threshold = 0.02

0. 
patient face id: 01012051367315_1_4_7
label yaofang:
防风 蜜百部 金银花 白前 蜜枇杷叶 苦杏仁 蜜紫菀 浙贝母 款冬花 干鱼腥草 紫苏梗 橘红 鸡内金
0.0325213 0.0647302 0.02902 0.0529134 0.0250022 0.0209053 0.0215913 0.0225756 0.0330269 0.0551243 0.033578 0.0546181 0.0618995 0.0563564 0.0473614
predicted yaofang:
茯苓 桔梗 橘红 金银花 太子参 黄芪 白前 百部 鸡内金 北沙参 辛夷 蜜百部 蜜枇杷叶 干鱼腥草 蜜紫菀

1. 
patient face id: 02181621581257_5_1_6
label yaofang:
党参 白术 麦芽 鱼古 甘草 瓜蒌皮 厚朴 香附 茯苓 法半夏 瓦楞子 佛手 砂仁 薤白 柿蒂 山药
0.059234 0.0352724 0.0217693 0.0272328 0.0476389 0.0408569 0.0436034 0.0218874 0.0393026 0.0233715 0.0255106 0.0389583 0.0279066 0.029036
predicted yaofang:
甘草 枳壳 法半夏 茯苓 薏苡仁 党参 白术 黄连 浙贝母 郁金 山药 鳖甲 皂角刺 白花蛇舌

2. 
patient face id: 01190646126717_3_5_6
label yaofang:
鳖甲 天麻 天山雪莲 山药 败酱草 郁金 茯苓 白芍 半枝莲 蜈蚣 红豆杉 薏苡仁 党参 莪术 熟附子 甘草
0.0672949 0.0469214 0.0378856 0.0207763 0.0216794 0.0304702 0.0231354 0.0212739 0.0473459 0.0340113 0.0441544 0.0286848 0.022979 0.0217971
predicted yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

3. 
patient face id: 01012101437253_1_4_2
label yaofang:
党参 益智 山药 乌药 黄芪 当归 熟附子 干姜 淫羊藿 仙茅 鹿角霜 醋龟甲 肉桂
0.0372131 0.0845091 0.0531603 0.113108 0.0271256 0.071533 0.0356341 0.100736 0.0305238 0.0351928 0.0317922 0.0730573 0.0313032
predicted yaofang:
甘草 当归 党参 黄芪 生地黄 乌药 郁金 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜

4. 
patient face id: 01122349239866_1_4_7
label yaofang:
天麻 桑寄生 天山雪莲 山药 大腹皮 白术 木香 茯苓 甘草 续断 白芍 枳壳 火麻仁 决明子 槟榔
0.0713149 0.0227521 0.0270196 0.0390582 0.0390672 0.0294279 0.0263873 0.0226644 0.0470318 0.0211601 0.0377877 0.026519
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 半枝莲

5. 
patient face id: 01201319592474_5_6
label yaofang:
鳖甲 半枝莲 蜈蚣 甘草 桔梗 苦杏仁 茯苓 白花蛇舌 天麻 天山雪莲 浙贝母 诃子 法半夏 前胡
0.0700615 0.0303037 0.0391551 0.0207346 0.0471214 0.0266023 0.0656074 0.0615437 0.0680528 0.0673636 0.0338289 0.0404277
predicted yaofang:
甘草 茯苓 桔梗 酸枣仁 浙贝母 郁金 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

6. 
patient face id: 01312320301102_1_6
label yaofang:
醋鳖甲 半枝莲 蜈蚣 延胡索 牛膝 地黄 甘草 白花蛇舌草 天麻 桑枝 补骨脂 牡丹皮 白术 浮小麦
0.0666858 0.0259589 0.0200042 0.0338502 0.0427213 0.0366695 0.04105 0.0210986 0.0582084 0.0216221 0.0433489 0.0382853
predicted yaofang:
甘草 白芍 川芎 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 半枝莲

7. 
patient face id: 02151813242252_4
label yaofang:
薄荷 前胡 紫菀 香薷 防风 北柴胡 荆芥穗 桔梗 紫苏梗 广藿香 甘草片 百部
0.0263159 0.0420208 0.0800142 0.0529096 0.0612582 0.0241641 0.0853768 0.0316257 0.0256306 0.0781552 0.0288212 0.0508776 0.02626 0.0351065 0.0419596 0.0596922 0.0416478 0.0244748 0.0207489
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 甘草片 蜜麻黄 炒苍耳子

8. 
patient face id: 01132148039324_5
label yaofang:
鳖甲 天麻 天山雪莲 火麻仁 广藿香 枇杷叶 法半夏 甘草 半枝莲 蜈蚣 党参 砂仁 黄连 紫苏梗 茯苓
0.0713149 0.0227521 0.0270196 0.0390582 0.0390672 0.0294279 0.0263873 0.0226644 0.0470318 0.0211601 0.0377877 0.026519
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 半枝莲

9. 
patient face id: 02141959473230_6
label yaofang:
干姜 天麻 姜半夏 合欢皮 蜈蚣 炙甘草 淡豆豉 龙骨 柏子仁
0.032817 0.028075 0.0421835 0.0444206 0.0269997 0.0303317 0.0237054 0.0547276 0.0411196 0.0289714 0.0300969
predicted yaofang:
甘草 白芍 茯苓 党参 白术 柏子仁 干姜 姜半夏 炙甘草 百合 蜈蚣

10. 
patient face id: 01042334549227_7_5
label yaofang:
天麻 茯苓 杜仲 桑寄生 地黄 补骨脂 龙骨 麦芽 酸枣仁 丹参 牛膝 甘草 白芍 山茱萸 牡蛎
0.0603244 0.0286478 0.0219005 0.0320969 0.0235063 0.0401796 0.0426518 0.0391044 0.0204956 0.0233515 0.0204833 0.0235591 0.0559533 0.0357388 0.0206758 0.0311732 0.025409
predicted yaofang:
甘草 白芍 川芎 茯苓 龙骨 党参 白术 酸枣仁 丹参 生地黄 山药 地黄 天麻 麦芽 浮小麦 蜈蚣 半枝莲

11. 
patient face id: 02120804283361_4_1
label yaofang:
鳖甲 薏苡仁 蜈蚣 浙贝母 豆蔻 桔梗 法半夏 甘草 白花蛇舌 天麻 郁金 天山雪莲 苦杏仁 茯苓 砂仁 黄连
0.0390296 0.0449519 0.0202771 0.0636497 0.0292896 0.0831224 0.0284649 0.0560722 0.0204224 0.0448148 0.0412982 0.0581423 0.026546 0.0242182
predicted yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 浙贝母 天麻 鳖甲 款冬花 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 红豆杉

12. 
patient face id: 02020948138913_5_6_1
label yaofang:
鳖甲 天麻 天山雪莲 熟附子 火麻仁 山药 佛手 半枝莲 蜈蚣 薏苡仁 败酱草 厚朴 巴戟天 甘草
0.0722016 0.02103 0.0402434 0.027631 0.0389018 0.031542 0.0264394 0.0346002 0.065537 0.0425089 0.0395606 0.0334648 0.0375513 0.0204617
predicted yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

13. 
patient face id: 02171905555390_4
label yaofang:
北沙参 百部 陈皮 细辛 太子参 紫菀 法半夏 干姜 炒紫苏子 款冬花 蜜麻黄 前胡 白前 炙甘草
0.0455158 0.0640864 0.088146 0.0237487 0.0293981 0.042414 0.0225016 0.0884254 0.0932623 0.07507 0.0810035 0.0584821 0.0218592 0.0225734 0.0565599 0.0642937
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

14. 
patient face id: 01182315196524_6_4
label yaofang:
鳖甲 半枝莲 蜈蚣 苦杏仁 甘草 紫菀 苇茎 诃子 茯苓 白花蛇舌 天麻 天山雪莲 浙贝母 前胡 款冬花 细辛 桂枝
0.0626134 0.0218518 0.0492143 0.0685715 0.0288553 0.0285703 0.0201545 0.0854006 0.0202301 0.0303022 0.0260435 0.037557 0.0572662 0.0408044 0.0216052
predicted yaofang:
甘草 川芎 法半夏 茯苓 前胡 桔梗 党参 浙贝母 郁金 天麻 鳖甲 款冬花 苇茎 苦杏仁 白花蛇舌

15. 
patient face id: 01012047218119_1_4
label yaofang:
杜仲 盐山萸肉 蚕沙 桑寄生 延胡索 葛根 威灵仙 桑枝 豨莶草 炒山楂 桂枝 桃仁
0.0820623 0.0240694 0.0394224 0.0324306 0.039672 0.0360985 0.0397753 0.0918104 0.0826743 0.0827336 0.0593843 0.0628332 0.0823197 0.0228289
predicted yaofang:
桂枝 茯苓 葛根 桃仁 黄芪 枸杞子 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂 土茯苓

16. 
patient face id: 01032101314768_6_2
label yaofang:
鳖甲 天山雪莲 浙贝母 蜂房 生地黄 五味子 茯苓 白花蛇舌 甘草 桔梗 酸枣仁 麦冬 知母 太子参
0.0709304 0.0239787 0.0362903 0.0295186 0.0252383 0.0202782 0.0253136 0.037758 0.0229581 0.0604108 0.0483311 0.0402741 0.0448493 0.0302082 0.0218369
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 酸枣仁 生地黄 浙贝母 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

17. 
patient face id: 01130634088580_1_2_4
label yaofang:
鳖甲 浙贝母 蜂房 诃子 茯苓 党参 紫菀 甘草 白花蛇舌 桔梗 四季青 法夏 岗梅根 橘红 乌梅
0.0710359 0.0253722 0.0372358 0.0284322 0.0239679 0.0222479 0.0218807 0.0313734 0.0299007 0.0201467 0.0323693 0.0284567 0.0229942 0.026904 0.0450014 0.0237552 0.0250121
predicted yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 白术 黄连 浙贝母 鳖甲 莪术 豆蔻 黄芩片 白花蛇舌 蜂房 岗梅根 四季青 红豆杉

18. 
patient face id: 01312124447549_1_2_6
label yaofang:
鳖甲 天麻 天山雪莲 茯苓 白芍 女贞子 生地黄 甘草 半枝莲 蜈蚣 党参 柴胡 枳壳 墨旱莲 五灵脂 砂仁
0.0670789 0.0245416 0.0313551 0.036574 0.0291793 0.0471948 0.0418239 0.0690258 0.0483428 0.0943021 0.0405858 0.0298167
predicted yaofang:
甘草 枳壳 茯苓 桔梗 党参 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

19. 
patient face id: 02122115124088_2_6
label yaofang:
山药 党参 合欢花 地骨皮 酸枣仁 首乌藤 女贞子 浮小麦 生地黄 茯苓 甘草 糯稻根 黄芪 牛膝 蔓荆子
0.0621325 0.0270292 0.0214431 0.0524218 0.0446568 0.0452331 0.0274222 0.0287856 0.0341329 0.0417234 0.0361568 0.0224063
predicted yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 丹参 生地黄 山药 天麻 首乌藤 蜈蚣

20. 
patient face id: 01132326450704_5_2
label yaofang:
姜半夏 太子参 丹参 炙甘草 生地黄 麦冬 三七片 瓜蒌皮 阿胶 桂枝 薤白
0.0283325 0.026117 0.153908 0.0339819 0.0333012 0.0431335 0.0231897
predicted yaofang:
白芍 桃仁 阿胶 红花 泽泻 冬瓜子 炙甘草

21. 
patient face id: 02191218217859_1_2_4
label yaofang:
鳖甲 半枝莲 蜈蚣 生地黄 羌活 威灵仙 防风 甘草 白花蛇舌 天麻 酸枣仁 粉葛 地黄 薏苡仁 党参 天山雪莲
0.0716596 0.0204612 0.0242689 0.0468483 0.0553471 0.0292432 0.0306903 0.0298392 0.0253026 0.0389053 0.0466646 0.0244935 0.0677237 0.0200694 0.0456093
predicted yaofang:
甘草 白芍 茯苓 羌活 党参 白术 酸枣仁 生地黄 延胡索 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

22. 
patient face id: 01211241234361_1_7
label yaofang:
桂枝 柴胡 蜜枇杷叶 天花粉 干姜 黄芩 人参叶 桔梗 牡蛎 炙甘草 藕节 苦杏仁
0.0471121 0.0209172 0.0361579 0.056336 0.0403837 0.0322823 0.023338 0.0293657 0.055771 0.0256364 0.0209431 0.0318744 0.0845874 0.0984959 0.104308
predicted yaofang:
桂枝 白芍 陈皮 黄芩 茯苓 桔梗 阿胶 藕节 干姜 天花粉 苦杏仁 姜半夏 炙甘草 蜜枇杷叶 人参叶

23. 
patient face id: 02171833303359_2
label yaofang:
防风 法半夏 紫苏梗 炒苍耳子 炒蔓荆子 炙甘草 前胡 陈皮 白芷 广藿香 百部 麸炒白术 豆蔻 辛夷
0.0436991 0.0220407 0.0241808 0.110254 0.0458233 0.0759079 0.0426008 0.0645274 0.0664356 0.0679025 0.187979 0.0724532
predicted yaofang:
陈皮 法半夏 前胡 防风 荆芥穗 白芷 百部 炙甘草 辛夷 紫苏梗 广藿香 炒苍耳子

24. 
patient face id: 02182002082546_2_6
label yaofang:
醋鳖甲 半枝莲 蜈蚣 麦冬 郁金 诃子 甘草 白花蛇舌草 天麻 地黄 浙贝母 桔梗 猫爪草 茯苓
0.0758463 0.0305265 0.0231454 0.0315419 0.0310048 0.028028 0.0205097 0.0213339 0.0357583 0.0274593 0.0473261 0.0329997
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 酸枣仁 浙贝母 干姜 天麻 鳖甲 蜈蚣 半枝莲

25. 
patient face id: 02182312185320_4_6
label yaofang:
鳖甲 甘草 蜈蚣 天麻 郁金 莱菔子 枳壳 白花蛇舌 薏苡仁 天山雪莲 党参 连翘 白术 辛夷
0.0597267 0.0239344 0.0269303 0.0236138 0.0227848 0.0434314 0.031407 0.0396845 0.0534473 0.0295339 0.0233 0.039344 0.0314943 0.0305544 0.0314287 0.0274538
predicted yaofang:
甘草 枳壳 法半夏 茯苓 桔梗 薏苡仁 党参 白术 浙贝母 郁金 山药 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉

26. 
patient face id: 02141934264802_1
label yaofang:
黄精 熟地黄 制何首乌 续断 白术 火麻仁 砂仁 杜仲 桑寄生 党参 枸杞子 艾叶 巴戟天 菟丝子
0.0381062 0.0659565 0.0334536 0.0319508 0.0769265 0.0435237 0.0557248 0.0338656 0.0656092 0.0310674 0.0987561 0.0326615 0.0617681 0.0239947 0.0242428
predicted yaofang:
甘草 党参 黄芪 枸杞子 白术 熟地黄 杜仲 山药 菟丝子 巴戟天 桑寄生 火麻仁 续断 黄精 艾叶

27. 
patient face id: 02151906061085_1_2
label yaofang:
防己 当归 盐菟丝子 炙甘草 党参片 川牛膝 续断片 茯苓 黄芪 桑寄生 木瓜 威灵仙 细辛 独活 川芎 地龙
0.0521586 0.124513 0.107904 0.0687651 0.0233012 0.0409466 0.0413601 0.0457879 0.0545331 0.0728356 0.0304562 0.02766 0.0465234 0.047587
predicted yaofang:
白芍 川芎 当归 黄芪 生地黄 细辛 干姜 木瓜 川牛膝 地龙 炙甘草 党参片 盐菟丝子 续断片

28. 
patient face id: 01070833060641_1_7
label yaofang:
鸡内金 土茯苓 泽泻 薏苡仁 威灵仙 苍术 车前子 炙甘草 茯苓 桃仁 萹蓄 牡丹皮 黄柏 鸡内金 土茯苓 泽泻 薏苡仁 威灵仙 苍术 车前子 炙甘草 茯苓 桃仁 萹蓄 牡丹皮 黄柏
0.0514011 0.0464092 0.0553772 0.0327813 0.0246647 0.027773 0.0312556 0.0249867 0.0238415 0.0279605 0.0702191 0.0721927 0.0383203 0.0279367
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牡丹皮 牛膝 山药 泽泻 车前子 萹蓄 土茯苓

29. 
patient face id: 01130633110456_1_4_6
label yaofang:
鳖甲 天麻 天山雪莲 茯苓 砂仁 紫苏梗 郁金 黄连 半枝莲 蜈蚣 党参 山药 法半夏 广藿香 甘草 莪术
0.0600312 0.0284219 0.0222799 0.0319235 0.0360399 0.0268116 0.0827355 0.0416073 0.0619154 0.0581469 0.0585958 0.0382883 0.056536 0.0219405
predicted yaofang:
甘草 枳壳 法半夏 茯苓 党参 黄连 郁金 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲

30. 
patient face id: 01132330588757_2_1
label yaofang:
大枣 白眉草 前胡 栀子 蝉蜕 牛蒡子 玉竹 薄荷 葶苈子 淡豆豉 芦根 白茅根
0.0220626 0.0265013 0.0212826 0.0224318 0.0224832 0.0223431 0.0250653 0.0482342 0.0305094
predicted yaofang:
甘草 白芍 茯苓 桃仁 党参 红花 白茅根 淡豆豉 炙甘草

31. 
patient face id: 02161838182278_1_4
label yaofang:
炒六神曲 海螵蛸 炙甘草 肉桂 茯苓 干石斛 豆蔻 炒麦芽 麸炒白术 广藿香 甘松 炒稻芽 麸炒苍术 炒白扁豆 干姜 炙黄芪
0.0410366 0.0221122 0.0301634 0.0359387 0.0256552 0.0216688 0.072423 0.021925 0.0597883 0.0551525 0.0249217 0.042589 0.0373735 0.0243173 0.0293959 0.0395578 0.0263323 0.0249944 0.0361907
predicted yaofang:
陈皮 茯苓 防风 黄芪 肉桂 钩藤 干姜 白芷 炙甘草 广藿香 威灵仙 炒白扁豆 麸炒白术 麸炒苍术 炙黄芪 炒六神曲 棉萆薢 醋香附 干石斛

32. 
patient face id: 02120925480463_6_7_1
label yaofang:
延胡索 乌药 桃仁 党参 柴胡 益母草 吴茱萸 麦芽 川楝子 薏苡仁 牡丹皮 茯苓 赤芍 五灵脂 甘草
0.0614931 0.0235533 0.0387578 0.0292872 0.0278599 0.0246562 0.0238966 0.0435995 0.0261019 0.0236404 0.022717
predicted yaofang:
甘草 白芍 茯苓 连翘 党参 丹参 生地黄 牡丹皮 山药 麦芽 白鲜皮

33. 
patient face id: 01180602171656_1_2
label yaofang:
鳖甲 浙贝母 蜂房 太子参 麦冬 鹿角霜 甘草 白花蛇舌 桔梗 诃子 北沙参 百合 丹参 天山雪莲
0.0542612 0.025027 0.0317504 0.0237448 0.0521438 0.0541004 0.0947265 0.0504135 0.10198 0.0572343 0.0242707 0.022499 0.021021
predicted yaofang:
甘草 茯苓 桔梗 生地黄 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 蜂房 红豆杉

34. 
patient face id: 02170847109438_1_4_7
label yaofang:
制何首乌 泽泻 夏枯草 红花 钩藤 丹参 牛膝 天麻 车前子 决明子 桃仁 莱菔子
0.0496241 0.0990112 0.0777616 0.0984432 0.0462027 0.0674797 0.0394566 0.0281463 0.113185 0.0493202 0.165676 0.0213637
predicted yaofang:
桃仁 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 干鱼腥草

35. 
patient face id: 02182250153830_4_1
label yaofang:
鳖甲 半枝莲 蜈蚣 杜仲 酸枣仁 党参 鸡血藤 茯苓 白花蛇舌 天麻 天山雪莲 桑寄生 远志 白术 甘草
0.0669443 0.0315821 0.0279007 0.0245389 0.0341285 0.0253694 0.0216764 0.0800493 0.0558411 0.0608237 0.0533961 0.046225 0.0423481
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

36. 
patient face id: 01070834571715_1_4_6
label yaofang:
党参 黄芪 郁金 麦冬 茯苓 首乌藤 百合 浮小麦 制远志 酸枣仁 牡蛎 甘草
0.0569144 0.0626771 0.0348887 0.0602144 0.117771 0.020711 0.134699 0.0304554 0.0305613 0.113931 0.0452363 0.0295516
predicted yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 生地黄 栀子 郁金 浮小麦 首乌藤

37. 
patient face id: 02020848231642_1_6
label yaofang:
鳖甲 天麻 天山雪莲 厚朴 茯苓 党参 火麻仁 半枝莲 蜈蚣 薏苡仁 黄柏 苍术 补骨脂 甘草
0.0651019 0.0232623 0.0312096 0.0225218 0.0267438 0.0256743 0.0282572 0.066539 0.0383703 0.0633021 0.0323685 0.0305487 0.0351914 0.0221208
predicted yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

38. 
patient face id: 02020950137737_6_5
label yaofang:
牡丹皮 柴胡 白芍 茯苓 合欢花 生地黄 甘草 栀子 黄芩片 白术 酸枣仁 党参 当归
0.0705049 0.0332263 0.039161 0.0389453 0.0227636 0.0385336 0.0293485 0.048736 0.0290134 0.0493518 0.02264 0.0234426 0.0236683 0.0246179 0.0478636
predicted yaofang:
甘草 柴胡 白芍 茯苓 远志 党参 白术 酸枣仁 丹参 生地黄 栀子 郁金 麦芽 首乌藤 合欢花

39. 
patient face id: 01061601125917_5_6
label yaofang:
鳖甲 天麻 薏苡仁 法半夏 鱼腥草 款冬花 桑白皮 桔梗 半枝莲 蜈蚣 郁金 茯苓 紫菀 苦杏仁 浙贝母 甘草
0.0672946 0.0469226 0.0378862 0.0207764 0.0216794 0.0304704 0.0231355 0.0212737 0.0473459 0.0340111 0.044154 0.0286851 0.0229789 0.0217969
predicted yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

40. 
patient face id: 01092051141685_6_2
label yaofang:
北沙参 乌梅 玉竹 金樱子 砂仁 鸡内金 天花粉 黄芪 冬凌草 桑螵蛸 郁金
0.0254127 0.0382622 0.0254822 0.0579652 0.0345354 0.0222076 0.148828 0.0488351 0.0461374 0.0318273 0.0244102 0.0265213
predicted yaofang:
甘草 蒲公英 牡丹皮 乌梅 山楂 砂仁 天花粉 鸡内金 桑螵蛸 北沙参 白鲜皮 覆盆子

41. 
patient face id: 01061604289217_5
label yaofang:
麻黄 浙贝母 黄芩片 法半夏 紫苏子 鱼腥草 款冬花 苦杏仁 桔梗 细辛 茯苓 桑白皮 莱菔子 甘草
0.042669 0.0865042 0.027532 0.0305729 0.0350416 0.0297364 0.0217662 0.0383238 0.0228408 0.0216207 0.0304763 0.057252 0.0587682
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 鱼腥草 浙贝母 细辛 桑白皮 天麻 款冬花 苦杏仁 紫苏子

42. 
patient face id: 01190618050244_1_2_6
label yaofang:
鳖甲 半枝莲 蜈蚣 党参 生地黄 酸枣仁 首乌藤 浮小麦 白花蛇舌 天麻 天山雪莲 茯苓 沙苑子 远志 甘草
0.0649435 0.023583 0.0340325 0.0493481 0.0215557 0.0244072 0.111841 0.0254972 0.0358672 0.0465877 0.0670285 0.0535177 0.0271047 0.023126 0.0622134 0.0303613
predicted yaofang:
甘草 川芎 远志 酸枣仁 丹参 生地黄 天麻 鳖甲 白花蛇舌草 浮小麦 沙苑子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 醋鳖甲

43. 
patient face id: 01250636099448_5_6
label yaofang:
苇茎 浙贝母 茯苓 前胡 苦杏仁 桃仁 甘草 薏苡仁 桔梗 法半夏 款冬花 鱼腥草 远志 紫苏子
0.063564 0.0590065 0.0456855 0.023887 0.067766 0.0234574 0.0236482 0.0454651 0.0225161 0.0317786 0.0381919 0.0510559 0.0292977 0.0203796
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 党参 白术 浙贝母 细辛 天麻 款冬花 苦杏仁 紫苏子 白花蛇舌

44. 
patient face id: 02020957549977_6_2_5
label yaofang:
鳖甲 天山雪莲 天麻 党参 薏苡仁 白术 僵蚕 甘草 白花蛇舌 半枝莲 蜈蚣 白扁豆 茯苓 牡丹皮 红豆杉
0.0613219 0.0257757 0.0310231 0.0252752 0.0269197 0.0265232 0.026632 0.0687882 0.0543894 0.0788311 0.0487767 0.0502839 0.0553268 0.0220414
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

45. 
patient face id: 02182258536887_2_6
label yaofang:
生地黄 当归 菟丝子 桑寄生 砂仁 艾叶 枳壳 五灵脂 白芍 川芎 益母草 何首乌 黄柏 柴胡 甘草
0.0668806 0.0350774 0.0256635 0.043908 0.0390316 0.0250043 0.0335482 0.0239041 0.0218864 0.0534286 0.0534306 0.021427 0.0246704
predicted yaofang:
甘草 柴胡 白芍 茯苓 酸枣仁 丹参 牡丹皮 郁金 地黄 菟丝子 益母草 麦芽 合欢花

46. 
patient face id: 02010019115213_1_2_7
label yaofang:
鹿角霜 山药 川加皮 茯苓 丹参 生地黄 豆蔻 山茱萸 补骨脂 党参 白术 甘草 麦芽
0.0713343 0.0227395 0.0270674 0.0390715 0.0390596 0.0294228 0.0263399 0.0226641 0.0470522 0.0211935 0.0378179 0.0265172
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 半枝莲

47. 
patient face id: 02182229014865_5_6
label yaofang:
鳖甲 半枝莲 蜈蚣 郁金 茯苓 山药 甘草 天山雪莲 白花蛇舌 天麻 薏苡仁 远志 党参 豆蔻 车前子
0.0552238 0.0294807 0.0280263 0.023972 0.0302347 0.0254549 0.0315157 0.0454833 0.0715082 0.0279205 0.0592903 0.0699662 0.0467038 0.0259885 0.0278848
predicted yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 党参 浙贝母 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

48. 
patient face id: 01012057139636_1_4
label yaofang:
制何首乌 钩藤 车前子 泽泻 丹参 决明子 夏枯草 牛膝 桃仁 红花 天麻 莱菔子
0.0539987 0.0570263 0.0876144 0.0826658 0.0449714 0.0571725 0.0881171 0.0974385 0.0475155 0.106496 0.106277 0.141466
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

49. 
patient face id: 01172359288914_1_5
label yaofang:
半夏 白术 甘草 砂仁 酸枣仁 太子参 茯苓 橘红 山慈菇 首乌藤 合欢皮 北沙参
0.0405033 0.0316901 0.0331807 0.0391319 0.0631922 0.0217528 0.0353561 0.0455555 0.0217263 0.037251 0.130021
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 酸枣仁 砂仁 北沙参 橘核 首乌藤 合欢皮

50. 
patient face id: 01061607383470_6_4_7
label yaofang:
天麻 党参 白术 红花 骨碎补 黄芪 桂枝 何首乌 赤芍 桑寄生 甘草 生地黄 桑枝 地龙 土茯苓
0.0537717 0.0284805 0.028498 0.0403161 0.0433383 0.0271472 0.0325538 0.0299476 0.0273441
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 桑寄生 补骨脂

51. 
patient face id: 02181956257943_1_4_7
label yaofang:
鳖甲 半枝莲 蜈蚣 天山雪莲 法半夏 桔梗 茯苓 砂仁 白花蛇舌 天麻 甘草 党参 浙贝母 丹参 麦芽 莪术
0.0552242 0.029481 0.0280267 0.0239719 0.0302347 0.0254552 0.0315155 0.0454834 0.0715077 0.0279202 0.0592898 0.0699655 0.0467035 0.0259883 0.027884
predicted yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 党参 浙贝母 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

52. 
patient face id: 02020837005799_6_4
label yaofang:
浙贝母 牡蛎 茯苓 桔梗 牡丹皮 柴胡 猫爪草 法半夏 天山雪莲 甘草 栀子 白芍
0.0661542 0.0319146 0.0823171 0.0553879 0.0285603 0.0294674 0.0216425 0.0452024 0.0279864 0.0200535
predicted yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 党参 白术 浙贝母 细辛 天麻

53. 
patient face id: 01070842226206_1_4_7
label yaofang:
党参 枳壳 丹参 法半夏 黄芪 茯苓 竹茹 橘红 厚朴 甘草 郁金 延胡索
0.0300213 0.0535043 0.0286047 0.0600999 0.0332316 0.0307388 0.0302413 0.102624 0.0280317 0.024124 0.0235527 0.0259882 0.0283602
predicted yaofang:
桂枝 甘草 白芍 茯苓 桃仁 麦冬 党参 黄芪 白术 熟地黄 枳实 胆南星 火麻仁

54. 
patient face id: 02122354206093_1_2
label yaofang:
天麻 枸杞子 墨旱莲 党参 地龙 粉葛 白术 女贞子 川芎 黄芪 甘草
0.065096 0.0217044 0.0348573 0.0438138 0.044335 0.0213881 0.0292741 0.0418063 0.020145 0.0440146 0.0273212
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 牛膝 山药 山茱萸 天麻 补骨脂

55. 
patient face id: 02190511234753_1_2_6
label yaofang:
醋鳖甲 半枝莲 蜈蚣 首乌藤 白芍 茯苓 浙贝母 白花蛇舌草 天麻 酸枣仁 太子参 白术 白茅根 甘草
0.0698495 0.0570961 0.0391621 0.0246727 0.0214359 0.0397646 0.0287712 0.0407912 0.0229945 0.0201435 0.0364766 0.0221088
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 浙贝母 细辛 天麻 鳖甲 苦杏仁 蜈蚣 半枝莲

56. 
patient face id: 01190438144769_3_5_7
label yaofang:
鳖甲 甘草 红豆杉 蒲公英 皂角刺 当归 莪术 连翘 党参 蜈蚣 半枝莲 败酱草 黄芪 郁金 紫苏梗 牡丹皮
0.0631082 0.0293019 0.0285403 0.0491446 0.0404141 0.0205904 0.0346354 0.036804 0.0202133 0.0533971 0.0252137 0.0329966 0.0345732
predicted yaofang:
甘草 白芍 茯苓 党参 白术 黄连 天麻 鳖甲 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲

57. 
patient face id: 01172333316006_7_6_5
label yaofang:
鳖甲 薏苡仁 天麻 浙贝母 郁金 蝉蜕 山药 白花蛇舌 莪术 蜈蚣 桔梗 诃子 天山雪莲 甘草
0.0349025 0.0562756 0.0474949 0.0413828 0.0875823 0.0591803 0.079012 0.0643732 0.0674649 0.0327827 0.0797149
predicted yaofang:
甘草 薏苡仁 浙贝母 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

58. 
patient face id: 01061932296050_4
label yaofang:
炒紫苏子 款冬花 炙甘草 前胡 白前 防风 百部 法半夏 陈皮 紫菀 蜜麻黄 广藿香
0.0422507 0.0528096 0.0656887 0.0297957 0.0382097 0.033494 0.0721602 0.0802459 0.0735025 0.0519624 0.0382366 0.0551845 0.0684082 0.0878266 0.110119 0.0335251
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子

59. 
patient face id: 01132122138549_6_7_1
label yaofang:
鳖甲 山药 茯苓 白术 丹参 黄精 远志 麦芽 党参 酸枣仁 甘草 土鳖虫 益母草 赤芍 首乌藤
0.103403 0.0270215 0.0369501 0.0245082 0.0878115 0.0231319 0.0451087 0.0296729 0.02383 0.0892912 0.0218831 0.0202337 0.0280546 0.025315 0.0257629
predicted yaofang:
甘草 白芍 茯苓 薏苡仁 党参 黄芪 白术 丹参 生地黄 赤芍 山药 青蒿 天麻 地骨皮 麦芽

60. 
patient face id: 01312138430082_1_2_6
label yaofang:
鳖甲 半枝莲 蜈蚣 女贞子 党参 赤芍 杜仲 甘草 白花蛇舌 天麻 天山雪莲 墨旱莲 白芍 宽筋藤 桑寄生 山茱萸
0.0532635 0.0216035 0.0231107 0.0352571 0.0366756 0.0253868 0.0334048 0.0215677 0.0393229 0.0380924 0.0375853 0.0279047
predicted yaofang:
甘草 白芍 茯苓 党参 枸杞子 白术 生地黄 牡丹皮 山药 山茱萸 天麻 桑寄生

61. 
patient face id: 01101808493959_4_1
label yaofang:
炒紫苏子 款冬花 法半夏 广藿香 前胡 白前 蜜麻黄 茯苓 百部 桔梗 炙甘草 紫菀 陈皮 防风
0.173052 0.0273647 0.0687011 0.0318703 0.0428383 0.0516022 0.0804282 0.0233557 0.0231504 0.250052 0.0592808 0.0354958 0.0239618
predicted yaofang:
陈皮 法半夏 前胡 桔梗 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

62. 
patient face id: 01201959434060_1_6_4
label yaofang:
黄芪 菟丝子 山药 稻芽 橘核 砂仁 合欢皮 白术 桑寄生 鸡内金 麦芽 厚朴 北沙参 首乌藤
0.0557909 0.0464125 0.0243513 0.0217397 0.0843252 0.024267 0.0510749 0.0287292 0.0214849 0.0363212 0.0412175 0.0209964 0.0264797
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 砂仁 菟丝子 麦芽 首乌藤 合欢皮 墨旱莲 稻芽

63. 
patient face id: 02161929314258_1_6_4
label yaofang:
黄芪 太子参 紫苏梗 鸡内金 补骨脂 合欢皮 云芝 白术 茯苓 砂仁 麦芽 海螵蛸 首乌藤 枸杞子
0.0285594 0.0307626 0.044719 0.0212594 0.0827698 0.12603 0.0609107 0.0666792 0.0205766 0.0423477 0.0329421 0.0347822 0.0319093 0.044745
predicted yaofang:
甘草 当归 茯苓 党参 黄芪 白术 海螵蛸 砂仁 僵蚕 补骨脂 鸡内金 首乌藤 合欢皮 云芝

64. 
patient face id: 01111901118795_1_4
label yaofang:
炒紫苏子 款冬花 蜜麻黄 干姜 前胡 白前 炙甘草 细辛 百部 枸杞子 太子参 茯苓 紫菀 法半夏 北沙参 醋五味子
0.0717233 0.0792095 0.052007 0.157829 0.0850457 0.0754942 0.0848739 0.0887565 0.0316023 0.0390058 0.105078
predicted yaofang:
法半夏 前胡 细辛 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄

65. 
patient face id: 01121835398485_2_1
label yaofang:
北柴胡 煅牡蛎 太子参 郁金 枸杞子 白芍 北沙参 炒酸枣仁 柏子仁 酒女贞子 煅龙骨 制远志 茯苓
0.0285589 0.0478974 0.0364857 0.0589745 0.0465797 0.0794021 0.0454564 0.0347819 0.0762698 0.0466809 0.0495528 0.0287287 0.0208404
predicted yaofang:
白芍 川芎 茯苓 太子参 黄芪 枸杞子 郁金 煅牡蛎 北沙参 党参片 酒女贞子 煅龙骨 炒酸枣仁

66. 
patient face id: 01200701550485_5_6
label yaofang:
黄芩 白术 地黄 茯苓 金银花 牡丹皮 麦芽 白芍 甘草 党参 连翘 蒲公英 黄芪 升麻
0.0424607 0.027987 0.0480634 0.0536748 0.0807058 0.177427 0.0313595 0.035112 0.161391 0.0277737
predicted yaofang:
甘草 白芍 当归 茯苓 党参 白术 熟附子 地黄 升麻 麦芽

67. 
patient face id: 01122233461655_5_7_6
label yaofang:
法半夏 茯苓 石菖蒲 远志 巴戟天 金樱子 锁阳 首乌藤 郁金 党参 蜈蚣 甘草 当归 山药 合欢花 牡丹皮
0.0620046 0.0248194 0.0307414 0.0373443 0.0349194 0.0616205 0.0409733 0.0379133 0.0457768 0.022925 0.0284769
predicted yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 党参 白术 黄连 山药 麦芽

68. 
patient face id: 02122100201809_1_6
label yaofang:
柴胡 茯苓 香附 桑寄生 生地黄 甘草 白芍 枳壳 木香 五灵脂 杜仲 山茱萸 山药
0.0667637 0.0296087 0.0348883 0.0382655 0.0321614 0.0325485 0.0329328 0.0500025 0.028398 0.0433145 0.0226443 0.0238139 0.0336554
predicted yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 山药 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

69. 
patient face id: 01132120395633_1_6_5
label yaofang:
柴胡 茯苓 合欢花 砂仁 甘草 法半夏 木香 白芍 党参 佛手 郁金 麦芽 黄连 山药
0.0590217 0.0347935 0.0213146 0.0498418 0.0426482 0.0292432 0.0253615 0.0639489 0.0283438 0.0232324
predicted yaofang:
甘草 白芍 枳壳 法半夏 茯苓 党参 白术 黄连 麦芽 黄芩片

70. 
patient face id: 02131313295349_1_4_7
label yaofang:
党参 乌药 肉桂 仙茅 熟附子 益智 黄芪 覆盆子 鹿角霜 山药 当归 淫羊藿 干姜
0.0544975 0.0466253 0.0295665 0.0486329 0.0212866 0.0418478 0.0205753 0.0202962 0.0253719 0.0229936 0.211459
predicted yaofang:
柴胡 白芍 大枣 当归 龙骨 党参 酸枣仁 柏子仁 杜仲 姜半夏 续断

71. 
patient face id: 02190506572928_6_4_2
label yaofang:
天麻 白术 甘草 麦芽 补骨脂 竹茹 山药 夏枯草 僵蚕 党参 沙苑子 山茱萸 法半夏 益智 辛夷
0.0608621 0.0361507 0.0389599 0.028061 0.0500232 0.0239035 0.0335852 0.0244048 0.0285993 0.0266555 0.0827744 0.0693691 0.0294878 0.0273803
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 黄连 竹茹 牛膝 山茱萸 细辛 补骨脂 麦芽 黄芩片 川木瓜

72. 
patient face id: 02171934369190_1_2_3
label yaofang:
北沙参 黄芪 厚朴 辛夷 冬凌草 肉桂 乌梅 玉竹 白术 火麻仁 肉苁蓉 附子 山茱萸 猫爪草
0.0413829 0.0557597 0.0224126 0.0287673 0.0279875 0.02417 0.0291907 0.0560415 0.0254207 0.0269596 0.0500193 0.0344331 0.0235091
predicted yaofang:
甘草 茯苓 橘红 牡蛎 桃仁 麦冬 党参 黄芪 白术 牛膝 厚朴 火麻仁 北沙参

73. 
patient face id: 02191622252526_6_1
label yaofang:
鳖甲 天麻 党参 甘草 天山雪莲 杜仲 益母草 白花蛇舌 蜈蚣 茯苓 半枝莲 桑寄生 菟丝子 浮小麦
0.0591273 0.0202636 0.0243032 0.0361332 0.0207081 0.0563793 0.0357215 0.0228861 0.0236298 0.058611 0.0277713 0.0266901 0.027483 0.0229929 0.0470603 0.0260061 0.0250362 0.0460176
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 山茱萸 天麻 菟丝子 益母草 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

74. 
patient face id: 02110731073939_1_6_7
label yaofang:
制何首乌 车前子 丹参 夏枯草 桃仁 天麻 钩藤 泽泻 决明子 牛膝 红花 莱菔子
0.0648361 0.0306056 0.0339226 0.106541 0.021151 0.0279878 0.0582447 0.0643866 0.0348014 0.0563483 0.0473978 0.0360164 0.0262534 0.0440669 0.0278722 0.0294473
predicted yaofang:
桂枝 甘草 枳壳 桃仁 党参 太子参 丹参 海螵蛸 杜仲 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 夏枯草

75. 
patient face id: 01081940504440_2_5
label yaofang:
黄芩冲剂 柴胡冲剂 石膏冲剂 龙骨冲剂 牡蛎冲剂 远志冲剂 茯神冲剂 生地冲剂 当归冲剂 枳实冲剂 白芍冲剂 法夏冲剂 干姜冲剂 大黄冲剂
0.0732841 0.0772694 0.090797 0.0417223 0.0408243 0.0230689 0.0568884 0.0287099 0.0739551 0.0675098 0.0692063 0.0631958 0.0665887 0.0452418 0.0207267
predicted yaofang:
黄芩冲剂 柴胡冲剂 石膏冲剂 川朴片冲剂 杏仁冲剂 玄参冲剂 当归冲剂 细辛冲剂 枳实冲剂 白芍冲剂 法夏冲剂 干姜冲剂 大黄冲剂 生地冲剂 龙骨冲剂

76. 
patient face id: 01141134578681_6_2_4
label yaofang:
鳖甲 天麻 天山雪莲 败酱草 党参 白芍 莪术 半枝莲 蜈蚣 薏苡仁 熟附子 柴胡 牡丹皮 甘草
0.0671399 0.0331475 0.0374421 0.0241274 0.0232151 0.0207695 0.0518341 0.0510395 0.0582128 0.0457531 0.0400459 0.0362743
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

77. 
patient face id: 02191628432476_6_1
label yaofang:
鳖甲 党参 骨碎补 山药 甘草 浙贝母 白芍 牡丹皮 白花蛇舌 薏苡仁 茯苓 生地黄 天山雪莲 细辛 栀子
0.0771295 0.0238477 0.0385467 0.020455 0.0302465 0.0339001 0.025079 0.0406952 0.0231225 0.0305896 0.0277453 0.0325423
predicted yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌

78. 
patient face id: 01062047334765_1_5_6
label yaofang:
鳖甲 天麻 天山雪莲 败酱草 薏苡仁 山药 半枝莲 蜈蚣 莪术 附子 党参 甘草
0.0389388 0.0702998 0.0314003 0.0531247 0.0492892 0.0805667 0.0562865 0.0891969 0.0336918 0.0355145 0.0750459
predicted yaofang:
甘草 薏苡仁 山药 天麻 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲 红豆杉

79. 
patient face id: 01202004249571_3_2_6
label yaofang:
太子参 桑枝 海螵蛸 紫苏梗 土鳖虫 北沙参 砂仁 白术 夏天无 龙骨 山药 半夏 枸杞子
0.0366731 0.0224757 0.0242741 0.0521689 0.0285115 0.0718156 0.0266547 0.021419 0.0677197 0.0289817 0.0244174 0.031068 0.0290869 0.0239114
predicted yaofang:
甘草 茯苓 半夏 黄芪 枸杞子 白术 山药 厚朴 砂仁 火麻仁 芡实 北沙参 墨旱莲 稻芽

80. 
patient face id: 01132306473066_2_4
label yaofang:
蝉蜕 三七片 太子参 酒萸肉 鳖甲 麦冬 白芍
0.0224808 0.029819 0.0377598 0.0364649 0.0216794 0.0313563 0.0525159 0.0245497 0.0361653 0.0374204 0.0329073 0.0777963
predicted yaofang:
甘草 白芍 茯苓 桔梗 玉竹 太子参 阿胶 牡丹皮 天花粉 冬瓜子 炙甘草 三七片

81. 
patient face id: 02141631108859_1_4_7
label yaofang:
麦冬 枸杞子 天花粉 玉米须 党参 山药 甘草 黄芪 北沙参 玄参 牡丹皮 生地黄
0.0369757 0.0760588 0.0398279 0.032097 0.0487494 0.103685 0.0303266 0.0321151 0.0274707 0.0349352 0.0223491 0.0548747 0.0464371 0.0247537
predicted yaofang:
桂枝 甘草 白芍 当归 葛根 党参 黄芪 丹参 熟附子 牡丹皮 乌药 山药 玉米须 黄精

82. 
patient face id: 01201314291366_1
label yaofang:
醋鳖甲 半枝莲 蜈蚣 党参 白术 山药 甘草 浮小麦 白花蛇舌草 天麻 首乌藤 茯苓 砂仁 紫苏梗 合欢花
0.0698495 0.0570961 0.0391621 0.0246727 0.0214359 0.0397646 0.0287712 0.0407912 0.0229945 0.0201435 0.0364766 0.0221088
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 浙贝母 细辛 天麻 鳖甲 苦杏仁 蜈蚣 半枝莲

83. 
patient face id: 01312058397579_5_6
label yaofang:
柴胡 枳实 黑枣 甘草 广金钱草 党参 陈皮 黄芩 半夏 白芍 延胡索 山药 茯苓 砂仁
0.0522039 0.020507 0.0595629 0.0207774 0.0358639 0.0485721 0.0264536 0.0262204 0.0370006 0.0450933 0.0326873 0.0248676 0.0250431 0.039889
predicted yaofang:
甘草 白芍 黄芩 法半夏 当归 茯苓 半夏 桃仁 白术 枳实 石菖蒲 瓜蒌皮 地龙 黑枣

84. 
patient face id: 02191249286384_5_6
label yaofang:
天麻 决明子 薏苡仁 杜仲 首乌藤 白芷 连翘 甘草 钩藤 蒲公英 桑寄生 牛膝 当归 莱菔子 麦芽
0.0638362 0.0837179 0.0384528 0.0202214 0.0232979 0.0240384 0.026498 0.020266 0.0314711 0.0280003
predicted yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 白术 牛膝 山药 天麻 苦杏仁

85. 
patient face id: 01182130382363_3_4_6
label yaofang:
党参 胆南星 酸枣仁 郁金 龙骨 厚朴 苍术 扁豆花 丹参 法半夏 黄连 茯苓 甘草 川加皮 莱菔子 三棱
0.0750823 0.0204205 0.0557353 0.0545283 0.043805 0.0328383 0.0204289 0.0263296 0.0400674
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 黄连 山药 天麻

86. 
patient face id: 02120927549252_1_2
label yaofang:
醋鳖甲 半枝莲 蜈蚣 党参 山药 泽泻 艾叶 白花蛇舌草 天麻 地黄 山茱萸 白术 茜草 甘草
0.0597744 0.0200012 0.0211337 0.0339033 0.0412132 0.0472851 0.0414816 0.0239605 0.0200797 0.0204274 0.0549258 0.0278535 0.0259509 0.0206267 0.0253929
predicted yaofang:
甘草 白芍 川芎 茯苓 党参 白术 酸枣仁 生地黄 山药 山茱萸 天麻 桑寄生 麦芽 首乌藤 蜈蚣

87. 
patient face id: 01111905168988_4
label yaofang:
茯苓 前胡 紫菀 百部 炒六神曲 防风 辛夷 款冬花 炒苍耳子 法半夏 紫苏梗 广藿香 甘草片 蜜麻黄
0.047017 0.0323394 0.0603597 0.025542 0.0205408 0.0251134 0.0265157 0.139964 0.0719205 0.128809 0.0363279 0.14407
predicted yaofang:
陈皮 茯苓 防风 柏子仁 海螵蛸 干姜 紫菀 炙甘草 紫苏梗 广藿香 甘草片 炒六神曲

88. 
patient face id: 01041842133304_1_4
label yaofang:
百部 陈皮 细辛 紫菀 半夏 干姜 款冬花 麻黄 黄芪 白前 炙甘草
0.0798461 0.0395211 0.0681797 0.0268111 0.0432726 0.0258487 0.0415412 0.0221771 0.0232191 0.0635949 0.0544386 0.0602533 0.0685145 0.0741382 0.0384443 0.0516755 0.0501157
predicted yaofang:
陈皮 法半夏 前胡 半夏 防风 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

89. 
patient face id: 01201550034210_1_6
label yaofang:
郁金 甘草 天麻 厚朴 党参 金银花 百部 土茯苓 豆蔻 天山雪莲 薏苡仁 法半夏 茯苓 荆芥穗 灯心草 白鲜皮 红花
0.0631754 0.045019 0.0370203 0.0278954 0.028554 0.0207394 0.0308645 0.0225372 0.0291946 0.0201624 0.0221386
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 黄连 牛膝 山药 天麻 桑寄生 麦芽

90. 
patient face id: 02021012407689_6_1_7
label yaofang:
太子参 白术 芡实 龙眼肉 百合 茯苓 山药 薏苡仁 莲子
0.0396713 0.0299389 0.0296322 0.0210057 0.067034 0.0397831 0.0242606 0.0403236 0.0203163 0.0429017 0.0210464 0.033509
predicted yaofang:
甘草 茯苓 黄芪 枸杞子 白术 山药 山茱萸 砂仁 火麻仁 芡实 莲子 稻芽

91. 
patient face id: 01192241040696_2_5
label yaofang:
柴胡 茯苓 山药 益母草 山茱萸 龙骨 水牛角 栀子 白芍 牡丹皮 菟丝子 地黄 酸枣仁 甘草 玄参
0.0681982 0.0208916 0.0350993 0.0478572 0.0378973 0.0418822 0.0394143 0.031362 0.0337644 0.0207869 0.0399872 0.0634448 0.0234724 0.0261201 0.0249631
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 酸枣仁 丹参 生地黄 山药 菟丝子 益母草 首乌藤 建曲 合欢花

92. 
patient face id: 02110735409807_1_6
label yaofang:
制何首乌 泽泻 夏枯草 红花 钩藤 丹参 牛膝 天麻 车前子 决明子 桃仁 莱菔子
0.0834056 0.0484594 0.0715198 0.0913958 0.0745741 0.0788156 0.0974111 0.0567836 0.0502006 0.0689124 0.0680849 0.0876786
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

93. 
patient face id: 02161844419121_1
label yaofang:
薄荷 前胡 甘草片 白芷 炒苍耳子 防风 紫菀 百部 荆芥穗 桔梗 辛夷 广藿香 法半夏 紫苏梗
0.0536162 0.0349122 0.0434645 0.0857005 0.0737835 0.0675715 0.0644588 0.036326 0.0407942 0.0384483 0.0394337 0.0298356 0.0954881 0.061017 0.0727615
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒苍耳子

94. 
patient face id: 01031832103853_2
label yaofang:
炒紫苏子 款冬花 炙甘草 炒苍耳子 炒紫苏子 款冬花 炙甘草 炒苍耳子 炒紫苏子 款冬花 炙甘草 干姜 前胡 白前 防风 细辛 前胡 白前 防风 细辛 前胡 白前 防风 百部 法半夏 荆芥穗 干姜 百部 法半夏 荆芥穗 干姜 百部 法半夏 荆芥穗 紫菀 蜜麻黄 辛夷 紫菀 蜜麻黄 辛夷 紫菀 蜜麻黄 细辛
0.0311515 0.0579601 0.0515487 0.0622639 0.101076 0.0492368 0.0212581 0.0286762 0.0210989 0.047457 0.0482679 0.0356447 0.0384553 0.063818 0.0509846 0.0623258 0.0201585 0.0310754 0.0433874
predicted yaofang:
陈皮 法半夏 前胡 防风 细辛 干姜 荆芥穗 白芷 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子

95. 
patient face id: 02191242000472_1_5
label yaofang:
醋鳖甲 薏苡仁 蜈蚣 青蒿 滑石 黄柏 山药 甘草 白花蛇舌草 天麻 莪术 牡丹皮 厚朴 党参 豆蔻 麦芽
0.0639058 0.0545139 0.0287254 0.024964 0.0318844 0.0210936 0.098551 0.0495711 0.0444117 0.0320909 0.0442794 0.0602281 0.0240531
predicted yaofang:
甘草 薏苡仁 党参 黄芪 白术 黄柏 山药 天麻 滑石 鳖甲 麦芽 蜈蚣 天山雪莲

96. 
patient face id: 02141935004376_6
label yaofang:
白术 甘草 枳实 干姜 肉桂 附片
0.0364497 0.0315364 0.0224805 0.02864 0.038311 0.10352 0.0677535 0.0243326 0.0662136 0.0243956 0.160956 0.0216315
predicted yaofang:
甘草 茯苓 龙骨 党参 白术 枳实 竹茹 附子 肉桂 干姜 附片 合欢皮

97. 
patient face id: 01190633162554_1_2_5
label yaofang:
鳖甲 薏苡仁 蜈蚣 白茅根 细辛 紫菀 百部 党参 山药 白花蛇舌 天麻 天山雪莲 炙麻黄 五味子 款冬花 茜草 甘草
0.0550926 0.0314425 0.0298425 0.0299067 0.0452327 0.0205502 0.0294748 0.0733566 0.0314117 0.048756 0.0220188 0.0220801 0.0251457
predicted yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 砂仁 天麻 莪术 苦杏仁 蜈蚣 黄芩片 白花蛇舌 半枝莲

98. 
patient face id: 02161927452714_5
label yaofang:
荆芥 辛夷 桑叶 白芷 紫苏叶 橘红 防风 苍耳子 菊花 枇杷叶 鸡内金 桑白皮
0.0223949 0.0407841 0.0886123 0.0393761 0.0838776 0.201882 0.0657975 0.0305401 0.0632903 0.0831929 0.0756551
predicted yaofang:
法半夏 橘红 荆芥 防风 桑叶 桑白皮 白芷 鸡内金 枇杷叶 辛夷 紫苏叶

99. 
patient face id: 01062338053814_1_4_7
label yaofang:
党参 厚朴 茯苓 桃仁 竹茹 法半夏 黄芪 枳实 甘草 丹参 胆南星 橘红
0.0405552 0.0239018 0.0321221 0.026317 0.0448315 0.0256717 0.0339517 0.0306994 0.030231 0.034109 0.0233402 0.0419521 0.0283261 0.025873 0.0203068
predicted yaofang:
甘草 白芍 茯苓 桃仁 党参 黄芪 丹参 红花 竹茹 胆南星 泽泻 车前子 莱菔子 火麻仁 制何首乌

100. 
patient face id: 01132309492493_1_7
label yaofang:
蝉蜕 牛蒡子 玉竹 薄荷 葶苈子 淡豆豉 芦根 白茅根 白眉草 前胡 栀子
0.0212199 0.0448698 0.0263678 0.0601514 0.0226013 0.0326049 0.0338142 0.0435477 0.0267296 0.0464115 0.0442472 0.0897433 0.0649631
predicted yaofang:
甘草 柴胡 白芍 茯苓 龙骨 党参 黄连 枳实 竹茹 栀子 淡豆豉 姜半夏 炙甘草

101. 
patient face id: 01031833212193_5
label yaofang:
前胡 百部 紫菀 款冬花 白前 陈皮 法半夏 炙甘草 防风 广藿香 豆蔻 茯苓 麸炒白术
0.0357505 0.042184 0.0202345 0.0613141 0.0200505 0.020975 0.051505 0.0317208 0.039301 0.0270543 0.0367709 0.0490369 0.0362085 0.0483436 0.0204267 0.242178 0.0520609 0.020504
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 木香 防风 薄荷 款冬花 紫菀 白前 百部 豆蔻 炙甘草 紫苏梗 广藿香 麸炒白术 炒六神曲

102. 
patient face id: 02131323185418_1_7
label yaofang:
制何首乌 车前子 丹参 夏枯草 桃仁 天麻 钩藤 泽泻 决明子 牛膝 红花 莱菔子
0.158614 0.0377235 0.0278956 0.0487114 0.0416767 0.113666 0.0434858 0.210158 0.097592 0.0675644 0.0359318
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

103. 
patient face id: 02182227538034_2_1
label yaofang:
鳖甲 半枝莲 天麻 天山雪莲 谷精子 木贼 麦芽 白花蛇舌 甘草 蜈蚣 酸枣仁 丹参 首乌藤 白芍
0.0813828 0.0257347 0.0272651 0.0277567 0.0583665 0.049883 0.0377186 0.0284994 0.0357422 0.0243374 0.0213119 0.025552 0.0258044 0.02732 0.0347019
predicted yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 酸枣仁 丹参 生地黄 赤芍 天麻 麦芽 首乌藤 合欢花

104. 
patient face id: 02182311166006_1
label yaofang:
鳖甲 天麻 莪术 桑螵蛸 红豆杉 薏苡仁 益智 菟丝子 半枝莲 蜈蚣 党参 甘草 天山雪莲 五倍子 茯苓 广升麻
0.0520242 0.0475469 0.0333334 0.0269648 0.0216706 0.056268 0.0223048 0.0822447 0.0697312 0.024792 0.0569654 0.0344037 0.0280392 0.0775555
predicted yaofang:
甘草 薏苡仁 党参 白术 熟附子 山药 天麻 鳖甲 莪术 败酱草 蜈蚣 白花蛇舌 天山雪莲 红豆杉

105. 
patient face id: 01200655104444_6_2_4
label yaofang:
鳖甲 白花蛇舌草 半枝莲 天麻 蜈蚣 天山雪莲 细辛 白芷 石膏 黄连 山茱萸 牛膝 蒲公英 麦芽 甘草 广升麻
0.0465913 0.0241381 0.0217398 0.0400627 0.0333713 0.0954983 0.021935 0.0365446 0.0832808 0.0227054 0.0689168 0.0329375
predicted yaofang:
甘草 党参 白术 山药 山茱萸 天麻 鳖甲 白花蛇舌草 蜈蚣 天山雪莲 半枝莲 醋鳖甲

106. 
patient face id: 02191255253650_4_6
label yaofang:
鳖甲 半枝莲 蜈蚣 浙贝母 前胡 黄芩片 苦杏仁 白花蛇舌 天麻 天山雪莲 桔梗 白前 细辛 甘草
0.0795888 0.0227398 0.0466975 0.0634998 0.0341384 0.0526923 0.0379073 0.0537849 0.0602166 0.0330987 0.0293432 0.0212399 0.0252489 0.0287204 0.020972
predicted yaofang:
甘草 川芎 法半夏 茯苓 桔梗 远志 酸枣仁 浙贝母 天麻 鳖甲 苦杏仁 首乌藤 蜈蚣 白花蛇舌 天山雪莲

107. 
patient face id: 01121845562436_2
label yaofang:
炒紫苏子 款冬花 炙甘草 辛夷 前胡 白前 防风 白芷 百部 法半夏 广藿香 炒苍耳子 紫菀 蜜麻黄 细辛
0.0579736 0.0792192 0.0230439 0.065437 0.0240815 0.0664827 0.0876415 0.103553 0.0622894 0.0272833 0.09624 0.074319 0.0772906 0.0536031
predicted yaofang:
法半夏 前胡 桔梗 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子

108. 
patient face id: 01012052236803_1_4_7
label yaofang:
党参 黄芪 苦杏仁 金银花 木香 茯苓 甘草 百部 丹参 竹茹 干鱼腥草 法半夏 橘红 草豆蔻 鸡内金 六神曲
0.0780695 0.0289966 0.0433096 0.0597936 0.0438949 0.0335744 0.037429 0.0227225 0.0341193 0.0262975 0.0391711 0.0482922
predicted yaofang:
甘草 法半夏 茯苓 金银花 党参 黄芪 丹参 玄参 厚朴 莱菔子 草豆蔻 六神曲

109. 
patient face id: 01211231484565_1_2
label yaofang:
蝉蜕 酸枣仁 附子 白术 麦冬 磁石 茯苓 柏子仁 龙骨 白芍
0.0302563 0.0571361 0.0369748 0.0237002 0.0313989 0.0290492 0.0273541 0.0383019 0.0221057 0.0297318 0.034573 0.0463652 0.0319472
predicted yaofang:
甘草 白芍 茯苓 龙骨 蒲公英 党参 阿胶 白术 生地黄 牛膝 附子 蝉蜕 炙甘草

110. 
patient face id: 02141949377929_6
label yaofang:
车前子 黄连 干姜 肉桂 附片
0.143637 0.142093 0.118369 0.029461 0.29208
predicted yaofang:
肉桂 车前子 干姜 砂仁 附片

111. 
patient face id: 02182259505353_1_2_6
label yaofang:
柴胡 茯苓 山药 砂仁 益母草 香附 甘草 麦芽 白芍 党参 白扁豆 菟丝子 酸枣仁 郁金 丹参
0.0598867 0.057237 0.0363565 0.0329025 0.0266441 0.0373784 0.035835 0.0203495 0.020719 0.0386709 0.0217632 0.0362023 0.0208526 0.0210574
predicted yaofang:
甘草 白芍 川芎 茯苓 党参 白术 生地黄 牛膝 山茱萸 天麻 鳖甲 蜈蚣 半枝莲 醋鳖甲

112. 
patient face id: 01061611102009_5_6
label yaofang:
鳖甲 浙贝母 苦杏仁 枳壳 天山雪莲 茯苓 山药 郁金 白花蛇舌 桔梗 火麻仁 黄连 党参 白术 丹参 甘草
0.0717677 0.0220106 0.0432921 0.0421262 0.031192 0.0310245 0.0275036 0.0247157 0.0269299 0.0246735 0.0243955 0.0259412
predicted yaofang:
甘草 白芍 法半夏 茯苓 桔梗 党参 白术 黄连 浙贝母 山药 鳖甲 白花蛇舌

113. 
patient face id: 01042304321914_4
label yaofang:
仙鹤草 豆蔻 牛膝 生石膏 苍术 川木通 甘草 干姜 姜半夏 草果 淡竹叶 浙贝母 龙脷叶
0.0246956 0.0234558 0.175144 0.0209315 0.0304102 0.0596677 0.0299824 0.0396049 0.0598652 0.0240879
predicted yaofang:
甘草 细辛 干姜 草果 仙鹤草 生石膏 苦杏仁 炙甘草 龙脷叶 姜黄

114. 
patient face id: 02111334042838_1_2_7
label yaofang:
麦冬 枸杞子 天花粉 玉米须 党参 山药 甘草 黄芪 北沙参 玄参 牡丹皮 生地黄
0.0713666 0.047403 0.0296395 0.0860089 0.0366422 0.0748171 0.0944305 0.0527206 0.0204639 0.0814154 0.0334184 0.0221135 0.0241314 0.022538 0.0389413
predicted yaofang:
甘草 党参 黄芪 枸杞子 酸枣仁 生地黄 牡丹皮 山药 泽泻 天花粉 北沙参 浮小麦 首乌藤 百合 玉米须

115. 
patient face id: 02191256242879_6_2
label yaofang:
鳖甲 半枝莲 蜈蚣 柴胡 枳壳 郁金 延胡索 木香 白花蛇舌 天麻 天山雪莲 白芍 鸡内金 北沙参 甘草
0.0610284 0.0287023 0.0207294 0.0306202 0.0216197 0.0246333 0.0553358 0.0818798 0.0219775 0.0805935 0.0679843 0.066233 0.0552861
predicted yaofang:
甘草 茯苓 远志 酸枣仁 生地黄 浙贝母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

116. 
patient face id: 02141936214927_4
label yaofang:
续断 徐长卿 甘草 土茯苓 补骨脂 威灵仙 玉竹 玉米须 萆薢 土鳖虫 牛膝
0.0343007 0.032857 0.0208055 0.0228592 0.0289026 0.0390851 0.026933 0.0221443 0.0322782 0.0219065 0.0214533 0.0678096 0.0202161 0.0237341 0.0596316
predicted yaofang:
甘草 白芍 延胡索 杜仲 石膏 肉桂 苍术 泽泻 车前子 干姜 莪术 附片 丝瓜络 骨碎补 徐长卿

117. 
patient face id: 02122236475814_3_4
label yaofang:
鳖甲 天麻 党参 补骨脂 干姜 甘草 天山雪莲 木香 半枝莲 蜈蚣 山药 赤石脂 吴茱萸 建曲 白芍 车前子
0.0748503 0.0582138 0.0242025 0.0269085 0.0567248 0.0253168 0.0271523 0.0315071 0.0347253 0.0273358 0.052143 0.0460599 0.0315115 0.0200229
predicted yaofang:
甘草 白芍 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 补骨脂 莪术 蜈蚣 天山雪莲 半枝莲

118. 
patient face id: 01051906302461_2
label yaofang:
防风 棉萆薢 炙甘草 荆芥穗 钩藤 广藿香 炒蔓荆子 首乌藤 香薷 白芷 川芎 茯苓
0.0376755 0.0257996 0.058576 0.052847 0.0245638 0.0274502 0.0484564 0.0349272 0.0384784 0.0278365 0.0258898 0.0471941 0.0250338 0.0214987 0.0203771 0.0382687 0.0283455 0.0300175 0.0649723 0.0507004
predicted yaofang:
白芍 川芎 法半夏 茯苓 前胡 防风 钩藤 干姜 荆芥穗 白芷 北柴胡 香薷 紫菀 白前 百部 炙甘草 广藿香 威灵仙 炒蔓荆子 棉萆薢

119. 
patient face id: 01042312130377_1
label yaofang:
砂仁 楮实子 茯苓 泽泻 红花 菟丝子 酒萸肉 山药 金樱子 黄精 熟地黄 牡丹皮
0.0229901 0.0369036 0.0279219 0.0333884 0.0287044 0.0341702 0.0274595 0.0414747 0.034975 0.0221051 0.0770035 0.0297635 0.0219116
predicted yaofang:
桂枝 甘草 白芍 茯苓 白术 红花 延胡索 牛膝 干姜 全蝎 地龙 炙甘草 土鳖虫

120. 
patient face id: 01050644521371_1_2
label yaofang:
鳖甲 半枝莲 蜈蚣 党参 生地黄 白术 菟丝子 浮小麦 白花蛇舌 天麻 天山雪莲 茯苓 酸枣仁 白芍 益母草 甘草
0.0522881 0.0484658 0.0248806 0.0602609 0.0392788 0.0299651 0.0209459 0.0468891 0.0676751 0.0301952 0.0740929 0.0806042 0.0627325 0.0675026
predicted yaofang:
甘草 党参 白术 酸枣仁 生地黄 郁金 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

121. 
patient face id: 01250703432063_2_5
label yaofang:
地黄 川芎 白芷 丹参 山药 山茱萸 甘草 白芍 白鲜皮 皂角刺 茯苓 连翘 牡丹皮
0.0580603 0.0253916 0.0306112 0.0200634 0.031742 0.0282381 0.0356448 0.0453626 0.0309719 0.0442708 0.0265541 0.035436
predicted yaofang:
甘草 白芍 茯苓 党参 酸枣仁 丹参 生地黄 牡丹皮 山药 山茱萸 菟丝子 益母草

122. 
patient face id: 01211218527161_4
label yaofang:
钩藤 白芍 牛膝 海风藤 豨莶草 丝瓜络 嫩桑枝 胆南星 徐长卿 地龙 宽筋藤 三七粉 甘草 苏木
0.0340642 0.0216803 0.0669353 0.0305788 0.0620079 0.023943 0.0247998 0.0260713 0.0525704 0.0512031 0.0580113
predicted yaofang:
桂枝 甘草 白芍 白术 牛膝 附子 苍术 车前子 苏木 嫩桑枝 丝瓜络

123. 
patient face id: 01132128328959_5_1
label yaofang:
鳖甲 半枝莲 红豆杉 浙贝母 薏苡仁 豆蔻 甘草 白花蛇舌 天麻 天山雪莲 苍术 桔梗 苦杏仁 滑石
0.0331518 0.0849121 0.0236365 0.020527 0.0206541 0.0629333 0.052014 0.0410083 0.0399642 0.0982508 0.027688 0.0415976 0.0369531 0.111734
predicted yaofang:
甘草 薏苡仁 白术 浙贝母 山药 天麻 鳖甲 莪术 败酱草 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

124. 
patient face id: 02021010331063_1_5
label yaofang:
党参 茯苓 天麻 预知子 牛膝 桑寄生 玉竹 白术 甘草 珍珠母 浙贝母 杜仲 砂仁
0.0566976 0.0267366 0.0213839 0.0718584 0.0430786 0.0445832 0.0618832 0.0882611 0.0286321 0.030573 0.0960235
predicted yaofang:
甘草 薏苡仁 党参 黄芪 白术 浙贝母 厚朴 砂仁 火麻仁 鸡内金 红豆杉

125. 
patient face id: 01132328455976_4
label yaofang:
紫苏叶 苦杏仁 紫苏子 姜半夏 人参叶 桔梗 厚朴 蜜枇杷叶 陈皮 茯苓
0.0266926 0.0433718 0.0437107 0.138175 0.104614 0.071523 0.0785979 0.121598 0.0666704 0.0474573
predicted yaofang:
麻黄 陈皮 黄芩 桔梗 苦杏仁 紫苏子 姜半夏 炙甘草 蜜枇杷叶 人参叶

126. 
patient face id: 02141843293517_4
label yaofang:
炒紫苏子 款冬花 蜜麻黄 广藿香 前胡 白前 炙甘草 炒六神曲 百部 陈皮 细辛 黄芪 紫菀 法半夏 干姜
0.0454154 0.118041 0.0220449 0.0669505 0.0347621 0.020602 0.0305112 0.0604391 0.0427151 0.0784935 0.0594808 0.0589391 0.0360455 0.0794459 0.0852356 0.0304951
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

127. 
patient face id: 01121853426185_2
label yaofang:
北沙参 百部 陈皮 细辛 太子参 紫菀 半夏 干姜 紫苏子 款冬花 麻黄 黄芪 前胡 白前 炙甘草 神曲
0.0323034 0.0266774 0.0425753 0.0571215 0.162115 0.0215773 0.0237398 0.0381339 0.0322254 0.0797547 0.0839987 0.0602903 0.0542287 0.0636471 0.0208184 0.0603845
predicted yaofang:
麻黄 陈皮 法半夏 前胡 半夏 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 紫苏子 炙甘草

128. 
patient face id: 02111357161355_1_4_7
label yaofang:
制何首乌 泽泻 夏枯草 红花 钩藤 丹参 牛膝 天麻 车前子 决明子 桃仁 莱菔子
0.0338927 0.10921 0.0402836 0.0424515 0.0785739 0.0460079 0.0912413 0.0304163 0.0219138 0.0415677
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 天麻 炙甘草 紫苏梗

129. 
patient face id: 01192144269748_5_1_6
label yaofang:
瓜蒌子 水蛭 甘草 三棱 党参 厚朴 豆蔻 苦杏仁 薤白 枳壳 莪术 丹参 法半夏 栀子 薏苡仁 赤芍
0.0701684 0.0332306 0.042944 0.0291806 0.0221904 0.0368037 0.0313081 0.0320159 0.0362143 0.0335387 0.0213959 0.0201265
predicted yaofang:
甘草 法半夏 茯苓 薏苡仁 远志 党参 白术 丹参 浙贝母 天麻 紫苏子 蜈蚣

130. 
patient face id: 01032105449163_6_4
label yaofang:
醋鳖甲 半枝莲 蜈蚣 羌活 赤芍 白术 麦芽 白花蛇舌草 天麻 鸡血藤 独活 川芎 骨碎补 甘草
0.0345687 0.0356589 0.0436557 0.0271164 0.0213994 0.0607621 0.0231264 0.0294661 0.0387044 0.023901 0.0246276 0.0724775 0.0321193 0.0271608 0.0209956 0.0305762 0.0214005
predicted yaofang:
甘草 白芍 川芎 枸杞子 白术 生地黄 赤芍 牡丹皮 黄柏 牛膝 山药 山茱萸 天麻 菟丝子 益母草 蜈蚣 半枝莲

131. 
patient face id: 02122219175729_1_6
label yaofang:
醋鳖甲 半枝莲 蜈蚣 苦参 地肤子 白术 金银花 麦芽 白花蛇舌草 天麻 荆芥 白鲜皮 红花 黄芪 甘草
0.0645497 0.0262677 0.0377687 0.030989 0.0356106 0.0274263 0.0357852 0.0404849 0.0211524 0.0210591 0.0506994 0.0343352 0.0324277 0.0539432
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 地黄 天麻 菟丝子 益母草 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

132. 
patient face id: 02141847160793_4
label yaofang:
北柴胡 木香 麸炒枳壳 豆蔻 郁金 法半夏 炙甘草 广藿香 白芍 醋香附 当归 麸炒白术 茯苓 川芎
0.0339508 0.0606225 0.0568821 0.0202353 0.0292377 0.0224235 0.023155 0.0280574 0.0274698 0.0600372 0.0271952 0.0249678 0.043816 0.0402191 0.0297612 0.0468299
predicted yaofang:
白芍 法半夏 茯苓 前胡 防风 麦冬 玄参 牡丹皮 荆芥穗 白芷 北柴胡 百部 炙甘草 广藿香 甘草片 麸炒白术

133. 
patient face id: 02142005466397_6_4
label yaofang:
香附 枳壳 麦芽 柴胡 紫苏梗 姜半夏 柏子仁 浙贝母 豆蔻 炙甘草 海螵蛸
0.0380694 0.0206341 0.131627 0.0362481 0.0368206 0.0258755 0.120691 0.0475807 0.0615662 0.141267
predicted yaofang:
白芍 香附 枳壳 柏子仁 海螵蛸 干姜 豆蔻 姜半夏 炙甘草 紫苏梗

134. 
patient face id: 01012106412464_1_6_8
label yaofang:
党参 茯苓 制远志 黄芪 首乌藤 酸枣仁 郁金 百合 川芎 牡蛎 麦冬 浮小麦 甘草
0.0462956 0.0211175 0.0578143 0.0374329 0.0248999 0.0381892 0.0643863 0.0378965 0.0459729 0.0439694 0.0228638 0.0211857
predicted yaofang:
甘草 川芎 茯苓 牡蛎 桃仁 党参 黄芪 白术 牛膝 厚朴 火麻仁 首乌藤

135. 
patient face id: 02191422300259_3_4
label yaofang:
山茱萸 黄芪 桑螵蛸 生地黄 茯苓 猪苓 杜仲 甘草 山药 白术 菟丝子 泽泻 熟附子 桑寄生 车前子
0.0581851 0.029649 0.029962 0.0223906 0.0271797 0.0405973 0.0241931 0.0445854 0.0418945 0.040703 0.055358 0.0470626 0.0266925 0.0385783
predicted yaofang:
甘草 独活 党参 白术 生地黄 红花 赤芍 杜仲 牛膝 山药 天麻 桑寄生 蜈蚣 牛大力

136. 
patient face id: 02151912039053_4
label yaofang:
炒紫苏子 款冬花 蜜麻黄 广藿香 前胡 白前 白芷 百部 桔梗 防风 辛夷 紫菀 法半夏 荆芥穗
0.0537396 0.0476179 0.0634132 0.0609676 0.0733085 0.0282779 0.0612485 0.0442365 0.0741684 0.0416862 0.0651691 0.0401501 0.0581571 0.0343972 0.0203396
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄

137. 
patient face id: 02191434505439_2_1_6
label yaofang:
鳖甲 天麻 蜂房 甘草 浙贝母 蒺藜 酸枣仁 浮小麦 白花蛇舌 蜈蚣 四季青 岗梅根 钩藤 辛夷 茯苓
0.0546765 0.0573588 0.0409997 0.0268016 0.0223584 0.06193 0.0244888 0.0392441 0.0897671 0.0244919 0.0751597 0.070675 0.046377
predicted yaofang:
甘草 酸枣仁 生地黄 天麻 五灵脂 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 蜂房 岗梅根 四季青

138. 
patient face id: 02151324327011_4_1
label yaofang:
党参 乌药 桑螵蛸 仙茅 益智 黄芪 覆盆子 鹿角霜 山药 当归 淫羊藿
0.0309461 0.0206367 0.0408912 0.0328001 0.0504698 0.0279829 0.0398272 0.0777594 0.0335629 0.0265893 0.0263955 0.105237 0.0630143 0.0486794 0.0287404 0.0235395
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 杜仲 牛膝 乌药 山药 泽泻 天麻 桑寄生 淫羊藿 桑螵蛸 仙茅 益智

139. 
patient face id: 01092336447011_4_1
label yaofang:
蒲公英 丹参 茯苓 黄连 合欢皮 枳实 陈皮 竹茹 首乌藤 炙甘草 姜半夏
0.0213696 0.0219352 0.0500505 0.0374403 0.0218268 0.0569325 0.0579267 0.0276164 0.0461102 0.0339526 0.0334217 0.0237176 0.0521918 0.0530493 0.0428764 0.0212401 0.0592434
predicted yaofang:
甘草 白芍 陈皮 茯苓 蒲公英 白术 黄连 枳实 竹茹 苍术 山茱萸 干姜 升麻 麦芽 炙甘草 紫苏叶 合欢皮

140. 
patient face id: 01031834204300_4
label yaofang:
炒紫苏子 前胡 百部 紫菀 款冬花 白前 桔梗 陈皮 法半夏 炙甘草 防风 白芷 辛夷 炒苍耳子
0.105768 0.025294 0.044458 0.0975649 0.0218215 0.109644 0.0341279 0.0417749 0.0239761 0.0476801 0.0385738 0.086599 0.0281776 0.0552955 0.0225692
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 甘草片 炒紫苏子

141. 
patient face id: 01122218311736_1_2_6
label yaofang:
鳖甲 半枝莲 蜈蚣 红豆杉 鸡血藤 白术 甘草 益母草 白花蛇舌 天麻 天山雪莲 生地黄 乌梢蛇 党参 菟丝子 酸枣仁
0.0600339 0.0240002 0.0319363 0.0321543 0.035462 0.0260587 0.0526346 0.0654234 0.063732 0.0605204 0.0530352 0.0439695
predicted yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

142. 
patient face id: 01192131597036_5_3
label yaofang:
鳖甲 薏苡仁 蜈蚣 熟附子 党参 白术 杜仲 半枝莲 天麻 甘草 败酱草 山药 巴戟天 天山雪莲
0.0666513 0.0240942 0.036047 0.0254613 0.0395537 0.0269118 0.100838 0.0540815 0.025994 0.0333114 0.0306331 0.0220156 0.0309496
predicted yaofang:
甘草 党参 白术 生地黄 杜仲 山药 山茱萸 天麻 肉苁蓉 补骨脂 蜈蚣 天山雪莲 半枝莲

143. 
patient face id: 01172235169237_1_4
label yaofang:
酸枣仁 党参 甘草 天麻 浮小麦 川芎 红花 生地黄 茯苓 丹参 郁金 赤芍 鸡血藤 乌梢蛇
0.0446266 0.0571628 0.0574242 0.12743 0.0750793 0.0207062 0.0498314 0.0727208 0.0266773 0.0497624 0.0376007 0.077397 0.0453399 0.0316696
predicted yaofang:
甘草 川芎 党参 酸枣仁 丹参 生地黄 红花 赤芍 郁金 天麻 益母草 浮小麦 首乌藤 乌梢蛇

144. 
patient face id: 01250705332646_2_7_6
label yaofang:
鳖甲 半枝莲 蜈蚣 酸枣仁 远志 生地黄 合欢花 浮小麦 白花蛇舌 天麻 天山雪莲 茯苓 党参 知母 甘草
0.0666858 0.0259589 0.0200042 0.0338502 0.0427213 0.0366695 0.04105 0.0210986 0.0582084 0.0216221 0.0433489 0.0382853
predicted yaofang:
甘草 白芍 川芎 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 半枝莲

145. 
patient face id: 01201257235995_7
label yaofang:
天麻 赤芍 首乌藤 威灵仙 络石藤 桃仁 白术 甘草 桂枝 川芎 生地黄 鸡血藤 桑枝 红花 党参
0.0681307 0.0304588 0.0210777 0.0504474 0.0237471 0.0225038 0.0213295 0.0360427 0.0256415 0.03458 0.0242094 0.023672 0.0230116 0.0209376 0.0392048 0.0377902 0.0249942 0.0440091 0.0419172 0.0335538
predicted yaofang:
桂枝 甘草 白芍 川芎 党参 鸡血藤 枸杞子 白术 生地黄 红花 赤芍 熟地黄 牡丹皮 杜仲 山茱萸 地黄 地龙 续断 桑枝 威灵仙

146. 
patient face id: 01062037534192_6_2
label yaofang:
柴胡 茯苓 酸枣仁 蒲公英 川芎 甘草 合欢花 白芍 白术 麸炒枳壳 党参 当归 麦芽
0.0566787 0.0397498 0.0230217 0.0398485 0.0246715 0.0503792 0.0336635 0.0315683 0.0454113 0.0253228 0.0275284 0.0353105 0.0399695 0.0248215
predicted yaofang:
甘草 白芍 当归 茯苓 党参 白术 酸枣仁 生地黄 牡丹皮 山药 地黄 菟丝子 麦芽 合欢花

147. 
patient face id: 01312049250652_1_3
label yaofang:
辛夷 白芷 茯苓 骨碎补 北沙参 厚朴 肉苁蓉 桃仁 苍耳子 太子参 白术 狗脊 紫苏叶 火麻仁 土鳖虫
0.0591078 0.0618624 0.0226645 0.0260772 0.101536 0.0223775 0.0376756 0.0386886 0.0279992 0.0376823 0.02653 0.0245952
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 赤芍 杜仲 砂仁 菟丝子 桑寄生 枇杷叶 首乌藤

148. 
patient face id: 01052203227715_2_7
label yaofang:
黄芪 山慈菇 红豆杉 土鳖虫 赤芍 墨旱莲 牛膝 白术 蛇舌草 砂仁 桃仁 海螵蛸 桑寄生
0.093525 0.0668499 0.0231114 0.0405219 0.0452159 0.0386085 0.02275 0.0362368 0.0348015 0.0744212 0.127232 0.045486
predicted yaofang:
黄芪 白术 生地黄 赤芍 杜仲 牛膝 山茱萸 砂仁 桑寄生 土鳖虫 红豆杉 山慈菇

149. 
patient face id: 02010649058806_1_2_5
label yaofang:
鳖甲 黄芩片 浙贝母 天花粉 芦根 紫菀 四季青 麦芽 白花蛇舌 牛蒡子 桔梗 白茅根 岗梅根 款冬花 甘草
0.0717648 0.0220091 0.043296 0.0421264 0.0311974 0.0310226 0.0275007 0.0247147 0.0269327 0.0246703 0.0243945 0.0259408
predicted yaofang:
甘草 白芍 法半夏 茯苓 桔梗 党参 白术 黄连 浙贝母 山药 鳖甲 白花蛇舌

150. 
patient face id: 01140801547976_6_2
label yaofang:
党参 白术 益母草 甘草 白芍 生地黄 桃仁 墨旱莲 茯苓 菟丝子 牡丹皮 柴胡 栀子 黄柏 合欢花
0.068378 0.0225134 0.039922 0.0488181 0.0349852 0.0414017 0.0333165 0.0338939 0.0306358 0.0437281 0.045088 0.0259737
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 酸枣仁 丹参 生地黄 菟丝子 益母草 麦芽

151. 
patient face id: 02182236090138_5_7
label yaofang:
鳖甲 天麻 莪术 茯苓 天山雪莲 枳壳 甘草 紫苏梗 半枝莲 蜈蚣 法半夏 党参 郁金 薏苡仁 砂仁 广藿香
0.0552238 0.0294807 0.0280263 0.023972 0.0302347 0.0254549 0.0315157 0.0454833 0.0715082 0.0279205 0.0592903 0.0699662 0.0467038 0.0259885 0.0278848
predicted yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 党参 浙贝母 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

152. 
patient face id: 01172334379834_1_2
label yaofang:
鳖甲 薏苡仁 蜈蚣 莪术 郁金 白芍 黄精 白花蛇舌 天麻 天山雪莲 太子参 浙贝母 佛手 甘草
0.0578811 0.0269078 0.0295387 0.0372556 0.0308819 0.0338892 0.0574975 0.0344992 0.060644 0.0429942 0.0429109 0.0276202 0.0210065
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 天麻 鳖甲 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

153. 
patient face id: 02150747509106_1_4_7
label yaofang:
炙甘草 桂枝 麦冬 龙骨 党参 熟地黄 火麻仁 牡蛎 黑枣 苦参 五味子 炙甘草 桂枝 麦冬 龙骨 党参 熟地黄 火麻仁 牡蛎 黑枣 苦参 五味子
0.0394646 0.0445629 0.0204856 0.0232812 0.0362874 0.0219387 0.0299956 0.0566569 0.0206111 0.0353677 0.040386 0.0349345 0.0266086
predicted yaofang:
甘草 茯苓 橘红 牡蛎 桃仁 麦冬 党参 黄芪 白术 牛膝 厚朴 火麻仁 北沙参

154. 
patient face id: 02161901358170_1_4
label yaofang:
炒六神曲 布渣叶 炒白扁豆 醋香附 茯苓 陈皮 炒麦芽 豆蔻 麸炒白术 广藿香 炒稻芽 麸炒苍术 佩兰 甘草片
0.0293849 0.026584 0.0306101 0.0204671 0.022029 0.0252633 0.0349885 0.0564634 0.0621102 0.0260825 0.0397587 0.069207 0.0409272 0.153027 0.0650185 0.052386
predicted yaofang:
陈皮 桔梗 太子参 佩兰 百部 炙甘草 广藿香 甘草片 炒白扁豆 蜜麻黄 麸炒白术 麸炒苍术 炒六神曲 布渣叶 炒稻芽 炒麦芽

155. 
patient face id: 01061859515593_1_5
label yaofang:
紫苏子 款冬花 麻黄 细辛 前胡 白前 炙甘草 干姜 百部 陈皮 防风 紫菀 半夏 广藿香
0.0281294 0.0339383 0.0288842 0.0807307 0.0475731 0.0779029 0.0608483 0.113069 0.0819394 0.116793 0.0598378 0.0315128 0.0298952 0.0427665 0.0416974 0.057397
predicted yaofang:
麻黄 陈皮 法半夏 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 炒紫苏子 蜜麻黄

156. 
patient face id: 01312130145531_4_1_6
label yaofang:
鳖甲 薏苡仁 天麻 天山雪莲 茯苓 远志 砂仁 合欢花 白花蛇舌 莪术 蜈蚣 党参 法半夏 木香 甘草 枳壳
0.0817632 0.0207492 0.040129 0.0250489 0.0228975 0.038451 0.0354407 0.0659139 0.048752 0.054268 0.0451621 0.0282423 0.0287075
predicted yaofang:
甘草 法半夏 茯苓 党参 酸枣仁 浙贝母 郁金 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

157. 
patient face id: 01132142541437_1_6
label yaofang:
鳖甲 半枝莲 蜈蚣 杜仲 生地黄 山茱萸 首乌藤 白花蛇舌 天麻 天山雪莲 续断 山药 党参 甘草
0.0275458 0.0441023 0.0237367 0.0241354 0.0523184 0.126012 0.0929657 0.134502 0.111136 0.0923515 0.0444937
predicted yaofang:
甘草 酸枣仁 生地黄 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

158. 
patient face id: 01032104426538_2_5
label yaofang:
醋鳖甲 半枝莲 蜈蚣 地黄 北沙参 牛膝 川木通 白花蛇舌草 天麻 酸枣仁 麦冬 白茅根 广金钱草 甘草
0.0565593 0.0247722 0.037216 0.0308837 0.0257005 0.0222865 0.0754872 0.0224906 0.0323562 0.053237 0.0202856 0.0220109 0.0494682 0.0327586
predicted yaofang:
甘草 党参 酸枣仁 生地黄 山茱萸 地黄 天麻 鳖甲 白花蛇舌草 蜈蚣 白花蛇舌 天山雪莲 半枝莲 醋鳖甲

159. 
patient face id: 01040651054435_6_7_2
label yaofang:
白芍 全蝎 羌活 川芎 蔓荆子 甘草 柏子仁 天麻 细辛 白芷 牛膝 赤芍 酸枣仁
0.0673702 0.0256479 0.0222531 0.0271772 0.0476012 0.0475479 0.0353636 0.0262581 0.021785 0.0265393 0.0337016
predicted yaofang:
甘草 白芍 川芎 法半夏 茯苓 党参 白术 酸枣仁 黄连 山药 天麻

160. 
patient face id: 01211300052209_7
label yaofang:
蝉蜕 胆南星 豨莶草 嫩桑枝 丝瓜络 僵蚕 地龙 甘草 白芍 钩藤 海风藤 徐长卿 三七粉 宽筋藤
0.0461793 0.106697 0.0385715 0.0616985 0.0255685 0.0301112 0.0253124 0.0220028 0.0442879 0.0300782 0.0351638 0.0209486 0.0202707
predicted yaofang:
桂枝 白芍 大枣 胆南星 干姜 全蝎 僵蚕 炙甘草 嫩桑枝 丝瓜络 海风藤 徐长卿 三七粉

161. 
patient face id: 02182232112406_6
label yaofang:
天麻 桑寄生 甘草 法半夏 谷精子 茵陈 栀子 天花粉 杜仲 茯苓 地龙 紫苏叶 钩藤 浙贝母 麦芽
0.0581022 0.0895474 0.0392813 0.0318055 0.0355601 0.0273827 0.030534 0.0241011 0.0398005 0.0461042
predicted yaofang:
甘草 法半夏 茯苓 桔梗 牛膝 细辛 天麻 款冬花 地龙 苦杏仁

162. 
patient face id: 01042345291518_1_7
label yaofang:
天麻 牡蛎 首乌藤 党参 甘草 山药 夏枯草 牛膝 钩藤 地龙 酸枣仁 泽泻 麦芽 磁石 防己
0.0441831 0.0398261 0.0261623 0.0306429 0.0240862 0.0407989 0.026312 0.024156 0.0925746 0.0220935 0.0237641 0.0324391 0.0266491 0.0301827 0.0242952
predicted yaofang:
甘草 川芎 党参 白术 酸枣仁 牛膝 山茱萸 泽泻 天麻 磁石 桑寄生 地龙 续断 蜈蚣 半枝莲

163. 
patient face id: 01052106017969_6_7
label yaofang:
黄芩冲剂 柴胡冲剂 丹皮片冲剂 桃仁冲剂 车前草冲剂 枳实冲剂 白芍冲剂 法夏冲剂 当归冲剂 川芎冲剂 泽泻冲剂 茯苓冲剂 白术冲剂 干姜冲剂 大黄冲剂
0.101616 0.108112 0.0337487 0.073729 0.0652729 0.107605 0.067658 0.0770535 0.0289088 0.0378611 0.0417218 0.0314915 0.0244895
predicted yaofang:
黄芩冲剂 柴胡冲剂 当归冲剂 枳实冲剂 白芍冲剂 法夏冲剂 干姜冲剂 大黄冲剂 生地冲剂 白术冲剂 茯苓冲剂 川芎冲剂 泽泻冲剂

164. 
patient face id: 01061557292574_1_4
label yaofang:
甘草 桂枝 车前子 白芍 山药 白术 桑螵蛸 菟丝子 泽兰 赤芍 猪苓 山茱萸 黄芪 黄芪 广升麻 益智 益母草
0.072337 0.0308677 0.0268592 0.0362894 0.0238789 0.0824348 0.0437672 0.0322291 0.0223547 0.0233382
predicted yaofang:
甘草 茯苓 党参 生地黄 栀子 牡丹皮 山药 山茱萸 茵陈 麦芽

165. 
patient face id: 01190634410324_4
label yaofang:
醋鳖甲 半枝莲 蜈蚣 桔梗 芦根 白术 太子参 白花蛇舌草 天麻 浙贝母 诃子 茯苓 天花粉 甘草
0.0752358 0.0214529 0.0404155 0.102514 0.0277806 0.0206846 0.0224058 0.0397934 0.0221156 0.0609989 0.0226932 0.0220437 0.0432256 0.0501355 0.0243728
predicted yaofang:
甘草 枳壳 桔梗 浙贝母 天麻 款冬花 旋覆花 诃子 豆蔻 白花蛇舌草 苦杏仁 板蓝根 蜈蚣 半枝莲 醋鳖甲

166. 
patient face id: 01062352246860_1_4_7
label yaofang:
炙甘草 黑枣 熟地黄 火麻仁 龙骨 苦参 党参 桂枝 麦冬 五味子 牡蛎
0.020776 0.0265425 0.0324639 0.031561 0.0291624 0.0307975 0.0342227 0.0248406 0.0218607 0.0209475 0.0517227 0.0275118 0.0204623 0.021836 0.020021
predicted yaofang:
桂枝 甘草 白芍 茯苓 党参 鸡血藤 白术 泽泻 干姜 天麻 炙甘草 续断 百合 蜈蚣 狗脊

167. 
patient face id: 01312134327639_5_1
label yaofang:
鳖甲 薏苡仁 天麻 红豆杉 黄芩片 麻黄 法半夏 前胡 甘草 白花蛇舌 莪术 蜈蚣 龙葵果 苦杏仁 茯苓 款冬花 鱼腥草
0.0563432 0.0364756 0.0297452 0.0318278 0.0231913 0.0329618 0.0325114 0.0387061 0.0249537 0.0242376 0.0207694 0.0306391 0.0237953 0.0355554
predicted yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 浙贝母 细辛 干姜 天麻 鳖甲 款冬花 苦杏仁 炙麻黄 蜈蚣

168. 
patient face id: 02151828175305_2
label yaofang:
前胡 桔梗 荆芥穗 辛夷 百部 陈皮 广藿香 白芷 紫菀 炙甘草 炒六神曲 款冬花 防风 茯苓
0.051383 0.0634457 0.056532 0.0256457 0.0816524 0.0245416 0.0657196 0.039313 0.0460051 0.0412953 0.0371826 0.0541346 0.06283 0.0420926 0.079323 0.0318894 0.0456189 0.0219725 0.0318448
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子 炒六神曲

169. 
patient face id: 01120051246013_1_7
label yaofang:
防风 苍术 川芎 天花粉 牡蛎 当归 黄芩 葛根 全蝎 炙甘草 干姜 土鳖虫 桂枝 蜈蚣 白芍 狗脊 柴胡 鸡血藤 泽泻 茯苓
0.0426425 0.0356933 0.073962 0.0492305 0.0221669 0.0220599 0.0588854 0.0215559 0.0265386 0.0319184 0.0218729 0.0623347 0.0376676 0.0462059 0.0211738
predicted yaofang:
桂枝 甘草 白芍 川芎 陈皮 当归 茯苓 远志 党参 白术 牛膝 干姜 全蝎 炙甘草 续断

170. 
patient face id: 01041827451344_1_4
label yaofang:
北沙参 太子参 炒紫苏子 前胡 百部 紫菀 款冬花 白前 陈皮 法半夏 蜜麻黄 炙甘草 细辛 干姜
0.0400366 0.0339117 0.0978289 0.0707064 0.0388457 0.0322271 0.105503 0.101724 0.114592 0.0555118 0.0553987 0.0817225 0.0234315 0.0512164 0.0606949
predicted yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

171. 
patient face id: 01211217272723_6
label yaofang:
郁金 黄连 丹参 首乌藤 石菖蒲 炙甘草 茯苓 姜半夏 陈皮 合欢皮 竹茹 枳实
0.024201 0.0207532 0.0305065 0.0417685 0.0538733 0.0428141 0.0773906 0.0214781 0.0227417 0.0329768 0.0365747 0.0280959
predicted yaofang:
甘草 柴胡 白芍 当归 茯苓 党参 白术 黄连 海螵蛸 枳实 竹茹 炙甘草

172. 
patient face id: 01182135003848_1_5_7
label yaofang:
柴胡 牡丹皮 党参 酸枣仁 菟丝子 桑寄生 白术 合欢花 白芍 栀子 生地黄 丹参 益母草 茯苓 甘草
0.0548701 0.0267302 0.0450371 0.0434571 0.0275775 0.0381492 0.0286089 0.0285143 0.0200482 0.022393 0.0648831 0.0660688 0.0223951 0.029409
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 酸枣仁 丹参 生地黄 地黄 菟丝子 益母草 麦芽 合欢花

173. 
patient face id: 01051854006500_4_1
label yaofang:
北沙参 百部 细辛 炙甘草 太子参 紫菀 陈皮 茯苓 炒紫苏子 款冬花 法半夏 干姜 前胡 白前 蜜麻黄
0.0267056 0.0623645 0.103362 0.0802055 0.0770743 0.102165 0.0548313 0.0595357 0.0578291 0.0333922 0.101871 0.0219149 0.0663973 0.0364053
predicted yaofang:
陈皮 法半夏 前胡 桔梗 细辛 款冬花 紫菀 白前 百部 紫苏子 炙甘草 炒紫苏子 蜜麻黄 人参叶

174. 
patient face id: 01101822532611_4
label yaofang:
白芷 款冬花 炒苍耳子 蜜麻黄 前胡 白前 炙甘草 茯苓 百部 桔梗 防风 紫菀 法半夏 辛夷
0.0282382 0.108653 0.0263175 0.0522522 0.176775 0.0209679 0.0578699 0.0314762 0.037373 0.062527 0.0607984 0.0283839 0.0432912 0.0335476 0.025106
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子 人参叶

175. 
patient face id: 02191632068330_5
label yaofang:
醋鳖甲 半枝莲 蜈蚣 桔梗 荆芥 牛蒡子 芦根 白花蛇舌草 天麻 浙贝母 贯众 诃子 黄芩 甘草
0.0514631 0.0308912 0.0435766 0.0289961 0.0298072 0.041947 0.0452517 0.0521037 0.030364 0.028624 0.0650774 0.036598
predicted yaofang:
甘草 牛蒡子 浙贝母 细辛 地黄 天麻 诃子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 贯众

176. 
patient face id: 01100248200851_1_2
label yaofang:
醋延胡索 紫苏梗 炙甘草 蜈蚣 苏木 白芍 全蝎 牛膝
0.0234893 0.0345124 0.0761441 0.0375995 0.0446752 0.0604868 0.0360991 0.0303757 0.0224151
predicted yaofang:
甘草 柴胡 白芍 牛膝 苏木 姜半夏 炙甘草 续断 醋延胡索

177. 
patient face id: 01062353212507_1_6
label yaofang:
党参 制远志 首乌藤 郁金 川芎 麦冬 甘草 茯苓 黄芪 酸枣仁 百合 牡蛎 浮小麦
0.0439874 0.0618361 0.0547991 0.0209037 0.0588755 0.0399201 0.0252747 0.0547598 0.0233085 0.0409137 0.0567073 0.043312 0.12402 0.0436604 0.0231173
predicted yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 枸杞子 酸枣仁 生地黄 山药 浮小麦 首乌藤 百合 制远志 黄精

178. 
patient face id: 01111905547402_2_4
label yaofang:
炒紫苏子 款冬花 蜜麻黄 荆芥穗 前胡 白前 炙甘草 辛夷 百部 桔梗 薄荷 广藿香 紫菀 法半夏 防风
0.037356 0.0798182 0.0787625 0.0341931 0.0294539 0.0247801 0.0849793 0.0621694 0.0720209 0.0464552 0.0315899 0.189938 0.0519881 0.0361739
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄

179. 
patient face id: 02142141228870_1_2
label yaofang:
天麻 地龙 酸枣仁 甘草 川芎 麦芽 牛膝 牡蛎 首乌藤 党参 磁石 枸杞子 龟甲 生地黄
0.0504252 0.0211829 0.0303203 0.0425066 0.0336847 0.0510771 0.0258255 0.0249028 0.0245711 0.02202 0.0339829 0.0252237 0.0240672 0.0258946 0.0280637 0.0323355
predicted yaofang:
甘草 白芍 川芎 茯苓 党参 白术 酸枣仁 红花 牛膝 山茱萸 地黄 天麻 菟丝子 桑寄生 麦芽 首乌藤

180. 
patient face id: 02122058104687_1_4_6
label yaofang:
鳖甲 半枝莲 蜈蚣 酸枣仁 党参 首乌藤 生地黄 白花蛇舌 天麻 天山雪莲 远志 龙骨 茯苓 甘草
0.0652874 0.0273167 0.0351449 0.0263985 0.0241696 0.0235293 0.0351818 0.0689929 0.0667717 0.086387 0.0637544 0.0567899 0.0673594
predicted yaofang:
甘草 白芍 茯苓 远志 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

181. 
patient face id: 01041825305063_2_4
label yaofang:
麦冬 百部 桔梗 茯苓 北沙参 紫菀 陈皮 炒紫苏子 款冬花 蜜麻黄 前胡 白前 炙甘草
0.0846681 0.0496675 0.0421051 0.0515742 0.0882009 0.0545285 0.046301 0.0359744 0.0497762 0.0465485 0.0462065 0.0573721 0.0580273 0.0330611 0.0617181 0.0555606
predicted yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

182. 
patient face id: 01250653068283_6_5
label yaofang:
党参 茯苓 薏苡仁 白花蛇舌 柴胡 合欢花 黄精 甘草 黄芪 白术 白芍 丹参 枳壳 五灵脂 砂仁
0.0673925 0.0279164 0.0515609 0.0205816 0.0363253 0.0447279 0.090417 0.0355901 0.0264819
predicted yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 赤芍 郁金

183. 
patient face id: 02182010564815_6_1_2
label yaofang:
鳖甲 薏苡仁 浙贝母 橘红 丹参 紫苏梗 广藿香 补骨脂 天山雪莲 白花蛇舌 郁金 桔梗 太子参 砂仁 黄连 甘草 鸡血藤
0.0555791 0.042573 0.0396888 0.0262553 0.027875 0.0277142 0.0222886 0.0573967 0.0519464 0.0612614 0.032216 0.0242135 0.0356961
predicted yaofang:
甘草 陈皮 茯苓 桔梗 薏苡仁 党参 太子参 白术 浙贝母 砂仁 紫苏梗 蜈蚣 红豆杉

184. 
patient face id: 02142002447507_1
label yaofang:
香附 枳壳 麦芽 柴胡 紫苏梗 姜半夏 浙贝母 豆蔻 海螵蛸 炙甘草
0.0514485 0.03417 0.0624179 0.0200082 0.0451743 0.0369592 0.031419 0.0483577 0.0641853 0.128007 0.0534482 0.0575097
predicted yaofang:
柴胡 香附 枳壳 桔梗 牛蒡子 海螵蛸 浙贝母 干姜 豆蔻 姜半夏 炙甘草 紫苏梗

185. 
patient face id: 02170748338173_1_3
label yaofang:
党参 黄芪 郁金 牡蛎 甘草 茯苓 首乌藤 百合 麦冬 制远志 酸枣仁 川芎 浮小麦
0.0317089 0.0536117 0.027526 0.0341838 0.124031 0.020505 0.100742 0.0908274 0.0231495 0.188491 0.0547009 0.122628
predicted yaofang:
甘草 川芎 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 山药 浮小麦 首乌藤 百合

186. 
patient face id: 01312310114850_2
label yaofang:
天麻 酸枣仁 牛膝 桑寄生 女贞子 生地黄 牡丹皮 山药 钩藤 茯苓 川芎 杜仲 墨旱莲 泽泻 甘草
0.0370458 0.0210514 0.0221299 0.0266624 0.0315323 0.0224697 0.0626168 0.0216333 0.056135 0.0294775 0.0211226 0.0326033 0.0200919 0.0727455 0.0213374
predicted yaofang:
甘草 党参 白术 生地黄 红花 赤芍 杜仲 黄柏 牛膝 山药 山茱萸 天麻 菟丝子 桑寄生 桑螵蛸

187. 
patient face id: 01190705074426_4_7
label yaofang:
天麻 桑寄生 白术 地龙 赤芍 陈皮 僵蚕 杜仲 茯苓 甘草 党参 法半夏 首乌藤
0.0633181 0.050322 0.0473437 0.0396455 0.0388374 0.0401925 0.0264574 0.022916 0.042685 0.0227033 0.0254751 0.0222747 0.0201523
predicted yaofang:
甘草 川芎 茯苓 党参 白术 酸枣仁 赤芍 牛膝 天麻 菟丝子 桑寄生 地龙 首乌藤

188. 
patient face id: 02161922458265_6
label yaofang:
浙贝母 桔梗 广金钱草 延胡索 莪术 瓜蒌皮 桑枝 猫爪草 甘草 北沙参 王不留行 牡蛎 砂仁 厚朴
0.039956 0.0349611 0.0484571 0.0422446 0.10071 0.0309216 0.0230526 0.0417997 0.0374057 0.030683 0.0928428
predicted yaofang:
甘草 茯苓 桔梗 白术 浙贝母 天麻 瓜蒌皮 鳖甲 苦杏仁 蜈蚣 猫爪草

189. 
patient face id: 01192234341547_1_6
label yaofang:
鳖甲 蜈蚣 半枝莲 酸枣仁 生地黄 红花 川芎 甘草 白花蛇舌 天山雪莲 天麻 党参 桃仁 当归 赤芍
0.0692998 0.0210253 0.0304132 0.0268618 0.0468437 0.0595464 0.0236857 0.0202467 0.0587511 0.032431 0.041079 0.0590862 0.0307622 0.0299213 0.0556571
predicted yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 山药 山茱萸 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

190. 
patient face id: 02142147380561_2_1_4
label yaofang:
桑寄生 甘草 白术 蒺藜 杜仲 菊花 白芍 粉葛 地龙 川芎 天麻 牛膝 枸杞子 蔓荆子 麦芽
0.0575757 0.0715588 0.024867 0.0285146 0.0310158 0.0261204 0.0631665 0.0557709 0.0442569 0.0319414 0.0279025 0.0377761
predicted yaofang:
甘草 白芍 川芎 茯苓 桃仁 党参 生地黄 牡丹皮 山药 山茱萸 天麻 桑寄生

191. 
patient face id: 01012115347471_1_3
label yaofang:
制何首乌 盐车前子 泽泻颗粒 丹参颗粒 决明子 夏枯草颗粒 牛膝颗粒 燀桃仁 天麻颗粒 莱菔子颗粒
0.0203249 0.0692503 0.0354367 0.126317 0.0325139 0.0976118 0.071313 0.0330345 0.0409013 0.0487285 0.0367928 0.039598 0.0288586 0.0592132 0.0591481
predicted yaofang:
甘草 川芎 丹参 决明子 浮小麦 百合 制何首乌 盐车前子 泽泻颗粒 丹参颗粒 夏枯草颗粒 牛膝颗粒 燀桃仁 天麻颗粒 莱菔子颗粒

192. 
patient face id: 02191425415892_1_7
label yaofang:
生地黄 山药 黄柏 菟丝子 泽兰 赤芍 甘草 山茱萸 牡丹皮 仙茅 益母草 土鳖虫 红花 茯苓
0.0441476 0.0218632 0.0611188 0.0355398 0.0291336 0.034835 0.0263459 0.0403653 0.0254717 0.0398354 0.024628 0.0298424 0.0206267 0.0474657
predicted yaofang:
甘草 柴胡 白芍 川芎 当归 茯苓 白术 生地黄 牡丹皮 黄柏 牛膝 知母 山药 山茱萸

193. 
patient face id: 01182055420456_7_1
label yaofang:
党参 茯苓 首乌藤 益母草 川芎 补骨脂 甘草 丹参 酸枣仁 菟丝子 红景天 白术 牛膝 枸杞子
0.0679539 0.0461078 0.0322117 0.0538843 0.0228174 0.0395158 0.0317249 0.030755 0.023845 0.0214186 0.0362347 0.0210301
predicted yaofang:
甘草 川芎 法半夏 茯苓 远志 党参 白术 酸枣仁 牛膝 山茱萸 天麻 地龙

194. 
patient face id: 02181957360140_2_6
label yaofang:
白芍 白术 山药 酸枣仁 生地黄 牡丹皮 甘草 茯苓 党参 大枣 柏子仁 山茱萸 郁李仁
0.0731071 0.0324839 0.0699473 0.0385177 0.028691 0.022232 0.0242171 0.0584198 0.0235479 0.0433302 0.0390883 0.0381363
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 酸枣仁 生地黄 栀子 牡丹皮 山药 山茱萸

195. 
patient face id: 01192233038041_6_7_1
label yaofang:
鳖甲 半枝莲 蜈蚣 酸枣仁 党参 桂枝 糯稻根 白花蛇舌 天麻 天山雪莲 白术 龙骨 白芍 甘草
0.0660265 0.0218568 0.0446016 0.0389446 0.0399686 0.0310609 0.0542908 0.0462952 0.0900711 0.0447718 0.0496078 0.0889753
predicted yaofang:
甘草 远志 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

196. 
patient face id: 02182304131167_1_6
label yaofang:
党参 酸枣仁 山药 益智 麦芽 王不留行 白芍 甘草 鳖甲 桑螵蛸 首乌藤 荆芥穗 五倍子 柏子仁
0.0715315 0.031056 0.0567022 0.0498729 0.0441585 0.0393591 0.0309796 0.0201803 0.0464488 0.0437323 0.0321553 0.0431893 0.0206912 0.0263813
predicted yaofang:
甘草 白芍 薏苡仁 党参 白术 郁金 山药 天麻 鳖甲 莪术 败酱草 蜈蚣 白花蛇舌 红豆杉

197. 
patient face id: 01132129373601_1_2_7
label yaofang:
黄连 丹参 山药 桃仁 乌梢蛇 赤芍 甘草 首乌藤 苍术 党参 山茱萸 红花 桂枝 太子参 天花粉
0.0654409 0.0293754 0.0223384 0.0509002 0.0218961 0.0259572 0.0352693 0.0263442 0.0230833 0.023104 0.0507369 0.0363892 0.0216504 0.0213955
predicted yaofang:
甘草 川芎 法半夏 茯苓 桃仁 党参 白术 酸枣仁 杜仲 山药 山茱萸 天麻 地龙 首乌藤

198. 
patient face id: 01052214499946_4
label yaofang:
三七片 西洋参 丹参
0.046796 0.0267323 0.0565509 0.0381464 0.0341954 0.0279489 0.0495483 0.042138 0.0552761 0.0202567 0.0311459 0.0420218
predicted yaofang:
甘草 柴胡 白芍 枳壳 茯苓 龙骨 党参 白术 黄连 延胡索 麦芽 紫苏梗

199. 
patient face id: 02181627186318_1_5
label yaofang:
荆芥穗 白鲜皮 红花 浙贝母 黄芪 牡丹皮 甘草 防风 地肤子 金银花 皂角刺 麦芽 水牛角
0.0452184 0.0255282 0.051164 0.0817473 0.026164 0.0226605 0.0311872 0.0299506 0.0257151 0.0291851 0.0716419 0.0447576
predicted yaofang:
甘草 白芍 防风 金银花 薏苡仁 生地黄 红花 水牛角 荆芥穗 麦芽 白鲜皮 地肤子