threshold = 0.5 (sigmoid)

0. 
patient tongue id: 02122059160135_4_6
label yaofang:
茯苓 细辛 干姜 炙麻黄 远志 甘草 紫苏子 法半夏 五味子 黄芩片 地龙 桃仁 浙贝母
0.899868 0.669932 0.562154
predicted yaofang:
甘草 法半夏 茯苓

1. 
patient tongue id: 05092230212086_2_4_6
label yaofang:
鳖甲 蜂房 浙贝母 太子参 麦冬 岗梅根 黄芩片 白花蛇舌 四季青 桔梗 白芍 乌梅 北沙参 甘草
0.923312 0.661963 0.685884 0.503985
predicted yaofang:
甘草 浙贝母 鳖甲 白花蛇舌

2. 
patient tongue id: 06070237366457_1_2
label yaofang:
醋鳖甲 半枝莲 蜈蚣 茯苓 党参 龙骨 石菖蒲 白花蛇舌草 天麻 酸枣仁 白术 杜仲 山药 甘草
0.986867 0.702413 0.846967 0.581161 0.512688 0.798745 0.539839 0.72791 0.533347
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 半枝莲

3. 
patient tongue id: 05222128038888_7_2_1
label yaofang:
黄芪 橘络 莪术 牡蛎 蒲公英 墨旱莲 白术 王不留行 砂仁 浙贝母 麦芽
0.583509 0.706136 0.586731
predicted yaofang:
黄芪 白术 砂仁

4. 
patient tongue id: 05182037284021_1_4
label yaofang:
柴胡 姜半夏 白芷 天麻 白术 炙甘草 泽泻 党参 黄芩 续断
0.677329 0.535429 0.660116
predicted yaofang:
党参 白术 炙甘草

5. 
patient tongue id: 05222054130477_1_2_6
label yaofang:
黄芪 糯稻根 鸡内金 合欢皮 紫苏梗 墨旱莲 白术 五味子 首乌藤 海螵蛸 稻芽 龙骨
0.768906 0.783219
predicted yaofang:
黄芪 白术

6. 
patient tongue id: 06130818199397_1_2
label yaofang:
党参 黄芪 郁金 牡蛎 茯苓 首乌藤 百合 麦冬 制远志 酸枣仁 川芎 浮小麦
0.546652 0.826884 0.549287 0.591642 0.814818 0.827036 0.786742 0.640435 0.848972
predicted yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 浮小麦 首乌藤

7. 
patient tongue id: 01132320412873_1
label yaofang:
天山雪莲 党参 当归 牡丹皮 红花 川芎 吴茱萸 炙甘草 白芍 桂枝 姜半夏 阿胶
0.746248 0.565112
predicted yaofang:
白芍 炙甘草

8. 
patient tongue id: 05262109501026_1_6
label yaofang:
醋鳖甲 半枝莲 蜈蚣 党参 白术 防风 扁豆花 白花蛇舌草 天麻 酸枣仁 茯苓 山药 陈皮 甘草
0.9806 0.657137 0.72953 0.63402 0.523047 0.822607 0.716681 0.599523
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣 半枝莲

9. 
patient tongue id: 05182057208000_4
label yaofang:
龙骨 枸杞子 艾叶 巴戟天 菟丝子 车前子 熟地黄 制何首乌 续断 白术 鹿角霜 砂仁 杜仲 桑寄生 党参
0.580842 0.805591 0.500717
predicted yaofang:
党参 白术 桑寄生

10. 
patient tongue id: 02231818378983_4_2
label yaofang:
北沙参 百部 法半夏 细辛 太子参 紫菀 蜜麻黄 干姜 炒紫苏子 款冬花 炙甘草 茯苓 前胡 白前 甘草片
0.949119 0.694405 0.952667 0.735729 0.802907 0.733677 0.966171 0.929393 0.931164 0.904729 0.741437 0.840332 0.728956 0.839749
predicted yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

11. 
patient tongue id: 05162057467576_2_1
label yaofang:
鳖甲 天麻 天山雪莲 莪术 远志 紫菀 诃子 紫苏梗 白花蛇舌 蜈蚣 薏苡仁 浙贝母 党参 款冬花 甘草
0.9767 0.580604 0.804256 0.854595 0.774522 0.707196 0.642966
predicted yaofang:
甘草 党参 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

12. 
patient tongue id: 05242226331835_2_4
label yaofang:
醋鳖甲 半枝莲 蜈蚣 桔梗 牛蒡子 太子参 紫苏子 白花蛇舌草 天麻 浙贝母 麦冬 北沙参 芦根 甘草
0.892963 0.628848 0.717692 0.640708
predicted yaofang:
甘草 浙贝母 天麻 蜈蚣

13. 
patient tongue id: 05042137439481_6
label yaofang:
远志 当归 黄芪 麦芽 百合 党参 炙甘草 柏子仁 鸡血藤 白术 木香 木香 龙骨 紫苏叶
0.66573 0.537246 0.788056 0.716775 0.85935 0.66714
predicted yaofang:
当归 木香 党参 黄芪 白术 炙甘草

14. 
patient tongue id: 03091854342645_5_6
label yaofang:
金银花 连翘 浙贝母 桔梗 莱菔子 枳壳 白术 苦杏仁 麦芽 稻芽 甘草 牛蒡子 独脚金
0.769716 0.574796 0.585238
predicted yaofang:
甘草 白术 浙贝母

15. 
patient tongue id: 05311935319321_5
label yaofang:
牛蒡子 薄荷 连翘 桔梗 芦根 射干 龙脷叶 淡豆豉 金银花 淡竹叶 甘草 板蓝根 桑白皮
0.717233 0.55857 0.524434
predicted yaofang:
甘草 桔梗 浙贝母

16. 
patient tongue id: 02211904112611_1_7
label yaofang:
当归 远志 党参 木香 大枣 炙甘草 黄芪 仙鹤草 白术 柏子仁 茯苓
0.594968 0.765062 0.657616 0.756373 0.514061
predicted yaofang:
茯苓 党参 黄芪 白术 炙甘草

17. 
patient tongue id: 03021838351229_4
label yaofang:
紫苏子 款冬花 麻黄 辛夷 前胡 白前 炙甘草 苍耳子 百部 桔梗 防风 紫菀 半夏 荆芥穗
0.546073 0.907917 0.718096 0.794895 0.826994 0.824592 0.79241 0.896692 0.811294 0.68548
predicted yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷

18. 
patient tongue id: 03281919403467_7
label yaofang:
地黄 石菖蒲 败酱草 茵陈 熟地黄 麦冬 红花 鱼腥草 滑石 白芍 玉竹 当归 栀子 黄柏 北沙参 桃仁 车前草 鸡内金

predicted yaofang:


19. 
patient tongue id: 04062030120916_4
label yaofang:
前胡 白前 甘草片 紫苏梗 百部 陈皮 细辛 木瓜 紫菀 法半夏 干姜 款冬花 蜜麻黄 防风
0.84984 0.912545 0.738632 0.645606 0.507019 0.860407 0.857405 0.75334 0.816088 0.679658 0.550157
predicted yaofang:
法半夏 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 蜜麻黄

20. 
patient tongue id: 04261334490446_2_6
label yaofang:
远志 当归 黄芪 淡豆豉 百合 党参 炙甘草 柏子仁 鸡血藤 白术 木香 栀子 紫苏叶
0.527719 0.852288 0.852117 0.853473 0.672062
predicted yaofang:
当归 党参 黄芪 白术 炙甘草

21. 
patient tongue id: 01032302546094_6_5
label yaofang:
鳖甲 薏苡仁 蜈蚣 莪术 党参 白术 红豆杉 茯苓 半枝莲 天麻 天山雪莲 郁金 白芍 山药 甘草
0.996988 0.670371 0.678737 0.808195 0.679662 0.577264 0.897472 0.909046 0.94258 0.590734 0.819472 0.736373
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

22. 
patient tongue id: 04200637551984_5_6
label yaofang:
胆南星 茯苓 栀子 丹参 牡蛎 远志 柴胡 黄连 法半夏 淡豆豉 党参 龙骨 酸枣仁 甘草 桑白皮
0.939437 0.755044 0.906827
predicted yaofang:
甘草 茯苓 党参

23. 
patient tongue id: 06190812318319_4_6_7
label yaofang:
鳖甲 半枝莲 蜈蚣 宽筋藤 白术 山药 杜仲 白花蛇舌 天麻 天山雪莲 党参 茯苓 薏苡仁 甘草
0.991448 0.667988 0.602438 0.816768 0.740091 0.584765 0.948324 0.9301 0.953449 0.767678 0.827761 0.874123
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

24. 
patient tongue id: 03180110107314_1
label yaofang:
人参叶 牛蒡子 姜半夏 白芍 炙甘草 紫菀 浙贝母 苦杏仁 桂枝 干姜 射干 五味子 龙脷叶 细辛
0.613089 0.514796 0.705475 0.578157 0.844392
predicted yaofang:
白芍 细辛 干姜 姜半夏 炙甘草

25. 
patient tongue id: 02260707247775_1_4
label yaofang:
鳖甲 半枝莲 蜈蚣 红豆杉 桔梗 桑白皮 前胡 田七末 白花蛇舌 天麻 天山雪莲 浙贝母 苦杏仁 枇杷叶 款冬花 甘草
0.977238 0.711265 0.735948 0.916089 0.906628 0.863676 0.748935 0.783517 0.754777
predicted yaofang:
甘草 桔梗 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

26. 
patient tongue id: 05140851543837_6_2_7
label yaofang:
太子参 五味子 酸枣仁 甘草 山茱萸 丹参 墨旱莲 红花 麦冬 龙骨 茯苓 补骨脂 鹿角霜 女贞子 浮小麦
0.898705 0.706165 0.501732 0.535871
predicted yaofang:
甘草 茯苓 党参 酸枣仁

27. 
patient tongue id: 03240601247005_2_5
label yaofang:
茯苓 甘草 山茱萸 广金钱草 木香 莪术 黄连 鸡内金 生地黄 灯心草 海金沙 王不留行 山楂 莱菔子
0.907302 0.776884
predicted yaofang:
甘草 茯苓

28. 
patient tongue id: 04261327508651_1_6
label yaofang:
天麻 柏子仁 炙甘草 合欢皮 百合 淡豆豉 浮小麦 龙骨 蜈蚣 栀子 干姜 姜半夏 紫苏叶
0.599962
predicted yaofang:
炙甘草

29. 
patient tongue id: 03231105005908_5
label yaofang:
桑白皮 浙贝母 桔梗 苇茎 苦杏仁 款冬花 紫菀 法半夏 茯苓 细辛 黄芩 鱼腥草 瓜蒌子 甘草
0.901296 0.849514 0.655622 0.797877 0.702972 0.58714 0.518045 0.54622
predicted yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 款冬花 紫菀 苦杏仁

30. 
patient tongue id: 04172001566944_4_1
label yaofang:
前胡 桔梗 防风 百部 法半夏 紫苏梗 紫菀 蜜麻黄 茯苓 款冬花 炙甘草 麦冬
0.749699 0.528619 0.826591 0.543744 0.521559 0.730364 0.765362 0.59836 0.73934 0.850315 0.579318
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 蜜麻黄

31. 
patient tongue id: 05092125018057_6_4
label yaofang:
鳖甲 薏苡仁 蜈蚣 浙贝母 郁金 广藿香 甘草 白花蛇舌 天麻 四季青 桔梗 茯苓 佩兰 白术
0.971326 0.723615 0.524364 0.703106 0.811357 0.753922 0.661007 0.596872
predicted yaofang:
甘草 茯苓 桔梗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

32. 
patient tongue id: 05112035227912_6_7_4
label yaofang:
黄芪 海螵蛸 茯苓 鲜龙葵果 浙贝母 合欢皮 枸杞子 厚朴 白术 生半夏 甘草 党参 北沙参 蜈蚣 砂仁 牡蛎
0.849996 0.501924 0.744472 0.854622 0.767891 0.662112 0.669027
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

33. 
patient tongue id: 01061616560202_5
label yaofang:
鳖甲 半枝莲 蜈蚣 薏苡仁 黄连 广藿香 麦芽 白花蛇舌 天麻 天山雪莲 苍术 石膏 甘草
0.983873 0.945717 0.893395 0.878604 0.707297 0.798912 0.887797
predicted yaofang:
甘草 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

34. 
patient tongue id: 04121855583643_1_7
label yaofang:
黄芪 赭石 甘草 莪术 厚朴 柿蒂 党参 白术 半夏 蒲公英 蛇舌草 桃仁 北沙参 僵蚕
0.705995 0.519207 0.532072 0.837951 0.76532 0.678155 0.534465 0.734883
predicted yaofang:
甘草 半夏 党参 黄芪 白术 厚朴 莪术 北沙参

35. 
patient tongue id: 01172243587825_5_6_7
label yaofang:
陈皮 党参 磁石 竹茹 甘草 龙骨 麦芽 黄连 法半夏 茯苓 胆南星 补骨脂 丹参 牡蛎 紫苏梗
0.890323 0.726994 0.789492 0.870663
predicted yaofang:
甘草 法半夏 茯苓 党参

36. 
patient tongue id: 03101853053004_6
label yaofang:
海螵蛸 柏子仁 姜半夏 紫苏梗 柴胡 干姜 枳壳 香附 白芍 炙甘草 豆蔻
0.778556 0.882996 0.783741 0.687005 0.688601 0.573852 0.720715 0.945853 0.721039
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

37. 
patient tongue id: 04271429367693_1_3
label yaofang:
麦冬 枸杞子 天花粉 玉米须 党参 山药 甘草 黄芪 北沙参 玄参 牡丹皮 生地黄
0.907024 0.706579 0.648982 0.510424 0.552257 0.587499 0.744187
predicted yaofang:
甘草 党参 黄芪 枸杞子 生地黄 山药 北沙参

38. 
patient tongue id: 05050746292112_5
label yaofang:
鳖甲 天山雪莲 桔梗 前胡 干姜 桑白皮 款冬花 白花蛇舌 浙贝母 细辛 白前 黄芩片 苦杏仁 甘草
0.878234 0.748848 0.59987 0.736744 0.60914 0.531291 0.629242 0.614709 0.539735
predicted yaofang:
甘草 法半夏 前胡 桔梗 浙贝母 细辛 鳖甲 款冬花 白花蛇舌

39. 
patient tongue id: 02201311365886_6
label yaofang:
香附 枳壳 白芍 柴胡 紫苏梗 姜半夏 延胡索 浙贝母 豆蔻 炙甘草 海螵蛸 制川乌 肉桂 海螵蛸 甘草 浙贝母
0.575699 0.871435 0.873404 0.711277 0.549247 0.619214 0.614308 0.590961 0.655798 0.624818
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 姜半夏 炙甘草 紫苏梗

40. 
patient tongue id: 01140445488548_6_7
label yaofang:
柴胡 枳壳 川楝子 茯苓 党参 桃仁 麦芽 白芍 延胡索 酸枣仁 白术 五灵脂 甘草 首乌藤
0.956221 0.776082 0.545332 0.675392 0.565216
predicted yaofang:
甘草 白芍 茯苓 党参 白术

41. 
patient tongue id: 04282202376289_5_1
label yaofang:
鳖甲 天麻 薏苡仁 柴胡 水牛角 桑白皮 前胡 羌活 白花蛇舌 蜈蚣 郁金 赤芍 金银花 苦杏仁 龙葵果 甘草
0.964642 0.72458 0.795934 0.725354 0.580423 0.615665
predicted yaofang:
甘草 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

42. 
patient tongue id: 02111355251651_1_4_7
label yaofang:
制何首乌 泽泻 夏枯草 红花 钩藤 丹参 牛膝 天麻 车前子 决明子 桃仁 莱菔子
0.924462 0.881796 0.89227 0.854867 0.805197 0.871302 0.777224 0.718256 0.879643 0.779788 0.783574 0.732087
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

43. 
patient tongue id: 03221622080727_6
label yaofang:
菟丝子 党参 生地黄 山茱萸 酸枣仁 王不留行 香附 浮小麦 益母草 茯苓 甘草 白术 黄柏 郁金 合欢花
0.98905 0.730671 0.872814 0.666535 0.618289
predicted yaofang:
甘草 茯苓 党参 酸枣仁 生地黄

44. 
patient tongue id: 04301136059351_2_6
label yaofang:
柴胡 五灵脂 砂仁 太子参 木香 甘草 麦芽 黄连 延胡索 白芍 北沙参 鱼古 瓦楞子 党参
0.85858 0.531347 0.565178 0.631485
predicted yaofang:
甘草 白芍 茯苓 党参

45. 
patient tongue id: 04131719335955_1_3
label yaofang:
党参 黄芪 郁金 牡蛎 甘草 茯苓 首乌藤 百合 麦冬 制远志 酸枣仁 川芎 浮小麦
0.92673 0.552167 0.884981 0.898988 0.704898 0.826478 0.723867 0.794628
predicted yaofang:
甘草 川芎 茯苓 党参 黄芪 酸枣仁 浮小麦 首乌藤

46. 
patient tongue id: 02020954233530_1_4
label yaofang:
天麻 法半夏 决明子 甘草 地龙 川芎 赤芍 木瓜 白术 钩藤 党参 首乌藤 沙苑子 白芍 宽筋藤
0.847686 0.75326 0.719647
predicted yaofang:
甘草 党参 天麻

47. 
patient tongue id: 04201954060958_2_6_1
label yaofang:
茯苓 桂枝 猪苓 天麻 川芎 益母草 山药 白术 车前子 泽兰 牛膝 菟丝子 甘草
0.834823 0.758984 0.52944 0.520771 0.616673
predicted yaofang:
甘草 茯苓 白术 牛膝 天麻

48. 
patient tongue id: 01250629444905_1_5
label yaofang:
鳖甲 天麻 天山雪莲 蒲公英 当归 木香 茜草 半枝莲 蜈蚣 赤石脂 白及 白芍 白头翁 甘草
0.962991 0.837501 0.707182 0.754991 0.545115 0.631678
predicted yaofang:
甘草 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

49. 
patient tongue id: 06182032076538_1_2
label yaofang:
苍术 薏苡仁 牛膝 黄柏 桑寄生 宽筋藤 黄芪 白术 桑枝 砂仁 合欢皮 首乌藤
0.706729 0.724956
predicted yaofang:
黄芪 白术

50. 
patient tongue id: 03012125599670_6_1
label yaofang:
鳖甲 半枝莲 蜈蚣 甘草 党参 牛大力 生地黄 白花蛇舌 天麻 天山雪莲 酸枣仁 首乌藤 杜仲 浮小麦
0.995444 0.831695 0.785987 0.723992 0.979072 0.901269 0.565996 0.930402 0.801441 0.850245 0.897535
predicted yaofang:
甘草 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

51. 
patient tongue id: 03282242173733_4
label yaofang:
豆蔻 鹿衔草 川芎 海桐皮 羌活 甘草 姜黄 干姜 白芍 蜈蚣 细辛
0.749195 0.720004
predicted yaofang:
甘草 白芍

52. 
patient tongue id: 04181939084290_6
label yaofang:
石膏 升麻 黄连 白芷 当归 牛膝 细辛 知母 地黄 党参 甘草 牡丹皮 山药 麦芽
0.897436 0.725741
predicted yaofang:
甘草 党参

53. 
patient tongue id: 04071316549792_4
label yaofang:
薄荷 广藿香 法半夏 北柴胡 香薷 前胡 甘草片 紫苏梗 炒苍耳子 防风 紫菀 荆芥穗 桔梗 辛夷
0.799652 0.817025 0.660305 0.929748 0.633746 0.600719 0.604144 0.65187 0.597758 0.524619 0.771637 0.65577 0.796067
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 广藿香

54. 
patient tongue id: 04181942494246_6
label yaofang:
柴胡 当归 白术 合欢花 酸枣仁 甘草 浮小麦 白芍 茯苓 川楝子 佛手 法半夏 黄芩片 龙骨
0.952204 0.791359 0.865243 0.585026 0.518185
predicted yaofang:
甘草 白芍 茯苓 党参 白术

55. 
patient tongue id: 05021912082838_3
label yaofang:
细辛 干姜 射干 川贝母 法半夏 桂枝 玄参 款冬花 炙甘草 蜜麻黄 木蝴蝶 防风 五味子 白芍 蝉蜕 白芷
0.671211 0.703368 0.503864 0.699858 0.502761 0.543706 0.927901
predicted yaofang:
白芍 法半夏 前胡 细辛 干姜 紫菀 炙甘草

56. 
patient tongue id: 01062041205222_6_5
label yaofang:
鳖甲 薏苡仁 蜈蚣 天山雪莲 败酱草 白芍 防风 甘草 半枝莲 天麻 党参 熟附子 白术 陈皮 姜黄
0.951564 0.621905 0.569647 0.60199 0.84704 0.784659 0.87683 0.73294 0.677897
predicted yaofang:
甘草 薏苡仁 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

57. 
patient tongue id: 03301936137931_1_4
label yaofang:
前胡 白前 炙甘草 荆芥穗 百部 桔梗 防风 白芷 紫菀 法半夏 广藿香 炒蔓荆子 款冬花 蜜麻黄 紫苏梗
0.857893 0.951657 0.828573 0.893121 0.730915 0.920217 0.937364 0.8416 0.931098 0.961226 0.59998 0.582189 0.745898 0.832906
predicted yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄

58. 
patient tongue id: 05232222235011_1_4
label yaofang:
北沙参 百部 桔梗 干姜 太子参 紫菀 蜜麻黄 炒紫苏子 款冬花 炙甘草 前胡 白前 茯苓
0.599534 0.707664 0.801579 0.547167 0.694759 0.542148 0.860495 0.884085 0.86943 0.852978 0.681891 0.9248 0.571813 0.672049
predicted yaofang:
法半夏 茯苓 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

59. 
patient tongue id: 02260649080182_1_6
label yaofang:
鳖甲 半枝莲 蜈蚣 酸枣仁 黄芪 续断 生地黄 白花蛇舌 天麻 天山雪莲 党参 远志 白术 甘草
0.991919 0.933471 0.738825 0.64678 0.564887 0.935814 0.827825 0.919864 0.702046 0.798795 0.815287
predicted yaofang:
甘草 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

60. 
patient tongue id: 05131626542431_6_1
label yaofang:
鳖甲 薏苡仁 天山雪莲 蜈蚣 太子参 郁金 茯苓 广藿香 白花蛇舌 莪术 天麻 砂仁 山药 白术 紫苏梗 甘草
0.971006 0.84508 0.606567 0.824087 0.504695 0.729076 0.934726 0.808653 0.778372 0.778277
predicted yaofang:
甘草 茯苓 薏苡仁 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

61. 
patient tongue id: 03171503401181_4_1
label yaofang:
薄荷 防风 白芷 法半夏 炒苍耳子 甘草片 麸炒白术 百部 荆芥穗 辛夷 豆蔻 广藿香 紫苏梗 前胡
0.79466 0.854057 0.954233 0.552518 0.695314 0.54091 0.597733 0.726364 0.573332 0.845966 0.651479 0.826348
predicted yaofang:
法半夏 前胡 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 广藿香

62. 
patient tongue id: 03222002224981_1_4
label yaofang:
杜仲 鹿衔草 牛膝 姜黄 干姜 车前子 甘草 蜈蚣 细辛 广藿香 白芍 独活 川芎 海桐皮

predicted yaofang:


63. 
patient tongue id: 03081821199316_1_7_6
label yaofang:
黄芪 山慈菇 红豆杉 预知子 合欢皮 桑枝 土鳖虫 桃仁 白术 蛇舌草 北沙参 浙贝母 海螵蛸 秦艽 砂仁
0.780733 0.784013 0.513878 0.534494 0.702322
predicted yaofang:
黄芪 白术 浙贝母 砂仁 北沙参

64. 
patient tongue id: 05162106199672_2_6_7
label yaofang:
鳖甲 半枝莲 蜈蚣 丹参 莪术 桑寄生 诃子 白花蛇舌 天麻 天山雪莲 郁金 杜仲 威灵仙 甘草
0.985829 0.941284 0.906749 0.89368 0.775463 0.801405 0.781495
predicted yaofang:
甘草 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

65. 
patient tongue id: 01042341105713_1_7
label yaofang:
鳖甲 半枝莲 天山雪莲 赤芍 白术 红花 续断 白花蛇舌 天麻 蜈蚣 党参 山药 狗脊 甘草
0.99364 0.728345 0.506988 0.961291 0.880448 0.916428 0.768161 0.780016 0.850876
predicted yaofang:
甘草 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

66. 
patient tongue id: 01101808080037_1_4
label yaofang:
北沙参 太子参 炒紫苏子 前胡 百部 紫菀 款冬花 白前 陈皮 法半夏 蜜麻黄 炙甘草 细辛 干姜
0.587644 0.803234 0.939967 0.695812 0.741113 0.740606 0.907899 0.935091 0.902062 0.915182 0.640574 0.962774 0.712164 0.830084
predicted yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

67. 
patient tongue id: 03311621410847_5_4_7
label yaofang:
黄芪 浙贝母 蛇舌草 土鳖虫 厚朴 红豆杉 薏苡仁 砂仁 白术 山慈菇 牛膝 桃仁 北沙参 牡蛎 杜仲
0.866018 0.760075 0.680112 0.597673
predicted yaofang:
黄芪 白术 厚朴 北沙参

68. 
patient tongue id: 02020832320086_1_6_5
label yaofang:
地黄 白术 党参 甘草 续断 益母草 黄柏 白芍 黄芩 茯苓 醋香附 菟丝子 当归
0.934986 0.718517 0.7923 0.814991 0.635602
predicted yaofang:
甘草 白芍 茯苓 党参 白术

69. 
patient tongue id: 03101922172879_5_7
label yaofang:
红豆杉 蜈蚣 浙贝母 茯苓 陈皮 黄芪 鱼腥草 桔梗 莪术 海螵蛸 薏苡仁 生半夏 甘草 北沙参 苍术
0.880856 0.622593 0.59503 0.500201 0.617876 0.612452 0.646571 0.574517
predicted yaofang:
甘草 茯苓 薏苡仁 黄芪 浙贝母 莪术 北沙参 蜈蚣

70. 
patient tongue id: 04111905410371_4
label yaofang:
前胡 桔梗 炙甘草 百部 广藿香 防风 紫菀 法半夏 炒紫苏子 款冬花 蜜麻黄 陈皮
0.509109 0.913689 0.956064 0.785458 0.744004 0.864042 0.873208 0.708897 0.818653 0.842061 0.592439 0.766432
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄

71. 
patient tongue id: 04131358566698_4_7_6
label yaofang:
法半夏 竹茹 党参 黄连 浙贝母 厚朴 栀子 浮小麦 茯苓 远志 丹参 紫苏梗 桔梗 甘草 牡丹皮
0.964773 0.511069 0.842466 0.732626 0.653977
predicted yaofang:
甘草 法半夏 茯苓 党参 浙贝母

72. 
patient tongue id: 05160613207537_1_3_6
label yaofang:
墨旱莲 甘草 桑寄生 合欢皮 牡蛎 糯稻根 厚朴 浮小麦 黑枣 首乌藤 龙骨 五味子 黄芪 火麻仁
0.652818 0.725265
predicted yaofang:
甘草 黄芪

73. 
patient tongue id: 05140832195840_6_7_1
label yaofang:
天麻 牛膝 杜仲 党参 山茱萸 鸡血藤 泽泻 甘草 钩藤 川芎 桑寄生 蒺藜 首乌藤 豆蔻 山药
0.850695 0.634491 0.630928 0.592227 0.824912
predicted yaofang:
甘草 党参 牛膝 山药 天麻

74. 
patient tongue id: 02190642028124_2_6_1
label yaofang:
鳖甲 半枝莲 蜈蚣 酸枣仁 丹参 菟丝子 山药 贯众 白花蛇舌 天麻 天山雪莲 生地黄 党参 益母草 甘草
0.997576 0.533994 0.876613 0.704649 0.618791 0.546423 0.966982 0.924896 0.907309 0.815937 0.852684 0.871353
predicted yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

75. 
patient tongue id: 03142047540413_4
label yaofang:
徐长卿 甘草 土茯苓 紫苏叶 珍珠母 白鲜皮 紫草 莪术 防风 乌梅 丹参 生地黄 牡丹皮
0.813752
predicted yaofang:
甘草

76. 
patient tongue id: 02202318375561_5
label yaofang:
厚朴 黄连 鸡内金 海螵蛸 枳壳 枇杷叶 火麻仁 黄芩 山楂 紫苏梗 布渣叶 北沙参

predicted yaofang:


77. 
patient tongue id: 05021432333785_1_3
label yaofang:
党参 黄芪 郁金 麦冬 茯苓 首乌藤 百合 浮小麦 制远志 酸枣仁 牡蛎 甘草
0.877628 0.847842 0.519614 0.887786 0.741693 0.711702 0.513962 0.567205 0.712541
predicted yaofang:
甘草 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤

78. 
patient tongue id: 03152021467591_1_2_7
label yaofang:
麦冬 枸杞子 天花粉 玉米须 党参 山药 甘草 黄芪 北沙参 玄参 牡丹皮 生地黄
0.909411 0.557041 0.764025 0.670339 0.624123 0.659544 0.550142 0.640895 0.655734
predicted yaofang:
甘草 麦冬 党参 黄芪 枸杞子 生地黄 牡丹皮 山药 北沙参

79. 
patient tongue id: 02122108129471_6_2
label yaofang:
天麻 白术 茯苓 地黄 建曲 白茅根 百合 白芍 牛膝 酸枣仁 法半夏 桑寄生 甘草
0.955619 0.515036 0.749931 0.603111
predicted yaofang:
甘草 白芍 茯苓 党参

80. 
patient tongue id: 05102011484721_1
label yaofang:
熟地黄 炒紫苏子 党参片 当归 防风 甘草片 法半夏 陈皮 大枣 茯苓 醋五味子
0.542679 0.711351
predicted yaofang:
法半夏 茯苓

81. 
patient tongue id: 03221817596943_4
label yaofang:
炒紫苏子 款冬花 法半夏 广藿香 前胡 白前 蜜麻黄 辛夷 百部 桔梗 炙甘草 紫菀 陈皮 防风
0.544028 0.930494 0.975398 0.785401 0.82625 0.510172 0.910297 0.908926 0.861524 0.914911 0.908594 0.522215 0.755347 0.618653 0.827516
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

82. 
patient tongue id: 01062342105694_1_3
label yaofang:
钩藤 泽泻 夏枯草 红花 制何首乌 丹参 牛膝 天麻 车前子 决明子 桃仁 莱菔子
0.903352 0.857851 0.85724 0.787926 0.847049 0.880198 0.794475 0.768438 0.822065 0.815185 0.724024 0.792577
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

83. 
patient tongue id: 03101954444297_4
label yaofang:
前胡 白前 蜜麻黄 北柴胡 百部 桔梗 炙甘草 荆芥穗 紫菀 陈皮 薄荷 款冬花 法半夏 防风
0.926533 0.937716 0.676599 0.764033 0.855255 0.888493 0.810604 0.887665 0.926397 0.789545
predicted yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 蜜麻黄

84. 
patient tongue id: 01042308513562_4
label yaofang:
薏苡仁 甘草 香附 党参 干姜 瓦楞子 紫菀 白术 白花蛇舌草 海螵蛸 续断 茯苓
0.830569 0.58026 0.762207 0.645535
predicted yaofang:
甘草 茯苓 党参 白术

85. 
patient tongue id: 04271850594482_1_6
label yaofang:
枳壳 浙贝母 预知子 麦芽 莪术 郁金 茯苓 薏苡仁 龙骨 厚朴 甘草 白术 半夏 冬凌草 合欢皮 黄芪 赤芍 砂仁
0.810682 0.732597 0.802001 0.715286 0.558774
predicted yaofang:
甘草 黄芪 白术 厚朴 砂仁

86. 
patient tongue id: 03231042469629_6_2_7
label yaofang:
鳖甲 天麻 蜈蚣 党参 姜黄 炙甘草 合欢花 菟丝子 杜仲 半枝莲 天山雪莲 白芍 延胡索 五灵脂 火麻仁 麦芽 补骨脂
0.791032 0.757336 0.5588 0.84381 0.697406 0.796251 0.625842
predicted yaofang:
甘草 白芍 党参 天麻 鳖甲 蜈蚣 半枝莲

87. 
patient tongue id: 04260445471322_1_6
label yaofang:
鳖甲 半枝莲 蜈蚣 丹参 胆南星 龙骨 茯苓 白花蛇舌 天麻 天山雪莲 党参 竹茹 牡蛎 甘草
0.984826 0.643789 0.804993 0.868652 0.806116 0.733191 0.693324 0.682031 0.613878
predicted yaofang:
甘草 茯苓 党参 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

88. 
patient tongue id: 04112315282386_1
label yaofang:
柏子仁 鸡血藤 党参 炙甘草 郁金 百合 黄芪 远志 当归 紫苏叶 白术 木香 鸡内金
0.729415 0.745186 0.807219
predicted yaofang:
党参 黄芪 白术

89. 
patient tongue id: 03312121440579_1_4
label yaofang:
鳖甲 半枝莲 蜈蚣 酸枣仁 茯苓 白术 木香 甘草 白花蛇舌 天麻 天山雪莲 远志 党参 首乌藤 麦芽
0.992981 0.895135 0.538522 0.924861 0.777123 0.760653 0.93172 0.907778 0.504645 0.845017 0.815685 0.874083 0.856097
predicted yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲

90. 
patient tongue id: 03291622503569_6_7
label yaofang:
天麻 赤芍 白芷 蒿苯 酸枣仁 生地黄 川芎 白芍 黄芪 细辛 羌活 茯苓 牛膝 甘草
0.889561 0.648841 0.577079
predicted yaofang:
甘草 茯苓 党参

91. 
patient tongue id: 04020814309348_5_6
label yaofang:
柴胡 黄连 白术 延胡索 甘草 麦芽 合欢花 莪术 白芍 党参 五灵脂 白及 蒲公英 姜黄 建曲 皂角刺
0.976128 0.6875 0.673184 0.828535 0.698529 0.530898
predicted yaofang:
甘草 柴胡 白芍 党参 白术 麦芽

92. 
patient tongue id: 03271536347983_4_5
label yaofang:
柴胡 大枣 麦冬 生石膏 牡蛎 鸡内金 黄芩片 甘草片 生地黄 防风 浮小麦 姜半夏 黄连片 当归 蜈蚣 糯稻根 党参 白芍 栀子 广藿香 桂枝 红芪
0.525191 0.623881 0.70678
predicted yaofang:
柴胡 白芍 党参

93. 
patient tongue id: 03091855486678_1_6_5
label yaofang:
鳖甲 党参 赤芍 茯苓 杜仲 黄精 麦芽 虎杖 山药 白术 茵陈 丹参 甘草
0.980889 0.771669 0.782724 0.644305 0.525689
predicted yaofang:
甘草 茯苓 党参 白术 山药

94. 
patient tongue id: 01042327249414_6_1_5
label yaofang:
醋鳖甲 半枝莲 蜈蚣 莱菔子 槟榔 砂仁 党参 甘草 白花蛇舌草 天麻 首乌藤 连翘 麸炒枳壳 白术 火麻仁
0.946024 0.739755 0.642071 0.909277 0.769811 0.632049
predicted yaofang:
甘草 党参 白术 天麻 蜈蚣 半枝莲

95. 
patient tongue id: 03062131282000_6_2
label yaofang:
鳖甲 天麻 天山雪莲 甘草 牛蒡子 浙贝母 白术 半枝莲 蜈蚣 党参 白芍 贯众 茯苓 法半夏
0.990306 0.555339 0.625856 0.774319 0.780189 0.756886 0.567977 0.613417 0.557744
predicted yaofang:
甘草 茯苓 党参 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

96. 
patient tongue id: 03311803378194_4
label yaofang:
紫苏梗 款冬花 蜜麻黄 辛夷 前胡 白前 炙甘草 白芷 百部 桔梗 防风 广藿香 紫菀 法半夏 荆芥穗
0.93579 0.941935 0.848869 0.922803 0.53085 0.806536 0.92448 0.921374 0.841512 0.899057 0.902083 0.84498 0.627706 0.816519 0.781153
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄

97. 
patient tongue id: 04202039135681_2_6_1
label yaofang:
黄芪 粉葛 天花粉 党参 黄连 赤芍 益智 山茱萸 山药 桂枝 石膏 甘草 桑螵蛸 补骨脂
0.933277 0.906718 0.570759
predicted yaofang:
甘草 党参 山药

98. 
patient tongue id: 06080203217118_2_7
label yaofang:
鳖甲 天麻 山茱萸 玄参 酸枣仁 牡丹皮 甘草 半枝莲 蜈蚣 生地黄 山药 茯苓 龙葵果 建曲
0.986776 0.702716 0.582002 0.542437 0.599343 0.836806 0.805522 0.75186 0.61367 0.721964
predicted yaofang:
甘草 茯苓 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

99. 
patient tongue id: 06080144204730_1_2
label yaofang:
鳖甲 半枝莲 蜈蚣 党参 浙贝母 生地黄 甘草 白花蛇舌 天麻 天山雪莲 丹参 虎杖 麦芽 益母草
0.997136 0.771674 0.923415 0.898701 0.882886 0.820029 0.77563 0.82052
predicted yaofang:
甘草 党参 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

100. 
patient tongue id: 04282207188400_2_6
label yaofang:
生地黄 山药 茯苓 桂枝 决明子 益母草 山茱萸 牡丹皮 桃仁 甘草 红曲 香附
0.911856 0.719697
predicted yaofang:
甘草 茯苓

101. 
patient tongue id: 04260658431213_1_4_6
label yaofang:
鳖甲 薏苡仁 蜈蚣 青蒿 柴胡 赤芍 龙葵果 甘草 白花蛇舌 天麻 党参 法半夏 莪术 瓜蒌皮 红豆杉
0.984531 0.656744 0.713922 0.813509 0.833942 0.563288 0.871478 0.628203 0.567493
predicted yaofang:
甘草 薏苡仁 党参 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲

102. 
patient tongue id: 03020849497259_6_4
label yaofang:
柴胡 法半夏 茯苓 白术 白芍 桂枝 党参 干姜 龙骨 甘草 浮小麦 扁豆花 酸枣仁 黄芩
0.962146 0.675858 0.898455 0.854944 0.578565
predicted yaofang:
甘草 白芍 茯苓 党参 白术

103. 
patient tongue id: 06071900303961_2
label yaofang:
酸枣仁 合欢皮 五味子 甘草 浮小麦 远志 牡蛎 竹茹 珍珠母 山药 陈皮 糯稻根 半夏 黄连 龙骨 黄精
0.757217 0.636518
predicted yaofang:
甘草 党参

104. 
patient tongue id: 01180612303331_2_6
label yaofang:
醋鳖甲 蜂房 桔梗 地黄 玄参 茜草 桑叶 白花蛇舌草 浙贝母 白茅根 麦冬 太子参 岗梅根 甘草
0.894387 0.637664
predicted yaofang:
甘草 浙贝母

105. 
patient tongue id: 05162151387474_6_1_2
label yaofang:
天麻 桑寄生 续断 川芎 红花 益母草 甘草 杜仲 补骨脂 牛膝 桃仁 赤芍 牛大力 酸枣仁
0.944396 0.60028 0.724606
predicted yaofang:
甘草 党参 天麻

106. 
patient tongue id: 05232009207607_1
label yaofang:
海螵蛸 厚朴 黄芪 蛇舌草 稻芽 薏苡仁 郁金 桂枝 五指毛桃 枳壳 莪术 杜仲 白术 枸杞子 半夏 蜈蚣 白芍 砂仁
0.5462 0.596759 0.79477 0.865701 0.575121 0.777339 0.566128 0.542454
predicted yaofang:
枳壳 半夏 黄芪 白术 海螵蛸 厚朴 砂仁 蜈蚣

107. 
patient tongue id: 01070845025107_1_4
label yaofang:
桃仁 川芎 香附 当归 丹参 红花 青皮 法半夏 赤芍 延胡索 生地黄 鸡内金
0.626575 0.68729
predicted yaofang:
甘草 丹参

108. 
patient tongue id: 06031113103621_4_6
label yaofang:
鳖甲 薏苡仁 桔梗 炙麻黄 法半夏 五味子 款冬花 远志 白花蛇舌 浙贝母 苦杏仁 细辛 茯苓 前胡 甘草 桃仁
0.964631 0.902561 0.790032 0.768355 0.784321 0.507436 0.529146
predicted yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 鳖甲 款冬花

109. 
patient tongue id: 03231310554451_1_5
label yaofang:
鳖甲 天麻 薏苡仁 天山雪莲 白芍 败酱草 甘草 山药 半枝莲 蜈蚣 莪术 党参 巴戟天 熟附子 白术
0.989719 0.607462 0.686926 0.681135 0.534208 0.895246 0.899383 0.925164 0.565828 0.844632 0.758134
predicted yaofang:
甘草 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

110. 
patient tongue id: 06132009531066_1_7
label yaofang:
黄芪 蛇舌草 莪术 枳壳 生半夏 甘草 紫苏叶 阿胶 柿蒂 薏苡仁 浙贝母 郁金 厚朴 赭石 黄连 白术 杜仲 蜈蚣
0.93777 0.594275 0.744688 0.813646 0.72472 0.874903 0.759695 0.810218
predicted yaofang:
甘草 薏苡仁 黄芪 白术 浙贝母 厚朴 莪术 蜈蚣

111. 
patient tongue id: 06190152201086_2_3
label yaofang:
熟地黄 山药 牡丹皮 熟附子 党参 赤芍 黄连 山茱萸 茯苓 泽泻 肉桂 粉葛 甘草
0.94089 0.747507 0.720124 0.707231
predicted yaofang:
甘草 茯苓 党参 山药

112. 
patient tongue id: 04261336505310_7
label yaofang:
甘草 桔梗 川芎 红花 枳壳 牛膝 生地黄 桃仁 柴胡 赤芍 当归
0.747755
predicted yaofang:
甘草

113. 
patient tongue id: 03012033364823_7_4
label yaofang:
鳖甲 天麻 莪术 天山雪莲 茵陈 白术 党参 白花蛇舌 蜈蚣 郁金 红豆杉 虎杖 山药 甘草
0.994164 0.784444 0.548086 0.503125 0.861474 0.867789 0.933234 0.710893 0.740073 0.631197
predicted yaofang:
甘草 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

114. 
patient tongue id: 01062335078914_1_4_7
label yaofang:
夏枯草 钩藤 车前子 泽泻 丹参 决明子 夏枯草 牛膝 桃仁 红花 天麻 莱菔子 夏枯草 钩藤 车前子 泽泻 丹参 决明子 夏枯草 牛膝 桃仁 红花 天麻 莱菔子 夏枯草 钩藤 车前子 泽泻 丹参 决明子 夏枯草 牛膝 桃仁 红花 天麻 莱菔子
0.851683 0.816653 0.82491 0.697023 0.734674 0.780821 0.735753 0.667357 0.83912 0.648366 0.591261 0.529883
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

115. 
patient tongue id: 04301141524707_6_4
label yaofang:
续断 甘草 党参 天麻 山茱萸 黄柏 桑寄生 杜仲 白芍 黄连 牛膝 酸枣仁 菟丝子
0.966233 0.760955
predicted yaofang:
甘草 党参

116. 
patient tongue id: 01031834204300_4
label yaofang:
炒紫苏子 前胡 百部 紫菀 款冬花 白前 桔梗 陈皮 法半夏 炙甘草 防风 白芷 辛夷 炒苍耳子
0.913905 0.967196 0.738131 0.87991 0.651192 0.917816 0.923703 0.848525 0.940584 0.893952 0.678935 0.645093 0.595773 0.746334
predicted yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

117. 
patient tongue id: 03230737255157_6_2
label yaofang:
柴胡 茯苓 酸枣仁 郁金 桃仁 首乌藤 甘草 女贞子 白芍 党参 合欢花 莪术 丹参 牡丹皮 何首乌
0.970161 0.616196 0.882775 0.862127 0.685274 0.641578 0.522984
predicted yaofang:
甘草 白芍 茯苓 党参 酸枣仁 丹参 郁金

118. 
patient tongue id: 03181802505956_1_6
label yaofang:
鳖甲 天麻 天山雪莲 山药 郁金 茯苓 甘草 续断 半枝莲 蜈蚣 党参 薏苡仁 莪术 白术 骨碎补
0.99484 0.800744 0.600807 0.8718 0.741601 0.640529 0.929832 0.84036 0.925192 0.527891 0.799445 0.743301
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

119. 
patient tongue id: 06031742008962_1_4
label yaofang:
前胡 白前 炙甘草 薄荷 百部 桔梗 防风 北柴胡 紫菀 法半夏 荆芥穗 款冬花 蜜麻黄 紫苏梗
0.861565 0.928928 0.704952 0.836948 0.904385 0.917622 0.818914 0.897538 0.928616 0.782816
predicted yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 蜜麻黄

120. 
patient tongue id: 01061853443097_1_4
label yaofang:
北沙参 太子参 前胡 百部 陈皮 法半夏 炙甘草 款冬花 豆蔻 麸炒白术 炒紫苏子 甘松 干姜 黄芪 白前 广藿香
0.641141 0.847371 0.877718 0.565782 0.622715 0.81303 0.798905 0.845478 0.750063 0.554839 0.905933 0.680649 0.535917
predicted yaofang:
陈皮 法半夏 前胡 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

121. 
patient tongue id: 02201756231562_4
label yaofang:
炒紫苏子 款冬花 蜜麻黄 辛夷 前胡 白前 炙甘草 桔梗 百部 白芷 防风 紫菀 法半夏 广藿香
0.921829 0.94126 0.731507 0.893673 0.661454 0.928396 0.902407 0.860556 0.900422 0.936147 0.645865 0.754114 0.548977 0.809971
predicted yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

122. 
patient tongue id: 05262206226520_1_2_7
label yaofang:
天麻 白术 茯苓 补骨脂 桑螵蛸 益智 杜仲 山茱萸 甘草 党参 地龙 熟附子 车前子 女贞子 牛膝 黄柏
0.905234 0.62208 0.903154 0.761017 0.765314
predicted yaofang:
甘草 茯苓 党参 白术 天麻

123. 
patient tongue id: 02171933452205_1_7_4
label yaofang:
黄芪 莪术 桃仁 山慈菇 预知子 淫羊藿 合欢皮 砂仁 白术 土鳖虫 玉米须 浙贝母 鸡血藤 杜仲 山药
0.703829 0.922759 0.590786 0.507053
predicted yaofang:
黄芪 白术 砂仁 莪术

124. 
patient tongue id: 04181141248791_1_3_4
label yaofang:
党参 枳实 桃仁 胆南星 黄芪 茯苓 丹参 法半夏 厚朴 甘草 竹茹 橘红
0.877312 0.728328 0.783628 0.539872 0.713478 0.572203 0.682003 0.546577
predicted yaofang:
甘草 法半夏 茯苓 桃仁 党参 黄芪 丹参 厚朴

125. 
patient tongue id: 02260020275618_1_2
label yaofang:
鳖甲 半枝莲 蜈蚣 山药 桑寄生 党参 浮小麦 白花蛇舌 天麻 天山雪莲 杜仲 白术 生地黄 甘草
0.997393 0.845233 0.647784 0.551989 0.712538 0.957312 0.895597 0.946256 0.731335 0.752226 0.86447
predicted yaofang:
甘草 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

126. 
patient tongue id: 02021010331063_1_5
label yaofang:
党参 茯苓 天麻 预知子 牛膝 桑寄生 玉竹 白术 甘草 珍珠母 浙贝母 杜仲 砂仁
0.932657 0.649229 0.643806 0.802692 0.534917 0.544139
predicted yaofang:
甘草 茯苓 党参 白术 杜仲 天麻

127. 
patient tongue id: 05221905448655_2
label yaofang:
桑叶 北沙参 玉竹 甘草 黄柏 钩藤 鳖甲 天花粉 麦冬 白扁豆 知母 天麻 芦根 龟甲
0.839288 0.646415
predicted yaofang:
甘草 天麻

128. 
patient tongue id: 03291358321471_5_1_6
label yaofang:
法半夏 党参 桑寄生 蜈蚣 郁金 柴胡 枳壳 石菖蒲 茯苓 甘草 杜仲 鹿衔草 益智 白芍 山药
0.967756 0.584937 0.755135 0.542599
predicted yaofang:
甘草 茯苓 党参 山药

129. 
patient tongue id: 04251950373840_2_1
label yaofang:
甘草 枳实 厚朴 火麻仁 桔梗 柏子仁 肉苁蓉 槟榔 黄芪 紫菀 白术
0.554754 0.507899 0.61235
predicted yaofang:
甘草 黄芪 白术

130. 
patient tongue id: 01042314293995_1
label yaofang:
郁李仁 厚朴 槟榔 桔梗 枳壳 枳实 白芍 火麻仁 甘草 肉苁蓉 白术 紫菀 黄芪
0.61107 0.648527
predicted yaofang:
甘草 白术

131. 
patient tongue id: 03111450108273_5
label yaofang:
苇茎 鱼腥草 前胡 炙麻黄 厚朴 浙贝母 法半夏 薏苡仁 款冬花 黄芩片 苦杏仁 桔梗 甘草
0.917029 0.792191 0.649647 0.597276
predicted yaofang:
甘草 法半夏 桔梗 浙贝母

132. 
patient tongue id: 04120008338976_7_4
label yaofang:
紫苏梗 茯苓 海螵蛸 车前子 香附 白术 瓦楞子 延胡索 葛根 党参 甘草 猫爪草
0.790665 0.595409 0.756399 0.755746
predicted yaofang:
甘草 茯苓 党参 白术

133. 
patient tongue id: 05161931009416_4
label yaofang:
前胡 白前 防风 细辛 百部 麸炒白术 广藿香 蝉蜕 紫菀 法半夏 茯苓 干姜 款冬花 炙甘草 黄芪
0.893132 0.61017 0.928928 0.717216 0.570344 0.665957 0.870231 0.847764 0.891638 0.852671 0.911403 0.502351 0.511404 0.559027
predicted yaofang:
法半夏 茯苓 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

134. 
patient tongue id: 03291509437282_1
label yaofang:
鳖甲 薏苡仁 天麻 红豆杉 白术 木香 砂仁 白花蛇舌 莪术 蜈蚣 龙葵果 党参 茯苓 甘草
0.972083 0.641373 0.543734 0.749216 0.764234 0.686592 0.775004 0.843708 0.576895 0.53473
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

135. 
patient tongue id: 02142148471120_6_4
label yaofang:
鳖甲 半枝莲 蜈蚣 前胡 浙贝母 牛蒡子 法半夏 白花蛇舌 天麻 天山雪莲 苦杏仁 桔梗 茯苓 甘草
0.984745 0.733209 0.756834 0.813022 0.789043 0.897897 0.932972 0.837496 0.860585 0.787794 0.808153
predicted yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

136. 
patient tongue id: 06111036539798_4_5_6
label yaofang:
牡蛎 郁金 浙贝母 甘草 连翘 玄参 猫爪草 柴胡 辛夷 苍耳子 茯苓 莪术 蔓荆子 蜂房 麦芽 蒲公英
0.939848 0.776269
predicted yaofang:
甘草 茯苓

137. 
patient tongue id: 03221316088197_1_6_2
label yaofang:
鳖甲 红豆杉 蜈蚣 天山雪莲 桑寄生 茯苓 白术 川芎 半枝莲 天麻 甘草 杜仲 骨碎补 党参 生地黄 威灵仙
0.99523 0.543786 0.793099 0.601037 0.570216 0.91887 0.77784 0.840789 0.525643 0.730814 0.652787
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

138. 
patient tongue id: 03011845172788_4
label yaofang:
炒紫苏子 款冬花 蜜麻黄 防风 前胡 白前 炙甘草 白芷 百部 桔梗 荆芥穗 紫菀 法半夏 广藿香
0.891639 0.947011 0.761595 0.824146 0.545106 0.909187 0.916074 0.815958 0.870355 0.941043 0.687352 0.560687 0.81687
predicted yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

139. 
patient tongue id: 01062332507065_1_7
label yaofang:
麦冬 枸杞子 玉米须 党参 山药 甘草 黄芪 北沙参 玄参 牡丹皮 生地黄 麦冬 枸杞子 天花粉 玉米须 党参 山药 甘草 黄芪 北沙参 玄参 牡丹皮 生地黄
0.897404 0.61235 0.754371 0.595171 0.530316 0.595416 0.672269 0.721566
predicted yaofang:
甘草 麦冬 党参 黄芪 枸杞子 生地黄 山药 北沙参

140. 
patient tongue id: 05042033497300_4_1
label yaofang:
黄芩 白芍 柴胡 香附 黄连 薄荷 当归 广藿香 茯苓 白术 甘草 麦芽
0.805916 0.546317 0.677165 0.676791 0.665057
predicted yaofang:
甘草 柴胡 白芍 茯苓 白术

141. 
patient tongue id: 05201510246732_6_4
label yaofang:
法半夏 柴胡 黄连 紫苏梗 厚朴 蒲公英 麦芽 茯苓 干姜 竹茹 木香 党参 白及 柿蒂
0.705419 0.572358 0.632335 0.761325
predicted yaofang:
甘草 法半夏 茯苓 党参

142. 
patient tongue id: 03021848107399_1_4
label yaofang:
白术 山慈菇 鸡内金 厚朴 火麻仁 枸杞子 当归 浙贝母 蛇舌草 海螵蛸 枳壳 生半夏 北沙参
0.590348 0.634422 0.678668 0.677598 0.625283
predicted yaofang:
黄芪 白术 海螵蛸 厚朴 北沙参

143. 
patient tongue id: 01202015416381_1_4
label yaofang:
黄芪 砂仁 稻芽 浙贝母 山药 太子参 白术 鸡内金 红豆杉 海螵蛸 石斛 紫苏梗
0.662383 0.892658
predicted yaofang:
黄芪 白术

144. 
patient tongue id: 04111936070295_1_4_6
label yaofang:
白术 枸杞子 半夏 党参 桑寄生 当归 厚朴 僵蚕 山药 大腹皮 紫苏叶 杜仲 黄芪 鸡内金 鲜龙葵果 白芷
0.536763 0.871165 0.838258 0.578141
predicted yaofang:
半夏 黄芪 白术 杜仲

145. 
patient tongue id: 04131815291922_6_2
label yaofang:
鳖甲 半枝莲 天山雪莲 天麻 独活 党参 生地黄 白花蛇舌 蜈蚣 甘草 红豆杉 桑寄生 白术 首乌藤
0.996809 0.809718 0.627359 0.934419 0.919702 0.955729 0.814374 0.843888 0.832422
predicted yaofang:
甘草 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

146. 
patient tongue id: 04282318301211_7_1_6
label yaofang:
茯苓 生地黄 菟丝子 杜仲 山茱萸 女贞子 补骨脂 甘草 续断 党参 白芍 枸杞子 白术
0.962981 0.586444 0.677373 0.894298 0.816986 0.562905 0.505587
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药

147. 
patient tongue id: 01250654172977_2_1
label yaofang:
鳖甲 浙贝母 四季青 黄芩片 蜈蚣 桔梗 远志 白花蛇舌 蜂房 甘草 芦根 天麻 酸枣仁 郁金
0.991919 0.667437 0.76472 0.925025 0.741499 0.854226 0.626901 0.547183
predicted yaofang:
甘草 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

148. 
patient tongue id: 05111913083848_5
label yaofang:
北沙参 蛤壳 蜈蚣 甘草 蒲公英 麦芽 生半夏 麦冬 粉葛 蛇舌草 冬凌草 厚朴 黄连 苇根 莪术 枸杞子 补骨脂 薏苡仁
0.825215 0.572994 0.616774 0.526097 0.518278 0.701616
predicted yaofang:
甘草 薏苡仁 厚朴 莪术 北沙参 蜈蚣

149. 
patient tongue id: 05140649284527_1_5
label yaofang:
鳖甲 薏苡仁 天山雪莲 甘草 炙麻黄 茯苓 浙贝母 款冬花 紫苏子 白花蛇舌 党参 蜈蚣 天麻 苦杏仁 法半夏 桔梗 前胡 鱼腥草
0.988692 0.923934 0.874722 0.652004 0.784502 0.539953 0.823158 0.78253 0.931242 0.649235 0.779418 0.83802 0.706325
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 薏苡仁 浙贝母 天麻 鳖甲 款冬花 蜈蚣 白花蛇舌 天山雪莲

150. 
patient tongue id: 05272349588036_1_2_5
label yaofang:
海螵蛸 砂仁 北沙参 枇杷叶 白术 山药 浙贝母 紫苏梗 延胡索 三七片 黄芪 茯苓 补骨脂
0.683573 0.530981 0.873435 0.673028
predicted yaofang:
茯苓 黄芪 白术 砂仁

151. 
patient tongue id: 04131904345463_1_4
label yaofang:
百部 防风 紫菀 款冬花 桔梗 紫苏梗 广藿香 法半夏 陈皮 前胡 甘草片 茯苓
0.565787 0.835922 0.716061 0.890562 0.770853 0.768125 0.81178 0.791989 0.583837 0.772297 0.670022
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 广藿香

152. 
patient tongue id: 04151221485307_1_2_4
label yaofang:
法半夏 干姜 炒紫苏子 细辛 白芍 醋五味子 太子参 茯苓 蜜麻黄 前胡 北沙参 麦冬 桂枝 紫菀 炙甘草
0.728887 0.56162 0.711347 0.643963 0.669233 0.600258 0.591091 0.731831 0.566914 0.697224 0.937899 0.557208 0.765225
predicted yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄

153. 
patient tongue id: 04101940126145_1_4_2
label yaofang:
前胡 人参叶 北沙参 北柴胡 桔梗 款冬花 玉竹 郁金 法半夏 甘草片 茯苓 芡实 紫菀 麦冬 太子参
0.691347 0.870714 0.637949 0.624739 0.687448 0.510195 0.580287 0.760021
predicted yaofang:
法半夏 茯苓 前胡 太子参 款冬花 白前 百部 北沙参

154. 
patient tongue id: 03012247157400_6_2_4
label yaofang:
鳖甲 甘草 蜈蚣 天麻 郁金 桔梗 板蓝根 芦根 白花蛇舌 薏苡仁 天山雪莲 党参 浙贝母 黄芩片 诃子
0.986848 0.546867 0.604022 0.82722 0.903278 0.833429 0.765496 0.70982 0.531634
predicted yaofang:
甘草 薏苡仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

155. 
patient tongue id: 04112158211623_5
label yaofang:
鳖甲 半枝莲 蜈蚣 浙贝母 贯众 荆芥穗 白前 甘草 白花蛇舌 天麻 天山雪莲 桔梗 金银花 前胡 款冬花
0.920517 0.603509 0.50284 0.738802 0.575769 0.896596 0.911503 0.800954 0.787543 0.782434 0.754098
predicted yaofang:
甘草 法半夏 前胡 桔梗 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

156. 
patient tongue id: 02181958375831_6_5_7
label yaofang:
补骨脂 丹参 麦芽 独活 秦艽 僵蚕 千斤拔 红花 甘草 龙骨 黄连 桑寄生 细辛 牛大力 白术 延胡索
0.90468
predicted yaofang:
甘草

157. 
patient tongue id: 02202246296718_1_6_2
label yaofang:
鳖甲 半枝莲 蜈蚣 枸杞子 菊花 酸枣仁 山茱萸 白花蛇舌 天麻 天山雪莲 白芍 木贼 生地黄 甘草
0.989133 0.541657 0.537082 0.625857 0.899191 0.914865 0.881746 0.793869 0.882607 0.791064
predicted yaofang:
甘草 白芍 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

158. 
patient tongue id: 01140806328188_5_6
label yaofang:
党参 赤芍 桑寄生 甘草 白术 蒺藜 杜仲 茯苓 丹参 地龙 川芎 天麻 牛膝 蔓荆子
0.91291 0.763364 0.730988 0.521318 0.66512
predicted yaofang:
甘草 茯苓 党参 白术 天麻

159. 
patient tongue id: 04111844323899_1_4
label yaofang:
北沙参 百部 陈皮 细辛 太子参 紫菀 法半夏 干姜 炒紫苏子 款冬花 蜜麻黄 前胡 白前 炙甘草
0.609993 0.854755 0.923916 0.767423 0.683113 0.641778 0.886923 0.944621 0.897963 0.885992 0.741545 0.910818 0.703938 0.815453
predicted yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

160. 
patient tongue id: 03012323333606_7_6
label yaofang:
桂枝 赤芍 薏苡仁 牛大力 茯苓 忍冬藤 甘草 白芍 桑枝 地黄 千斤拔 党参 知母 红花
0.915917 0.530428 0.518413 0.678127
predicted yaofang:
甘草 白芍 茯苓 党参

161. 
patient tongue id: 06071937388774_2_5_6
label yaofang:
茯苓 桑寄生 磁石 生地黄 女贞子 川芎 桂枝 天麻 麦芽 甘草 党参 墨旱莲 桃仁 牡丹皮
0.926066 0.702148 0.698676 0.568488
predicted yaofang:
甘草 茯苓 党参 天麻

162. 
patient tongue id: 03041119063783_4_1
label yaofang:
防风 百部 陈皮 细辛 广藿香 紫菀 法半夏 干姜 炒紫苏子 款冬花 蜜麻黄 前胡 白前 炙甘草
0.600147 0.937292 0.961169 0.692258 0.72708 0.583179 0.899592 0.920368 0.865204 0.875539 0.960127 0.585228 0.66739 0.804316
predicted yaofang:
陈皮 法半夏 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

163. 
patient tongue id: 05310759345798_1_4_7
label yaofang:
党参 丹参 熟附子 麦芽 鸡内金 木香 黄芪 高良姜 白芍 山药 当归 茯苓 草豆蔻
0.622076 0.711864 0.747471 0.586278 0.595458
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

164. 
patient tongue id: 06082042297182_5
label yaofang:
浙贝母 甘草 莪术 僵蚕 蜂房 猫爪草 忍冬藤 山慈菇 水蛭 牡丹皮 赤芍 冬凌草 姜黄 北沙参 蒲公英 薏苡仁 黄连 连翘
0.930301 0.602214 0.537583
predicted yaofang:
甘草 浙贝母 莪术

165. 
patient tongue id: 06082001004237_1_7
label yaofang:
牛膝 黄芪 宽筋藤 三七片 桃仁 珍珠母 丹参 浮小麦 威灵仙 延胡索 白芍 麦冬 红花 北沙参 制草乌 黑老虎
0.518889 0.612153
predicted yaofang:
桃仁 丹参

166. 
patient tongue id: 01112024451603_1
label yaofang:
炒紫苏子 款冬花 蜜麻黄 荆芥穗 前胡 白前 炙甘草 白芷 百部 桔梗 防风 炒苍耳子 紫菀 法半夏 辛夷
0.936637 0.965288 0.803576 0.886175 0.569778 0.611422 0.933003 0.950675 0.900314 0.947372 0.926027 0.787246 0.701626 0.650881 0.841237
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

167. 
patient tongue id: 01201953419882_1
label yaofang:
女贞子 生地黄 山药 牛膝 茯苓 茯苓 酸枣仁 益母草 墨旱莲 山茱萸 天麻 牡丹皮 甘草 浮小麦 川芎
0.985167 0.705839 0.769494 0.746559 0.592593 0.643822 0.636476
predicted yaofang:
甘草 茯苓 酸枣仁 生地黄 山药 天麻 浮小麦

168. 
patient tongue id: 01122224439561_1_2_7
label yaofang:
甘草 山药 山茱萸 肉苁蓉 桑寄生 酸枣仁 天麻 党参 补骨脂 地龙 杜仲 续断 首乌藤 川芎
0.970043 0.864284 0.622139 0.774851
predicted yaofang:
甘草 党参 酸枣仁 天麻

169. 
patient tongue id: 06031053412668_1_7_6
label yaofang:
鳖甲 薏苡仁 天麻 甘草 黄芪 皂角刺 补骨脂 白芍 白花蛇舌 莪术 蜈蚣 龙葵果 当归 党参 山药 建曲
0.974605 0.587434 0.888282 0.594972 0.658934 0.755863 0.865064
predicted yaofang:
甘草 薏苡仁 党参 山药 天麻 鳖甲 蜈蚣

170. 
patient tongue id: 05191920567686_1_2
label yaofang:
鳖甲 甘草 天麻 墨旱莲 天山雪莲 茯苓 川芎 郁金 白花蛇舌 蜈蚣 女贞子 沙苑子 太子参 山药 浙贝母
0.986915 0.838203 0.885702 0.89891 0.791696 0.780742 0.709697 0.508848
predicted yaofang:
甘草 茯苓 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

171. 
patient tongue id: 04141304546821_4
label yaofang:
北沙参 百部 桔梗 炒苍耳子 太子参 紫菀 法半夏 辛夷 炒紫苏子 款冬花 蜜麻黄 白芷 前胡 白前 炙甘草 广藿香
0.941339 0.967081 0.780766 0.663923 0.577308 0.628623 0.959681 0.95041 0.923802 0.95159 0.921303 0.750955 0.750373 0.725831 0.921571
predicted yaofang:
法半夏 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

172. 
patient tongue id: 06052015342367_2
label yaofang:
桑叶 北沙参 玉竹 甘草 知母 芦根 天花粉 麦冬 白扁豆 布渣叶 生地黄
0.72258
predicted yaofang:
甘草

173. 
patient tongue id: 03040844543696_5
label yaofang:
生地黄 火麻仁 金银花 黄连 白芍 浮小麦 川芎 白鲜皮 甘草 玄参 红花 何首乌 百合 酸枣仁
0.899133 0.537854 0.628841 0.544807
predicted yaofang:
甘草 白芍 酸枣仁 生地黄

174. 
patient tongue id: 03282238173263_2_6
label yaofang:
火麻仁 紫苏叶 炙甘草 枳实 党参 干姜 桑寄生 白术 附子
0.605528
predicted yaofang:
白术

175. 
patient tongue id: 04201438535233_1_4_7
label yaofang:
太子参 生地黄 玄参 牡丹皮 麦冬 枸杞子 天花粉 知母 北沙参 山药 甘草 丹参
0.886939 0.503488 0.640339 0.570596 0.656762
predicted yaofang:
甘草 麦冬 生地黄 山药 北沙参

176. 
patient tongue id: 03101921374709_1_4
label yaofang:
黄芪 稻芽 海螵蛸 山慈菇 砂仁 太子参 女贞子 白术 浙贝母 山药 蛇舌草 补骨脂 当归 鸡血藤
0.771608 0.962185 0.797782
predicted yaofang:
黄芪 白术 砂仁

177. 
patient tongue id: 01040654075894_5_6
label yaofang:
鳖甲 天麻 薏苡仁 龙葵果 款冬花 法半夏 苦杏仁 甘草 白花蛇舌 蜈蚣 红豆杉 紫菀 百部 茯苓 茜草
0.956513 0.719885 0.617709 0.790066 0.838127 0.520633 0.804705 0.702465 0.587685
predicted yaofang:
甘草 法半夏 茯苓 天麻 鳖甲 款冬花 蜈蚣 白花蛇舌 天山雪莲

178. 
patient tongue id: 04282037541702_5
label yaofang:
北沙参 郁金 夏枯草 黄芩 黄连 咸竹蜂 陈皮 白茅根 赤芍 枇杷叶 黄柏 东风桔 白扁豆

predicted yaofang:


179. 
patient tongue id: 03290656123143_3_4
label yaofang:
鳖甲 薏苡仁 甘草 白术 熟附子 干姜 白芷 蒺藜 党参 黄芪 土鳖虫 山药 赤芍 菟丝子 川芎 蔓荆子
0.922136 0.590288 0.712081 0.516839 0.756122 0.580517
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药

180. 
patient tongue id: 06190149568031_1_2
label yaofang:
鳖甲 甘草 红豆杉 天山雪莲 酸枣仁 白术 菟丝子 丹参 半枝莲 蜈蚣 天麻 党参 茯苓 山药 益母草
0.993562 0.702578 0.864918 0.600008 0.521256 0.525733 0.946181 0.75149 0.852118 0.709332 0.762513
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

181. 
patient tongue id: 03221944325654_1_4
label yaofang:
山茱萸 生地黄 猪苓 杜仲 甘草 泽兰 茺蔚子 山药 茯苓 桑寄生 车前子 天麻 白芍
0.897078 0.632465 0.529339 0.518787 0.509989
predicted yaofang:
甘草 茯苓 白术 山药 天麻

182. 
patient tongue id: 06072239555962_4
label yaofang:
柴胡 山药 车前子 女贞子 益母草 枳壳 黄芩片 白芍 苍术 菟丝子 补骨脂 丹参 甘草
0.940091 0.667088
predicted yaofang:
甘草 白芍

183. 
patient tongue id: 04272306317116_9
label yaofang:
前胡 炙甘草 白芷 紫苏子 百部 防风 苍耳子 细辛 白前 广藿香 紫苏梗 半夏 辛夷 麻黄
0.824194 0.871104 0.703898 0.622845 0.588683 0.613815 0.798234 0.903985 0.671477 0.703679
predicted yaofang:
前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香

184. 
patient tongue id: 03151940332754_5_7
label yaofang:
黄芪 太子参 杜仲 山慈菇 桃仁 砂仁 白茅根 白术 浙贝母 生半夏 土鳖虫 蛇舌草 合欢皮 鲜龙葵果
0.630033 0.811405 0.536636 0.57026
predicted yaofang:
黄芪 白术 浙贝母 砂仁

185. 
patient tongue id: 05131456329234_1_2
label yaofang:
鳖甲 半枝莲 蜈蚣 党参 补骨脂 赤芍 浮小麦 白花蛇舌 天麻 天山雪莲 茯苓 生地黄 酸枣仁 甘草
0.997477 0.82406 0.87797 0.728697 0.558056 0.955254 0.901929 0.900965 0.850943 0.883542 0.870503
predicted yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

186. 
patient tongue id: 05251937575866_1_2
label yaofang:
北沙参 预知子 莪术 蜈蚣 厚朴 杜仲 柴胡 合欢皮 郁金 麦芽 枳壳 甘草 黄芩 枸杞子
0.892246
predicted yaofang:
甘草

187. 
patient tongue id: 02190530393201_2_6
label yaofang:
醋鳖甲 半枝莲 蜈蚣 山茱萸 牡丹皮 荆芥 金银花 白花蛇舌草 天麻 地黄 山药 茯苓 白鲜皮 甘草
0.984085 0.861005 0.686783 0.663674
predicted yaofang:
甘草 天麻 蜈蚣 半枝莲

188. 
patient tongue id: 05092059497731_4
label yaofang:
金银花 浙贝母 茯苓 紫菀 鱼腥草 苦杏仁 紫苏梗 连翘 桔梗 法半夏 款冬花 黄芩片 桑白皮 甘草
0.947912 0.838455 0.814579 0.739864 0.623703 0.517263
predicted yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 款冬花

189. 
patient tongue id: 02182015027796_1_6
label yaofang:
柴胡 麸炒枳壳 黄连 茯苓 甘草 白术 补骨脂 白芍 乌梅 酸枣仁 党参 鸡血藤 当归
0.948168 0.721841 0.827373 0.917246 0.689318 0.500597
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁

190. 
patient tongue id: 05042016057503_7_4_6
label yaofang:
党参 墨旱莲 北沙参 龙骨 赤芍 莪术 甘草 女贞子 牡蛎 合欢皮 木蝴蝶 首乌藤
0.782867 0.627093 0.662889
predicted yaofang:
甘草 党参 黄芪

191. 
patient tongue id: 04182001138946_2_5
label yaofang:
鳖甲 浙贝母 天山雪莲 茯苓 法半夏 苍术 板蓝根 忍冬藤 白花蛇舌 桔梗 牛蒡子 芦根 厚朴 陈皮 岗梅根 甘草
0.942575 0.520505 0.755074 0.660859 0.726007 0.8343 0.634568
predicted yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 鳖甲 白花蛇舌

192. 
patient tongue id: 02202219177280_6_4
label yaofang:
鳖甲 半枝莲 蜈蚣 酸枣仁 党参 浙贝母 竹茹 合欢花 白花蛇舌 天麻 天山雪莲 甘草 郁金 法半夏 浮小麦
0.997681 0.829676 0.531736 0.957611 0.941337 0.935457 0.876502 0.830458 0.822716
predicted yaofang:
甘草 党参 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

193. 
patient tongue id: 03180154085892_6
label yaofang:
柴胡 茯苓 白花蛇舌草 防风 大枣 石斛 乌梅 太子参 连翘 海藻 猫爪草 昆布 山慈菇
0.540392
predicted yaofang:
茯苓

194. 
patient tongue id: 04120519530407_1_2_6
label yaofang:
鳖甲 薏苡仁 红豆杉 天麻 党参 白芍 大枣 虎杖 白花蛇舌 蜈蚣 甘草 天山雪莲 山药 茯苓 郁金
0.994608 0.707374 0.774269 0.600356 0.813651 0.898928 0.83588 0.762997 0.707612 0.560614
predicted yaofang:
甘草 茯苓 党参 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

195. 
patient tongue id: 06111039383433_4_6
label yaofang:
海藻 浙贝母 柴胡 法半夏 茯苓 莪术 夏枯草 黄药子 昆布 郁金 白芍 党参 白花蛇舌 甘草 牡丹皮 山药
0.950863 0.788963 0.776027
predicted yaofang:
甘草 茯苓 党参

196. 
patient tongue id: 06031532032162_1_2
label yaofang:
炒紫苏子 款冬花 蜜麻黄 黄芪 前胡 白前 炙甘草 麸炒白术 百部 桔梗 防风 干姜 紫菀 法半夏 紫苏梗 细辛
0.826673 0.955738 0.621294 0.764913 0.721939 0.62061 0.935828 0.941589 0.901493 0.919849 0.967992 0.67055 0.812949
predicted yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 炒紫苏子 蜜麻黄

197. 
patient tongue id: 04072024072540_1_4_7
label yaofang:
熟地黄 牡丹皮 山茱萸 黄芪 郁金 陈皮 砂仁 山药 茯苓 益智 白术 北沙参 鸡内金
0.73282 0.82285 0.738723 0.688195
predicted yaofang:
茯苓 黄芪 白术 北沙参

198. 
patient tongue id: 04151218075798_1_4
label yaofang:
前胡 白前 炙甘草 广藿香 百部 桔梗 紫苏梗 辛夷 紫菀 法半夏 防风 白芷 款冬花 蜜麻黄 荆芥穗
0.897919 0.932407 0.878499 0.930468 0.755156 0.895056 0.915074 0.84501 0.903812 0.909445 0.81632 0.634759 0.823194 0.774635
predicted yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄

199. 
patient tongue id: 04222240029844_2_4
label yaofang:
北沙参 百部 桔梗 炙甘草 太子参 紫菀 陈皮 茯苓 炒紫苏子 款冬花 法半夏 麦冬 前胡 白前 蜜麻黄
0.700938 0.908931 0.796591 0.934919 0.714446 0.741391 0.907895 0.901582 0.889777 0.87061 0.78547 0.819216 0.705036 0.815725
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄