d_ratio=0.8

0. 
patient text:
胃痛暴作,恶寒喜暖,得温痛减,遇寒加重,口淡不渴,或喜热饮.
label yaofang:
麻黄 桂枝 芍药 甘草
get id > 0.072853
0.364263 0.208627
predicted yaofang:
麻黄 桂枝

1. 
patient text:
胃脘疼痛,胀满据按,嗳腐吞酸,或呕吐不消化食物,其味腐臭,不思饮食,大便不爽,得矢气及便后稍舒.
label yaofang:
麻黄 桂枝 芍药 甘草
get id > 0.058621
0.276194 0.293104 0.0766192 0.112118
predicted yaofang:
麻黄 桂枝 芍药 甘草

2. 
patient text:
头痛爆裂
label yaofang:
柴胡 白芍 川芎 香附 陈皮 枳壳 甘草
get id > 0.099679
0.498393 0.1065
predicted yaofang:
柴胡 香附

3. 
patient text:
头痛,眩晕
label yaofang:
柴胡 白芍 川芎 香附 陈皮 枳壳 甘草
get id > 0.172930
0.864652
predicted yaofang:
滑石

4. 
patient text:
头痛,发热,鼻塞
label yaofang:
麻黄 桂枝 芍药 甘草
get id > 0.091486
0.129702 0.193325 0.457431
predicted yaofang:
麻黄 桂枝 芍药

5. 
patient text:
恶寒发热,无汗,或热势不高,鼻塞流涕,头痛身楚,,咳嗽痰白,咳痰无力,平素神疲体倦,乏力.
label yaofang:
人参 茯苓 甘草 苏叶 葛根 前胡 桔梗 半夏 橘红 枳壳 木香
get id > 0.059391
0.0646297 0.104684 0.0734285 0.296954 0.120024
predicted yaofang:
甘草 人参 葛根 前胡 木香

6. 
patient text:
头痛,眼花,眩晕,
label yaofang:
龙骨 牡蛎
get id > 0.137920
0.238653 0.689599
predicted yaofang:
龙骨 牡蛎

7. 
patient text:
恶寒重,发热轻,无汗,头痛,肢体酸痛,鼻塞,喷嚏,流清涕,咳嗽
label yaofang:
荆芥 防风 羌活 柴胡 枳壳 桔梗 前胡 独活 川芎
get id > 0.040174
0.0936815 0.200868 0.0430537 0.0453455 0.0755539 0.0461613 0.188243 0.0482048
predicted yaofang:
当归 前胡 龙骨 荆芥 防风 羌活 独活 蒲黄

8. 
patient text:
恶寒发热,咳嗽,胸痛,咳时尤甚,咯吐白色黏痰,痰量由少渐多,呼吸不利,口干鼻燥
label yaofang:
金银花 连翘 薄荷 荆芥 豆豉 芦根 竹叶 桔梗 贝母 牛蒡子 前胡 甘草
get id > 0.043159
0.0616125 0.078629 0.0435409 0.215796 0.0445231 0.118838 0.158777 0.0505938
predicted yaofang:
前胡 桔梗 荆芥 金银花 连翘 豆豉 芦根 竹叶

9. 
patient text:
身热转甚,时时振寒,继则壮热,咳嗽气急,胸满作痛,转侧不利,咳吐黄稠痰,或黄绿色痰,自觉喉间有腥味,口干咽燥,烦躁汗出
label yaofang:
薏苡仁 冬瓜仁 桃仁 桔梗 黄芩 金银花 鱼腥草 红藤 蒲公英 紫花地丁 甘草 芦根
get id > 0.048701
0.243505 0.169459 0.0583768 0.0585381
predicted yaofang:
桃仁 鱼腥草 红藤 苇茎

10. 
patient text:
咳吐大量脓痰,或如米粥,或痰血相兼,腥臭异常,有时咯血,胸中烦满而痛,甚则气喘不能卧,身热面赤,烦渴喜饮
label yaofang:
桔梗 金银花 贝母 薏苡仁 橘红 葶苈子 白及 甘草
get id > 0.055503
0.277513 0.101237 0.104073 0.0969645 0.101321
predicted yaofang:
金银花 豆豉 芦根 葶苈子 荆芥穗

11. 
patient text:
身热渐退,咳嗽减轻,咯吐脓血渐少,臭味亦减,痰液转为清稀,精神渐振,食欲改善,或见胸胁隐痛,难以久卧,气短乏力,自汗,盗汗,低热,午后潮热,心烦,口干咽燥,面色不华,形瘦神疲
label yaofang:
沙参 麦冬 玉竹 党参 太子参 黄芪 当归 贝母 冬瓜仁
get id > 0.056152
0.0714071 0.157184 0.0571574 0.130172 0.280762 0.0617096
predicted yaofang:
当归 贝母 冬瓜仁 沙参 麦冬 党参

12. 
patient text:
心悸不宁,善惊易恐,坐卧不宁,少寐多梦,易惊醒,恶闻声响,食少纳呆
label yaofang:
人参 茯苓 茯神 菖蒲 姜志远 龙齿
get id > 0.120690
0.603451 0.12113
predicted yaofang:
茯神 菖蒲

13. 
patient text:
心悸气短,头晕目眩,少寐多梦,健忘,思虑劳心则甚,神疲乏力,纳呆食少,腹胀便溏,口唇色淡,面色无华,
label yaofang:
人参 白术 甘草 当归 黄芪 远志 酸枣仁 茯神 龙眼肉 木香 生姜 大枣
get id > 0.036269
0.0819385 0.0982497 0.041258 0.0892618 0.127809 0.08966 0.106124 0.181345
predicted yaofang:
人参 生姜 大枣 木香 茯神 远志 酸枣仁 龙眼肉

14. 
patient text:
心悸易惊,心烦失眠,形体消瘦,五心烦热,口干盗汗,头晕目眩,耳鸣,急躁易怒,腰酸酸软,小便短黄,大便干结
label yaofang:
人参 丹参 玄参 远志 茯苓 五味子 桔梗 天冬 麦冬 酸枣仁 柏子仁 朱砂 甘草 黄连 当归 生地黄
get id > 0.020429
0.0295047 0.102145 0.0528872 0.0547859 0.0278505 0.0586072 0.0371787 0.0249411 0.0584847 0.0537768 0.0630005 0.0280192 0.0235955 0.0617552 0.0304689 0.0286719 0.0291943 0.0248035
predicted yaofang:
桂枝 甘草 人参 当归 茯苓 麦冬 阿胶 枸杞子 白术 远志 酸枣仁 丹参 五味子 天冬 柏子仁 黄连 生地黄 去皮

15. 
patient text:
心悸不宁,胸闷气短,自汗,动则尤甚,形寒肢冷,喜温,或伴心痛,面色㿠白
label yaofang:
桂枝 甘草 牡蛎 龙骨 人参 熟附子 生姜 大枣
get id > 0.045877
0.101187 0.229385 0.127183 0.0491865
predicted yaofang:
桂枝 龙骨 牡蛎 白术

16. 
patient text:
心悸,胸闷痞满,渴不欲饮,肢面浮肿,尿少,甚者咳喘,不能平卧,眩晕,呕恶流涎,形寒肢冷
label yaofang:
茯苓 桂枝 白术 甘草
get id > 0.037450
0.0998181 0.0947804 0.187251
predicted yaofang:
桂枝 茯苓 白术

17. 
patient text:
心悸,胸闷,心痛时作,痛如针刺,心悸日久不愈,面色晦暗,唇甲青紫.或兼神疲乏力,少气懒言,或兼形寒肢冷,或兼两胁胀痛,善太息
label yaofang:
红花 当归 桃仁 香附 延胡索 赤芍 川芎 乳香 丹参 青皮 熟地黄 桂枝 甘草 牡蛎 龙骨
get id > 0.051849
0.105074 0.259247 0.0946525 0.0520421 0.167258 0.0823092
predicted yaofang:
龙骨 牡蛎 桃仁 红花 乳香 青皮

18. 
patient text:
颈前喉结两旁结块肿大,质软不痛,颈部觉胀,胸闷,喜太息,或胸胁窜痛,病情常随情志波动
label yaofang:
昆布 海藻 海带 海螵蛸 海蛤壳 青木香 陈皮
get id > 0.054492
0.070553 0.0714728 0.132366 0.194557 0.272459 0.208557
predicted yaofang:
昆布 海藻 海带 海螵蛸 海蛤壳 青木香

19. 
patient text:
心悸时发时止,受惊易作,胸闷胀满,痰多呕恶,易怒烦躁,失眠多梦,口干口苦,大便秘结,小便短赤
label yaofang:
半夏 茯苓 陈皮 甘草 枳实 竹茹 黄连 大枣
get id > 0.058332
0.280386 0.291661 0.108466
predicted yaofang:
黄连 竹茹 橘皮