threshold = 0.3 validation_split = 0.1 sorted

0. 
patient tongue id: 03211936112753_4
label yaofang:
黄芩 茯苓 栀子 杜仲 牛膝 钩藤 天麻 石决明 桑寄生 益母草 首乌藤
0.440629 0.568711 0.401246 0.4785 0.588261 0.424446
predicted yaofang:
甘草 茯苓 杜仲 牛膝 天麻 桑寄生

1. 
patient tongue id: 06092004526441_1_4_6
label yaofang:
甘草 川芎 当归 防风 独活 党参 白术 海螵蛸 杜仲 牛膝 厚朴 巴戟天 桑寄生 秦艽 紫苏叶 蜈蚣 骨碎补
0.792072 0.673613 0.784702 0.312312 0.534313 0.353419
predicted yaofang:
甘草 党参 白术 赤芍 杜仲 厚朴

2. 
patient tongue id: 04252016476939_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 海螵蛸 车前子 白花蛇舌草 紫苏梗 瓦楞子 猫爪草 山慈菇
0.71425 0.327018 0.573758 0.73463 0.73873 0.324712 0.495531 0.651011
predicted yaofang:
甘草 香附 茯苓 党参 白术 丹参 海螵蛸 紫苏梗

3. 
patient tongue id: 03151854573311_3_6
label yaofang:
党参 白术 柏子仁 附子 车前子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.388779 0.541033 0.405971 0.820182 0.390661 0.67186 0.420626
predicted yaofang:
白芍 党参 黄芪 白术 砂仁 炙甘草 紫苏叶

4. 
patient tongue id: 02122104594538_4_6
label yaofang:
甘草 薏苡仁 蒲公英 党参 厚朴 天麻 五灵脂 鳖甲 三棱 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 鱼古
0.997506 0.863814 0.777897 0.323165 0.368251 0.961728 0.960385 0.635076 0.984795 0.883524 0.899556 0.90283 0.708004
predicted yaofang:
甘草 薏苡仁 党参 白术 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

5. 
patient tongue id: 05270138084657_1_2_4
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 党参 浙贝母 细辛 砂仁 天麻 鳖甲 补骨脂 莪术 蜈蚣 白花蛇舌 天山雪莲
0.997097 0.761964 0.779465 0.516441 0.655293 0.769505 0.724952 0.684095 0.932994 0.408246 0.857345 0.781707 0.824379 0.329294
predicted yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 党参 浙贝母 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲

6. 
patient tongue id: 06190148379154_7_6
label yaofang:
甘草 川芎 茯苓 龙骨 桃仁 远志 党参 酸枣仁 丹参 红花 赤芍 知母 地黄 淡竹叶 浮小麦 百合 合欢花
0.933901 0.526993 0.801913 0.338373 0.868243 0.811091 0.637146 0.361788 0.334902 0.524378 0.562883 0.335291
predicted yaofang:
甘草 川芎 茯苓 桃仁 党参 酸枣仁 丹参 生地黄 红花 天麻 浮小麦 首乌藤

7. 
patient tongue id: 05090815286121_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.875932 0.888825 0.828141 0.816768 0.776683 0.83207 0.797653 0.736229 0.859505 0.761017 0.641548 0.667128
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

8. 
patient tongue id: 04141835473752_1_4_3
label yaofang:
陈皮 枳壳 当归 木香 黄芪 枸杞子 白术 杜仲 厚朴 砂仁 菟丝子 鸡内金 北沙参 紫苏叶 预知子 稻芽
0.397955 0.456082 0.368582 0.41985 0.310036 0.979705 0.362663 0.965976 0.474756 0.410038 0.811152 0.716267 0.596952 0.69214 0.464456
predicted yaofang:
陈皮 枳壳 当归 半夏 党参 黄芪 枸杞子 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 紫苏叶

9. 
patient tongue id: 05182041306526_1_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 金樱子 桑螵蛸 炙甘草 百合 紫苏叶 覆盆子
0.794618 0.421053 0.950037 0.909917 0.38356 0.882234 0.528052 0.637698 0.358629 0.500347
predicted yaofang:
当归 木香 党参 黄芪 鸡血藤 白术 柏子仁 炙甘草 百合 紫苏叶

10. 
patient tongue id: 06130757280187_1_2_4
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.922867 0.903189 0.574863 0.682123 0.895465 0.808595 0.800962 0.558567 0.816199 0.767641 0.556982
predicted yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合

11. 
patient tongue id: 02150746046672_1_3_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.916332 0.472952 0.936616 0.725958 0.714555 0.946411 0.769036 0.902054 0.574352 0.89494 0.848376 0.72935 0.302933
predicted yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志

12. 
patient tongue id: 04300900263194_5
label yaofang:
甘草 荆芥 金银花 蒲公英 紫花地丁 白术 丹参 浙贝母 地黄 紫草 麦芽 皂角刺 白鲜皮 地肤子
0.935716 0.310166 0.673902 0.520574
predicted yaofang:
甘草 白芍 白术 浙贝母

13. 
patient tongue id: 01201410528158_1_4
label yaofang:
甘草 白芍 枳壳 薏苡仁 党参 白术 熟附子 天麻 鳖甲 莪术 败酱草 佛手 蜈蚣 天山雪莲 半枝莲 红豆杉
0.995726 0.561485 0.797043 0.875385 0.735533 0.935817 0.918422 0.59499 0.978029 0.473805 0.897833 0.866393 0.677513
predicted yaofang:
甘草 白芍 薏苡仁 党参 白术 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

14. 
patient tongue id: 03081838101446_4
label yaofang:
麻黄 陈皮 前胡 半夏 防风 细辛 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.497077 0.365094 0.91709 0.327416 0.847545 0.575222 0.306828 0.627675 0.820436 0.905605 0.721499 0.809859 0.947534 0.704466 0.844978 0.450947
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄

15. 
patient tongue id: 04112055520868_1_2_7
label yaofang:
桂枝 白芍 牡蛎 薏苡仁 黄芪 白术 熟地黄 浙贝母 山茱萸 砂仁 糯稻根 北沙参 炙甘草 麻黄根 黑枣 鲜龙葵果
0.405734 0.524761 0.764607 0.458129 0.426782 0.31532
predicted yaofang:
白芍 黄芪 白术 砂仁 北沙参 炙甘草

16. 
patient tongue id: 02182202209567_2_1
label yaofang:
甘草 白芍 茯苓 龙骨 远志 玉竹 党参 赤芍 紫河车 天麻 僵蚕 益智仁 北沙参 沙苑子
0.918619 0.622858 0.708842 0.547006
predicted yaofang:
甘草 茯苓 党参 天麻

17. 
patient tongue id: 05022129253218_1_6
label yaofang:
甘草 法半夏 茯苓 龙骨 牡蛎 远志 党参 太子参 酸枣仁 丹参 黄连 生地黄 浮小麦 合欢花
0.960661 0.486183 0.960505 0.301179 0.755902 0.814705 0.560466 0.596791
predicted yaofang:
甘草 法半夏 茯苓 牡蛎 党参 酸枣仁 生地黄 浮小麦

18. 
patient tongue id: 03232025522366_6_4
label yaofang:
甘草 法半夏 茯苓 桔梗 柏子仁 浙贝母 鳖甲 首乌藤 白花蛇舌 天山雪莲
0.970483 0.771116 0.830037 0.809703 0.355591 0.694432 0.326613 0.77623 0.555565 0.482041
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 浙贝母 天麻 鳖甲 白花蛇舌 天山雪莲

19. 
patient tongue id: 06190943139925_2_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 石菖蒲 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.999095 0.79718 0.760337 0.974418 0.84038 0.764289 0.947605 0.979597 0.978806 0.922728 0.947975 0.93429
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

20. 
patient tongue id: 04291510105716_1_6
label yaofang:
甘草 薏苡仁 党参 黄芪 熟附子 泽泻 天麻 赤石脂 鳖甲 补骨脂 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.975303 0.666833 0.838489 0.451122 0.303077 0.300318 0.957479 0.831649 0.42912 0.921141 0.358373 0.795754 0.746492
predicted yaofang:
甘草 薏苡仁 党参 黄芪 白术 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲

21. 
patient tongue id: 03291941162140_1_2
label yaofang:
甘草 桃仁 党参 太子参 枸杞子 浙贝母 乌药 莪术 北沙参 赭石 蜈蚣 荔枝核 鸭脚艾
0.932677 0.370899 0.557687 0.339588 0.316048 0.454262 0.627231 0.370805
predicted yaofang:
甘草 薏苡仁 党参 浙贝母 郁金 莪术 北沙参 蜈蚣

22. 
patient tongue id: 05192002495832_6_7_2
label yaofang:
甘草 川芎 茯苓 薏苡仁 党参 赤芍 杜仲 牛膝 山药 天麻 僵蚕 桑寄生 川木瓜 宽筋藤
0.974818 0.309106 0.628121 0.357659 0.694645 0.432352 0.393988 0.576502 0.411609 0.662559 0.785381 0.471651
predicted yaofang:
甘草 川芎 茯苓 薏苡仁 党参 白术 赤芍 杜仲 牛膝 山药 天麻 桑寄生

23. 
patient tongue id: 04282239073444_1_2_7
label yaofang:
甘草 柴胡 当归 黄芪 白术 赤芍 海螵蛸 砂仁 柿蒂 鸡内金 北沙参 土鳖虫 预知子 稻芽
0.49247 0.383288 0.858726 0.938015 0.419575 0.544376 0.479032 0.66694 0.400055 0.733377
predicted yaofang:
甘草 枳壳 黄芪 白术 赤芍 海螵蛸 厚朴 砂仁 鸡内金 北沙参

24. 
patient tongue id: 04282213242322_5
label yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 芦根 浙贝母 白茅根 细辛 诃子 板蓝根 紫苏子 黄芩片 木蝴蝶
0.967175 0.771091 0.905904 0.829942 0.832068 0.394722
predicted yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 苦杏仁

25. 
patient tongue id: 02221317287831_1_4_7
label yaofang:
甘草 法半夏 桔梗 橘红 防风 金银花 太子参 藿香 白前 鸡内金 蜜百部 干鱼腥草
0.706009 0.744939 0.781056 0.409201 0.396109 0.351236
predicted yaofang:
甘草 法半夏 桔梗 防风 太子参 白前

26. 
patient tongue id: 06072249163764_1_4
label yaofang:
甘草 桔梗 独活 芦根 薏苡仁 白术 浙贝母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.996669 0.477858 0.646611 0.378942 0.689699 0.896803 0.956711 0.956095 0.886844 0.86981 0.837247
predicted yaofang:
甘草 桔梗 薏苡仁 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

27. 
patient tongue id: 03231441188626_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.732711 0.973537 0.769269 0.975801 0.897564 0.831394 0.350965 0.317439 0.650418 0.968053 0.96438 0.94339 0.963731 0.923425 0.55952 0.588972 0.672519 0.907525
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

28. 
patient tongue id: 04171837100610_6
label yaofang:
川芎 陈皮 法半夏 茯苓 木香 茯神 党参 白术 五味子 杜仲 郁金 砂仁 炙甘草 合欢皮 牛大力 五指毛桃
0.504207 0.313714 0.878366 0.745639 0.367148 0.669729 0.356543
predicted yaofang:
甘草 陈皮 茯苓 党参 黄芪 白术 炙甘草

29. 
patient tongue id: 05232044202054_1_4_7
label yaofang:
甘草 茯苓 半夏 党参 黄芪 枸杞子 白术 杜仲 牛膝 厚朴 菟丝子 芡实 鸡内金 莲子 紫苏子 百合 紫苏叶 骨碎补 红豆杉 土茯苓 预知子 素馨花
0.616033 0.353531 0.401401 0.624811 0.805585 0.963775 0.466886 0.958081 0.598289 0.381615 0.300137 0.770777 0.415938 0.31695 0.308955 0.475979 0.348511 0.35795
predicted yaofang:
甘草 当归 茯苓 半夏 党参 黄芪 枸杞子 白术 杜仲 郁金 山药 厚朴 砂仁 僵蚕 莪术 鸡内金 紫苏叶 合欢皮

30. 
patient tongue id: 02212026241597_4_6
label yaofang:
甘草 前胡 酸枣仁 生地黄 牡丹皮 杜仲 天麻 鳖甲 苦杏仁 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.992982 0.437125 0.712839 0.453013 0.965647 0.942236 0.447157 0.938114 0.828033 0.884115 0.893731
predicted yaofang:
甘草 茯苓 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

31. 
patient tongue id: 04072028513350_4_5_1
label yaofang:
黄芪 白术 丹参 厚朴 砂仁 菟丝子 桑寄生 莪术 王不留行 橘核 首乌藤 合欢皮
0.313949 0.725088 0.928785 0.326503 0.450617 0.765909 0.324912
predicted yaofang:
甘草 黄芪 白术 海螵蛸 厚朴 砂仁 合欢皮

32. 
patient tongue id: 04130619356062_4
label yaofang:
甘草 川芎 当归 茯苓 桔梗 黄芪 郁金 山药 山茱萸 石菖蒲 天麻 桑螵蛸 地龙 辛夷 首乌藤
0.876534 0.339489 0.774504 0.531402 0.64279 0.506119 0.487605
predicted yaofang:
甘草 川芎 茯苓 黄芪 山药 天麻 首乌藤

33. 
patient tongue id: 02251112247374_4
label yaofang:
白芍 川芎 茯苓 木香 防风 丹参 钩藤 天麻 白芷 石决明 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.619185 0.513933 0.726934 0.573783 0.475342 0.339216 0.434368 0.449957 0.68907 0.323541 0.345273
predicted yaofang:
白芍 川芎 茯苓 防风 丹参 钩藤 天麻 白芷 炙甘草 首乌藤 广藿香

34. 
patient tongue id: 05161912268370_4
label yaofang:
麻黄 陈皮 前胡 桔梗 半夏 防风 细辛 白芷 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.502607 0.856289 0.418585 0.321208 0.862511 0.335612 0.728445 0.671539 0.783968 0.638841 0.713968 0.900201 0.761525 0.813178 0.355176
predicted yaofang:
陈皮 前胡 桔梗 半夏 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄

35. 
patient tongue id: 02281228362087_1_7
label yaofang:
黄芩 金银花 牛蒡子 蒲公英 麦冬 细辛 荷叶 蔓荆子 百部 白鲜皮 苍耳子 炒六神曲
0.313638
predicted yaofang:
甘草

36. 
patient tongue id: 01132305570528_1
label yaofang:
柴胡 黄芩 大枣 龙骨 牡蛎 党参 栀子 淡豆豉 姜半夏 炙甘草
0.582271 0.37484 0.680304 0.337315 0.818842
predicted yaofang:
柴胡 龙骨 党参 姜半夏 炙甘草

37. 
patient tongue id: 01051854006500_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.736577 0.960576 0.855392 0.940575 0.731148 0.750788 0.784067 0.91762 0.908864 0.899304 0.894016 0.747804 0.924656 0.741732 0.858877
predicted yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

38. 
patient tongue id: 04291449031355_7_1
label yaofang:
甘草 柴胡 白芍 薏苡仁 桃仁 远志 天麻 白花蛇舌草 佛手 浮小麦 蜈蚣 合欢花 半枝莲 醋鳖甲
0.982073 0.537813 0.653998 0.334935 0.358773 0.325032 0.966232 0.491111 0.550975 0.336491 0.912804 0.380145 0.40907 0.858997 0.464523
predicted yaofang:
甘草 柴胡 白芍 薏苡仁 党参 酸枣仁 天麻 鳖甲 白花蛇舌草 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 醋鳖甲

39. 
patient tongue id: 03231854140386_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.532886 0.958242 0.985889 0.902981 0.929451 0.443816 0.381497 0.770208 0.979119 0.97504 0.964202 0.976527 0.959754 0.782801 0.706888 0.587203 0.922073 0.34358
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子

40. 
patient tongue id: 04131756056735_1_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.997608 0.637381 0.906445 0.56118 0.335548 0.47323 0.356193 0.472255 0.899775 0.929937 0.886332 0.797838 0.894721 0.757635
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

41. 
patient tongue id: 03090802565431_6
label yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.998049 0.49346 0.892396 0.339873 0.941141 0.812586 0.954499 0.952137 0.531049 0.880176 0.871177 0.88133 0.864979
predicted yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

42. 
patient tongue id: 02272226177792_4_1
label yaofang:
白芍 当归 木香 党参 白术 肉桂 补骨脂 肉豆蔻 诃子 炙甘草
0.425086 0.674923 0.463429 0.773471 0.314329 0.688924 0.544379
predicted yaofang:
甘草 白芍 当归 党参 黄芪 白术 炙甘草

43. 
patient tongue id: 03141606320774_1_2_7
label yaofang:
桔梗 防风 金银花 薏苡仁 党参 乳香 胆南星 藿香 白芷 辛夷 干鱼腥草 苍耳子
0.600752 0.558748 0.7015 0.305981 0.303136
predicted yaofang:
甘草 桔梗 防风 党参 白芷

44. 
patient tongue id: 03280627487411_4
label yaofang:
陈皮 前胡 桔梗 荆芥 防风 牛蒡子 薏苡仁 浙贝母 桑白皮 紫菀 苦杏仁 紫苏叶
0.44421 0.795631 0.517084 0.667604 0.59187
predicted yaofang:
甘草 桔梗 薏苡仁 浙贝母 苦杏仁

45. 
patient tongue id: 06190936485518_6_1
label yaofang:
甘草 党参 黄芪 酸枣仁 生地黄 山药 菟丝子 桑寄生 益母草 鳖甲 麦芽 续断 天山雪莲 半枝莲 红豆杉
0.994712 0.445138 0.941561 0.367221 0.587179 0.614844 0.443735 0.789799 0.733858 0.752266 0.601584 0.494157 0.612376 0.413195
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

46. 
patient tongue id: 03271537585114_2_5
label yaofang:
桂枝 柴胡 白芍 当归 牡蛎 桃仁 党参 黄芪 枸杞子 白术 生地黄 胆南星 黄柏 干姜 水蛭 天花粉 糯稻根 姜半夏 炙甘草 浮小麦 黄芩片 半枝莲 淡附片 半边莲 黄连片 蒸陈皮
0.571023 0.492523 0.664775 0.863887 0.643027 0.502019 0.36771 0.808337 0.660908 0.798191 0.443339 0.347824 0.559976 0.437543 0.39052
predicted yaofang:
桂枝 甘草 柴胡 白芍 当归 茯苓 龙骨 党参 黄芪 白术 生地黄 牡丹皮 干姜 炙甘草 浮小麦

47. 
patient tongue id: 05092124506730_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒六神曲
0.667983 0.904057 0.918538 0.628706 0.77155 0.63494 0.569299 0.434842 0.918027 0.939499 0.874196 0.905648 0.947556 0.764219 0.407434 0.648065
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

48. 
patient tongue id: 02201802258727_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.452562 0.92095 0.945847 0.751777 0.81273 0.434168 0.344872 0.93426 0.920819 0.860181 0.937074 0.83813 0.519105 0.488906 0.519525 0.832189
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

49. 
patient tongue id: 03301352465122_4
label yaofang:
法半夏 前胡 防风 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.441623 0.878894 0.921318 0.774288 0.683651 0.514136 0.490216 0.865923 0.908384 0.878471 0.900807 0.967624 0.407362 0.666779 0.454327 0.736506
predicted yaofang:
陈皮 法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

50. 
patient tongue id: 02142152203344_6_1_2
label yaofang:
甘草 党参 白术 山药 天麻 鳖甲 扁豆花 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 木棉花
0.997377 0.309186 0.35869 0.954148 0.711851 0.576781 0.946669 0.934964 0.309895 0.94404 0.804369 0.891643 0.870999 0.307681
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

51. 
patient tongue id: 06132207194330_4_1_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.798345 0.903545 0.78464 0.66621 0.829561 0.659383 0.559036 0.669863 0.738992 0.840376
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗

52. 
patient tongue id: 03021201155190_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.873765 0.443634 0.563104 0.876359 0.850531 0.511493 0.347731 0.376025 0.343771 0.582586 0.644971
predicted yaofang:
甘草 茯苓 麦冬 党参 黄芪 枸杞子 生地黄 牡丹皮 郁金 山药 北沙参

53. 
patient tongue id: 03021953406490_4_1
label yaofang:
白芍 川芎 大枣 当归 太子参 枸杞子 熟地黄 山萸肉 炙甘草 制何首乌 党参片 炙黄芪 盐菟丝子 续断片 酒女贞子 盐巴戟天
0.817889 0.787325 0.577254 0.544826 0.42193 0.327541 0.908131
predicted yaofang:
白芍 川芎 当归 太子参 枸杞子 北沙参 炙甘草

54. 
patient tongue id: 04222116002959_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.967173 0.726019 0.961442 0.833875 0.894437 0.51164 0.673956 0.937679 0.912562 0.878219 0.919057 0.906605 0.734884 0.646287 0.556471 0.323504 0.827617
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

55. 
patient tongue id: 04200637018914_2_6
label yaofang:
甘草 白芍 茯苓 龙骨 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.99926 0.42827 0.785411 0.903581 0.625808 0.721801 0.663755 0.938808 0.932905 0.926517 0.729519 0.903284 0.897843
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

56. 
patient tongue id: 04062010158057_1_4_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.657006 0.429467 0.893049 0.65951 0.651307 0.418749 0.533972 0.472553
predicted yaofang:
甘草 枳壳 党参 黄芪 丹参 海螵蛸 厚朴 鸡内金

57. 
patient tongue id: 06111022092460_1_6
label yaofang:
甘草 白芍 党参 白术 山药 白茅根 茜草 天麻 赤石脂 鳖甲 补骨脂 蜈蚣 天山雪莲 半枝莲 广金钱草
0.990311 0.547235 0.355669 0.815648 0.758183 0.591981 0.900695 0.86324 0.908594 0.464049 0.861512 0.791545
predicted yaofang:
甘草 白芍 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

58. 
patient tongue id: 05222124222250_7_2_1
label yaofang:
牡蛎 蒲公英 黄芪 白术 浙贝母 砂仁 莪术 王不留行 麦芽 橘络 墨旱莲
0.380419 0.589454 0.783666 0.474216 0.677029
predicted yaofang:
甘草 黄芪 白术 浙贝母 砂仁

59. 
patient tongue id: 03111203178808_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.91749 0.354494 0.94009 0.595719 0.646144 0.931047 0.781731 0.80539 0.544409 0.766143 0.745504 0.535143
predicted yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合

60. 
patient tongue id: 05021440330750_1_4_7
label yaofang:
人参 当归 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.432401 0.45924 0.816692 0.777828
predicted yaofang:
当归 党参 黄芪 山药

61. 
patient tongue id: 04191714594400_3_1
label yaofang:
牡蛎 黄芪 白术 熟地黄 杜仲 附子 山药 山茱萸 厚朴 当归尾 砂仁 桑枝 三七片
0.912615 0.895422 0.464527 0.684152 0.416518 0.746099 0.368326
predicted yaofang:
黄芪 白术 杜仲 山药 厚朴 砂仁 首乌藤

62. 
patient tongue id: 05182102403420_4
label yaofang:
陈皮 桔梗 牛蒡子 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 天山雪莲
0.435565 0.494874 0.350632 0.501855 0.429689 0.433604 0.455892
predicted yaofang:
陈皮 桔梗 干姜 姜半夏 炙甘草 紫苏叶 广藿香

63. 
patient tongue id: 02231821438489_4
label yaofang:
麻黄 法半夏 前胡 桔梗 防风 荆芥穗 紫菀 辛夷 紫苏梗 广藿香 甘草片 炒苍耳子
0.584542 0.59171 0.628012 0.865084 0.413128 0.357771 0.549107 0.588428 0.354854 0.490787 0.344187 0.625459 0.518496 0.775198
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香

64. 
patient tongue id: 03240608491750_2_7_4
label yaofang:
甘草 白芍 川芎 茯苓 党参 枸杞子 白术 牛膝 山药 泽泻 天麻 磁石 桑寄生 麦芽 蒺藜 首乌藤
0.962769 0.627202 0.45892 0.775889 0.885957 0.562958 0.510403 0.60299 0.680213 0.411967 0.358585
predicted yaofang:
甘草 白芍 川芎 茯苓 党参 白术 牛膝 山药 天麻 桑寄生 麦芽

65. 
patient tongue id: 01042344242554_1_7
label yaofang:
甘草 独活 党参 白术 生地黄 杜仲 天麻 鳖甲 续断 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.99646 0.333006 0.780191 0.642991 0.342609 0.921589 0.856485 0.931147 0.605995 0.785979 0.795497
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

66. 
patient tongue id: 02272220562979_1
label yaofang:
陈皮 当归 党参 黄芪 白术 海螵蛸 白芷 升麻 北柴胡 炙甘草
0.324383 0.792308 0.794341 0.764687 0.7612
predicted yaofang:
当归 党参 黄芪 白术 炙甘草

67. 
patient tongue id: 03151901022924_1
label yaofang:
桂枝 白芍 当归 茯苓 龙骨 牡蛎 党参 黄芪 白术 海螵蛸 砂仁 炙甘草
0.381224 0.389284 0.661969 0.487398 0.801712 0.825113 0.823336 0.893443 0.368863 0.313338 0.648399
predicted yaofang:
桂枝 柴胡 白芍 当归 茯苓 党参 黄芪 白术 海螵蛸 砂仁 炙甘草

68. 
patient tongue id: 02212127132845_4
label yaofang:
防风 薄荷 钩藤 荆芥穗 白芷 北柴胡 炙甘草 首乌藤 紫苏梗 广藿香 威灵仙 炒蔓荆子
0.309664 0.777494 0.41478 0.603504 0.583283 0.40031 0.429457 0.694392
predicted yaofang:
桔梗 防风 荆芥穗 白芷 炙甘草 辛夷 紫苏梗 广藿香

69. 
patient tongue id: 01040647112282_6_2_1
label yaofang:
甘草 白芍 川芎 麦冬 党参 白术 玄参 柏子仁 生地黄 牛膝 厚朴 天麻 全蝎 火麻仁
0.958433 0.567512 0.726466 0.570464 0.453398 0.316652 0.327324
predicted yaofang:
甘草 白芍 党参 白术 生地黄 牛膝 天麻

70. 
patient tongue id: 06041126505886_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.353699 0.935559 0.974759 0.382493 0.865326 0.754202 0.537 0.305126 0.626809 0.958192 0.958996 0.947563 0.954769 0.958754 0.661268 0.700321 0.645 0.839244
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

71. 
patient tongue id: 02241442382479_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.774254 0.893577 0.710646 0.642398 0.822253 0.616096 0.559202 0.731493 0.80759 0.77258
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗

72. 
patient tongue id: 03101921026061_6_2_7
label yaofang:
黄芪 白术 黄柏 郁金 泽泻 天麻 全蝎 桑寄生 芡实 金樱子 玉米须 合欢皮
0.466945 0.840711 0.770539 0.311849 0.302837 0.748726 0.322706
predicted yaofang:
甘草 黄芪 白术 山药 泽泻 天麻 桑寄生

73. 
patient tongue id: 02141849046928_4
label yaofang:
陈皮 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.580731 0.607108 0.944549 0.84088 0.876396 0.680714 0.922692 0.954991 0.907561 0.94665 0.916322 0.616745 0.806613 0.470667 0.749391
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

74. 
patient tongue id: 02191256242879_6_2
label yaofang:
甘草 柴胡 白芍 枳壳 木香 延胡索 郁金 天麻 鳖甲 鸡内金 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.987333 0.527996 0.354625 0.326762 0.384038 0.829931 0.844711 0.851591 0.467176 0.690253 0.7189
predicted yaofang:
甘草 白芍 枳壳 党参 郁金 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

75. 
patient tongue id: 04202014554214_7_5_1
label yaofang:
甘草 陈皮 茯苓 黄芪 枸杞子 白术 生地黄 海螵蛸 胆南星 车前子 厚朴 生半夏 砂仁 天麻 蜈蚣 鲜龙葵果
0.823189 0.46546 0.666206 0.779964 0.923365 0.625777 0.568778 0.336875 0.300213
predicted yaofang:
甘草 陈皮 茯苓 黄芪 白术 厚朴 砂仁 天麻 蜈蚣

76. 
patient tongue id: 02261921450466_1_5
label yaofang:
甘草 橘红 牛蒡子 桃仁 远志 细辛 桑白皮 鳖甲 款冬花 川贝母 紫菀 苦杏仁 黄芩片 白花蛇舌
0.927036 0.635119 0.397087 0.426663 0.410142 0.456431 0.452325 0.550251 0.50018 0.335449 0.655969 0.654722
predicted yaofang:
甘草 法半夏 前胡 桔梗 桃仁 浙贝母 细辛 鳖甲 款冬花 紫菀 苦杏仁 白花蛇舌

77. 
patient tongue id: 06022237143554_1_4_6
label yaofang:
陈皮 半夏 牡蛎 远志 黄芪 枸杞子 白术 杜仲 郁金 菟丝子 北沙参 炙甘草 首乌藤 紫苏梗 骨碎补 红豆杉 合欢皮 预知子
0.412038 0.346386 0.729889 0.87611 0.704297 0.318843 0.590732 0.392293 0.382247 0.313767 0.30143 0.648608 0.301579 0.346707
predicted yaofang:
陈皮 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 郁金 厚朴 砂仁 鸡内金 北沙参 炙甘草 合欢皮

78. 
patient tongue id: 06111030183679_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 生地黄 浙贝母 山楂 莱菔子 麦芽 建曲
0.958991 0.623509 0.747185 0.365248 0.826236 0.80949 0.709314 0.533587
predicted yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 麦芽

79. 
patient tongue id: 04271549503123_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.8668 0.334345 0.600848 0.814456 0.835608 0.651081 0.474101 0.556722 0.336833 0.727124 0.632155
predicted yaofang:
甘草 茯苓 麦冬 党参 黄芪 枸杞子 生地黄 牡丹皮 郁金 山药 北沙参

80. 
patient tongue id: 04142236233858_6_4_7
label yaofang:
甘草 枳壳 法半夏 茯苓 龙骨 党参 酸枣仁 丹参 黄连 山茱萸 薤白 天麻 全蝎 瓜蒌皮 麦芽
0.984515 0.419265 0.866976 0.325772 0.827803 0.512021 0.543692 0.321303 0.835072 0.526935 0.304229 0.317791 0.301844
predicted yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 丹参 生地黄 天麻 麦芽 浮小麦 蜈蚣 半枝莲

81. 
patient tongue id: 01070838157796_1_4_7
label yaofang:
当归 党参 黄芪 熟附子 乌药 山药 干姜 淫羊藿 吴茱萸 仙茅 益智 鹿角霜 煨诃子
0.370864 0.741628 0.736854 0.738314
predicted yaofang:
当归 党参 黄芪 山药

82. 
patient tongue id: 05182214120526_1_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.423591 0.978681 0.770478 0.964683 0.396762 0.632072 0.779517 0.619681 0.376559 0.94455 0.922069 0.886888 0.915893 0.957595 0.424068 0.303131 0.596458 0.805494
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

83. 
patient tongue id: 04142240130644_6
label yaofang:
甘草 柴胡 茯苓 桃仁 黄芪 白术 酸枣仁 生地黄 桑螵蛸 益智 浮小麦 广升麻
0.901055 0.818206 0.639121 0.49562 0.372507 0.627158 0.331016 0.426232
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 酸枣仁 生地黄 浮小麦

84. 
patient tongue id: 02021017140721_1_4
label yaofang:
甘草 茯苓 黄芪 白术 胆南星 杜仲 白茅根 石菖蒲 大黄 厚朴 生半夏 火麻仁 鸡内金 稻芽
0.83936 0.323362 0.808582 0.323957 0.793606 0.964153 0.679014 0.301697 0.353811
predicted yaofang:
甘草 陈皮 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金

85. 
patient tongue id: 01192136512410_7_1_6
label yaofang:
甘草 法半夏 前胡 浙贝母 郁金 天麻 款冬花 紫菀 诃子 白花蛇舌草 丝瓜络 蜈蚣 半枝莲 醋鳖甲
0.955935 0.589845 0.526625 0.553644 0.884717 0.598102 0.445266 0.85881 0.651918 0.354633
predicted yaofang:
甘草 法半夏 前胡 桔梗 天麻 款冬花 紫菀 蜈蚣 半枝莲 醋鳖甲

86. 
patient tongue id: 05191952205989_6_2_1
label yaofang:
甘草 川芎 茯苓 羌活 桃仁 党参 浙贝母 山药 天麻 全蝎 粉葛 首乌藤 紫苏梗 猫爪草
0.932657 0.80926 0.858063 0.323332 0.340885 0.405184 0.48825 0.300409
predicted yaofang:
甘草 茯苓 党参 丹参 浙贝母 山药 天麻 鳖甲

87. 
patient tongue id: 04171840023037_7
label yaofang:
柴胡 川芎 茯苓 桔梗 薏苡仁 桃仁 党参 黄芪 白术 红花 乳香 熟地黄 黄柏 白茅根 干姜 地骨皮 天花粉 没药 败酱草 皂角刺 山萸肉 炙甘草 醋香附 大血藤
0.510973 0.312972 0.811393 0.798754 0.503874 0.500793
predicted yaofang:
甘草 法半夏 茯苓 党参 黄芪 白术

88. 
patient tongue id: 05191926128325_6_1
label yaofang:
甘草 茯苓 龙骨 牡蛎 远志 党参 酸枣仁 生地黄 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.998483 0.879303 0.314518 0.945442 0.853743 0.575116 0.933274 0.903822 0.462569 0.417951 0.850876 0.727613 0.808414 0.891237
predicted yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲

89. 
patient tongue id: 01200648408446_1_7_5
label yaofang:
甘草 柴胡 蒲公英 黄芪 生地黄 天麻 白芷 天花粉 鳖甲 百部 王不留行 麦芽 皂角刺 蜈蚣 白花蛇舌 天山雪莲 半枝莲 广升麻
0.981813 0.398833 0.442399 0.908949 0.900508 0.318796 0.922005 0.750768 0.837952 0.861984
predicted yaofang:
甘草 党参 生地黄 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲

90. 
patient tongue id: 03091958120659_5
label yaofang:
甘草 前胡 桔梗 芦根 牛蒡子 浙贝母 天麻 鳖甲 款冬花 苦杏仁 板蓝根 蜈蚣 黄芩片 天山雪莲 半枝莲
0.98251 0.390408 0.479518 0.873024 0.306148 0.808424 0.85463 0.931527 0.485762 0.548309 0.807247 0.774508 0.78436 0.668723
predicted yaofang:
甘草 法半夏 前胡 桔梗 薏苡仁 浙贝母 天麻 鳖甲 款冬花 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲

91. 
patient tongue id: 04201415481479_1_2
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.927696 0.372385 0.934205 0.587418 0.70389 0.937687 0.763279 0.871842 0.330375 0.57099 0.821697 0.758215 0.555609
predicted yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 生地黄 郁金 浮小麦 首乌藤 百合

92. 
patient tongue id: 01100248200851_1_2
label yaofang:
白芍 牛膝 全蝎 苏木 炙甘草 紫苏梗 蜈蚣 醋延胡索
0.570576 0.321201
predicted yaofang:
白芍 炙甘草

93. 
patient tongue id: 03240614548861_6_2
label yaofang:
茯苓 龙骨 党参 丹参 生地黄 山茱萸 天麻 鳖甲 火麻仁 炙甘草 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.968719 0.680194 0.748808 0.423361 0.431838 0.354505 0.942327 0.795345 0.762247 0.400912 0.700427 0.843195
predicted yaofang:
甘草 茯苓 党参 酸枣仁 丹参 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

94. 
patient tongue id: 04261934159961_4
label yaofang:
桂枝 茯苓 酸枣仁 神曲 泽泻 山楂 莱菔子 磁石 赤小豆 茯苓皮 猪苓 鸡内金 珍珠母 广藿香
0.432657 0.307986
predicted yaofang:
茯苓 首乌藤

95. 
patient tongue id: 02252059002883_1_4
label yaofang:
甘草 枸杞子 丹参 栀子 牡丹皮 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 木贼 有瓜石斛
0.98837 0.415835 0.428645 0.373833 0.968847 0.881055 0.904946 0.647674 0.791449 0.896689
predicted yaofang:
甘草 薏苡仁 党参 丹参 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

96. 
patient tongue id: 03012052108424_5_6
label yaofang:
甘草 法半夏 大枣 茯苓 桔梗 薏苡仁 葶苈子 浙贝母 款冬花 苇茎 苦杏仁
0.90617 0.850303 0.770571 0.361996 0.823519 0.438984 0.783317 0.522738 0.530023
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 薏苡仁 浙贝母 款冬花 苦杏仁

97. 
patient tongue id: 03221335488711_2_4
label yaofang:
法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.565797 0.964712 0.77258 0.956526 0.811187 0.494057 0.817449 0.804242 0.936963 0.927431 0.936516 0.935531 0.854298 0.958781 0.863069 0.905318
predicted yaofang:
陈皮 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

98. 
patient tongue id: 03301359441832_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 麦冬 款冬花 紫菀 白前 百部 北沙参 广藿香 甘草片 蜜麻黄
0.66373 0.835342 0.808255 0.884712 0.358864 0.466605 0.420185 0.843369 0.786329 0.865046 0.7966 0.529943 0.465455 0.4845 0.473321 0.707484
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

99. 
patient tongue id: 02182259505353_1_2_6
label yaofang:
甘草 柴胡 白芍 香附 茯苓 党参 酸枣仁 丹参 郁金 山药 砂仁 菟丝子 益母草 麦芽 白扁豆
0.989456 0.641248 0.78158 0.924305 0.978426 0.577368 0.398965 0.335579 0.584156 0.531603
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 酸枣仁 丹参 山药 麦芽

100. 
patient tongue id: 04221848579766_2
label yaofang:
法半夏 葛根 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 威灵仙 人参叶
0.87085 0.873146 0.771142 0.360392 0.699759 0.797957 0.78344 0.860774 0.758991 0.678257 0.698034 0.469144 0.576569
predicted yaofang:
法半夏 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

101. 
patient tongue id: 06011956469720_5_7
label yaofang:
甘草 薏苡仁 鸡血藤 枸杞子 赤芍 杜仲 郁金 苍术 天麻 菟丝子 金樱子 桑螵蛸 决明子 沙苑子 覆盆子
0.873952 0.524788 0.321447 0.442889 0.432882 0.460702 0.667882 0.317878 0.315653
predicted yaofang:
甘草 薏苡仁 党参 杜仲 牛膝 山药 天麻 莪术 蜈蚣

102. 
patient tongue id: 04172229427925_1
label yaofang:
柴胡 白芍 香附 陈皮 延胡索 川楝子 干姜 炙甘草 预知子
0.583828 0.745476 0.359814 0.303468 0.51583 0.843442
predicted yaofang:
柴胡 白芍 陈皮 党参 干姜 炙甘草

103. 
patient tongue id: 06031046424397_1_4
label yaofang:
甘草 柴胡 金银花 连翘 蒲公英 浙贝母 牡丹皮 郁金 天花粉 瓜蒌皮 王不留行 皂角刺 黄芩片 路路通
0.951523 0.320645 0.677558
predicted yaofang:
甘草 柴胡 浙贝母

104. 
patient tongue id: 03152021467591_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.939331 0.407236 0.606361 0.854764 0.855165 0.688707 0.581231 0.578629 0.427881 0.772578 0.643349
predicted yaofang:
甘草 茯苓 麦冬 党参 黄芪 枸杞子 生地黄 牡丹皮 郁金 山药 北沙参

105. 
patient tongue id: 05162041043829_7_1
label yaofang:
柴胡 白芍 香附 枳壳 桃仁 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗 土茯苓
0.816303 0.89462 0.759394 0.673684 0.858073 0.745108 0.56182 0.777233 0.712178 0.814558
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗

106. 
patient tongue id: 02191623352769_6_4
label yaofang:
甘草 薏苡仁 远志 党参 赤芍 郁金 山药 天麻 鳖甲 莪术 虎杖 蜈蚣 天山雪莲 红豆杉
0.995073 0.776333 0.890057 0.52443 0.908701 0.86594 0.607474 0.920825 0.678261 0.721354 0.431021 0.453963
predicted yaofang:
甘草 薏苡仁 党参 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

107. 
patient tongue id: 02202228066799_1_6
label yaofang:
甘草 茯苓 远志 党参 白术 五味子 杜仲 山茱萸 车前子 菟丝子 巴戟天 金樱子 蛇床子 覆盆子
0.871173 0.634374 0.72185 0.765105
predicted yaofang:
甘草 茯苓 党参 白术

108. 
patient tongue id: 02020821107179_5
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 鱼腥草 浙贝母 桑白皮 款冬花 紫菀 苇茎 苦杏仁 紫苏子 蜜麻黄
0.836213 0.864788 0.823004 0.674818 0.902331 0.772363 0.688943 0.457216 0.584394
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 款冬花 紫菀 苦杏仁

109. 
patient tongue id: 02272214146195_6_4
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.827648 0.92936 0.764346 0.725741 0.857009 0.79651 0.596117 0.770391 0.695111 0.72381
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗

110. 
patient tongue id: 05130652110081_2_6
label yaofang:
甘草 白芍 龙骨 党参 黄芪 白术 酸枣仁 山茱萸 地黄 天麻 糯稻根 蜈蚣 半枝莲 醋鳖甲
0.982682 0.541439 0.310091 0.849041 0.881205 0.45087 0.375141 0.328406 0.849623 0.806417 0.585714
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 蜈蚣 半枝莲

111. 
patient tongue id: 02182227538034_2_1
label yaofang:
甘草 白芍 酸枣仁 丹参 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 木贼 谷精子
0.992138 0.406797 0.320677 0.510302 0.520203 0.365423 0.304047 0.985002 0.923562 0.87961 0.770201 0.87933 0.929954
predicted yaofang:
甘草 白芍 茯苓 党参 酸枣仁 丹参 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

112. 
patient tongue id: 02202244307088_5
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 鱼腥草 白术 桑白皮 款冬花 苦杏仁 紫苏梗
0.838184 0.345022 0.854688 0.906451 0.50846 0.47005 0.520005 0.564627 0.36965 0.321423
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 白术 款冬花 紫菀 苦杏仁

113. 
patient tongue id: 05221904306881_4
label yaofang:
陈皮 半夏 薏苡仁 厚朴 蝉蜕 白鲜皮 土茯苓 木棉花
0.41462 0.387538 0.570303 0.360428 0.538525
predicted yaofang:
甘草 陈皮 薏苡仁 白术 厚朴

114. 
patient tongue id: 03081821577831_1_7_4
label yaofang:
甘草 枳壳 太子参 黄芪 白术 海螵蛸 郁金 厚朴 山楂 砂仁 鸡内金 北沙参 紫苏梗
0.6415 0.674684 0.420273 0.818187 0.786009 0.670315 0.479511 0.75402 0.803664 0.676373 0.679148 0.423711
predicted yaofang:
甘草 枳壳 太子参 黄芪 白术 海螵蛸 郁金 厚朴 砂仁 鸡内金 北沙参 紫苏梗

115. 
patient tongue id: 02272203463482_6
label yaofang:
甘草 甘草 川芎 陈皮 枳壳 茯苓 龙骨 牡蛎 远志 柏子仁 柏子仁 竹茹 肉桂 姜半夏 附片
0.753404 0.354897 0.82897 0.304994 0.481562 0.363405
predicted yaofang:
甘草 陈皮 茯苓 龙骨 党参 炙甘草

116. 
patient tongue id: 02182217015039_2_6
label yaofang:
甘草 白芍 麦冬 太子参 浙贝母 山药 白茅根 鳖甲 北沙参 辛夷 苍耳子 白花蛇舌 天山雪莲 蜂房 四季青
0.963681 0.366101 0.834779 0.317288 0.338415 0.593897 0.541886
predicted yaofang:
甘草 浙贝母 鳖甲 北沙参 蜈蚣 白花蛇舌 天山雪莲

117. 
patient tongue id: 02171855235107_4
label yaofang:
防风 黄芪 细辛 荆芥穗 白芷 辛夷 紫苏梗 广藿香 甘草片 炒苍耳子 麸炒白术
0.325247 0.559865 0.927239 0.374575 0.41 0.578163 0.341459 0.441069 0.361256 0.493652 0.630083 0.758374 0.627409 0.809047
predicted yaofang:
法半夏 前胡 防风 黄芪 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香

118. 
patient tongue id: 06170923445741_5_1_6
label yaofang:
甘草 桔梗 牛蒡子 海螵蛸 浙贝母 郁金 厚朴 砂仁 北沙参 木蝴蝶 猫爪草 稻芽
0.793272 0.526483 0.320334 0.339314 0.798438 0.338015 0.498493 0.411272 0.520509
predicted yaofang:
甘草 桔梗 白术 海螵蛸 浙贝母 郁金 厚朴 砂仁 北沙参

119. 
patient tongue id: 06181855225779_1_2
label yaofang:
甘草 川芎 龙骨 党参 牛膝 山药 天麻 鳖甲 麦芽 女贞子 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.997198 0.907191 0.436321 0.320083 0.553946 0.98214 0.892452 0.885498 0.681919 0.8331 0.881486
predicted yaofang:
甘草 党参 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

120. 
patient tongue id: 06031125422178_5_1_7
label yaofang:
甘草 柴胡 白芍 连翘 薏苡仁 党参 白术 黄连 延胡索 浙贝母 乌梅 郁金 山药 仙鹤草 麦芽 白花蛇舌
0.992791 0.64793 0.719214 0.349258 0.52095 0.964521 0.649888 0.414451 0.606409 0.407007 0.580401 0.452657 0.441905
predicted yaofang:
甘草 柴胡 白芍 枳壳 薏苡仁 党参 白术 浙贝母 山药 鳖甲 麦芽 蜈蚣 白花蛇舌

121. 
patient tongue id: 02241826013553_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.448708 0.971985 0.674295 0.98141 0.830612 0.890503 0.359158 0.622301 0.972833 0.959124 0.955397 0.967089 0.904546 0.728633 0.701058 0.672473 0.87903
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

122. 
patient tongue id: 02120817007164_1_7
label yaofang:
甘草 法半夏 茯苓 远志 党参 白术 杜仲 石菖蒲 天麻 菟丝子 补骨脂 桑螵蛸 益智 辛夷
0.942157 0.639442 0.802657 0.742879 0.645682 0.387642 0.434874 0.441866
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 杜仲 山药 天麻

123. 
patient tongue id: 03151812056427_1_3_7
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 薤白 厚朴
0.847461 0.563265 0.917628 0.46313 0.786277 0.583773 0.313915 0.542358
predicted yaofang:
甘草 法半夏 茯苓 桃仁 党参 黄芪 白术 丹参

124. 
patient tongue id: 04282232113156_5_6_1
label yaofang:
甘草 法半夏 茯苓 龙骨 党参 酸枣仁 地黄 天麻 白花蛇舌草 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.991792 0.831543 0.829747 0.678685 0.357901 0.915925 0.398519 0.344171 0.693244 0.332237 0.725476
predicted yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲

125. 
patient tongue id: 02202220357633_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 栀子 桑白皮 莱菔子 茵陈 款冬花 麦芽 苦杏仁 紫苏子
0.881142 0.876592 0.815721 0.625064 0.93074 0.786788 0.647153 0.509177
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 款冬花 苦杏仁

126. 
patient tongue id: 02260214108926_1_6
label yaofang:
甘草 茯苓 党参 栀子 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 木贼 有瓜石斛
0.995455 0.745861 0.897522 0.429507 0.68193 0.963198 0.961295 0.416274 0.912116 0.871185 0.882432 0.904964
predicted yaofang:
甘草 茯苓 党参 酸枣仁 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

127. 
patient tongue id: 02142151149145_6
label yaofang:
甘草 柴胡 白芍 木香 酸枣仁 山药 砂仁 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.966985 0.362676 0.68586 0.322759 0.455808 0.821607 0.363795 0.769625 0.496868 0.359441
predicted yaofang:
甘草 柴胡 白芍 党参 山药 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

128. 
patient tongue id: 01201946387318_2_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 酸枣仁 生地黄 砂仁 菟丝子 麦芽 女贞子 紫苏梗
0.984878 0.644035 0.854429 0.441464 0.91654 0.930541 0.906573 0.371688 0.471698 0.496899 0.331482
predicted yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 生地黄 砂仁 麦芽 紫苏梗

129. 
patient tongue id: 05090816486962_1_4_7
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 阿胶 五味子 熟地黄 火麻仁 炙甘草 牡荆子 黑枣
0.336392 0.37137 0.400215 0.484923 0.683471
predicted yaofang:
当归 龙骨 牡蛎 党参 炙甘草

130. 
patient tongue id: 02142001548586_4
label yaofang:
甘草 黄连 肉桂 干姜 附片
0.744453
predicted yaofang:
甘草

131. 
patient tongue id: 02272233112543_3
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 砂仁 菟丝子 巴戟天 桑寄生 鹿角霜 续断 制何首乌 艾叶
0.388557 0.689977 0.458881 0.768067 0.620981 0.380105 0.406652 0.433044
predicted yaofang:
甘草 党参 黄芪 白术 杜仲 山药 砂仁 桑寄生

132. 
patient tongue id: 03312043271548_1_6_4
label yaofang:
甘草 茯苓 羌活 独活 薏苡仁 白术 延胡索 郁金 山药 厚朴 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲
0.997354 0.700545 0.683862 0.487534 0.757018 0.35703 0.372654 0.843082 0.893336 0.66533 0.907879 0.703883 0.754418 0.478429
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 郁金 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲

133. 
patient tongue id: 04182208380615_1_3_7
label yaofang:
甘草 当归 茯苓 党参 黄芪 白术 浙贝母 杜仲 厚朴 砂仁 款冬花 鸡内金 地龙 紫苏子 蜈蚣 鲜龙葵果
0.886543 0.921868 0.838503 0.748372 0.975238 0.434779 0.547883 0.547405 0.379113
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 浙贝母 厚朴 砂仁 鸡内金

134. 
patient tongue id: 03151835363889_6_1
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.353825 0.375883 0.641616
predicted yaofang:
白术 天麻 炙甘草

135. 
patient tongue id: 02182148324994_2_6
label yaofang:
甘草 党参 生地黄 郁金 山药 山茱萸 泽泻 车前子 海金沙 鸡内金 王不留行 川木瓜 广金钱草 土茯苓 石苇
0.89662 0.781954 0.310851 0.310648 0.349254 0.334332 0.454998 0.336988
predicted yaofang:
甘草 党参 黄芪 白术 生地黄 郁金 山药 天麻

136. 
patient tongue id: 02020947100958_6_1
label yaofang:
甘草 柴胡 法半夏 茯苓 木香 蒲公英 白及 党参 白术 黄连 延胡索 五灵脂 旋覆花 鱼古 煅瓦楞子
0.809573 0.511509 0.41523 0.733184 0.925863 0.818133 0.565347 0.315629 0.305672
predicted yaofang:
甘草 柴胡 枳壳 法半夏 茯苓 党参 白术 黄连 炙甘草

137. 
patient tongue id: 03111516539803_7_6
label yaofang:
甘草 柴胡 白芍 川芎 羌活 桃仁 红花 赤芍 栀子 牡丹皮 牛膝 细辛 天麻 全蝎 白芷
0.927047 0.508028 0.796709 0.575545 0.552411 0.515751 0.333009 0.572064 0.340617 0.687048
predicted yaofang:
甘草 柴胡 白芍 川芎 桃仁 红花 赤芍 牛膝 细辛 天麻

138. 
patient tongue id: 06010208339212_6_4_7
label yaofang:
甘草 法半夏 茯苓 党参 白术 砂仁 天麻 鳖甲 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991602 0.418814 0.79086 0.832858 0.758755 0.416872 0.740674 0.933089 0.50134 0.866847 0.752319 0.832457 0.827378
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 砂仁 天麻 鳖甲 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲

139. 
patient tongue id: 04232016402822_4
label yaofang:
麻黄 桂枝 荆芥 防风 独活 延胡索 乳香 没药 炙甘草 豨莶草 海风藤 海桐皮 鹿衔草 走马胎
0.408552 0.396313 0.317007 0.546383
predicted yaofang:
白芍 防风 黄芪 炙甘草

140. 
patient tongue id: 01061842504754_2_4
label yaofang:
茯苓 葛根 麦冬 玄参 牡丹皮 北沙参 百合 甘草片 人参叶 干石斛
0.708587 0.60783 0.556195
predicted yaofang:
茯苓 麦冬 北沙参

141. 
patient tongue id: 05312141258570_1_2_7
label yaofang:
甘草 桃仁 党参 酸枣仁 生地黄 天麻 鳖甲 女贞子 紫苏叶 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众 龟甲
0.995444 0.837146 0.681733 0.449705 0.972109 0.944468 0.945027 0.84818 0.862862 0.828097
predicted yaofang:
甘草 党参 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

142. 
patient tongue id: 02271231581169_1_7
label yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 薏苡仁 白术 大腹皮 厚朴 藿香 白芷 六神曲
0.954216 0.620746 0.739585 0.855214 0.800552 0.451054 0.463184
predicted yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 白术 厚朴

143. 
patient tongue id: 01111919051363_1
label yaofang:
白芍 川芎 大枣 当归 太子参 黄芪 枸杞子 熟地黄 郁金 干姜 北柴胡 炙甘草 党参片 盐菟丝子 续断片 酒女贞子
0.90119 0.91979 0.689588 0.467477 0.300782 0.438295 0.388439 0.64204 0.671572 0.767763 0.456774 0.758561 0.438497 0.557098 0.604518
predicted yaofang:
白芍 川芎 当归 茯苓 牡蛎 麦冬 党参 太子参 黄芪 枸杞子 杜仲 郁金 北沙参 炙甘草 首乌藤

144. 
patient tongue id: 05232039238010_1
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 车前子 砂仁 升麻 炙甘草
0.32456 0.825324 0.847808 0.851421 0.351716 0.55569
predicted yaofang:
当归 党参 黄芪 白术 砂仁 炙甘草

145. 
patient tongue id: 04291454424177_6_5
label yaofang:
甘草 柴胡 白芍 木香 蒲公英 党参 黄连 槟榔 山药 砂仁 柿蒂 麦芽 麸炒枳壳
0.909275 0.578373 0.743703 0.332094 0.919999 0.37829 0.670425 0.556801 0.574576
predicted yaofang:
甘草 柴胡 白芍 枳壳 党参 白术 山药 砂仁 麦芽

146. 
patient tongue id: 02212216574632_1_6
label yaofang:
甘草 白芍 枳壳 木香 白术 砂仁 莱菔子 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.985901 0.480092 0.355158 0.653097 0.429204 0.942237 0.882438 0.922311 0.60585 0.840173 0.823663 0.358545
predicted yaofang:
甘草 白芍 党参 白术 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

147. 
patient tongue id: 05262213296794_1_2_6
label yaofang:
甘草 枳壳 茯苓 桔梗 太子参 浙贝母 郁金 山药 鳖甲 鸡内金 夏枯草 麦芽 皂角刺 白花蛇舌 天山雪莲 猫爪草
0.993992 0.371105 0.68592 0.666168 0.359121 0.312064 0.30717 0.617873 0.769556 0.752307 0.444586 0.620455 0.494656
predicted yaofang:
甘草 枳壳 茯苓 桔梗 党参 太子参 生地黄 浙贝母 郁金 鳖甲 麦芽 白花蛇舌 天山雪莲

148. 
patient tongue id: 06141845556710_6_7
label yaofang:
川芎 茯苓 半夏 薏苡仁 白术 海螵蛸 牡丹皮 杜仲 桑寄生 莪术 续断 蜈蚣
0.763813 0.740457 0.726291 0.489852 0.407121 0.314013 0.902336 0.421679 0.356887 0.906 0.399869 0.397548 0.791736 0.674394
predicted yaofang:
甘草 茯苓 半夏 薏苡仁 党参 黄芪 白术 赤芍 海螵蛸 杜仲 山药 桑寄生 莪术 蜈蚣

149. 
patient tongue id: 03242124052755_4_6
label yaofang:
桂枝 牛蒡子 玉竹 海螵蛸 牛膝 大黄 砂仁 萆薢 土茯苓
0.329618
predicted yaofang:
牛膝

150. 
patient tongue id: 03171206353723_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.94335 0.324418 0.942692 0.531097 0.563306 0.922524 0.753787 0.812557 0.443216 0.774154 0.73904 0.437625
predicted yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合

151. 
patient tongue id: 05161938550890_2
label yaofang:
茯苓 葛根 麦冬 玉竹 玄参 生地黄 赤芍 牡丹皮 木瓜 北沙参 百合 甘草片 干石斛
0.751074 0.545246 0.355738 0.327184 0.758673
predicted yaofang:
茯苓 麦冬 太子参 牡丹皮 北沙参

152. 
patient tongue id: 02010218494145_6_2
label yaofang:
甘草 酸枣仁 赤芍 山药 山茱萸 地黄 天麻 菟丝子 桑寄生 益母草 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.997604 0.345144 0.341144 0.471194 0.618849 0.408473 0.634393 0.407556 0.971565 0.314635 0.366226 0.872553 0.301794 0.335394 0.761278 0.446189
predicted yaofang:
甘草 白芍 党参 白术 酸枣仁 生地黄 山药 山茱萸 天麻 鳖甲 白花蛇舌草 蜈蚣 白花蛇舌 天山雪莲 半枝莲 醋鳖甲

153. 
patient tongue id: 02110749410392_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.924282 0.369593 0.929362 0.617577 0.675026 0.903493 0.789168 0.867458 0.576864 0.83073 0.825623 0.553799
predicted yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合

154. 
patient tongue id: 04291512242065_4_1
label yaofang:
甘草 党参 黄芪 白术 红花 天麻 鳖甲 威灵仙 地肤子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土茯苓
0.982747 0.846936 0.373249 0.5339 0.350746 0.895932 0.887153 0.812535 0.674996 0.789626 0.777398
predicted yaofang:
甘草 党参 黄芪 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

155. 
patient tongue id: 05242250369845_1_6
label yaofang:
甘草 薏苡仁 党参 延胡索 赤芍 郁金 山药 天麻 鳖甲 莪术 虎杖 蜈蚣 白花蛇舌 红豆杉
0.997088 0.816705 0.899196 0.414957 0.702828 0.845818 0.847532 0.704324 0.904443 0.766367 0.542085 0.323862 0.602411
predicted yaofang:
甘草 薏苡仁 党参 郁金 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

156. 
patient tongue id: 02122215112909_1_4
label yaofang:
甘草 独活 薏苡仁 远志 杜仲 牛膝 天麻 桑寄生 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲 牛大力
0.985962 0.399236 0.33251 0.983359 0.324659 0.403475 0.887349 0.425102 0.854156 0.362786
predicted yaofang:
甘草 薏苡仁 杜仲 天麻 桑寄生 鳖甲 蜈蚣 天山雪莲 半枝莲 醋鳖甲

157. 
patient tongue id: 03021258034638_4
label yaofang:
法半夏 前胡 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.979176 0.98473 0.664621 0.928676 0.490313 0.700202 0.599312 0.980528 0.972102 0.969281 0.977046 0.956272 0.829431 0.646964 0.730677 0.670047 0.930974 0.396477
predicted yaofang:
法半夏 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄 炒苍耳子

158. 
patient tongue id: 01211216530312_2
label yaofang:
茯苓 龙骨 牡蛎 麦冬 党参 酸枣仁 柏子仁 附子 干姜 炙甘草
0.760973 0.319694 0.764634 0.322199 0.39599 0.306892 0.662334
predicted yaofang:
茯苓 龙骨 党参 黄芪 酸枣仁 干姜 炙甘草

159. 
patient tongue id: 06031132104638_1_7
label yaofang:
桂枝 甘草 白芍 川芎 桃仁 黄芪 鸡血藤 生地黄 红花 赤芍 牛膝 天麻 威灵仙 木蝴蝶
0.813528 0.558843 0.511061 0.548975 0.322977 0.510594 0.616126 0.436525
predicted yaofang:
甘草 白芍 川芎 桃仁 丹参 红花 牛膝 天麻

160. 
patient tongue id: 03012006403838_4
label yaofang:
陈皮 法半夏 茯苓 黄芪 豆蔻 炙甘草 广藿香 麸炒白术 党参片 麸炒苍术 炒六神曲 甘松
0.580605 0.643023 0.864198 0.413642 0.425015 0.348488 0.922011 0.454768
predicted yaofang:
陈皮 法半夏 茯苓 防风 黄芪 豆蔻 炙甘草 广藿香

161. 
patient tongue id: 04112318500054_4
label yaofang:
麻黄 桂枝 白芍 法半夏 前胡 五味子 浙贝母 细辛 干姜 厚朴 款冬花 苦杏仁 炙甘草
0.388716 0.662606 0.729327 0.379264 0.566707 0.757552 0.675294 0.406502 0.533157 0.317369 0.865165
predicted yaofang:
桂枝 白芍 法半夏 前胡 浙贝母 细辛 干姜 款冬花 紫菀 苦杏仁 炙甘草

162. 
patient tongue id: 01312301217045_6_2
label yaofang:
甘草 法半夏 桔梗 党参 酸枣仁 丹参 浙贝母 牡丹皮 薤白 水蛭 瓜蒌皮 浮小麦 合欢花 麸炒枳壳
0.937839 0.370821 0.609518 0.405099 0.684519 0.459847 0.32849 0.629943 0.353157 0.311641
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 酸枣仁 丹参 浙贝母 天麻 浮小麦

163. 
patient tongue id: 02272218279158_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 补骨脂 麦芽 百合 紫苏叶
0.331788 0.52935 0.30944 0.650565 0.765194 0.366467 0.324759
predicted yaofang:
甘草 枳壳 黄芪 白术 砂仁 麦芽 紫苏叶

164. 
patient tongue id: 06132154043375_1_4
label yaofang:
柴胡 大枣 茯苓 防风 连翘 太子参 昆布 海藻 乌梅 桑叶 石斛 白花蛇舌草 浮小麦 猫爪草 山慈菇
0.452225 0.332414 0.557364 0.339762 0.336099 0.379618
predicted yaofang:
甘草 柴胡 茯苓 太子参 生地黄 浮小麦

165. 
patient tongue id: 02201755030112_1_4
label yaofang:
陈皮 法半夏 茯苓 海螵蛸 干姜 豆蔻 炙甘草 广藿香 麸炒白术 党参片 麸炒苍术 炙黄芪 炒六神曲 甘松
0.746454 0.700563 0.825949 0.31435 0.389372 0.432283 0.357529 0.301018 0.574659 0.942123 0.594264
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 干姜 紫菀 白前 豆蔻 炙甘草 广藿香

166. 
patient tongue id: 06062305528235_5_7
label yaofang:
甘草 金银花 丹参 玄参 红花 延胡索 牡丹皮 细辛 天麻 鳖甲 忍冬藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989234 0.302232 0.378524 0.454515 0.357784 0.342701 0.97963 0.884741 0.854601 0.678974 0.77974 0.841688
predicted yaofang:
甘草 桃仁 党参 丹参 生地黄 红花 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

167. 
patient tongue id: 05201925429684_5_1
label yaofang:
桂枝 甘草 大枣 竹茹 生牡蛎 石膏 浙贝
0.594003
predicted yaofang:
甘草

168. 
patient tongue id: 02182257533049_1_2_7
label yaofang:
甘草 桃仁 党参 鸡血藤 白术 酸枣仁 生地黄 天麻 菟丝子 糯稻根 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.998927 0.354807 0.335913 0.89029 0.686399 0.667172 0.450803 0.969717 0.91639 0.960667 0.839088 0.871309 0.882174 0.337466
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

169. 
patient tongue id: 06031047394681_1_2_7
label yaofang:
甘草 白芍 木香 薏苡仁 党参 牡丹皮 郁金 山药 鳖甲 莪术 虎杖 蜈蚣 白花蛇舌 天山雪莲 龙葵果
0.996107 0.787341 0.903031 0.318429 0.37152 0.69601 0.587972 0.882596 0.59225 0.893482 0.661512 0.669176
predicted yaofang:
甘草 薏苡仁 党参 白术 郁金 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲

170. 
patient tongue id: 05152106551307_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草 山慈菇
0.65038 0.413201 0.59993 0.774295 0.794055 0.636193 0.300459 0.699865
predicted yaofang:
甘草 香附 茯苓 党参 白术 海螵蛸 砂仁 紫苏梗

171. 
patient tongue id: 05261952114880_1_4_7
label yaofang:
陈皮 当归 茯苓 半夏 黄芪 枸杞子 白术 山药 菟丝子 鸡内金 紫苏子 炙甘草 首乌藤 紫苏叶 黑枣
0.498329 0.571627 0.890504 0.591524 0.389687 0.941245 0.936942 0.322334 0.510223 0.350154 0.322759 0.585534 0.302132
predicted yaofang:
陈皮 当归 茯苓 半夏 党参 黄芪 白术 杜仲 山药 厚朴 鸡内金 炙甘草 首乌藤

172. 
patient tongue id: 03231036155787_6_7
label yaofang:
甘草 白芍 川芎 香附 白术 丹参 牛膝 郁金 薤白 厚朴 砂仁 天麻 全蝎 瓜蒌皮 降香
0.944971 0.620234 0.7018 0.450784 0.481191 0.417594 0.625139
predicted yaofang:
甘草 白芍 白术 丹参 牛膝 郁金 天麻

173. 
patient tongue id: 02151818584876_1_4_7
label yaofang:
桂枝 桂枝 桂枝 龙骨 龙骨 龙骨 牡蛎 牡蛎 牡蛎 麦冬 麦冬 麦冬 党参 党参 党参 酸枣仁 酸枣仁 酸枣仁 五味子 五味子 五味子 熟地黄 熟地黄 熟地黄 火麻仁 火麻仁 火麻仁 苦参 苦参 苦参 炙甘草 炙甘草 炙甘草 黑枣 黑枣 黑枣
0.339302 0.350063 0.384064 0.40067 0.338768 0.562033 0.635195
predicted yaofang:
桂枝 当归 龙骨 牡蛎 麦冬 党参 炙甘草

174. 
patient tongue id: 02271253152246_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.874695 0.895427 0.825171 0.853677 0.758899 0.802677 0.780294 0.666282 0.814337 0.724363 0.648536 0.654521
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

175. 
patient tongue id: 01190643310777_2_6
label yaofang:
甘草 柴胡 白芍 川芎 茯苓 酸枣仁 生地黄 牛膝 山药 山茱萸 细辛 天麻 全蝎 菟丝子 桑寄生 益母草
0.986523 0.319789 0.919066 0.652639 0.796496 0.600973 0.636304 0.374819 0.489935 0.373105 0.688958 0.371357
predicted yaofang:
甘草 柴胡 白芍 川芎 茯苓 酸枣仁 生地黄 牛膝 山药 山茱萸 天麻 益母草

176. 
patient tongue id: 01140817402376_5
label yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 浙贝母 细辛 莱菔子 瓜蒌皮 款冬花 紫菀 枇杷叶 苦杏仁 黄芩片
0.861632 0.910504 0.769634 0.571051 0.779432 0.550195 0.370245 0.722813 0.60903 0.311788 0.50591
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 款冬花 紫菀 白前 苦杏仁

177. 
patient tongue id: 04201918516149_2_1
label yaofang:
白芍 川芎 当归 茯苓 太子参 黄芪 枸杞子 柏子仁 熟地黄 煅牡蛎 炙甘草 盐菟丝子 续断片 酒女贞子 煅龙骨 炒酸枣仁
0.306398 0.693525 0.547727 0.617133 0.582991 0.391233 0.677084 0.458133 0.343847 0.875502
predicted yaofang:
桂枝 白芍 川芎 当归 茯苓 太子参 黄芪 枸杞子 北沙参 炙甘草

178. 
patient tongue id: 05241954463133_2_6
label yaofang:
甘草 党参 酸枣仁 生地黄 黄柏 山药 山茱萸 桑叶 荆芥穗 地骨皮 菟丝子 糯稻根 银柴胡 淫羊藿 女贞子 龟甲
0.965435 0.527334 0.716711 0.557407 0.496961 0.496097 0.321662
predicted yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 山药 天麻

179. 
patient tongue id: 03022129573516_2_6
label yaofang:
甘草 白芍 牡蛎 玄参 天冬 柏子仁 川楝子 牛膝 茵陈 麦芽 赭石 浮小麦 龟甲
0.891239 0.502678 0.385328 0.306079
predicted yaofang:
甘草 白芍 党参 麦芽

180. 
patient tongue id: 01032112407541_6_7
label yaofang:
甘草 独活 白术 酸枣仁 天麻 益母草 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 骨碎补 乌梢蛇
0.995369 0.341467 0.692304 0.475331 0.961782 0.90326 0.953032 0.711614 0.829553 0.917199
predicted yaofang:
甘草 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

181. 
patient tongue id: 01130654133756_2_1_6
label yaofang:
甘草 桔梗 龙骨 桃仁 党参 酸枣仁 浙贝母 山茱萸 天麻 糯稻根 鳖甲 白花蛇舌 天山雪莲 半枝莲
0.993385 0.484392 0.657953 0.614191 0.523452 0.91988 0.891917 0.640172 0.784611 0.778699 0.595755
predicted yaofang:
甘草 桔梗 党参 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

182. 
patient tongue id: 03081816411947_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 柏子仁 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.396356 0.805627 0.639317 0.971369 0.305302 0.30217 0.710801 0.363318 0.361719 0.643655 0.760908 0.816361 0.359226 0.49125 0.871682 0.942467
predicted yaofang:
麻黄 桂枝 柴胡 白芍 香附 当归 牛蒡子 五味子 柏子仁 浙贝母 细辛 干姜 豆蔻 苦杏仁 姜半夏 炙甘草

183. 
patient tongue id: 04121836206568_1
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.715231 0.927722 0.334149 0.916202 0.784781 0.451955 0.642895 0.726771 0.886438 0.884593 0.904484 0.909346 0.823786 0.925345 0.786259 0.853592
predicted yaofang:
陈皮 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

184. 
patient tongue id: 05061437512906_6_5
label yaofang:
甘草 陈皮 茯苓 半夏 瓜蒌皮 川贝母 枇杷叶 夏枯草 北沙参 龙脷叶
0.494392 0.645605 0.463736
predicted yaofang:
甘草 茯苓 北沙参

185. 
patient tongue id: 03092002052317_4
label yaofang:
茯苓 葛根 麦冬 太子参 北沙参 百合 甘草片 木贼 干石斛
0.692728 0.551829 0.509814 0.599777
predicted yaofang:
茯苓 麦冬 太子参 北沙参

186. 
patient tongue id: 05112017269712_1_4_6
label yaofang:
党参 黄芪 枸杞子 熟地黄 杜仲 山药 山茱萸 当归尾 砂仁 炙甘草 茺蔚子 路路通
0.302501 0.687854 0.838538 0.367693 0.386272 0.717875 0.375944
predicted yaofang:
茯苓 党参 黄芪 白术 杜仲 山药 砂仁

187. 
patient tongue id: 06080123471129_4_1
label yaofang:
甘草 川芎 法半夏 茯苓 党参 白术 厚朴 天麻 鳖甲 蒺藜 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.998395 0.484746 0.786301 0.927622 0.738813 0.853193 0.918586 0.930531 0.688311 0.841978 0.794726 0.380102
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

188. 
patient tongue id: 03151848008043_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.532996 0.734812 0.52812 0.549197 0.754776 0.78856 0.537479 0.479897 0.54779 0.930034
predicted yaofang:
桂枝 白芍 牛蒡子 浙贝母 细辛 干姜 紫菀 苦杏仁 姜半夏 炙甘草

189. 
patient tongue id: 02231827583142_4_2
label yaofang:
麻黄 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 香薷 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子
0.83603 0.902533 0.863491 0.912896 0.657276 0.608369 0.871179 0.850164 0.66253 0.786269 0.672135 0.825874 0.648237 0.85658 0.496609 0.356851
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄 炒苍耳子

190. 
patient tongue id: 02151916068464_2_1
label yaofang:
法半夏 前胡 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.364839 0.961097 0.978009 0.353718 0.652855 0.617846 0.703393 0.460125 0.303501 0.961335 0.956728 0.960956 0.955082 0.659085 0.906003 0.572295 0.573088 0.786902 0.898678
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

191. 
patient tongue id: 01201940535619_1_2_6
label yaofang:
甘草 党参 山药 山茱萸 地黄 天麻 菟丝子 益智仁 益母草 金樱子 白花蛇舌草 蜈蚣 棉萆薢 醋鳖甲
0.981504 0.706824 0.720169 0.825368 0.447599 0.780748 0.363401 0.404519
predicted yaofang:
甘草 党参 山药 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

192. 
patient tongue id: 03151940332754_5_7
label yaofang:
桃仁 太子参 黄芪 白术 浙贝母 杜仲 白茅根 生半夏 砂仁 土鳖虫 合欢皮 山慈菇 蛇舌草 鲜龙葵果
0.833991 0.84646 0.337009 0.535946 0.625629 0.34393
predicted yaofang:
黄芪 白术 海螵蛸 浙贝母 砂仁 合欢皮

193. 
patient tongue id: 02272224553829_1
label yaofang:
陈皮 当归 党参 黄芪 鸡血藤 白术 升麻 北柴胡 炙甘草 山慈菇
0.414917 0.302302 0.797904 0.866703 0.731312 0.628647
predicted yaofang:
当归 茯苓 党参 黄芪 白术 炙甘草

194. 
patient tongue id: 02181635236970_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 黄连 乌梅 山药 干姜 麦芽 建曲 合欢花
0.974479 0.65509 0.793894 0.568374 0.907438 0.947477 0.670724 0.544301 0.48899
predicted yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 山药 麦芽

195. 
patient tongue id: 03020759122561_1_7
label yaofang:
甘草 白芍 茯苓 党参 生地黄 山药 山茱萸 厚朴 肉苁蓉 火麻仁 制川乌 天山雪莲 牛大力
0.978912 0.493558 0.72774 0.793192 0.647977 0.522238 0.507701
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药

196. 
patient tongue id: 05261929472402_5
label yaofang:
甘草 白芍 陈皮 桃仁 麦冬 党参 黄芪 丹参 红花 延胡索 牛膝 苏木 珍珠母 北沙参 浮小麦 威灵仙 宽筋藤
0.58034 0.367687 0.542429 0.795792 0.550737 0.435379 0.560365 0.322947
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝

197. 
patient tongue id: 03311652130497_6
label yaofang:
甘草 法半夏 龙齿 酸枣仁 柏子仁 栀子 淡豆豉 天麻 糯稻根 百合 紫苏叶 蜈蚣
0.764374 0.67042 0.561277
predicted yaofang:
甘草 天麻 蜈蚣

198. 
patient tongue id: 04222212283838_1_4
label yaofang:
陈皮 茯苓 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.761278 0.867019 0.762909 0.937165 0.683553 0.693393 0.346047 0.592559 0.917653 0.910724 0.902667 0.924176 0.647164 0.884757 0.745417 0.852503
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

199. 
patient tongue id: 01062333312019_1_4_7
label yaofang:
莱菔子 泽泻颗粒 丹参颗粒 夏枯草颗粒 牛膝颗粒 制何首乌颗粒 钩藤颗粒 盐车前子颗粒 决明子颗粒 燀桃仁天麻颗粒
0.38277 0.332172
predicted yaofang:
法半夏 炙甘草