threshold = 0.02

0. 
patient text:
胃痛暴作,恶寒喜暖,得温痛减,遇寒加重,口淡不渴,或喜热饮.
label yaofang:
麻黄 桂枝 芍药 甘草
0.0208168 0.0369954 0.056902 0.0258767 0.0413635 0.365735 0.105058 0.0347754 0.0574529 0.0257756
predicted yaofang:
桂枝 甘草 白芍 人参 炙甘草 生姜 大枣 茯苓 半夏 橘红

1. 
patient text:
胃脘疼痛,胀满据按,嗳腐吞酸,或呕吐不消化食物,其味腐臭,不思饮食,大便不爽,得矢气及便后稍舒.
label yaofang:
麻黄 桂枝 芍药 甘草
0.0879707 0.278673 0.0908167 0.0405463 0.0346815 0.0251721 0.0299085 0.0753154 0.0906024 0.0230963 0.0404297
predicted yaofang:
麻黄 桂枝 芍药 甘草 陈皮 生姜 大枣 茯苓 白术 杏仁 车前子

2. 
patient text:
头痛爆裂
label yaofang:
柴胡 白芍 川芎 香附 陈皮 枳壳 甘草
0.0389804 0.499609 0.0264501 0.207181 0.0396905 0.147659
predicted yaofang:
柴胡 白芍 川芎 香附 陈皮 枳壳

3. 
patient text:
头痛,眩晕
label yaofang:
柴胡 白芍 川芎 香附 陈皮 枳壳 甘草
0.42163 0.0765817 0.341504 0.0455397 0.0216228 0.0407849
predicted yaofang:
白芍 川芎 香附 陈皮 半夏 槟榔

4. 
patient text:
头痛,发热,鼻塞
label yaofang:
麻黄 桂枝 芍药 甘草
0.224069 0.0252557 0.105883 0.0994657 0.0203595 0.0292768 0.0294884 0.323502
predicted yaofang:
麻黄 桂枝 芍药 甘草 陈皮 半夏 五味子 麦门冬

5. 
patient text:
恶寒发热,无汗,或热势不高,鼻塞流涕,头痛身楚,,咳嗽痰白,咳痰无力,平素神疲体倦,乏力.
label yaofang:
人参 茯苓 甘草 苏叶 葛根 前胡 桔梗 半夏 橘红 枳壳 木香
0.0572299 0.0940986 0.0283157 0.0236125 0.0951244 0.036571 0.120912 0.0761859 0.0304932 0.168701 0.029445 0.0207943 0.0230253
predicted yaofang:
芍药 甘草 柴胡 黄芩 人参 茯苓 葛根 前胡 桔梗 橘红 木香 白术 细辛

6. 
patient text:
头痛,眼花,眩晕,
label yaofang:
龙骨 牡蛎
0.0906657 0.855135
predicted yaofang:
龙骨 牡蛎

7. 
patient text:
恶寒重,发热轻,无汗,头痛,肢体酸痛,鼻塞,喷嚏,流清涕,咳嗽
label yaofang:
荆芥 防风 羌活 柴胡 枳壳 桔梗 前胡 独活 川芎
0.0308575 0.0247223 0.071295 0.396761 0.0464663 0.0556419 0.0775223 0.0525532 0.0210771 0.0615226 0.0479005 0.0232634
predicted yaofang:
甘草 柴胡 川芎 枳壳 当归 前胡 桔梗 荆芥 防风 羌活 独活 黄芪

8. 
patient text:
恶寒发热,咳嗽,胸痛,咳时尤甚,咯吐白色黏痰,痰量由少渐多,呼吸不利,口干鼻燥
label yaofang:
金银花 连翘 薄荷 荆芥 豆豉 芦根 竹叶 桔梗 贝母 牛蒡子 前胡 甘草
0.0416232 0.0297507 0.0687734 0.0286479 0.182557 0.0425291 0.0455661 0.0894832 0.219036 0.0952039 0.0355904 0.03461 0.0424376
predicted yaofang:
甘草 前胡 桔梗 荆芥 金银花 连翘 薄荷 豆豉 芦根 竹叶 贝母 牛蒡子 荆芥穗

9. 
patient text:
身热转甚,时时振寒,继则壮热,咳嗽气急,胸满作痛,转侧不利,咳吐黄稠痰,或黄绿色痰,自觉喉间有腥味,口干咽燥,烦躁汗出
label yaofang:
薏苡仁 冬瓜仁 桃仁 桔梗 黄芩 金银花 鱼腥草 红藤 蒲公英 紫花地丁 甘草 芦根
0.0467882 0.0368416 0.0251951 0.0422976 0.0378273 0.1604 0.0318668 0.0352529 0.0721963 0.0435002 0.0357225 0.0329762 0.0693301 0.0503803 0.0713983 0.0728555
predicted yaofang:
黄芩 桔梗 芦根 薏苡仁 冬瓜仁 桃仁 鱼腥草 红藤 蒲公英 紫花地丁 黄连 栀子 黄柏 苇茎 生薏仁 冬瓜子

10. 
patient text:
咳吐大量脓痰,或如米粥,或痰血相兼,腥臭异常,有时咯血,胸中烦满而痛,甚则气喘不能卧,身热面赤,烦渴喜饮
label yaofang:
桔梗 金银花 贝母 薏苡仁 橘红 葶苈子 白及 甘草
0.0415545 0.0459095 0.0507826 0.0858011 0.0431238 0.0905266 0.0771081 0.238981 0.0416361 0.0255846 0.0359686
predicted yaofang:
甘草 桔梗 橘红 金银花 连翘 豆豉 芦根 竹叶 麦冬 生地黄 荆芥穗

11. 
patient text:
身热渐退,咳嗽减轻,咯吐脓血渐少,臭味亦减,痰液转为清稀,精神渐振,食欲改善,或见胸胁隐痛,难以久卧,气短乏力,自汗,盗汗,低热,午后潮热,心烦,口干咽燥,面色不华,形瘦神疲
label yaofang:
沙参 麦冬 玉竹 党参 太子参 黄芪 当归 贝母 冬瓜仁
0.0210175 0.0227859 0.0285158 0.0436476 0.160986 0.0584676 0.289667 0.096811 0.163491 0.0220087
predicted yaofang:
甘草 当归 贝母 冬瓜仁 沙参 麦冬 玉竹 党参 太子参 黄芪

12. 
patient text:
心悸不宁,善惊易恐,坐卧不宁,少寐多梦,易惊醒,恶闻声响,食少纳呆
label yaofang:
人参 茯苓 茯神 菖蒲 姜志远 龙齿
0.0253321 0.0343064 0.0948018 0.564216 0.14104
predicted yaofang:
人参 茯神 菖蒲 姜志远 龙齿

13. 
patient text:
心悸气短,头晕目眩,少寐多梦,健忘,思虑劳心则甚,神疲乏力,纳呆食少,腹胀便溏,口唇色淡,面色无华,
label yaofang:
人参 白术 甘草 当归 黄芪 远志 酸枣仁 茯神 龙眼肉 木香 生姜 大枣
0.0725729 0.0221846 0.116033 0.117402 0.0488033 0.0638259 0.0933906 0.110511 0.0641263 0.0714442
predicted yaofang:
甘草 黄芩 人参 生姜 大枣 当归 木香 黄芪 白术 龙眼肉

14. 
patient text:
心悸易惊,心烦失眠,形体消瘦,五心烦热,口干盗汗,头晕目眩,耳鸣,急躁易怒,腰酸酸软,小便短黄,大便干结
label yaofang:
人参 丹参 玄参 远志 茯苓 五味子 桔梗 天冬 麦冬 酸枣仁 柏子仁 朱砂 甘草 黄连 当归 生地黄
0.0292463 0.0327806 0.0206284 0.0245873 0.259942 0.0457848 0.0234158 0.0436369 0.209764 0.163038
predicted yaofang:
甘草 人参 当归 沙参 麦冬 枸杞子 丹参 玄参 天冬 生地黄

15. 
patient text:
心悸不宁,胸闷气短,自汗,动则尤甚,形寒肢冷,喜温,或伴心痛,面色㿠白
label yaofang:
桂枝 甘草 牡蛎 龙骨 人参 熟附子 生姜 大枣
0.0417317 0.0448971 0.070904 0.0625189 0.0965971 0.0429258 0.197632 0.184941 0.0524255 0.0358483
predicted yaofang:
桂枝 甘草 人参 生姜 大枣 当归 龙骨 牡蛎 熟附子 熟地黄

16. 
patient text:
心悸,胸闷痞满,渴不欲饮,肢面浮肿,尿少,甚者咳喘,不能平卧,眩晕,呕恶流涎,形寒肢冷
label yaofang:
茯苓 桂枝 白术 甘草
0.091453 0.0633973 0.040021 0.0659303 0.0240326 0.124758 0.020027 0.0368893 0.198312 0.0308045 0.0357093 0.0379614
predicted yaofang:
桂枝 甘草 陈皮 人参 当归 茯苓 连翘 黄芪 白术 杏仁 飞滑石 白蔻仁

17. 
patient text:
心悸,胸闷,心痛时作,痛如针刺,心悸日久不愈,面色晦暗,唇甲青紫.或兼神疲乏力,少气懒言,或兼形寒肢冷,或兼两胁胀痛,善太息
label yaofang:
红花 当归 桃仁 香附 延胡索 赤芍 川芎 乳香 丹参 青皮 熟地黄 桂枝 甘草 牡蛎 龙骨
0.0350551 0.0297665 0.0458478 0.0528353 0.0694088 0.0250984 0.0286171 0.0895463 0.0681248 0.0439101 0.0249469 0.0293596 0.0635105 0.0961334 0.0908818 0.0273373
predicted yaofang:
桂枝 甘草 川芎 香附 陈皮 当归 茯苓 龙骨 牡蛎 桃仁 丹参 红花 延胡索 赤芍 青皮 熟地黄

18. 
patient text:
颈前喉结两旁结块肿大,质软不痛,颈部觉胀,胸闷,喜太息,或胸胁窜痛,病情常随情志波动
label yaofang:
昆布 海藻 海带 海螵蛸 海蛤壳 青木香 陈皮
0.0265703 0.0262219 0.187609 0.266299 0.451043
predicted yaofang:
昆布 海藻 海带 海蛤壳 青木香

19. 
patient text:
心悸时发时止,受惊易作,胸闷胀满,痰多呕恶,易怒烦躁,失眠多梦,口干口苦,大便秘结,小便短赤
label yaofang:
半夏 茯苓 陈皮 甘草 枳实 竹茹 黄连 大枣
0.0472488 0.0254835 0.0452151 0.0579458 0.0538817 0.278102 0.0644301 0.154273 0.0255216 0.030374
predicted yaofang:
甘草 陈皮 茯苓 半夏 麦冬 黄连 枳实 竹茹 黄柏 橘皮
