threshold = 0.015

0. 
patient text:
胃痛暴作,恶寒喜暖,得温痛减,遇寒加重,口淡不渴,或喜热饮.
label yaofang:
麻黄 桂枝 芍药 甘草
0.0869908 0.0510805 0.092823 0.0159676 0.0806574 0.0171763 0.0154387 0.0346169 0.112616 0.0312689 0.0485507 0.0575703 0.0409678 0.0662684 0.0498472
predicted yaofang:
桂枝 甘草 陈皮 炙甘草 茯苓 半夏 羌活 白术 槟榔 附子 泽泻 车前子 大腹皮 赤小豆 猪苓

1. 
patient text:
胃脘疼痛,胀满据按,嗳腐吞酸,或呕吐不消化食物,其味腐臭,不思饮食,大便不爽,得矢气及便后稍舒.
label yaofang:
麻黄 桂枝 芍药 甘草
0.0785149 0.145636 0.136392 0.0392517 0.0185664 0.0178598 0.0539078 0.0358994 0.02145 0.0369476 0.0294179 0.0396115 0.0444497 0.0364076 0.0161501 0.0262375 0.0154214 0.0190396 0.0176128
predicted yaofang:
麻黄 桂枝 芍药 甘草 炙甘草 生姜 当归 茯苓 半夏 桃仁 黄芪 赤芍 熟地黄 牡丹皮 黄柏 附子 山茱萸 细辛 大黄

2. 
patient text:
头痛爆裂
label yaofang:
柴胡 白芍 川芎 香附 陈皮 枳壳 甘草
0.0281855 0.200161 0.451158 0.0169485 0.0156912 0.126212 0.0499226
predicted yaofang:
甘草 柴胡 白芍 川芎 枳壳 贝母 猪苓

3. 
patient text:
头痛,眩晕
label yaofang:
柴胡 白芍 川芎 香附 陈皮 枳壳 甘草
0.0460513 0.246008 0.026365 0.0850731 0.145732 0.209262 0.034357 0.0412198 0.0158256 0.0156151 0.0173383
predicted yaofang:
甘草 柴胡 白芍 川芎 香附 枳壳 赤芍药 木通 泽泻 大黄 猪苓

4. 
patient text:
头痛,发热,鼻塞
label yaofang:
麻黄 桂枝 芍药 甘草
0.22199 0.250543 0.140253 0.0864416 0.0383881 0.0260167 0.023748 0.0295394 0.0288149 0.0286631
predicted yaofang:
麻黄 桂枝 芍药 甘草 柴胡 枳壳 龙骨 白术 杏仁 猪苓

5. 
patient text:
恶寒发热,无汗,或热势不高,鼻塞流涕,头痛身楚,,咳嗽痰白,咳痰无力,平素神疲体倦,乏力.
label yaofang:
人参 茯苓 甘草 苏叶 葛根 前胡 桔梗 半夏 橘红 枳壳 木香
0.133614 0.0176503 0.023687 0.0850664 0.0460075 0.0270223 0.0284039 0.0252 0.0484625 0.047716 0.0734775 0.114832 0.109259 0.0232152 0.105081 0.0344135
predicted yaofang:
甘草 柴胡 陈皮 枳壳 人参 生姜 大枣 当归 茯苓 苏叶 葛根 前胡 桔梗 半夏 橘红 木香

6. 
patient text:
头痛,眼花,眩晕,
label yaofang:
龙骨 牡蛎
0.0843504 0.908992
predicted yaofang:
龙骨 牡蛎

7. 
patient text:
恶寒重,发热轻,无汗,头痛,肢体酸痛,鼻塞,喷嚏,流清涕,咳嗽
label yaofang:
荆芥 防风 羌活 柴胡 枳壳 桔梗 前胡 独活 川芎
0.0703536 0.034895 0.0277474 0.0171053 0.119674 0.0236855 0.0241601 0.0619962 0.116279 0.127677 0.106089 0.0745171 0.0279625 0.0293649
predicted yaofang:
川芎 枳壳 当归 前胡 桔梗 龙骨 荆芥 防风 羌活 独活 桃仁 红花 牛膝 大蓟

8. 
patient text:
恶寒发热,咳嗽,胸痛,咳时尤甚,咯吐白色黏痰,痰量由少渐多,呼吸不利,口干鼻燥
label yaofang:
金银花 连翘 薄荷 荆芥 豆豉 芦根 竹叶 桔梗 贝母 牛蒡子 前胡 甘草
0.0243084 0.0163215 0.0178914 0.0636143 0.0227663 0.0980332 0.176606 0.0235637 0.0640098 0.123024 0.169206 0.0417768 0.0777027
predicted yaofang:
甘草 茯苓 前胡 桔梗 荆芥 金银花 连翘 薄荷 豆豉 芦根 竹叶 牛蒡子 荆芥穗

9. 
patient text:
身热转甚,时时振寒,继则壮热,咳嗽气急,胸满作痛,转侧不利,咳吐黄稠痰,或黄绿色痰,自觉喉间有腥味,口干咽燥,烦躁汗出
label yaofang:
薏苡仁 冬瓜仁 桃仁 桔梗 黄芩 金银花 鱼腥草 红藤 蒲公英 紫花地丁 甘草 芦根
0.0803486 0.0538414 0.0394631 0.032834 0.0214043 0.0361514 0.11062 0.0213309 0.0257058 0.0773285 0.111312 0.0162447 0.0860395 0.0152621 0.0499129 0.019167 0.0190736
predicted yaofang:
甘草 黄芩 当归 桔梗 金银花 薏苡仁 冬瓜仁 鱼腥草 红藤 蒲公英 紫花地丁 白术 黄连 栀子 黄柏 生薏仁 冬瓜子

10. 
patient text:
咳吐大量脓痰,或如米粥,或痰血相兼,腥臭异常,有时咯血,胸中烦满而痛,甚则气喘不能卧,身热面赤,烦渴喜饮
label yaofang:
桔梗 金银花 贝母 薏苡仁 橘红 葶苈子 白及 甘草
0.0689061 0.02482 0.0372342 0.075296 0.175456 0.0814225 0.0151909 0.0196759 0.208282 0.0306223 0.0717178 0.0268237
predicted yaofang:
甘草 茯苓 桔梗 橘红 金银花 连翘 豆豉 芦根 竹叶 贝母 薏苡仁 荆芥穗

11. 
patient text:
身热渐退,咳嗽减轻,咯吐脓血渐少,臭味亦减,痰液转为清稀,精神渐振,食欲改善,或见胸胁隐痛,难以久卧,气短乏力,自汗,盗汗,低热,午后潮热,心烦,口干咽燥,面色不华,形瘦神疲
label yaofang:
沙参 麦冬 玉竹 党参 太子参 黄芪 当归 贝母 冬瓜仁
0.0885135 0.0155093 0.0750429 0.182695 0.0679407 0.27841 0.080619 0.095118 0.055177
predicted yaofang:
当归 贝母 冬瓜仁 沙参 麦冬 玉竹 党参 太子参 黄芪

12. 
patient text:
心悸不宁,善惊易恐,坐卧不宁,少寐多梦,易惊醒,恶闻声响,食少纳呆
label yaofang:
人参 茯苓 茯神 菖蒲 姜志远 龙齿
0.682139 0.131624 0.125188
predicted yaofang:
菖蒲 姜志远 龙齿

13. 
patient text:
心悸气短,头晕目眩,少寐多梦,健忘,思虑劳心则甚,神疲乏力,纳呆食少,腹胀便溏,口唇色淡,面色无华,
label yaofang:
人参 白术 甘草 当归 黄芪 远志 酸枣仁 茯神 龙眼肉 木香 生姜 大枣
0.041844 0.0445221 0.03816 0.0918196 0.0482257 0.0284149 0.0781072 0.0163249 0.0158542 0.0715099 0.0161505 0.166715 0.0435812 0.0240256 0.0683628 0.0208089 0.0348381 0.0262319 0.0185074
predicted yaofang:
甘草 白芍 人参 生姜 大枣 当归 茯苓 半夏 橘红 木香 黄芪 白术 远志 酸枣仁 龙眼肉 熟地黄 枳实 肉桂 大黄

14. 
patient text:
心悸易惊,心烦失眠,形体消瘦,五心烦热,口干盗汗,头晕目眩,耳鸣,急躁易怒,腰酸酸软,小便短黄,大便干结
label yaofang:
人参 丹参 玄参 远志 茯苓 五味子 桔梗 天冬 麦冬 酸枣仁 柏子仁 朱砂 甘草 黄连 当归 生地黄
0.0175024 0.0445808 0.0369028 0.0441416 0.0534067 0.0294934 0.296851 0.304182 0.0501926 0.0212063
predicted yaofang:
甘草 麦冬 远志 酸枣仁 丹参 五味子 天冬 柏子仁 朱砂 黄连

15. 
patient text:
心悸不宁,胸闷气短,自汗,动则尤甚,形寒肢冷,喜温,或伴心痛,面色㿠白
label yaofang:
桂枝 甘草 牡蛎 龙骨 人参 熟附子 生姜 大枣
0.0730311 0.0623341 0.0186033 0.0504022 0.215198 0.108729 0.0162335 0.0493835 0.0211199 0.119283 0.0152675 0.0545942
predicted yaofang:
桂枝 甘草 黄芩 人参 生姜 大枣 当归 茯苓 龙骨 牡蛎 白术 熟附子

16. 
patient text:
心悸,胸闷痞满,渴不欲饮,肢面浮肿,尿少,甚者咳喘,不能平卧,眩晕,呕恶流涎,形寒肢冷
label yaofang:
茯苓 桂枝 白术 甘草
0.0786205 0.0675208 0.016682 0.0227828 0.0180887 0.024668 0.196476 0.026544 0.159089 0.131453 0.0153638
predicted yaofang:
甘草 陈皮 人参 生姜 大枣 当归 茯苓 半夏 木香 白术 附子

17. 
patient text:
心悸,胸闷,心痛时作,痛如针刺,心悸日久不愈,面色晦暗,唇甲青紫.或兼神疲乏力,少气懒言,或兼形寒肢冷,或兼两胁胀痛,善太息
label yaofang:
红花 当归 桃仁 香附 延胡索 赤芍 川芎 乳香 丹参 青皮 熟地黄 桂枝 甘草 牡蛎 龙骨
0.0155949 0.0163216 0.0818819 0.066839 0.0337793 0.0610139 0.0257424 0.043911 0.0206819 0.0450002 0.125697 0.0881259 0.114411 0.0501332 0.0243074 0.0363176
predicted yaofang:
桂枝 甘草 川芎 香附 枳壳 当归 茯苓 桃仁 党参 红花 延胡索 赤芍 熟地黄 苍术 山茱萸 泽泻

18. 
patient text:
颈前喉结两旁结块肿大,质软不痛,颈部觉胀,胸闷,喜太息,或胸胁窜痛,病情常随情志波动
label yaofang:
昆布 海藻 海带 海螵蛸 海蛤壳 青木香 陈皮
0.0411631 0.109004 0.108985 0.0598397 0.244459 0.125936 0.273657
predicted yaofang:
陈皮 昆布 海藻 海带 海螵蛸 海蛤壳 青木香

19. 
patient text:
心悸时发时止,受惊易作,胸闷胀满,痰多呕恶,易怒烦躁,失眠多梦,口干口苦,大便秘结,小便短赤
label yaofang:
半夏 茯苓 陈皮 甘草 枳实 竹茹 黄连 大枣
0.0370904 0.0498922 0.0176369 0.118426 0.19493 0.0352405 0.0559073 0.274784 0.0186679 0.0199687
predicted yaofang:
甘草 陈皮 生姜 茯苓 半夏 白术 黄连 枳实 大黄 厚朴