threshold = 0.02

0. 
patient text:
胃痛暴作，恶寒喜暖，得温痛减，遇寒加重；口淡不渴，或喜热饮
label yaofang:
麻黄 桂枝 芍药 甘草
0.0342445 0.02184 0.0274512 0.0261236 0.0248604 0.0603203 0.0373733 0.0313383 0.0401698 0.0311048 0.0385416 0.0226034 0.0401458
predicted yaofang:
甘草 白芍 生姜 大枣 当归 茯苓 半夏 生地黄 附子 肉桂 泽泻 干姜 高良姜

1. 
patient text:
胃脘疼痛，胀满据按，嗳腐吞酸，或呕吐不消化食物，其味腐臭，不思饮食；大便不爽，得矢气及便后稍舒
label yaofang:
麻黄 桂枝 芍药 甘草
0.0361472 0.0566664 0.0420243 0.0353233 0.0732032 0.0260423 0.032757 0.0242811 0.0578983 0.0211078 0.0328188 0.0314964 0.0223026
predicted yaofang:
甘草 陈皮 人参 茯苓 半夏 木香 杜仲 牛膝 神曲 山楂 莱菔子 桑寄生 益母草

2. 
patient text:
头痛爆裂
label yaofang:
柴胡 白芍 川芎 香附 陈皮 枳壳 甘草
0.0484964 0.0214642 0.0230083 0.0280052 0.0409115 0.0849193 0.0295883 0.0458207 0.025964 0.0254884 0.0362456
predicted yaofang:
甘草 连翘 竹叶 麦冬 丹参 大黄 滑石 丹皮 灯心 元参 苇根

3. 
patient text:
头痛，眩晕
label yaofang:
柴胡 白芍 川芎 香附 陈皮 枳壳 甘草
0.0519711 0.0545426 0.0287079 0.0379882 0.0266815 0.0271506 0.0268462 0.0284228 0.0284611 0.0811871 0.0404481 0.0552764 0.0206319 0.0798854
predicted yaofang:
甘草 黄芩 茯苓 半夏 麦冬 黄连 枳实 知母 石膏 大黄 青蒿 芒硝 滑石 丹皮

4. 
patient text:
头痛，发热，鼻塞
label yaofang:
麻黄 桂枝 芍药 甘草
0.28953 0.0715823 0.0630852 0.03811 0.0873803 0.0701536
predicted yaofang:
麻黄 甘草 半夏 玉竹 杏仁 桑白皮

5. 
patient text:
恶寒发热，无汗，或热势不高，鼻塞流涕，头痛身楚，咳嗽痰白，咳痰无力，平素神疲体倦，乏力
label yaofang:
人参 茯苓 甘草 苏叶 葛根 前胡 桔梗 半夏 橘红 枳壳 木香
0.0297497 0.0696565 0.0211148 0.0295003 0.0249713 0.0276357 0.0340101 0.0208292 0.048316 0.0227193
predicted yaofang:
桂枝 甘草 陈皮 人参 生姜 大枣 茯苓 葛根 半夏 郁金

6. 
patient text:
头痛，眼花，眩晕
label yaofang:
龙骨 牡蛎
0.0279464 0.18574 0.0342726 0.0283359 0.04975 0.0561585 0.0204278
predicted yaofang:
桂枝 甘草 人参 当归 荆芥 白术 菊花

7. 
patient text:
恶寒重，发热轻，无汗，头痛，肢体酸痛；鼻塞，喷嚏，流清涕，咳嗽
label yaofang:
荆芥 防风 羌活 柴胡 枳壳 桔梗 前胡 独活 川芎
0.0333494 0.0270085 0.0433409 0.0299367 0.0246161 0.0349982 0.0299545 0.0821595 0.0890779 0.0700875
predicted yaofang:
黄芩 橘红 麦冬 杏仁 生石膏 花粉 生草 蔗汁 苏梗 广皮

8. 
patient text:
恶寒发热，咳嗽，胸痛，咳时尤甚；咯吐白色黏痰，痰量由少渐多，呼吸不利，口干鼻燥
label yaofang:
金银花 连翘 薄荷 荆芥 豆豉 芦根 竹叶 桔梗 贝母 牛蒡子 前胡 甘草
0.068097 0.0280645 0.0279411 0.0202765 0.0458629 0.0952753 0.0299929 0.0363519 0.0244687
predicted yaofang:
桔梗 金银花 竹叶 生地黄 杏仁 荆芥穗 瓜蒌皮 川贝母 枇杷叶

9. 
patient text:
身热转甚，时时振寒，继则壮热，咳嗽气急，胸满作痛，转侧不利，咳吐黄稠痰，或黄绿色痰，自觉喉间有腥味；口干咽燥，烦躁汗出
label yaofang:
薏苡仁 冬瓜仁 桃仁 桔梗 黄芩 金银花 鱼腥草 红藤 蒲公英 紫花地丁 甘草 芦根
0.0316831 0.0440014 0.0275989 0.0402355 0.0502987 0.0407762 0.0775526 0.0287543 0.0418198 0.025496 0.0239457 0.0376782 0.0381009 0.0365351 0.0268098 0.0443182
predicted yaofang:
甘草 黄芩 麦冬 黄连 熟地黄 栀子 杜仲 黄柏 牛膝 山药 山茱萸 钩藤 泽泻 桑寄生 苇茎 生薏仁

10. 
patient text:
咳吐大量脓痰，或如米粥，或痰血相兼，腥臭异常；有时咯血，胸中烦满而痛，甚则气喘不能卧，身热面赤，烦渴喜饮
label yaofang:
桔梗 金银花 贝母 薏苡仁 橘红 葶苈子 白及 甘草
0.0944568 0.0218147 0.042151 0.05917 0.0239726 0.0214928 0.0542108 0.0358622 0.020266 0.0201631
predicted yaofang:
甘草 人参 当归 桔梗 连翘 生地黄 知母 大黄 地骨皮 芒硝

11. 
patient text:
身热渐退，咳嗽减轻，咯吐脓血渐少，臭味亦减，痰液转为清稀；精神渐振，食欲改善，或见胸胁隐痛，难以久卧，气短乏力，自汗，盗汗，低热，午后潮热，心烦，口干咽燥，面色不华，形瘦神疲
label yaofang:
沙参 麦冬 玉竹 党参 太子参 黄芪 当归 贝母 冬瓜仁
0.0359268 0.0228738 0.0431172 0.0361791 0.094149 0.179729 0.0446729
predicted yaofang:
甘草 当归 茯苓 防风 冬瓜仁 太子参 黄芪

12. 
patient text:
心悸不宁，善惊易恐，坐卧不宁；少寐多梦，易惊醒，恶闻声响，食少纳呆
label yaofang:
人参 茯苓 茯神 菖蒲 远志 龙齿
0.0585506 0.0203074 0.0281842 0.050902 0.0718192 0.0208495 0.0216627 0.0298389 0.0276613 0.0290278 0.0302613 0.0347637 0.0212784
predicted yaofang:
甘草 白芍 当归 竹叶 贝母 麦冬 枳实 粳米 杏仁 大黄 厚朴 西洋参 旋覆

13. 
patient text:
心悸气短，头晕目眩，少寐多梦，健忘，思虑劳心则甚；神疲乏力，纳呆食少，腹胀便溏；口唇色淡，面色无华
label yaofang:
人参 白术 甘草 当归 黄芪 远志 酸枣仁 茯神 龙眼肉 木香 生姜 大枣
0.0217251 0.065932 0.0205027 0.0399693 0.0221477 0.0340445 0.0565026 0.0244601 0.0379945
predicted yaofang:
桂枝 甘草 陈皮 茯苓 前胡 半夏 麦冬 白术 北沙参

14. 
patient text:
心悸易惊，心烦失眠，形体消瘦，五心烦热，口干盗汗；头晕目眩，耳鸣，急躁易怒，腰酸酸软，小便短黄，大便干结
label yaofang:
人参 丹参 玄参 远志 茯苓 五味子 桔梗 天冬 麦冬 酸枣仁 柏子仁 朱砂 甘草 黄连 当归 生地黄
0.0381962 0.0910475 0.0233318 0.0480889 0.0267093 0.0209308 0.0235757 0.124659 0.0473588 0.0783469 0.0223554
predicted yaofang:
麻黄 甘草 黄芩 茯苓 半夏 荆芥 金银花 沙参 麦冬 玉竹 杏仁

15. 
patient text:
心悸不宁，胸闷气短，自汗，动则尤甚；形寒肢冷，喜温，或伴心痛；面色㿠白
label yaofang:
桂枝 甘草 牡蛎 龙骨 人参 熟附子 生姜 大枣
0.0343961 0.0276804 0.0204454 0.0284602 0.0235042 0.0660525 0.0489987 0.0353884 0.0270878 0.026039 0.0323543 0.027726 0.0225614 0.0390862 0.0243865
predicted yaofang:
甘草 人参 当归 茯苓 茯神 远志 黄芪 枸杞子 白术 龙眼肉 熟地黄 杜仲 山药 山茱萸 菟丝子

16. 
patient text:
心悸，胸闷痞满，渴不欲饮，肢面浮肿，尿少，甚者咳喘，不能平卧；眩晕，呕恶流涎，形寒肢冷
label yaofang:
茯苓 桂枝 白术 甘草
0.0594442 0.0330981 0.0537047 0.072255 0.0677051 0.13926 0.0466617 0.0235922 0.0277356
predicted yaofang:
甘草 陈皮 人参 茯苓 半夏 木香 黄芪 沉香 神曲

17. 
patient text:
心悸，胸闷，心痛时作，痛如针刺；心悸日久不愈，面色晦暗，唇甲青紫。或兼神疲乏力，少气懒言；或兼形寒肢冷；或兼两胁胀痛，善太息
label yaofang:
红花 当归 桃仁 香附 延胡索 赤芍 川芎 乳香 丹参 青皮 熟地黄 桂枝 甘草 牡蛎 龙骨
0.0247317 0.0355168 0.0697079 0.0271118 0.0532598 0.0328773 0.0379586 0.0481837 0.066476 0.024238 0.0358485 0.0228045 0.0309769
predicted yaofang:
桔梗 连翘 薄荷 芦根 贝母 黄柏 桑叶 滑石 丹皮 羚羊角 象贝 花粉 藕

18. 
patient text:
颈前喉结两旁结块肿大，质软不痛，颈部觉胀；胸闷，喜太息，或胸胁窜痛，病情常随情志波动
label yaofang:
昆布 海藻 海带 海螵蛸 海蛤壳 青木香 陈皮
0.0248174 0.0403907 0.0264271 0.0264269 0.115345 0.0927748 0.0278163 0.192763 0.0433648 0.0234578
predicted yaofang:
木香 党参 昆布 海藻 海带 海螵蛸 海蛤壳 青木香 牛膝 细辛

19. 
patient text:
心悸时发时止，受惊易作；胸闷胀满，痰多呕恶，易怒烦躁，失眠多梦，口干口苦；大便秘结，小便短赤
label yaofang:
半夏 茯苓 陈皮 甘草 枳实 竹茹 黄连 大枣
0.0746076 0.0949871 0.0233918 0.0284545 0.0247878 0.0256646 0.0312336 0.0532391 0.0785002 0.023037 0.0286654
predicted yaofang:
甘草 黄芩 茯苓 蒲公英 沙参 麦冬 玉竹 黄连 枳实 神曲 大黄

20. 
patient text:
颈前喉结两旁结块肿大，按之较硬或有结节，肿块经久不消；胸闷，纳差
label yaofang:
海藻 昆布 海带 青皮 陈皮 半夏 胆南星 浙贝母 连翘 当归 川芎
0.0201043 0.0204754 0.0210096 0.0239496 0.147698 0.1477 0.0952495 0.0899765 0.0567631
predicted yaofang:
甘草 川芎 陈皮 木香 昆布 海藻 海带 胆南星 浙贝母

21. 
patient text:
心悸时发时止，受惊易作；胸闷胀满，痰多呕恶，易怒烦躁，失眠多梦，口干口苦；大便秘结，小便短赤
label yaofang:
黄连 半夏 橘皮 生姜 竹茹 枳实 甘草
0.0746076 0.0949871 0.0233918 0.0284545 0.0247878 0.0256646 0.0312336 0.0532391 0.0785002 0.023037 0.0286654
predicted yaofang:
甘草 黄芩 茯苓 蒲公英 沙参 麦冬 玉竹 黄连 枳实 神曲 大黄

22. 
patient text:
颈前喉结两旁轻度或中度肿大，一般柔软光滑；烦热汗出，急躁易怒，眼球突出，手指颤抖，面部烘热，口苦咽干，多食易饥
label yaofang:
柴胡 当归 白芍 栀子 牡丹皮 牛蒡子 生牡蛎 浙贝母 玄参
0.0618581 0.0801753 0.0369365 0.0434791 0.0239904 0.0313678 0.0451408 0.0938427 0.0774566 0.0376369 0.0422013
predicted yaofang:
甘草 人参 生姜 大枣 当归 茯苓 半夏 黄芪 白术 熟地黄 附子

23. 
patient text:
健忘失眠，心悸神倦；纳呆气短，脘腹胀满
label yaofang:
人参 白术 甘草 当归 黄芪 远志 酸枣仁 茯神 龙眼肉 木香 生姜 大枣
0.0230132 0.0231876 0.0594283 0.0429029 0.0213102 0.049981 0.0294315 0.0256013 0.0244831 0.0220956 0.0264801 0.0510329
predicted yaofang:
甘草 枳壳 黄芩 半夏 连翘 麦冬 枳实 麦门冬 知母 神曲 姜汁 川连

24. 
patient text:
颈前喉结两旁结块或大或小，质软，病起缓慢；心悸不宁，心烦少寐，易出汗，手指颤动，眼干，目眩，倦怠乏力
label yaofang:
生地黄 沙参 玄参 麦冬 天冬 人参 茯苓 枸杞子 当归 丹参 酸枣仁 柏子仁 五味子 远志 川楝子
0.0230415 0.0205725 0.0231885 0.0299086 0.0643329 0.0473163 0.109253 0.0243033 0.0223799 0.0845959 0.0271293
predicted yaofang:
甘草 白芍 当归 党参 熟地黄 杜仲 牛膝 附子 肉桂 山药 山茱萸

25. 
patient text:
健忘，形体疲惫，精神不振；腰酸腿软，头晕耳鸣，遗精早泄，五心烦热
label yaofang:
紫河车 熟地黄 杜仲 天门冬 麦门冬 龟板 黄柏 牛膝
0.0848988 0.0455146 0.0608377 0.0305306 0.0248075 0.0323457 0.0624421
predicted yaofang:
甘草 半夏 麦冬 黄芪 粳米 杏仁 蔗汁

26. 
patient text:
寒战壮热，休作有时，先有哈欠乏力，继则寒栗鼓颔，寒罢则内外皆热；头痛面赤，口渴引饮，终则遍身汗出，热退身凉
label yaofang:
柴胡 半夏 人参 甘草 黄芩 生姜 大枣 常山 槟榔 乌梅
0.0282879 0.0230514 0.0254853 0.0207401 0.0334983 0.0967051
predicted yaofang:
茯苓 橘红 连翘 附子 生甘草 枇杷叶

27. 
patient text:
健忘嗜卧，困倦；头晕胸闷，呕恶，咳吐痰涎
label yaofang:
枳实 竹茹 半夏 陈皮 茯苓 甘草 生姜 大枣
0.0286376 0.0212652 0.0712977 0.0338507 0.0427507 0.0204936 0.0742481 0.0215206 0.0348745 0.0328277
predicted yaofang:
香附 陈皮 茯苓 木香 桃仁 党参 红花 赤芍 桑寄生 朱茯神

28. 
patient text:
热多寒少，汗出不畅；头痛，骨节酸疼，口渴引饮，便秘尿赤
label yaofang:
知母 粳米 石膏 甘草 桂枝
0.0977517 0.0373519 0.0406369 0.0863739 0.0238893 0.0248625 0.0222939 0.0236085 0.0220573 0.100627
predicted yaofang:
甘草 陈皮 人参 茯苓 橘红 黄芪 杏仁 瓜蒌 厚朴 地骨皮

29. 
patient text:
遇事善忘，心悸胸闷；伴言语迟缓，神思欠敏，表现呆钝，面唇暗红或黧黑
label yaofang:
当归 生地黄 桃仁 红花 枳壳 赤芍药 柴胡 甘草 桔梗 牛膝 川芎
0.031403 0.0274362 0.0233479 0.0310604 0.0235897 0.0738734 0.0215415 0.0399872 0.0345284 0.0220414 0.0203171 0.0707904
predicted yaofang:
甘草 当归 茯苓 麦冬 枸杞子 生地黄 熟地黄 牡丹皮 龟板 山药 升麻 冬桑叶

30. 
patient text:
多形体壮实，多由精神刺激引发，突然昏倒，不省人事；口噤拳握，呼吸气粗，或四肢厥冷
label yaofang:
乌药 沉香 槟榔 枳实 木香
0.0250567 0.0410024 0.0213213 0.0232712 0.0291834 0.0319654 0.0467882 0.0389425
predicted yaofang:
甘草 白芍 茯苓 龙眼肉 牛膝 姜汁 生白芍 白芥子

31. 
patient text:
精神抑郁，表情淡漠，沉默痴呆，时时太息，言语无序；或喃喃自语，多疑多虑，喜怒无常，秽洁不分，不思饮食
label yaofang:
半夏 陈皮 胆南星 茯苓 甘草 生姜 枳实 木香 香附
0.0381705 0.0408816 0.0278822 0.081922 0.14841 0.0243029 0.0201874 0.0203625 0.0235122 0.0508077
predicted yaofang:
甘草 白芍 陈皮 茯苓 半夏 栀子 黄柏 附子 泽泻 莱菔子

32. 
patient text:
精神抑郁，情绪不宁，喜太息；胁肋胀痛，痛无定处，女子月事不调或经前乳胀；胸部满闷，脘闷嗳气，不思饮食，大便不调
label yaofang:
柴胡 香附 枳壳 陈皮 川芎 芍药 甘草
0.0202997 0.0451049 0.0202276 0.0565933 0.0235003 0.0912929 0.0913539 0.0913665 0.0913013
predicted yaofang:
沙参 麦冬 黄连 栀子 枇杷叶 兰草 橄榄 地栗 海蜇

33. 
patient text:
头晕目眩，突然昏仆，不省人事；面色苍白，呼吸微弱，汗出肢冷
label yaofang:
人参 炮姜 甘草 附子
0.0906855 0.0534257 0.0239566 0.0325547 0.0689604 0.0665451 0.0228878 0.0251276 0.0225536 0.0372594 0.041484 0.0409976
predicted yaofang:
甘草 陈皮 黄芩 人参 茯苓 半夏 橘红 辰砂 冬瓜子 淡芩 羚羊片 佩兰叶

34. 
patient text:
性情急躁易怒，胸胁胀满，口苦而干；或头痛、目赤、耳鸣；或胃脘灼痛，嘈杂吞酸，大便秘结
label yaofang:
柴胡 薄荷 郁金 制香附 当归 白芍 白术 茯苓 牡丹皮 栀子
0.0311724 0.0228796 0.0276195 0.0322066 0.0320086 0.0209999 0.0201275 0.0244734 0.0235805 0.0426089 0.0241512 0.0628665
predicted yaofang:
甘草 陈皮 黄芩 当归 茯苓 桃仁 沙参 麦冬 白术 生地黄 红花 栀子

35. 
patient text:
精神抑郁，胸部闷塞，胁肋胀满；咽中如有物梗塞，吞之不下，咯之不出
label yaofang:
黄连 半夏 橘皮 生姜 竹茹 枳实 甘草
0.047328 0.0613847 0.061496 0.0319598 0.0462498 0.034334 0.0238382 0.0356953 0.0266981 0.0238453 0.0276652 0.0336988 0.0212012
predicted yaofang:
甘草 柴胡 陈皮 黄芩 人参 当归 茯苓 半夏 桃仁 麦冬 肉桂 山楂 川连

36. 
patient text:
神思恍惚，魂梦颠倒，心悸易惊，善悲欲哭；肢体困乏，饮食锐减，言语无序
label yaofang:
黄芪 人参 茯苓 甘草 当归 茯神 远志 柏子仁 酸枣仁 五味子 川芎 半夏曲 肉桂 川芎 香附 苍术 神曲 栀子
0.0453288 0.033219 0.0363821 0.0331862 0.0269912 0.0388745 0.0699438 0.0246402 0.046005
predicted yaofang:
白芍 枳壳 法半夏 大枣 桃仁 青皮 乌药 沉香 郁金

37. 
patient text:
精神抑郁，性情急躁；头痛，失眠，健忘；胸胁胀痛，或呈刺痛且痛有定处，或身体某部有发冷发热感
label yaofang:
石膏 知母 地黄 麦冬 牛膝 大蓟 小蓟 白茅根 藕节
0.0327094 0.0592772 0.0306983 0.0377179 0.0321171 0.0418339 0.0212001 0.0219919 0.0277838 0.0382157
predicted yaofang:
桂枝 甘草 柴胡 香附 陈皮 茯苓 贝母 牡丹皮 苍术 泽泻

38. 
patient text:
精神恍惚，心神不宁，多疑易惊，悲忧善哭，喜怒无常；时时欠伸，或手舞足蹈，骂詈喊叫等多种症状
label yaofang:
甘草 小麦 大枣
0.0295448 0.0364973 0.0351496 0.0202488 0.0233152 0.0228617 0.0357896 0.0215477 0.0222152 0.0209356 0.0450323 0.0228619 0.0290107 0.0496126
predicted yaofang:
甘草 陈皮 茯苓 半夏 木香 葶苈子 玉竹 白术 竹茹 沉香 龙胆草 大腹皮 石斛 山栀

39. 
patient text:
多思善疑，心悸胆怯，失眠，健忘；腹胀，纳差，便溏；头晕神疲，面色不华
label yaofang:
人参 白术 黄芪 甘草 当归 白芍 酸枣仁 龙眼肉 远志 茯神 木香
0.0451068 0.0363433 0.0220882 0.0771813 0.036793 0.0253058 0.0422216 0.0634 0.0430705 0.0270316 0.0229079 0.0777416 0.0240623
predicted yaofang:
甘草 白芍 当归 茯苓 半夏 木香 沙参 麦冬 玉竹 黄连 生地黄 石斛 橘白络

40. 
patient text:
精神抑郁，情绪不宁，沉默痴呆；善怒易哭、时时太息、胁胀
label yaofang:
陈皮 柴胡 枳壳 芍药 甘草 香附 川芎
0.0370899 0.0442829 0.0387431 0.040811 0.0300017 0.0258729 0.0208315 0.0411447 0.208085
predicted yaofang:
白芍 川芎 香附 当归 茯苓 木香 生地黄 红花 地龙

41. 
patient text:
情绪不宁，心悸；健忘，失眠，多梦，五心烦热，盗汗，口咽干燥
label yaofang:
生地黄 天冬 麦冬 玄参 人参 茯苓 五味子 当归 柏子仁 酸枣仁 远志 丹参 甘草
0.0794827 0.0432927 0.0398598 0.0241139 0.0236346 0.0453606 0.0759839 0.0316401
predicted yaofang:
甘草 人参 熟地 半夏 阿胶 白术 五味子 泽泻

42. 
patient text:
情绪不宁，急躁易怒；眩晕，耳鸣，目干畏光，视物不明，或头痛且胀，面红目赤，或肢体麻木
label yaofang:
石膏 知母 地黄 麦冬 牛膝 大蓟 小蓟 白茅根 藕节
0.038521 0.0237915 0.0452687 0.0276154 0.0335753 0.0283984 0.0245831 0.0280718 0.0307319 0.0266836 0.0381608
predicted yaofang:
甘草 陈皮 半夏 连翘 菖蒲 麦冬 白术 附子 姜 巴戟天 枣

43. 
patient text:
起病急骤，二目怒视，狂暴无知，面红目赤，言语杂乱，骂詈叫号，不避亲疏；性情急躁，或毁物伤人，或哭笑无常。头痛失眠，渴喜冷饮，便秘尿赤
label yaofang:
生铁落 钩藤 胆星 贝母 茯苓 橘红 菖蒲 远志 辰砂 茯神 天冬 麦冬 丹参 玄参 连翘
0.0397145 0.0210224 0.0256236 0.131376 0.0307699 0.0302793 0.0305874 0.0244629 0.0235138 0.0208268 0.0318353
predicted yaofang:
甘草 黄芩 麦冬 知母 木通 大黄 厚朴 生地 滑石 元参 山栀子仁

44. 
patient text:
心悸气短，胸闷胸痛；发热，恶风，全身酸痛，神疲乏力，咽喉肿痛，咳嗽，口干渴
label yaofang:
金银花 连翘 薄荷 荆芥 豆豉 芦根 竹叶 桔梗 贝母 牛蒡子 前胡 甘草
0.0211866 0.0411308 0.0270245 0.0280902 0.0358699 0.0320539 0.0378765 0.0354975 0.0308067
predicted yaofang:
甘草 茯苓 桔梗 半夏 橘红 杏仁 姜汁 款冬花 枇杷叶

45. 
patient text:
鼻燥衄血，口干咽燥；或兼有身热，恶风，头痛，咳嗽，痰少等症
label yaofang:
桑叶 菊花 薄荷 连翘 桔梗 杏仁 甘草 芦根 牡丹皮 白茅根 旱莲草 侧柏叶
0.0360039 0.0429742 0.0248257 0.0400197 0.0514426 0.0423466 0.0357955 0.0293095 0.0233948 0.0452297 0.0431222 0.0240195 0.0399458 0.0617314
predicted yaofang:
甘草 川芎 枳壳 当归 茯苓 党参 白术 生地黄 牡丹皮 黄柏 牛膝 细辛 泽泻 木瓜

46. 
patient text:
猝然心痛如绞，或心痛彻背，重则喘息不能平卧；形寒肢冷，面色苍白，冷汗自出，心悸气短；气候骤冷或骤遇风寒而发病或加重
label yaofang:
瓜蒌 薤白 白酒 当归 桂枝 芍药 细辛 甘草 通草 大枣
0.045406 0.192244 0.0315614 0.0201906 0.0209904 0.0327523 0.04152 0.0242892 0.0449781
predicted yaofang:
桂枝 甘草 人参 生姜 大枣 茯苓 白术 杏仁 生白芍

47. 
patient text:
胸部刺痛，固定不移，入夜尤甚；或见胸胁胀痛，善太息，遇情志不遂时容易诱发或加重；时见心悸不宁
label yaofang:
当归 生地黄 桃仁 红花 枳壳 赤芍药 柴胡 甘草 桔梗 牛膝 川芎
0.0651115 0.0905188 0.0489342 0.0283572 0.0250504 0.0462342 0.02301 0.0292298 0.0857106 0.0493081
predicted yaofang:
麻黄 桂枝 甘草 茯苓 黄芪 枸杞子 白术 熟地黄 山药 山茱萸

48. 
patient text:
鼻衄，或兼齿衄，血色鲜红；口渴欲饮，鼻干，口干臭秽，烦躁，便秘
label yaofang:
石膏 知母 地黄 麦冬 牛膝 大蓟 小蓟 白茅根 藕节
0.0680013 0.0711163 0.025517 0.0292661 0.0561351 0.0275301 0.0690828 0.0285423 0.0563468 0.0305673 0.0412118
predicted yaofang:
麻黄 甘草 陈皮 黄芩 茯苓 苏叶 半夏 枳实 杏仁 桑白皮 苏子

49. 
patient text:
情绪焦虑、紧张，时而躁动；心烦易躁，失眠多梦，精神疲惫，形瘦面红，心悸健忘，五心烦热
label yaofang:
生地黄 麦冬 枣仁 生甘草 玄参 茯苓 黄连 木通 灯心草 竹叶
0.0243346 0.06192 0.0307175 0.0461529 0.0469293 0.0376764 0.0260291 0.0225909 0.0330528 0.0301876 0.0325211
predicted yaofang:
桂枝 甘草 白芍 人参 茯苓 半夏 黄芪 白术 粳米 枸杞 曲

50. 
patient text:
胸闷重而心痛微，或痛引肩背，气短喘促，遇阴雨天易发作；肢体沉重，形体肥胖，倦怠乏力，纳呆便溏，咳嗽痰多，口粘恶心
label yaofang:
瓜蒌 薤白 白酒 半夏 制南星 陈皮 枳实 茯苓 人参 石菖蒲 竹茹 甘草 生姜
0.04998 0.0292003 0.0704661 0.0211576 0.0223445 0.0374592 0.0223655 0.0264631 0.0607036 0.0215182 0.259636 0.0240435
predicted yaofang:
甘草 陈皮 茯苓 白术 枳实 知母 杏仁 大腹皮 厚朴 藿香 地骨皮 紫苏

51. 
patient text:
心胸隐痛，时作时休，心悸气短，动则益甚，伴疲倦乏力，声息低微，面色㿠白，易汗出；心悸，手足心热，面潮红，口干
label yaofang:
人参 麦冬 五味子 黄芪 熟地黄 当归 白芍 白术 茯苓 甘草 陈皮 远志 桂心
0.0437275 0.0218473 0.0224927 0.0321398 0.0234976 0.0290477 0.0307747
predicted yaofang:
甘草 白芍 当归 独活 黄连 熟地黄 牛膝

52. 
patient text:
鼻衄，头痛，目眩；耳鸣，烦躁易怒，两目红赤，口苦
label yaofang:
龙胆草 柴胡 栀子 黄芩 木通 泽泻 车前子 生地黄 当归 甘草 白茅根 蒲黄 大蓟 小蓟 藕节
0.0439916 0.0290854 0.0373384 0.0493206 0.1063 0.0578013 0.196197 0.0308765
predicted yaofang:
甘草 柴胡 人参 当归 粳米 大黄 芒硝 甘菊

53. 
patient text:
胸闷痛或灼痛，心悸虚烦不寐，盗汗，腰膝酸软，耳鸣，或头晕目眩；胸憋闷刺痛，或面部烘热，汗多，善太息，胁肋胀痛
label yaofang:
人参 丹参 玄参 远志 茯苓 五味子 桔梗 天冬 麦冬 当归 生地黄 酸枣仁 柏子仁 朱砂 熟地黄 山茱萸 山药 泽泻 牡丹皮
0.0538408 0.0229643 0.0296481 0.0219037 0.0209351 0.0214299 0.0498321 0.0864112 0.0623444
predicted yaofang:
甘草 当归 茯苓 半夏 贝母 生地黄 枳实 钩藤 厚朴

54. 
patient text:
躁扰不安，多言多语；面色晦滞，胸胁满痛，头痛心烦，或呆滞少语，妄见妄闻，或妇人经期腹痛，经血紫黯
label yaofang:
桃仁 柴胡 香附 木通 赤芍 半夏 大腹皮 青皮 陈皮 桑白皮 苏子 甘草 蟅虫 干姜 干大黄 水蛭 芍药 杏仁 黄芩 虻虫 蛴螬 大黄 桃仁 甘草
0.0625569 0.0260283 0.0727227 0.0420909 0.043046
predicted yaofang:
天麻 麝香 石决明 桑寄生 全瓜蒌

55. 
patient text:
热少寒多，口不渴，神疲体倦；胸脘痞闷
label yaofang:
柴胡 黄芩 桂枝 干姜 甘草 常山 草果 槟榔 厚朴 青皮 陈皮
0.0206308 0.0202025 0.0541781 0.0214176 0.0649417 0.0200537 0.0470641 0.0222571 0.0221526 0.0651011 0.0222346
predicted yaofang:
甘草 熟地 熟地黄 川楝子 龟板 神曲 山药 山茱萸 旋覆花 丹皮 萸肉

56. 
patient text:
热甚寒微，或壮热不寒；头痛，肢体烦疼，面红目赤，胸闷呕吐，烦渴饮冷，大便秘结，小便热赤，甚至神昏谵语
label yaofang:
黄芩 黄连 知母 柴胡 青蒿 常山 竹茹 枳实 半夏 陈皮 茯苓 益元散
0.0385146 0.121994 0.0278899 0.0324751 0.0221871 0.0368088 0.0249765 0.0403022 0.0200521
predicted yaofang:
麻黄 甘草 陈皮 人参 当归 茯苓 半夏 玉竹 天花粉

57. 
patient text:
狂证久治不愈，神志恍惚，多言善惊，心烦易怒，躁扰不寐；面红形瘦，口干舌燥
label yaofang:
党参 白术 茯苓 甘草 知母 黄柏 熟地黄 龟板 猪脊髓
0.0818578 0.0250913 0.043426 0.0481036 0.0214487 0.131304 0.0447645
predicted yaofang:
甘草 白芍 当归 生地黄 黄柏 大黄 西洋参

58. 
patient text:
胸闷痛，气短，遇寒加重。心悸，胸闷气短，动则更甚，自汗，腰酸乏力，畏寒肢冷，唇甲淡白，面色㿠白；或胸痛掣背，四肢厥冷，唇色紫黯，脉微欲绝，或动则气喘，不能平卧，面浮足肿
label yaofang:
人参 熟附子 生姜 大枣 熟地黄 山药 山茱萸 枸杞 甘草 杜仲 肉桂 附子
0.0483294 0.0265041 0.0317489 0.0205785 0.0505171 0.0388143 0.0539521 0.0289019
predicted yaofang:
甘草 白芍 当归 茯苓 防风 太子参 黄芪 郁金

59. 
patient text:
寒甚热微，或但寒不热；或呕吐腹泻，甚则神昏不语
label yaofang:
苍术 厚朴 陈皮 甘草 藿香 半夏 佩兰 荷叶 槟榔 草果 菖蒲
0.0496369 0.136014 0.0937087 0.047894 0.0204058 0.0339435 0.0259993 0.068498 0.0264308
predicted yaofang:
甘草 人参 生姜 大枣 当归 独活 黄芪 白术 干姜

60. 
patient text:
突然昏倒，不省人事；牙关紧闭，面赤唇紫
label yaofang:
当归尾 红花 山楂 香附 乌药 青皮 木香 泽泻
0.0557626 0.0287449 0.0583713 0.024388 0.0245847 0.0296563 0.0485506 0.0340984 0.0265918 0.0543895 0.0858209 0.025836 0.0218019 0.0376413
predicted yaofang:
甘草 人参 熟地 茯苓 半夏 连翘 牛蒡子 玉竹 白术 五味子 麦门冬 石斛 升麻 山栀

61. 
patient text:
鼻衄，或兼齿衄、肌衄；神疲乏力，面色㿠白，头晕，耳鸣，心悸，夜寐不宁
label yaofang:
党参 茯苓 白术 甘草 当归 黄芪 酸枣仁 远志 龙眼肉 木香 阿胶 仙鹤草 茜草
0.0200914 0.0933873 0.0433911 0.0353248 0.021134 0.126612 0.0408101 0.0524505 0.0211777 0.0486417 0.0284558 0.0305263
predicted yaofang:
桂枝 甘草 柴胡 陈皮 黄芩 茯苓 半夏 党参 黄芪 白术 栀子 大黄

62. 
patient text:
不寐多梦，性情急躁；不思饮食，口渴喜饮，头胀头晕，目赤耳鸣，口舌生疮口苦，便秘溲赤
label yaofang:
龙胆草 柴胡 栀子 黄芩 木通 泽泻 车前子 生地黄 当归 甘草 白茅根 蒲黄 大蓟 小蓟 藕节
0.0649056 0.0266921 0.0247034 0.131186 0.0306666 0.307154 0.0347287
predicted yaofang:
麻黄 甘草 陈皮 茯苓 杏仁 瓜蒌 厚朴

63. 
patient text:
寒热时作，倦怠乏力，短气懒言，遇劳则复发疟疾；食少，面色萎黄，形体消瘦
label yaofang:
人参 何首乌 当归 陈皮 生姜
0.0342464 0.046725 0.0222861 0.024825 0.0600256 0.0438473 0.0225821 0.0369413 0.0371725 0.0474312 0.0252103 0.0299936
predicted yaofang:
白芍 茯苓 半夏 阿胶 枸杞子 熟地黄 生牡蛎 黄柏 山药 山茱萸 泽泻 旋覆花

64. 
patient text:
发病前常有眩晕、头昏、胸闷、乏力痰多；无明显症状，突然仆倒，不省人事，面色潮红，牙关紧闭，两目上视，四肢抽搐，口吐涎沫；或喉中痰鸣或发怪叫，移时苏醒，一如常人
label yaofang:
柴胡 薄荷 麦冬 栀子 黄连 龙胆草 茯神 钩藤 甘草 木通 竹叶 朱砂
0.0204211 0.0210502 0.0236071 0.0208073 0.021461 0.0251534 0.0364539 0.0398825
predicted yaofang:
桔梗 生地黄 牡丹皮 细辛 补骨脂 白茯苓 冬瓜子 炙甘草

65. 
patient text:
心悸头晕，或眼前发黑，昏厥无知；面色苍白，口唇不华，目陷口张，自汗肤冷，气息低微，或四肢震颤
label yaofang:
人参 人参 甘草 黄芪 当归 白芍 熟地 桂心 大枣 白术 茯苓 五味子 远志 陈皮
0.0257231 0.0286931 0.047208 0.0248458 0.031616 0.0389925 0.0358123 0.0262188 0.0799861 0.0281239 0.0207308
predicted yaofang:
茯苓 半夏 荆芥 杏仁 瓜蒌皮 枇杷叶 粉草 粉前胡 光杏仁 象山贝 嫩勾尖

66. 
patient text:
突然头晕眩仆，或因原有咳喘发作严重，一时痰浊上涌，不能咯出；喉中痰鸣，呼吸急促，胸闷纳呆，或呕吐痰涎
label yaofang:
半夏 陈皮 枳实 茯苓 甘草 制南星 生姜
0.0431061 0.0265101 0.0330433 0.0264597 0.0240507 0.034351 0.0248987 0.0391347 0.0215424
predicted yaofang:
甘草 茯苓 桔梗 半夏 连翘 豆豉 牡丹皮 杏仁 车前子

67. 
patient text:
齿衄，血色鲜红；齿龈红肿疼痛，头痛，口臭
label yaofang:
生地黄 牡丹皮 水牛角 大黄 黄连 黄芩 连翘 当归 甘草 白茅根 大蓟 小蓟 藕节
0.0220534 0.0683561 0.0356546 0.0313778 0.0235628 0.0204287 0.0472412 0.0406753 0.0301849 0.0244791 0.0314607 0.0209543 0.0204908 0.0240996 0.0327674 0.0203786
predicted yaofang:
麻黄 甘草 陈皮 枳壳 黄芩 当归 茯苓 苏叶 木香 黄芪 白术 槟榔 神曲 山药 杏仁 淡豆豉

68. 
patient text:
面色晦暗青灰而黄，手足清冷，双眼半开半合，昏愦，拘急；或抽搐时作，口吐涎沫，一般口不啼叫；或声音微小，仅为呆木无知，不闻不见，不动不语，动作中断，手中物体落地；或头突然向前倾下，又迅速抬起；或目上吊数秒乃数分钟即可恢复；病发后对上述症状全然不知，多一日频作十数次或数十次，醒后周身乏力，或如常人
label yaofang:
桃仁 柴胡 香附 木通 赤芍 半夏 大腹皮 青皮 陈皮 桑白皮 苏子 甘草 蟅虫 干姜 干大黄 水蛭 芍药 杏仁 黄芩 虻虫 蛴螬 大黄 桃仁 甘草
0.0447118 0.0208159 0.036794 0.028313 0.0319753 0.0454886 0.0388493 0.0590918 0.0692796 0.0257156 0.0906849
predicted yaofang:
半夏 橘红 连翘 薄荷 芦根 桑叶 杏仁 生甘草 枇杷叶 花粉 川石斛

69. 
patient text:
外感热病中，猝然耳鸣、耳聋或伴有耳内作痒；头痛恶风或有发热，骨节酸痛等表证
label yaofang:
金银花 连翘 甘草 荆芥穗 豆豉 桔梗 竹叶 芦根
0.0229528 0.0230997 0.0210815 0.0264129 0.0390172 0.0286194 0.0292743 0.0255765 0.0235769 0.0305055
predicted yaofang:
甘草 白芍 陈皮 法半夏 薤白 生甘草 竹沥 象贝 羚角 鲜霍斛

70. 
patient text:
齿衄，血色淡红；起病较缓，常因受热及烦劳而诱发，齿摇不坚
label yaofang:
熟地黄 山药 山茱萸 茯苓 牡丹皮 泽泻 茜草根 黄芩 侧柏叶 阿胶
0.024243 0.023559 0.0536474 0.049003 0.0433944 0.0307759 0.0486875 0.0806148 0.0622389 0.0292894 0.0380153 0.0249272
predicted yaofang:
白芍 川芎 当归 桃仁 枸杞子 生地黄 红花 赤芍 熟地黄 山药 菟丝子 冬桑叶

71. 
patient text:
急躁易怒，心烦失眠，咯痰不爽，口苦咽干，便秘溲黄；病发后，症状加重，甚则彻夜难眠，目赤
label yaofang:
龙胆草 黄芩 栀子 泽泻 木通 车前子 当归 生地黄 柴胡 生甘草
0.038163 0.0340252 0.0282402 0.0209973 0.0623489 0.0716203 0.0889922 0.0551223 0.0625973 0.0570323 0.0717983
predicted yaofang:
桂枝 甘草 人参 当归 黄芪 枸杞子 白术 肉桂 山药 泽泻 芡实

72. 
patient text:
不寐心烦，头重目眩；痰多胸闷，口苦嗳气，吞酸恶心，或大便秘结
label yaofang:
半夏 茯苓 陈皮 甘草 枳实 竹茹 黄连 大枣
0.0307746 0.0456156 0.0323942 0.0321587 0.0487198 0.0211771 0.0272368 0.0200834 0.0891532 0.025517 0.0344928
predicted yaofang:
桂枝 白芍 香附 当归 茯苓 半夏 枸杞子 白术 生地黄 肉桂 冰糖

73. 
patient text:
喉痒咳嗽，痰中带血；口干鼻燥，或有身热
label yaofang:
桑叶 栀子 淡豆豉 沙参 梨皮 贝母 杏仁 白茅根 茜草 藕节 侧柏叶
0.0390652 0.0365339 0.0503544 0.0371993 0.0349667 0.0322312 0.0240424 0.0394137 0.0241822 0.0221689 0.0341285 0.0395655 0.0241294
predicted yaofang:
甘草 陈皮 茯苓 半夏 连翘 薄荷 竹叶 石膏 苍术 杏仁 厚朴 青蒿 丹皮

74. 
patient text:
暴饮暴食后，突然昏厥；气息窒塞，脘腹胀满
label yaofang:
盐汤 苍术 陈皮 厚朴 甘草 藿香 砂仁 山楂 神曲 半夏 茯苓 陈皮 连翘 莱菔子
0.0200891 0.0774309 0.0756215 0.041784 0.0225294 0.0422829 0.0277109 0.0337415 0.0423628 0.183951 0.0355846
predicted yaofang:
桂枝 甘草 白芍 人参 茯苓 半夏 白术 枳实 麦门冬 粳米 大黄

75. 
patient text:
心烦不寐，头晕心悸；腰酸膝软，耳鸣，健忘，口干津少，潮热盗汗，五心烦热，男子梦遗，女子月经不调
label yaofang:
熟地黄 山茱萸 山药 泽泻 牡丹皮 茯苓 黄连 肉桂
0.0294253 0.0497922 0.0397028 0.0205432 0.0588364 0.0921522 0.020498 0.0295824 0.0210867 0.0207547
predicted yaofang:
甘草 白芍 茯苓 枳实 乌药 郁金 半夏曲 泽泻 大黄 厚朴

76. 
patient text:
猝然耳鸣、耳聋，头痛面赤、口苦咽干；心烦易怒，怒则鸣聋更甚，胸胁胀痛，大便秘结，夜寐不宁
label yaofang:
龙胆草 黄芩 木通 泽泻 车前子 柴胡 栀子 当归 生地黄 甘草
0.0547388 0.0381676 0.0497821 0.0350267 0.0238389 0.0247413 0.025653
predicted yaofang:
甘草 白芍 当归 茯苓 麦冬 红花 竹茹

77. 
patient text:
梦多易醒，心悸健忘；头晕目眩，胸脘满闷，纳食无味，肢倦神疲，面色少华
label yaofang:
人参 白术 甘草 当归 黄芪 远志 酸枣仁 茯神 龙眼肉 木香 生姜 大枣
0.0695337 0.073289 0.0404511 0.0275902 0.0249975 0.0295798 0.0572206 0.0476609 0.0203622
predicted yaofang:
桂枝 芍药 甘草 白芍 人参 大枣 当归 生地黄 秦艽

78. 
patient text:
发病前常有眩晕、头昏、胸闷、乏力痰多，心情不悦；痫病发作呈多样性，或见突然跌倒，神志不清，双目发呆，茫然所失，谈话中断，持物落地，或精神恍惚而无抽搐
label yaofang:
天麻 川贝 胆南星 半夏 茯苓 茯神 丹参 麦冬 菖蒲 远志 全蝎 僵蚕 琥珀 辰砂
0.0312648 0.0418335 0.030915 0.0754879 0.0262893 0.030301 0.0327066 0.0437738 0.0212154 0.0214272
predicted yaofang:
白芍 陈皮 茯苓 半夏 栀子 粳米 沉香 芒硝 天花粉 炙甘草

79. 
patient text:
咳嗽阵作，痰中带血或纯血鲜红；胸胁胀痛，烦躁易怒，口苦
label yaofang:
青黛 黄芩 桑白皮 地骨皮 海蛤壳 甘草 旱莲草 白茅根 大小蓟
0.047378 0.0214948 0.0501357 0.0245145 0.0248903 0.0209445 0.0537382 0.0350449 0.139684 0.0394012 0.0219007
predicted yaofang:
甘草 人参 茯苓 麦冬 杏仁 车前子 桑白皮 地骨皮 紫菀 白前 枇杷叶

80. 
patient text:
不寐多梦，易于惊醒，胆怯心悸，遇事善惊；气短倦怠，自汗虚烦
label yaofang:
人参 茯苓 茯神 菖蒲 远志 龙齿 知母 川芎 甘草 酸枣仁
0.0484751 0.0367019 0.0204501 0.0469425 0.0223785 0.0214524 0.0334045 0.0847157 0.0406581 0.0236546 0.0234577
predicted yaofang:
甘草 白芍 陈皮 黄芩 茯苓 前胡 半夏 麦冬 枳实 大黄 川连

81. 
patient text:
汗出恶风，动则加重；易于感冒，体倦乏力，面色少华
label yaofang:
黄芪 白术 防风
0.0587471 0.0357983 0.0713072 0.0261916 0.0338276 0.0259824 0.0481929 0.0372554 0.0238017 0.0201497 0.0248663 0.058195
predicted yaofang:
甘草 柴胡 川芎 枳壳 人参 大枣 当归 茯苓 葛根 木香 防风 黄芪

82. 
patient text:
两耳蝉鸣，时轻时重，有时闭塞如聋；胸中烦闷，痰多、口苦
label yaofang:
陈皮 半夏 茯苓 竹茹 枳壳 甘草 生姜 大枣
0.0293 0.0318599 0.0244731 0.0260065 0.0711084 0.0250048 0.0203468 0.0246246 0.0218896 0.0217386
predicted yaofang:
甘草 白芍 黄芩 茯苓 半夏 茯神 神曲 钩藤 杏仁 天麻

83. 
patient text:
心胸刺痛，胸部闷窒，动则加重；气短无力，心悸汗出
label yaofang:
人参 黄芪 肉桂 当归 生地黄 桃仁 红花 枳壳 赤芍药 柴胡 甘草 桔梗 牛膝 川芎
0.0210507 0.0279602 0.0248176 0.0259424 0.026119 0.0207815 0.0275635 0.0241457 0.0282309 0.0438529
predicted yaofang:
陈皮 人参 半夏 防风 连翘 薄荷 黄芪 熟地黄 杜仲 山茱萸

84. 
patient text:
咳嗽痰少，痰中带血，或反复咳血，血色鲜红；口干咽燥，颧红，潮热盗汗
label yaofang:
麦冬 玄参 生地黄 熟地黄 当归 白芍 贝母 甘草 白及 藕节 白茅根 茜草
0.0205532 0.0303557 0.0227515 0.0222068 0.0454223 0.0248616 0.109125 0.0314025 0.0486069 0.0397727 0.0499448 0.0221812
predicted yaofang:
甘草 黄芩 黄连 生地黄 栀子 杜仲 牛膝 神曲 钩藤 桑寄生 益母草 夜交藤

85. 
patient text:
胸痛彻背，胸闷气短，心悸不宁；神疲乏力，形寒肢冷
label yaofang:
黄芪 当归
0.0507563 0.0738293 0.0371284 0.156994 0.0776367 0.026843 0.0435679 0.0930147 0.0578962
predicted yaofang:
甘草 人参 茯苓 黄芪 白术 五味子 熟地黄 山药 升麻

86. 
patient text:
腹痛拘急，得温痛减，遇寒痛甚；口淡不渴，形寒肢冷，小便清长，大便清稀或秘结
label yaofang:
高良姜 干姜 紫苏 乌药 香附 陈皮
0.0493704 0.026157 0.0371862 0.0612364 0.0381433 0.0482072 0.0219662 0.0283083 0.0342826 0.0283572
predicted yaofang:
甘草 陈皮 当归 茯苓 贝母 麦冬 鸡血藤 竹茹 车前子 砂仁

87. 
patient text:
耳鸣耳聋，久延难止；头晕目眩，腰酸遗精
label yaofang:
熟地黄 山茱萸 山药 泽泻 茯苓 牡丹皮 五味子 磁石
0.0535552 0.194978 0.0437272 0.0294495 0.0422069 0.0212259 0.0344148
predicted yaofang:
麦冬 橘皮 杏仁 青蒿 芡实 金樱子 丹皮

88. 
patient text:
心胸绞痛，胸中憋闷或有窒息感，喘促不宁，心悸；大汗淋漓，烦躁不安或表情淡漠，重则神智昏迷，口开目合，四肢厥冷，手撒尿遗；面色苍白
label yaofang:
附子 干姜 人参 甘草
0.0262655 0.0485137 0.0504602 0.0371705 0.0324393 0.0404815 0.143364 0.023448 0.0205052 0.0240493
predicted yaofang:
桂枝 甘草 当归 茯苓 白术 熟地黄 肉桂 山药 芒硝 秦艽

89. 
patient text:
吐血色红或紫黯，口苦胁痛；心烦易怒，寐少梦多
label yaofang:
龙胆草 柴胡 黄芩 栀子 泽泻 木通 车前子 生地黄 当归 白茅根 藕节 旱莲草 茜草
0.0291963 0.0211567 0.034931 0.0304934 0.0299857 0.0248057 0.0279084 0.0307194 0.0304991
predicted yaofang:
甘草 陈皮 人参 生姜 当归 半夏 茯神 黄连 竹茹

90. 
patient text:
吐血缠绵不止，时轻时重，血色暗淡；神疲乏力，心悸气短，面色苍白
label yaofang:
党参 茯苓 白术 甘草 当归 黄芪 木香 阿胶 仙鹤草 姜 白及 乌贼骨
0.0515593 0.0800226 0.0443708 0.033842 0.029814 0.0348765 0.0437971 0.0300206 0.0346292 0.0259754
predicted yaofang:
桂枝 甘草 茯苓 党参 枸杞子 白术 山药 山茱萸 大黄 银柴胡

91. 
patient text:
腹部胀痛，痞满拒按；口干，口苦，或身热，大便秘结，或溏滞不爽，小便黄赤
label yaofang:
大黄 芒硝 厚朴 枳实
0.024437 0.0383247 0.0441233 0.0558569 0.0250115 0.0288393 0.0262668 0.0232623 0.031417 0.022975 0.0415126 0.0598926 0.0285766 0.117016
predicted yaofang:
甘草 人参 当归 茯苓 木香 黄芪 白术 生地黄 熟地黄 栀子 附子 肉桂 山茱萸 泽泻

92. 
patient text:
耳鸣耳聋，久延难止；肢体酸软，腰冷畏寒，阳痿早泄
label yaofang:
肉苁蓉 菟丝子 巴戟天 羊肾 当归 人参 黄芪 干生地黄 石斛 附子 肉桂
0.0628444 0.0230418 0.0430124 0.0261455 0.0213075 0.0202382 0.0304808 0.0469886
predicted yaofang:
白芍 竹叶 生麦芽 归身 于术 吴萸 生谷芽 川桂枝

93. 
patient text:
烦渴多饮，口干舌燥
label yaofang:
黄连 天花粉 人乳汁 藕汁 生地 姜汁 蜂蜜
0.0671175 0.0272758 0.0386079 0.0327453 0.0210568 0.022442 0.0428503 0.0306592 0.0399077 0.0224177 0.0250939 0.0284204 0.0234275 0.109115
predicted yaofang:
甘草 柴胡 川芎 陈皮 黄芩 人参 茯苓 苏叶 半夏 防风 白术 杏仁 大黄 川贝

94. 
patient text:
耳鸣、耳聋，时轻时重；休息暂减，烦劳加重，倦怠乏力，神疲食少，大便易溏
label yaofang:
人参 黄芪 升麻 葛根 蔓荆子 黄柏 芍药
0.0431941 0.045788 0.082949 0.0209046 0.0280198 0.0241967 0.0296518 0.105603
predicted yaofang:
甘草 陈皮 茯苓 薏苡仁 黄芪 白术 肉桂 车前子

95. 
patient text:
便血色红黏稠；大便不畅或稀溏，或有腹痛，口苦
label yaofang:
地榆 茜草 槐角 栀子 黄芩 黄连 茯苓 防风 枳壳 当归
0.0343971 0.0225962 0.0651731 0.0214302 0.0413411 0.0657866 0.0780084 0.0557368 0.0313377 0.0396284 0.0283506
predicted yaofang:
麻黄 桂枝 甘草 陈皮 黄芩 茯苓 半夏 玉竹 枳实 杏仁 桑白皮

96. 
patient text:
便血色淡红或紫黯；食少，体倦，面色萎黄，心悸，少寐
label yaofang:
党参 茯苓 白术 甘草 当归 黄芪 酸枣仁 远志 龙眼肉 木香 阿胶 槐花 地榆 仙鹤草
0.241763 0.140421 0.0673874 0.0881526 0.0869507 0.0214931 0.0302158 0.0201023
predicted yaofang:
麻黄 桂枝 甘草 茯苓 半夏 黄芪 白术 银柴胡

97. 
patient text:
脘腹胀满，疼痛拒按，嗳腐吞酸；厌食，痛而欲泻，泻后痛减，粪便奇臭，或大便秘结
label yaofang:
大黄 枳实 神曲 黄芩 黄连 泽泻 白术 茯苓
0.0201908 0.0245488 0.0321211 0.0301169 0.0403552 0.0238307 0.0210867 0.0216675 0.0230724
predicted yaofang:
人参 竹茹 桑叶 大黄 滑石 瞿麦 篇蓄 羚羊角 川石斛

98. 
patient text:
反复发作，神疲乏力，心悸气短，不寐多梦；面色苍白，形体消瘦纳呆，大便溏薄
label yaofang:
人参 甘草 茯苓 白术 陈皮 半夏 生姜 大枣 人参 白术 甘草 当归 黄芪 远志 酸枣仁 茯神 龙眼肉 木香 生姜 大枣
0.0264015 0.0223944 0.0614546 0.0282813 0.0398123 0.029038 0.0342841 0.0439512 0.0663927 0.030843 0.0375327 0.0567125 0.0329715 0.0346924 0.0369261
predicted yaofang:
桂枝 芍药 甘草 白芍 人参 生姜 大枣 当归 茯苓 党参 黄芪 白术 生地黄 附子 泽泻

99. 
patient text:
脘腹疼痛，胀满不舒，痛无定处；痛引少腹、两胁，得嗳气矢气则舒，遇忧思恼怒则剧
label yaofang:
柴胡 枳壳 香附 陈皮 芍药 甘草 川芎
0.0249616 0.0499964 0.0352497 0.0711941 0.0458817 0.0268 0.0224123 0.0236554 0.0289883 0.0221892 0.0316757
predicted yaofang:
桂枝 白芍 陈皮 茯苓 半夏 木香 贝母 钩藤 厚朴 丁香 归身

100. 
patient text:
汗出恶风；周身酸楚，或微发热，头痛；或表现半身、某局部出汗
label yaofang:
桂枝 芍药 生姜 大枣 甘草
0.0201974 0.10933 0.0228033 0.0827017 0.0438743 0.0252825 0.0465554 0.121406 0.0282248
predicted yaofang:
白芍 竹茹 栀子 郁金 木瓜 旋覆花 元参 蔗汁 犀角尖

101. 
patient text:
便血紫黯，甚则黑色，腹部隐痛，喜热饮；面色不华，神倦懒言，便溏
label yaofang:
灶心土 炮姜 白术 附子 甘草 地黄 阿胶 黄芩 白及 乌贼骨 三七 花蕊石
0.0261664 0.0325646 0.0506447 0.0330452 0.022974 0.0322493 0.0312626 0.0577823 0.0275097 0.0643312 0.0376487
predicted yaofang:
白芍 香附 茯苓 半夏 桃仁 麦冬 黄连 川楝子 黄柏 泽泻 蔗汁

102. 
patient text:
痫病频作，神思恍惚，面色晦暗；头晕目眩，两目干涩，耳轮焦枯不泽，健忘失眠，腰膝痠软，大便干燥
label yaofang:
熟地黄 山药 山茱萸 枸杞子 杜仲 党参 甘草 当归 菟丝子 益智仁
0.0518823 0.0224107 0.0389842 0.0204703 0.0217446 0.0218453 0.0302236 0.0259015 0.0674456 0.0366057 0.0216715 0.0263012
predicted yaofang:
甘草 陈皮 黄芩 人参 大枣 当归 半夏 生地黄 栀子 肉桂 吴茱萸 穿山甲

103. 
patient text:
小便黄赤灼热，尿血鲜红；心烦口渴，面赤口疮，夜寐不安
label yaofang:
小蓟 生地黄 藕节 蒲黄 栀子 竹叶 滑石 甘草 当归
0.0227685 0.0418195 0.0452319 0.11889 0.0805743 0.0315631 0.0282145 0.0313605 0.0336393 0.0212341 0.0341868 0.0386245
predicted yaofang:
甘草 白芍 陈皮 茯苓 半夏 木香 麦冬 牛膝 附子 肉桂 泽泻 厚朴

104. 
patient text:
少腹疼痛，痛如针刺，痛处固定不移，拒按，腹痛经久不愈；腹部包块，大便色黑，肌肤甲错
label yaofang:
当归 川芎 赤芍 蒲黄 五灵脂 没药 延胡索 小茴香 肉桂 干姜
0.0449735 0.0237116 0.0272489 0.0474037 0.0300888 0.0706859 0.0227612 0.0363688 0.03646 0.0209042 0.0230876 0.0392313 0.043372 0.0209305
predicted yaofang:
甘草 白芍 川芎 人参 当归 茯苓 薏苡仁 黄芪 白术 杜仲 牛膝 钩藤 厚朴 桑寄生

105. 
patient text:
盗汗或自汗；心悸不寐，神倦懒言，面色无华
label yaofang:
黄芪 人参 白术 当归 酸枣仁 龙眼肉 远志 生姜 甘草 大枣 木香 茯神
0.0331316 0.131719 0.0292507 0.0381504 0.0354774 0.0942077 0.0571257 0.0260128 0.0261927 0.0278086
predicted yaofang:
枳壳 黄芩 半夏 连翘 麦冬 枳实 槟榔 麦门冬 大黄 苦桔梗

106. 
patient text:
智能减退，记忆力、计算力、定向力、判断力明显减退，神情呆钝，语不达意；头晕耳鸣，懈惰思卧，齿枯发焦，腰酸骨软，步履艰难
label yaofang:
人参 熟地黄 当归 白术 酸枣仁 远志 甘草
0.10155 0.0261819 0.0308373 0.0236958 0.032794 0.0370965 0.0407639 0.0212235 0.0265273
predicted yaofang:
甘草 柴胡 人参 生姜 当归 葛根 麦冬 白术 石斛

107. 
patient text:
小便短赤带血，头晕耳鸣，神疲；颧红潮热，腰膝酸软
label yaofang:
地黄 山药 山茱萸 茯苓 泽泻 牡丹皮 知母 黄柏 旱莲草 大蓟 小蓟 藕节 蒲黄
0.0424157 0.0288647 0.0283994 0.0291192 0.0265361 0.0856697 0.0320347 0.0303206
predicted yaofang:
甘草 茯苓 桔梗 牡蛎 连翘 玄参 地黄 泽泻

108. 
patient text:
腹痛绵绵，时作时止，喜温喜按，饥饿劳累后加重，得食休息后减轻；神疲乏力，气短懒言，形寒肢冷，面色无华，大便溏薄
label yaofang:
黄芪 桂枝 饴糖 生姜 大枣 芍药 甘草
0.0362225 0.0296868 0.0541868 0.0336711 0.0425358 0.0747288 0.0473839 0.0377682 0.0275814 0.0288543 0.0391976 0.0359992 0.022582
predicted yaofang:
桂枝 芍药 甘草 白芍 生姜 大枣 当归 茯苓 黄芪 白术 生地黄 附子 苍术

109. 
patient text:
胸胁胀满不舒，心下痞闷，胃中有振水音，脘腹喜温畏冷冷痛，喜温喜按，泛吐清水痰涎；口渴不欲饮水，饮入即吐，头晕目眩，心悸气短乏力，纳差食少，大便溏泄，形体逐渐消瘦
label yaofang:
桂枝 甘草 白术 茯苓 半夏 生姜
0.0669856 0.0452866 0.0304794 0.0271635 0.0536069 0.0360917 0.0283661 0.0539922 0.0307546 0.0268911 0.0369317
predicted yaofang:
甘草 黄芩 当归 麦冬 枳实 知母 大黄 厚朴 地骨皮 西洋参 苦桔梗

110. 
patient text:
久病尿血，甚或兼见齿衄、肌衄；食少，体倦乏力，气短声低，面色不华
label yaofang:
党参 茯苓 白术 甘草 当归 黄芪 酸枣仁 远志 龙眼肉 木香 熟地黄 阿胶 仙鹤草 槐花
0.0236709 0.0211245 0.0261332 0.0204001 0.179695 0.0231806 0.0337048 0.040579 0.0297379 0.0499157 0.0391251 0.036241 0.0558829 0.10074
predicted yaofang:
白芍 当归 茯苓 木香 枸杞子 白术 熟地黄 附子 肉桂 山药 山茱萸 泽泻 菟丝子 鹿角胶

111. 
patient text:
表情呆滞，沉默寡言，记忆减退，失认失算，口齿含糊，词不达意；伴腰膝酸软，肌肉萎缩，食少纳呆，气短懒言；口涎外溢或四肢不温，腹痛喜按，鸡鸣泄泻
label yaofang:
熟地黄 枸杞子 山茱萸 肉苁蓉 远志 巴戟天 小茴香 杜仲 怀牛膝 茯苓 五味子 党参 楮实 石菖蒲 大枣
0.0425768 0.0258755 0.032603 0.0209643 0.029842 0.0247683 0.0250879 0.0397285 0.0268284 0.022581 0.0316155
predicted yaofang:
甘草 川芎 当归 防风 白术 熟地黄 大腹皮 藿香 天麻 云茯苓 六神曲

112. 
patient text:
久病尿血，血色淡红；头晕耳鸣，精神困惫，腰脊酸痛
label yaofang:
熟地黄 山药 山茱萸 怀牛膝 肉苁蓉 菟丝子 杜仲 巴戟天 茯苓 泽泻 五味子 赤石脂 仙鹤草 蒲黄 槐花 紫珠草
0.0537666 0.0418811 0.0269385 0.0200886 0.0387708 0.0254526 0.0209709 0.0261714 0.0328312 0.0388004 0.0273793
predicted yaofang:
甘草 沙参 黄芪 枸杞子 白术 熟地黄 知母 山药 生地 麻仁 天竺黄

113. 
patient text:
皮肤出现青紫斑点或斑块，或伴有鼻衄、齿衄、便血、尿血；或有发热，口渴，便秘
label yaofang:
大蓟 小蓟 侧柏叶 茜草根 白茅根 棕榈皮 牡丹皮 栀子 大黄
0.0283068 0.0203174 0.0705145 0.0295724 0.0474673 0.0600567 0.0282685 0.0423497 0.024817 0.0200964 0.0231642 0.0216455
predicted yaofang:
麻黄 桂枝 甘草 陈皮 茯苓 半夏 枸杞子 山茱萸 杏仁 补骨脂 紫菀 百部

114. 
patient text:
表情呆钝，智力衰退，或哭笑无常，喃喃自语，或终日无语，呆若木鸡；伴不思饮食，脘腹胀痛，痞满不适，口多涎沫，头重如裹
label yaofang:
半夏 陈皮 枳实 茯苓 甘草 制南星
0.0300174 0.0214939 0.0415234 0.0200345 0.0223028 0.0257893 0.027609 0.0307177 0.050106 0.0257205 0.0722957 0.0228697
predicted yaofang:
桑叶 杏仁 通草 生甘草 天花粉 山栀 羚羊角 花粉 川连 川石斛 甘菊花 甜杏仁

115. 
patient text:
夜寐盗汗或有自汗；五心烦热，或兼午后潮热，两颧色红，口渴，女子月经不调，男子梦遗
label yaofang:
当归 生地黄 熟地黄 黄连 黄芩 黄柏 黄芪
0.0369791 0.0374201 0.0457266 0.0428811 0.0203377 0.0265289 0.0356582 0.0660541 0.0626103 0.0207518 0.0247483 0.0361743
predicted yaofang:
甘草 白芍 当归 茯苓 半夏 桃仁 生地黄 熟地黄 杜仲 黄柏 山药 钩藤

116. 
patient text:
心下坚满或痛，自利，利后反快，虽利，心下续坚满；水走肠间，沥沥有声，腹满，便秘或便溏，口舌干燥
label yaofang:
甘遂 半夏 白芍 蜂蜜 甘草 甘遂 大黄 葶苈 防己 椒目
0.0696014 0.030938 0.0319257 0.0392602 0.0535722 0.0380548 0.044062
predicted yaofang:
甘草 柴胡 牛蒡子 黄芪 白术 山药 胡桃肉

117. 
patient text:
皮肤出现青紫斑点或斑块，时发时止，常伴鼻衄、齿衄或月经过多；颧红，心烦，口渴，手足心热，或有潮热，盗汗
label yaofang:
茜草根 黄芩 侧柏 生地黄 阿胶 甘草
0.0440984 0.0212065 0.0983342 0.0310795 0.0343894 0.021874 0.0353738 0.0235358 0.0251332 0.06047
predicted yaofang:
麻黄 桂枝 甘草 茯苓 枸杞子 白术 山茱萸 细辛 款冬花 百部

118. 
patient text:
表情迟钝，言语不利，善忘，易惊恐，或思维异常，行为古怪；伴肌肤甲错，口干不欲饮，双目晦暗
label yaofang:
赤芍 川芎 桃仁 红花 麝香 老葱 鲜姜 大枣 酒
0.0238328 0.0300217 0.0398409 0.0255744 0.101218 0.0330712 0.0289804
predicted yaofang:
甘草 陈皮 茯苓 黄芪 大腹皮 厚朴 山栀

119. 
patient text:
蒸蒸汗出，汗黏，汗液易使衣服黄染；面赤烘热，烦躁；口苦，小便色黄
label yaofang:
龙胆草 黄芩 栀子 柴胡 泽泻 木通 车前子 当归 生地黄 糯稻根
0.0372584 0.0328032 0.0292147 0.0202153 0.0207595 0.0330503 0.0346204 0.0451441 0.0297762 0.0339258 0.025114 0.0983666
predicted yaofang:
甘草 人参 生姜 茯苓 葛根 半夏 玄参 竹茹 杏仁 苏子 川贝 枇杷叶

120. 
patient text:
寒热往来，或发热不恶寒，有汗而热不解，汗少，咳嗽咳痰，痰量较少，气急喘促，胸胁刺痛，呼吸、转侧疼痛加重；心下痞硬，口苦，咽干，干呕
label yaofang:
柴胡 黄芩 瓜蒌 半夏 枳壳 青皮 赤芍 桔梗 杏仁
0.115094 0.0201497 0.0522416 0.0266878 0.031314 0.0206588 0.0243355 0.0421488 0.0375358 0.0240561 0.0208133 0.0337345 0.0297874 0.0334291 0.0253323
predicted yaofang:
桂枝 芍药 甘草 陈皮 人参 生姜 大枣 当归 茯苓 半夏 木香 黄芪 白术 泽泻 猪苓

121. 
patient text:
反复发生肌衄，久病不愈；神疲乏力，头晕目眩，面色苍白或萎黄，食欲不振
label yaofang:
党参 茯苓 白术 甘草 当归 黄芪 酸枣仁 远志 龙眼肉 木香 仙鹤草 棕榈炭 地榆 蒲黄 茜草根 紫草
0.0789924 0.117767 0.0363682 0.146737 0.076746 0.0279458 0.0264811 0.0464198
predicted yaofang:
甘草 柴胡 黄芩 人参 当归 木香 桃仁 大黄

122. 
patient text:
头痛连及项背，常喜裹头；恶风畏寒，遇风尤剧，口不渴，或兼鼻塞、流清涕等症
label yaofang:
川芎 荆芥 防风 细辛 白芷 薄荷 羌活 甘草
0.128362 0.024947 0.103891 0.0508568 0.0329752 0.0257076 0.0526338 0.0213841 0.0291444
predicted yaofang:
陈皮 当归 茯苓 半夏 木香 白术 干姜 生白芍 白蜜

123. 
patient text:
粪便清稀，甚则如水样，腹痛肠鸣，纳呆脘闷；或伴有恶寒发热头痛，肢体酸痛
label yaofang:
藿香 白术 茯苓 陈皮 半夏 大腹皮 紫苏 白芷 桔梗
0.0250079 0.0255182 0.091637 0.0251912 0.0231348 0.0526147 0.0526311
predicted yaofang:
白芍 茯苓 半夏 益智仁 石决明 百部 川连

124. 
patient text:
头痛而胀，甚则头胀如裂；发热恶风，面红目赤，口渴喜饮，大便不畅，或便秘，小便黄赤
label yaofang:
川芎 白芷 石膏 藁本 羌活 菊花
0.0825993 0.0248912 0.086585 0.0423782 0.0358456 0.0233553 0.029656 0.0277239 0.0284273 0.0528345
predicted yaofang:
甘草 黄芩 茯苓 半夏 麦冬 白术 黄连 枳实 杏仁 厚朴

125. 
patient text:
腹痛频作，里急后重，下痢赤白脓血；大便腥臭，肛门灼热，小便短赤
label yaofang:
黄芩 黄连 大黄 木香 槟榔 当归 芍药 甘草 肉桂
0.0577593 0.0203764 0.0701783 0.028909 0.0268449 0.033897 0.0350285 0.0232842 0.0283771 0.0270244 0.025789 0.0289583 0.0212787 0.0311062 0.0219387 0.0498286 0.0299885
predicted yaofang:
甘草 陈皮 黄芩 人参 当归 茯苓 半夏 木香 白术 五味子 黄连 枳实 槟榔 麦门冬 牛膝 泽泻 大黄

126. 
patient text:
泄泻腹痛，泻下急迫；或泻而不爽，粪色黄褐，气味臭秽，肛门灼热，烦热口渴，小便短黄
label yaofang:
葛根 黄芩 黄连 甘草 木香 茯苓 车前子
0.0293368 0.0218713 0.0327517 0.0203626 0.0204787 0.0266961 0.0844059 0.0272024 0.026248 0.0275044 0.0683137 0.0201486 0.0286751 0.0312591
predicted yaofang:
麻黄 甘草 陈皮 枳壳 人参 生姜 茯苓 半夏 薄荷 苍术 杏仁 细辛 苏子 白芥子

127. 
patient text:
发热多为低热或潮热，热势常随情绪波动而起伏；精神抑郁，胁肋胀满，烦躁易怒，口干而苦
label yaofang:
柴胡 郁金 薄荷 当归 生白芍 牡丹皮 栀子 白术 茯苓 甘草
0.0312948 0.0212852 0.0477187 0.0275867 0.0549973 0.0207018 0.0215262
predicted yaofang:
白芍 黄芩 茯苓 半夏 麦冬 黄连 冬瓜子

128. 
patient text:
泻下稀便，臭如败卵，伴有不消化食物，腹痛肠鸣，泻后痛减；脘腹胀满，嗳腐酸臭，不思饮食
label yaofang:
神曲 山楂 莱菔子 半夏 陈皮 茯苓
0.0204034 0.0917027 0.0215441 0.0205201 0.0273166 0.0310472 0.0231243 0.0243031 0.0347378 0.0307726 0.0933099 0.0365541
predicted yaofang:
芍药 甘草 陈皮 人参 半夏 白术 沉香 神曲 细辛 苏子 胡桃肉 冬虫夏草

129. 
patient text:
眼睑浮肿，继则四肢及全身皆肿，来势迅速，多有恶寒，发热，肢体酸重，小便不利等恶寒，哮喘
label yaofang:
麻黄 杏仁 防风 浮萍 白术 茯苓 泽泻 车前子 石膏 桑白皮 黄芩 苏叶 桂枝 防风
0.0905097 0.0302806 0.0493808 0.0553746 0.0253531 0.0228354 0.0271258 0.025428 0.027153 0.0308498
predicted yaofang:
甘草 川芎 人参 当归 茯苓 木香 远志 白术 枣仁 茵陈

130. 
patient text:
骤然发病，呕吐暴作；发热恶寒，头身疼痛，胸脘满闷
label yaofang:
藿香 紫苏 白芷 大腹皮 厚朴 白术 茯苓 半夏 陈皮 生姜
0.0231349 0.0200066 0.0363724 0.036957 0.028661 0.0214027 0.0493347 0.039637 0.0253514 0.0238039 0.0312223
predicted yaofang:
甘草 茯苓 桃仁 熟地黄 龟板 苍术 山药 山茱萸 泽泻 木瓜 丹皮

131. 
patient text:
头痛如裹；肢体困重，胸闷纳呆，小便不利，大便溏薄
label yaofang:
羌活 独活 藁本 防风 川芎 蔓荆子 甘草
0.0441092 0.0341558 0.0254077 0.049036 0.0880787 0.0302348 0.0249216 0.0572499 0.056769 0.0367069 0.0200076 0.04473 0.0608238
predicted yaofang:
桂枝 甘草 白芍 生姜 大枣 当归 茯苓 半夏 黄芪 白术 生地黄 芡实 金樱子

132. 
patient text:
眼睑浮肿，继则四肢及全身皆肿，来势迅速，多有恶寒，发热，肢体酸重，小便不利等；咽喉肿痛
label yaofang:
麻黄 杏仁 防风 浮萍 白术 茯苓 泽泻 车前子 石膏 桑白皮 黄芩
0.023828 0.0477287 0.022183 0.0269494 0.0693527 0.0350854 0.0209295 0.0454548 0.0250928 0.0301462 0.034861 0.0559687 0.0233867
predicted yaofang:
甘草 白芍 陈皮 当归 茯苓 半夏 木香 党参 白术 熟地黄 川楝子 山药 泽泻

133. 
patient text:
发病急骤，腹痛剧烈，里急后重明显，痢下鲜紫脓血；壮热烦渴，头痛烦躁，神昏惊厥；亦可见下痢量少或无，而突然出现高热，神昏谵语，呕吐，喘逆，四肢厥冷
label yaofang:
白头翁 黄连 黄柏 秦皮
0.0485858 0.245357 0.245371
predicted yaofang:
黄柏 白头翁 秦皮

134. 
patient text:
头痛且眩，两侧为重；心烦易怒，失眠多梦，面红目赤，口苦，或兼胁痛
label yaofang:
天麻 钩藤 石决明 栀子 黄芩 桑寄生 杜仲 牛膝 益母草 夜交藤 茯神
0.0383528 0.0267174 0.0329993 0.0343892 0.0222604 0.0368875 0.0236905 0.0271383 0.0204313
predicted yaofang:
甘草 陈皮 茯苓 半夏 茯神 栀子 杜仲 钩藤 天麻

135. 
patient text:
发热多在午后或夜晚，或热势昼轻夜重，或自觉发热，或局部发热；口干咽燥而不欲饮，躯体有固定痛处或肿块，面色萎黄或黯黑，甚或肌肤甲错
label yaofang:
当归 桃仁 红花 赤芍 生地黄 川芎 牛膝 柴胡 枳壳 桔梗
0.0207136 0.0278603 0.0875838 0.0212862 0.0208768 0.0799669 0.0211316 0.0507976 0.0638782 0.0206622
predicted yaofang:
甘草 陈皮 茯苓 桔梗 豆豉 薏苡仁 砂仁 姜汁 生白芍 木瓜

136. 
patient text:
呕吐酸腐，大便不爽，或溏或结；脘腹胀满，嗳气，厌食，得食愈甚，呕后稍舒
label yaofang:
山楂 神曲 半夏 茯苓 陈皮 连翘 莱菔子
0.0397471 0.0234649 0.0295334 0.0753 0.0237611 0.0365316 0.0282091 0.0210798 0.0434775
predicted yaofang:
甘草 茯苓 前胡 半夏 麦冬 杏仁 花粉 白蒺藜 苁蓉

137. 
patient text:
头痛隐隐，缠绵不休；心悸怔忡，失眠少寐，面色萎黄，气短乏力
label yaofang:
人参 白术 茯苓 甘草 当归 白芍 熟地黄 川芎 大枣 生姜
0.0283857 0.030579 0.0432347 0.0355301 0.032871 0.0478166 0.0645501 0.0224548 0.020678 0.124204 0.0255816
predicted yaofang:
白芍 茯苓 半夏 麦冬 熟地黄 杜仲 牛膝 山药 山茱萸 钩藤 益母草

138. 
patient text:
低热，午后热甚或身热不扬，胸闷，周身困重；纳呆脘痞，口干不欲饮，呕恶，大便稀薄或粘滞不爽
label yaofang:
杏仁 蔻仁 苡仁 半夏 厚朴 通草 滑石 竹叶
0.04631 0.0330348 0.0402565 0.0466182 0.0225705 0.0633325 0.119823 0.0405929 0.0263854 0.038528 0.0595254
predicted yaofang:
甘草 人参 熟地 黄芪 枸杞子 玄参 五味子 熟地黄 附子 山药 山茱萸

139. 
patient text:
眼睑浮肿，延及周身，身发疮痍，甚者溃烂；恶风发热、尿少色赤，大便不爽
label yaofang:
麻黄 杏仁 赤小豆 桑白皮 金银花 野菊花 紫花地丁 蒲公英 紫背天葵
0.0247903 0.0209767 0.0287352 0.0640864 0.0224042 0.0802996 0.0320717 0.0276875
predicted yaofang:
甘草 香附 茯苓 半夏 豆豉 栀子 车前子 橘核

140. 
patient text:
发热，热势或低或高，常在劳累后发作或加剧；倦怠乏力，气短懒言，自汗，易于感冒，食少便溏
label yaofang:
黄芪 人参 白术 茯苓 甘草 陈皮 当归 升麻 北柴胡
0.0922905 0.020115 0.0246693 0.0369705 0.0823021 0.0578182 0.0873625 0.044763 0.026826 0.0391215
predicted yaofang:
甘草 柴胡 白芍 川芎 当归 茯苓 鸡血藤 白术 生地黄 车前子

141. 
patient text:
呕吐清水痰涎，脘腹满闷，不思饮食，脘中水声辘辘；头眩心悸
label yaofang:
半夏 生姜 茯苓 桂枝 白术 甘草
0.0535205 0.0202374 0.0708902 0.0756651 0.140598 0.0310993 0.0269106 0.0394223 0.0231098 0.0547594
predicted yaofang:
甘草 白芍 陈皮 茯苓 半夏 贝母 杏仁 大黄 厚朴 白芥子

142. 
patient text:
全身水肿，按之没指，身体困重；胸闷，纳呆，泛恶，小便短少
label yaofang:
桑白皮 大腹皮 茯苓皮 陈皮 生姜皮 白术 茯苓 苍术 厚朴 猪苓 泽泻 肉桂
0.0570397 0.0249032 0.0340029 0.0301214 0.049099 0.0366273 0.032313 0.0462713 0.0527392 0.0400244 0.0282069
predicted yaofang:
甘草 川芎 人参 大枣 当归 木香 沙参 麦冬 黄芪 白术 生地黄

143. 
patient text:
胁痛以胀痛为主，走窜不定，甚则连及胸背；疼痛每因情志而增减，胸闷腹胀，纳少，嗳气频作
label yaofang:
柴胡 香附 枳壳 陈皮 川芎 芍药 甘草
0.0620556 0.0365546 0.0869668 0.0493273 0.0436769 0.050925 0.0274174 0.0459359 0.0384514
predicted yaofang:
白芍 陈皮 茯苓 半夏 木香 桃仁 红花 肉桂 干姜

144. 
patient text:
发热绵绵不断，多为低热，头晕眼花，身倦乏力，心悸眠差；面白少华，唇甲色淡
label yaofang:
黄芪 党参 茯苓 白术 甘草 当归 龙眼肉 酸枣仁 远志 木香
0.0306704 0.0279073 0.0202362 0.022134 0.0211946
predicted yaofang:
甘草 白芍 麻仁 山栀 干地黄

145. 
patient text:
遍体浮肿，皮肤绷紧光亮，胸脘痞闷；烦热口渴，小便短赤，或大便干结
label yaofang:
羌活 秦艽 防风 茯苓皮 大腹皮 生姜皮 猪苓 茯苓 泽泻 椒目 赤小豆 黄柏 槟榔 生大黄
0.0502661 0.0351404 0.0399763 0.0409012 0.0245128 0.128946 0.020557 0.0281518 0.0216228
predicted yaofang:
甘草 陈皮 人参 茯苓 桔梗 半夏 荆芥 白术 肉桂

146. 
patient text:
呕吐吞酸，嗳气频繁；情志郁闷，胸胁胀痛
label yaofang:
柴胡 白芍 枳实 甘草 半夏 厚朴 紫苏 茯苓 生姜
0.022977 0.0365677 0.0200283 0.0555355 0.0281938 0.0602867 0.0261915 0.0268727 0.0449929 0.0442157
predicted yaofang:
甘草 白芍 茯苓 半夏 连翘 竹叶 牛膝 杏仁 天麻 生薏苡仁

147. 
patient text:
恶寒重，发热轻，无汗，头痛，肢体酸痛；鼻塞，喷嚏，流清涕，咳嗽
label yaofang:
独活 川芎 枳壳 桔梗 前胡 柴胡 荆芥 防风 羌活
0.0333494 0.0270085 0.0433409 0.0299367 0.0246161 0.0349982 0.0299545 0.0821595 0.0890779 0.0700875
predicted yaofang:
黄芩 橘红 麦冬 杏仁 生石膏 花粉 生草 蔗汁 苏梗 广皮

148. 
patient text:
身肿，腰以下为甚，按之凹陷不易恢复；脘腹胀闷，面色萎黄，纳减便溏，神倦肢冷，劳累后加重，小便短少
label yaofang:
干姜 附子 草果仁 桂枝 白术 茯苓 甘草 生姜 大枣 茯苓 泽泻 车前子 木瓜 木香 厚朴 大腹皮
0.0266223 0.0238467 0.0802819 0.0925822 0.0201601 0.0628746 0.0437791 0.0414312 0.0529365 0.0227161
predicted yaofang:
甘草 黄芩 茯苓 葛根 半夏 沙参 麦冬 黄连 杏仁 花粉

149. 
patient text:
头痛且空，眩晕耳鸣；腰膝酸软，神疲乏力，五心烦热，遗精或带下
label yaofang:
熟地黄 山药 山茱萸 枸杞子 杜仲 党参 甘草 当归 菟丝子 益智仁
0.0263958 0.0476638 0.0487413 0.0204273 0.0307636 0.0240884 0.0219436 0.0964497 0.0456079 0.0521664
predicted yaofang:
甘草 黄芩 茯苓 连翘 麦冬 黄连 黄柏 牛膝 泽泻 车前子

150. 
patient text:
胸胁疼痛，咳唾引痛，痛势较前减轻，而呼吸困难加重，气喘气憋，息促不能平卧；或仅能偏卧于停饮的一侧，病侧肋间胀满不舒，严重者可见病侧胸廓隆起
label yaofang:
葶苈子 桑白皮 苏子 瓜蒌皮 杏仁 枳壳 川椒目 茯苓 猪苓 泽泻 冬瓜皮 车前子 甘遂 大戟 芫花
0.0553535 0.0459438 0.0389208 0.0242819 0.0503798 0.0427837 0.0305641 0.0341284 0.0363265
predicted yaofang:
甘草 人参 当归 橘红 木香 茯神 肉桂 归身 酒大黄

151. 
patient text:
发热以午后或夜间为甚，手足心热或骨蒸潮热；颧红盗汗，心烦少寐、多梦，口干咽燥，大便干，小便色黄量少
label yaofang:
银柴胡 知母 胡黄连 地骨皮 青蒿 秦艽 鳖甲
0.0846491 0.0470791 0.0447097 0.107603 0.0275377 0.0302242 0.0365483 0.0329673 0.0272096 0.0363036 0.0257401
predicted yaofang:
甘草 黄芩 半夏 芦根 麦冬 枳实 知母 杏仁 大黄 犀角 花粉

152. 
patient text:
面浮身肿，腰以下尤甚，按之凹陷不起；心悸，气促，腰部冷痛酸重，尿量减少或增多，四肢厥冷，怯寒神疲；面色㿠白或晦滞
label yaofang:
附子 肉桂 巴戟天 淫羊藿 白术 茯苓 泽泻 车前子 牛膝
0.0599339 0.0232642 0.028396 0.0826087 0.0708994 0.039678 0.0278266 0.0242439 0.0320174 0.0213252
predicted yaofang:
甘草 牛蒡子 桑白皮 天花粉 款冬花 紫菀 百部 灯心 白蒺藜 炙茯苓

153. 
patient text:
饮食稍有不慎或稍有劳倦即食呕吐，时作时止；胃纳不佳，倦怠乏力，面色㿠白甚则四肢不温，口干不欲饮；脘腹痞闷，便溏
label yaofang:
木香 砂仁 人参 茯苓 白术 甘草 半夏 陈皮
0.0401551 0.0285785 0.0350602 0.0205773 0.0266368 0.0401537 0.0256395 0.0298416 0.0815966 0.0550629 0.0577422
predicted yaofang:
甘草 黄芩 茯苓 半夏 玄参 黄连 生地黄 栀子 黄柏 泽泻 车前子

154. 
patient text:
胸胁胀满疼痛，胸闷不舒，气憋；或有闷咳，甚则迁延，阴雨加重。严重者可见病侧胸廓变形
label yaofang:
生地黄 玄参 麦冬
0.0363038 0.0395325 0.0417927 0.0219786 0.205049 0.0408547 0.0474392 0.0566665 0.0345473
predicted yaofang:
甘草 茯苓 橘红 竹茹 郁金 杏仁 泽泻 于术 旋覆

155. 
patient text:
发热欲近衣，形寒怯冷，四肢不温；头晕嗜卧，纳少便溏，腰膝酸痛，面色晄白
label yaofang:
熟地黄 山药 山茱萸 茯苓 泽泻 牡丹皮 附子 桂枝
0.108519 0.0209985 0.0785974 0.0443663 0.0505853 0.0208221 0.0283076 0.0291992 0.0232844 0.0397026 0.060114
predicted yaofang:
甘草 柴胡 人参 当归 茯苓 远志 沙参 麦冬 黄芪 白术 地骨皮

156. 
patient text:
咳嗽咳痰时作，咯吐少量黏黄痰，不易咳出，口燥咽干；或午后颧红，心烦，手足心热，潮热盗汗，或伴胸胁闷痛，病久不复，形体羸瘦
label yaofang:
柴胡 香附 枳壳 陈皮 川芎 芍药 甘草
0.0251729 0.0647613 0.0256147 0.0694416 0.0201414 0.0318731 0.0222978 0.0284744 0.0330805
predicted yaofang:
柴胡 黄芩 茯苓 郁金 泽泻 大黄 川贝母 白扁豆 炙甘草

157. 
patient text:
腹痛拘急，痢下赤白粘冻，白多赤少，或纯为白冻，里急后重；脘痞腹胀，头身困重
label yaofang:
苍术 白术 厚朴 桂枝 茯苓 陈皮
0.0560614 0.0261151 0.0307681 0.0419609 0.177346 0.0293242 0.0385256 0.0200155 0.030419 0.116648
predicted yaofang:
桂枝 芍药 甘草 陈皮 茯苓 黄芪 白术 半夏曲 大黄 厚朴

158. 
patient text:
水肿肿势轻重不一，四肢或全身浮肿，久治不愈；皮肤瘀斑，腰部刺痛，或见血尿，久治不愈
label yaofang:
干姜 附子 草果仁 桂枝 白术 茯苓 甘草 生姜 大枣 茯苓 泽泻 车前子 木瓜 木香 厚朴 大腹皮
0.0283627 0.1034 0.0217318 0.0261344 0.105473 0.0988224 0.0235314 0.051048 0.0292383
predicted yaofang:
桂枝 甘草 柴胡 白芍 人参 当归 黄芪 白术 肉桂

159. 
patient text:
呕吐反复发作，但呕吐量不多，或仅吐唾涎沫，时作干呕；口燥咽干，胃中嘈杂，似饥而不欲食
label yaofang:
麦门冬 半夏 人参 甘草 粳米 大枣
0.0211186 0.03082 0.0232452 0.0215941 0.020882 0.0812826
predicted yaofang:
甘草 柴胡 香附 黄芩 桃仁 泽泻

160. 
patient text:
身体沉重而疼痛，甚则肢体浮肿，头痛，恶寒，无汗，或有咳喘，白色泡沫痰；胸闷不舒，干呕，口不渴
label yaofang:
麻黄 桂枝 半夏 干姜 细辛 五味子 白芍 甘草
0.0264111 0.0610472 0.0237955 0.0305656 0.0359328 0.0235547 0.0246978 0.106223 0.0260558 0.0385463 0.0402584 0.0592202 0.03676 0.0201067
predicted yaofang:
桂枝 甘草 香附 人参 当归 茯苓 木香 桃仁 党参 黄芪 白术 红花 熟地黄 山药

161. 
patient text:
胁肋胀痛，牵引肩背，触痛明显，拒按；口苦口干，胸闷纳呆，恶心呕吐，目赤或目黄、身黄、小便黄赤
label yaofang:
茵陈 栀子 大黄
0.0237034 0.0384474 0.0254757 0.0340251 0.0274788 0.0496199 0.0613471 0.0270636 0.0855875 0.0863593
predicted yaofang:
甘草 白芍 当归 茯苓 黄连 生地黄 黄柏 苍术 泽泻 石斛

162. 
patient text:
自觉吞咽时梗阻不畅，胸膈痞满，或有疼痛感，情志舒畅可减轻；嗳气呃逆，呕吐痰涎，口干咽燥，大便艰涩
label yaofang:
丹参 郁金 砂仁壳 沙参 川贝 茯苓 荷叶蒂 杵头糠
0.0262226 0.0221301 0.0248861 0.0294252 0.0385948 0.0546217 0.0365038 0.0307784 0.0274701 0.0628275 0.0419294 0.0263738 0.0358049
predicted yaofang:
甘草 白芍 陈皮 黄芩 人参 生姜 当归 茯苓 桔梗 半夏 黄连 栀子 炙草

163. 
patient text:
痢下赤白脓血，或下痢鲜血粘稠，脐腹灼痛，虚坐努责，量少难出；午后低热，口干食少，心烦
label yaofang:
柴胡 大黄 枳实 黄芩 半夏 白芍 大枣 生姜
0.0596325 0.0583933 0.0498916 0.0286548 0.0343274 0.0275304 0.0618929 0.0549463
predicted yaofang:
甘草 柴胡 人参 半夏 麦冬 黄芪 苏子 大黄

164. 
patient text:
咳逆喘息不得卧，咳吐白色泡沫痰，量多，经久不愈，阴天加重，甚至引起面浮跗肿；或平素伏而不作，遇寒即发，发则寒热，背痛，腰痛，目泣自出，身体振振瞤动
label yaofang:
麻黄 桂枝 干姜 细辛 半夏 厚朴 苏子 杏仁 甘草 五味子
0.021272 0.0370405 0.0727326 0.179611 0.0259708 0.0321367 0.0331574 0.025024
predicted yaofang:
麻黄 芦根 青木香 杏仁 桑白皮 大黄 天花粉 川贝母

165. 
patient text:
吞咽梗塞而痛，水饮可下，固体食物难进；形体消瘦，口燥咽干，五心烦热，大便干结
label yaofang:
茵陈 附子 白术 干姜 甘草
0.0320186 0.0222972 0.0303686 0.0286802 0.0554602 0.0208794 0.0204995 0.0423868 0.0300245
predicted yaofang:
甘草 陈皮 黄芩 茯苓 麦冬 栀子 杏仁 款冬花 百部

166. 
patient text:
大便干结，腹中胀满，口干口臭；面红身热，小便短赤，心烦不安，时欲饮冷
label yaofang:
火麻仁 大黄 杏仁 白芍 枳实 厚朴
0.041167 0.0327659 0.0642066 0.0448973 0.0212506 0.0219731 0.0269784 0.0213943 0.0218896 0.0287971 0.0765849 0.0234983
predicted yaofang:
甘草 黄芩 人参 茯苓 半夏 橘红 黄芪 白术 苍术 杏仁 厚朴 姜汁

167. 
patient text:
身热较著，微恶风，有汗或少汗，咽红肿痛；鼻塞，喷嚏，流稠涕，咳嗽，口干渴
label yaofang:
金银花 连翘 荆芥 薄荷 淡豆豉 桔梗 牛蒡子 甘草 淡竹叶 芦根
0.0371273 0.0571689 0.0609013 0.0518814 0.0998611 0.065386 0.0279819 0.0629486 0.0290915 0.0237752 0.0238219 0.0246259
predicted yaofang:
甘草 陈皮 人参 生姜 茯苓 半夏 荆芥 白术 附子 杏仁 砂仁 枇杷叶

168. 
patient text:
喘促动则为甚，心悸，气短，或咳而气怯，痰多；食少，胸闷，怯寒肢冷，神疲，少腹拘急不仁，脐下动悸，小便不利，足跗浮肿，或吐涎沫而头目昏眩
label yaofang:
桂枝 附子 黄芪 怀山药 白术 甘草 苏子 干姜 款冬花 钟乳石 沉香 补骨脂 山茱萸
0.0220016 0.0206574 0.0211474 0.0392329 0.0244516 0.0321085 0.0816256 0.0226632 0.0465625 0.0403971 0.0374836 0.0223749 0.101051 0.0496183
predicted yaofang:
甘草 白芍 川芎 陈皮 人参 当归 茯苓 半夏 黄芪 白术 附子 砂仁 木瓜 白芥子

169. 
patient text:
大便秘结，欲排不得，腹中胀满；胸胁满闷，嗳气呃逆，肠鸣矢气，纳差
label yaofang:
木香 乌药 沉香 大黄 槟榔 枳实
0.0639167 0.0396566 0.0259133 0.0350381 0.0201209 0.0395632 0.0585489 0.0308181 0.020214 0.0250509 0.0351536 0.0228291 0.0286919 0.0494532 0.0289973 0.0490202
predicted yaofang:
桂枝 甘草 白芍 香附 人参 当归 茯苓 半夏 木香 黄芪 枸杞子 白术 熟地黄 肉桂 泽泻 猪苓

170. 
patient text:
发于夏季，头身困重，发热；暑湿偏重者，兼食欲不振，胸闷脘痞，口中粘腻，或呕吐，腹泻；暑热偏重者，见高热汗出，心烦口渴，小便短黄
label yaofang:
香薷 金银花 连翘 扁豆花 厚朴
0.022563 0.0491824 0.0292983 0.0328698 0.0304816 0.042078 0.0270997 0.0303859 0.0650885 0.0568506
predicted yaofang:
麻黄 陈皮 人参 生姜 茯苓 半夏 杏仁 苏子 晚蚕沙 生麻黄

171. 
patient text:
大便艰涩，腹痛拘急，胀满拒按；手足不温，呃逆呕吐；
label yaofang:
附子 大黄 细辛
0.0572474 0.0476292 0.0267117 0.0536535 0.0363688 0.0338874 0.0250389
predicted yaofang:
香附 陈皮 法半夏 茯苓 杏仁 瓜蒌 炙草

172. 
patient text:
虽有便意，临厕努争乏力，难以排出，便后乏力；汗出短气，面白神疲，肢倦懒言
label yaofang:
黄芪 火麻仁 白蜜 陈皮
0.0521176 0.0554144 0.0441042 0.0386824 0.0717379 0.0655203 0.0869346 0.0350258 0.0454852 0.0304018
predicted yaofang:
甘草 人参 当归 茯苓 黄芪 白术 熟地黄 龟板 山药 火麻仁

173. 
patient text:
大便干结；面色苍白，头晕目眩，心悸，失眠多梦，健忘
label yaofang:
当归 生地黄 麻仁 桃仁 枳壳
0.165025 0.0448844 0.0324427 0.0613895 0.0283197 0.0360432 0.0235527 0.0265716 0.0233478 0.0271998 0.0559388 0.0271507
predicted yaofang:
桂枝 甘草 大枣 茯苓 半夏 党参 黄芪 白术 山药 泽泻 猪苓 莲子肉

174. 
patient text:
大便干结，甚如羊屎状；形体消瘦，头晕耳鸣，两颧红赤，心烦少眠，潮热盗汗，腰膝酸软
label yaofang:
生地 玄参 麦冬
0.0256802 0.0272044 0.0215835 0.021775 0.0771737 0.0247159 0.0396056 0.0295168 0.0491843 0.0445254 0.023793
predicted yaofang:
甘草 当归 茯苓 玄参 黄柏 附子 肉桂 泽泻 车前子 莲子心 北沙参

175. 
patient text:
恶寒发热，鼻塞，流涕，喷嚏，头痛；偏于气虚者，兼倦怠乏力，气短懒言，易汗出，反复易感
label yaofang:
苏叶 前胡 葛根 党参 茯苓 甘草
0.0401674 0.0206469 0.0270623 0.039932 0.0358247 0.0355428 0.0425024 0.0610842 0.0384193
predicted yaofang:
甘草 茯苓 防风 羌活 薏苡仁 附子 苍术 细辛 生杭芍

176. 
patient text:
大便艰涩，排出困难；面色㿠白，四肢不温，喜热怕冷，小便清长，或腹中冷痛，或腰膝冷痛
label yaofang:
肉苁蓉 当归 牛膝 枳壳 泽泻 升麻
0.0371322 0.0210647 0.0290384 0.0275003 0.0768233 0.116547 0.0412281 0.0254749 0.0401391
predicted yaofang:
贝母 枳实 竹茹 橘皮 杏仁 石斛 生白芍 山栀 西洋参

177. 
patient text:
恶寒发热，鼻塞，流涕，喷嚏，头痛；偏于阴虚者，口干咽燥，手足心热
label yaofang:
玉竹 豆豉 薄荷 葱白 桔梗 白薇 甘草 大枣
0.0396113 0.0251619 0.0221429 0.0245443 0.0363005 0.0568722 0.0628574 0.0357006 0.0341556 0.0376843 0.0562429 0.0229023
predicted yaofang:
甘草 柴胡 枳壳 黄芩 当归 茯苓 沙参 麦冬 黄连 生地黄 神曲 桑叶

178. 
patient text:
胁痛以胀痛为主，走窜不定，甚则连及胸背；疼痛每因情志而增减，胸闷腹胀，纳少，嗳气频作
label yaofang:
柴胡 香附 枳壳 陈皮 川芎 芍药 甘草
0.0620556 0.0365546 0.0869668 0.0493273 0.0436769 0.050925 0.0274174 0.0459359 0.0384514
predicted yaofang:
白芍 陈皮 茯苓 半夏 木香 桃仁 红花 肉桂 干姜

179. 
patient text:
胁肋胀痛，牵引肩背，触痛明显，拒按；口苦口干，胸闷纳呆，恶心呕吐，目赤或目黄、身黄、小便黄赤
label yaofang:
龙胆草 黄芩 栀子 柴胡 木通 车前子 泽泻 当归 生地黄
0.0237034 0.0384474 0.0254757 0.0340251 0.0274788 0.0496199 0.0613471 0.0270636 0.0855875 0.0863593
predicted yaofang:
甘草 白芍 当归 茯苓 黄连 生地黄 黄柏 苍术 泽泻 石斛

180. 
patient text:
胁肋刺痛，痛有定处；入夜更甚，胁肋下或面色晦暗
label yaofang:
新绛 旋覆花
0.0531739 0.0267937 0.0251548 0.0267667 0.0938707 0.0662272 0.025725 0.0661279 0.0343812 0.038445 0.153004
predicted yaofang:
白芍 茯苓 半夏 木香 党参 黄芪 白术 泽泻 新绛 玄胡 归尾

181. 
patient text:
胁肋隐痛，悠悠不休，遇劳加重；口干咽燥，心中烦热，头晕目眩
label yaofang:
生地黄 枸杞子 沙参 麦冬 当归 川楝子
0.0414331 0.0219877 0.0374218 0.0761363 0.0574601 0.028139 0.0331762 0.0689733 0.0309016 0.0214666 0.0364114
predicted yaofang:
甘草 茯苓 麦冬 枸杞子 延胡索 川楝子 槟榔 沉香 郁金 山药 泽泻

182. 
patient text:
身目俱黄，黄色鲜明，发热口渴；心中懊憹，腹部胀满，口干而苦，恶心呕吐，小便短少黄赤，大便秘结
label yaofang:
茵陈 栀子 大黄
0.0559049 0.027249 0.0344312 0.0293969 0.0274284 0.0222127 0.0342613 0.0458828 0.0211561 0.0328147
predicted yaofang:
甘草 黄芩 人参 当归 贝母 栀子 桑叶 通草 大黄 滑石

183. 
patient text:
身目俱黄，但不如前者鲜明，头重身困；嗜卧乏力，胸脘痞闷，纳呆呕恶，厌食油腻，口粘不渴，大便溏垢
label yaofang:
茵陈 连翘 木通 滑石 白术 茯苓 猪苓 泽泻 藿香 石菖蒲 豆蔻 薄荷 射干 知母
0.0309529 0.0228616 0.0448527 0.0217434 0.0334823 0.0440078 0.0420598 0.0314326 0.0244958 0.0370473 0.0648969 0.0574863
predicted yaofang:
甘草 人参 连翘 粳米 肉桂 干姜 藿香 天花粉 射干 肉豆蔻 豆蔻 炙甘草

184. 
patient text:
身目发黄，黄色鲜明，右胁胀闷、疼痛，牵引肩背，便秘，尿黄；身热不退，或寒热往来，口苦咽干，呕吐呃逆
label yaofang:
柴胡 大黄 枳实 黄芩 半夏 白芍 大枣 生姜
0.0287372 0.0997884 0.0310344 0.0599352 0.0219376 0.032429 0.029761 0.0229863 0.0328125
predicted yaofang:
甘草 白芍 人参 当归 阿胶 生地黄 枳实 川楝子 大黄

185. 
patient text:
发病急骤，黄疸迅速加深，其色如金，高热烦渴，胁痛腹满，烦躁不安；神昏谵语，或见衄血、便血，或肌肤出现瘀斑
label yaofang:
犀角 生地黄 牡丹皮 芍药
0.150197 0.0395972 0.0304656
predicted yaofang:
牡丹皮 益智仁 犀角

186. 
patient text:
身目俱黄，黄色晦黯，或如烟熏；纳少脘闷，或见腹胀，大便不实，神疲畏寒，口淡不渴
label yaofang:
茵陈 附子 白术 干姜 甘草
0.0419635 0.025688 0.0393269 0.0306967 0.0725739 0.0204646 0.0912986 0.0770938 0.0430955 0.0283213 0.0343741
predicted yaofang:
甘草 陈皮 人参 当归 茯苓 防风 黄芪 白术 熟地黄 干姜 火麻仁

187. 
patient text:
面目及肌肤淡黄，甚则晦黯不泽；纳呆，腹胀，神疲乏力
label yaofang:
黄芪 桂枝 饴糖 生姜 大枣 芍药 甘草
0.0209281 0.0543134 0.0203471 0.0323123 0.0285272 0.039554 0.02698 0.0246554 0.0713077 0.0546419 0.0355984
predicted yaofang:
甘草 陈皮 黄芩 人参 茯苓 薄荷 栀子 槟榔 乌药 沉香 干姜

188. 
patient text:
腹中气聚，攻窜胀痛，时聚时散；脘胁之间时或不适，常随情志变化而加重或减轻
label yaofang:
柴胡 白芍 当归 香附 木香 青皮 枳壳 乌药 川芎 陈皮 厚朴 砂仁
0.0268522 0.181051 0.0533685 0.0287117 0.0308449 0.0251328 0.0210446 0.0703387 0.0262089 0.0244532 0.0206349 0.0213536 0.0225926
predicted yaofang:
麻黄 桂枝 甘草 川芎 陈皮 大枣 当归 茯苓 半夏 木香 荆芥 白术 砂仁

189. 
patient text:
腹胀或痛，腹部时有条索状物聚起，重按则胀痛更甚；便秘，纳呆
label yaofang:
木香 乌药 沉香 大黄 槟榔 枳实
0.0257023 0.0624402 0.0326372 0.0406567 0.0334629 0.0757067 0.0212109 0.0537722 0.0245132 0.0445315
predicted yaofang:
桂枝 甘草 陈皮 茯苓 桔梗 半夏 砂仁 紫菀 白前 白蒺藜

190. 
patient text:
积块软而不坚，固定不移；胀痛不适
label yaofang:
川楝子 延胡索 蒲黄 五灵脂
0.0967112 0.288477 0.0352744 0.038477 0.106063
predicted yaofang:
延胡索 川楝子 生甘草 蒲黄 五灵脂

191. 
patient text:
腹部积块明显，硬痛不移；面黯消瘦，纳减乏力，女子或见月事不下
label yaofang:
当归 川芎 赤芍 桃仁 红花 五灵脂 牡丹皮 延胡索 香附 乌药 枳壳 人参 白术 甘草
0.100032 0.0776189 0.0461175 0.0223628 0.0868465 0.114343 0.0466411 0.0211926 0.0299335 0.0911 0.0465004 0.0310082
predicted yaofang:
川芎 香附 当归 桃仁 红花 延胡索 赤芍 牡丹皮 乌药 泽泻 五灵脂 猪苓

192. 
patient text:
积块坚硬，疼痛加剧；面色萎黄或黧黑，消瘦脱形，饮食大减
label yaofang:
人参 白术 茯苓 甘草 熟地黄 当归 白芍 川芎 三棱 莪术 苏木 五灵脂 香附 槟榔
0.0267506 0.0223831 0.0204709 0.0223891 0.0224245 0.0563028 0.0368051 0.235615 0.0689091 0.164938
predicted yaofang:
甘草 柴胡 川芎 人参 白术 槟榔 五灵脂 三棱 莪术 苏木

193. 
patient text:
胸膈疼痛，饮食不下，食入即吐，甚则滴水难进，大便坚如羊屎，或吐出物如赤豆汁；面色晦暗，肌肤枯燥，形体消瘦
label yaofang:
生地黄 熟地黄 当归 桃仁 红花 升麻 甘草
0.0246573 0.0492469 0.0236026 0.0846302 0.0213195 0.0411149 0.0206547 0.0504805
predicted yaofang:
白芍 青皮 肉桂 旋覆花 芡实 代赭石 西洋参 新会皮

194. 
patient text:
腹部胀大，按之不坚，叩之如鼓；胁下胀满或疼痛，饮食减少，食后胀甚，嗳气不适，小便短少
label yaofang:
柴胡 香附 枳壳 川芎 苍术 厚朴 陈皮 茯苓 猪苓 泽泻
0.0228591 0.0324266 0.0214836 0.0251896 0.112933 0.0329373 0.0316093 0.0217657 0.0216025 0.0765166 0.0467161 0.0268012 0.0227644 0.0208574
predicted yaofang:
桂枝 甘草 陈皮 黄芩 茯苓 葛根 黄连 黄柏 附子 苍术 泽泻 车前子 厚朴 猪苓

195. 
patient text:
腹大胀满，按之如囊裹水；脘腹痞胀，得热稍舒，精神困倦，怯寒懒动，甚则颜面微浮，下肢浮肿，小便少，大便溏
label yaofang:
附子 干姜 白术 木香 厚朴 茯苓 草果 木瓜
0.0335669 0.0205736 0.0200309 0.0729652 0.032993 0.0321214 0.0211297
predicted yaofang:
茯苓 半夏 黄连 栀子 泽泻 木瓜 元参

196. 
patient text:
腹大坚满，脘腹撑急；烦热口苦，渴不欲饮，小便赤涩，大便秘结或溏垢，或有面目皮肤发黄
label yaofang:
茵陈 栀子 黄芩 大黄 厚朴 砂仁 陈皮 白术 茯苓 泽泻 车前子
0.0453893 0.0489191 0.0303559 0.0234364 0.05236 0.0254763 0.0231214 0.0451354 0.030473 0.0381664 0.0370377 0.0296575 0.0216436 0.0983503
predicted yaofang:
甘草 川芎 香附 陈皮 茯苓 桃仁 党参 白术 红花 栀子 泽泻 车前子 大黄 茵陈

197. 
patient text:
长期吞咽受阻，水饮不下，泛吐清涎，面色?白，精神疲惫；偏脾阳虚者，兼腹胀便溏；偏肾阳虚者，兼形寒气短，面浮足肿
label yaofang:
人参 茯苓 白术 甘草 黄芪 陈皮 半夏 砂仁 生姜 大枣 熟地黄 附子 肉桂 山药 山茱萸 菟丝子 当归 杜仲 鹿角胶 枸杞子
0.0393927 0.0202252 0.032312 0.0236209 0.0255378 0.0478599 0.142201 0.020918 0.0369062 0.0584873 0.0211192
predicted yaofang:
甘草 陈皮 茯苓 桔梗 半夏 附子 肉桂 山药 紫菀 竹沥 橘白

198. 
patient text:
腹大坚满，青筋暴露，胁腹刺痛；面色黯黑，面颈胸臂出现血痣呈丝纹状，手掌赤痕，口干不欲饮水，或见大便色黑
label yaofang:
当归 川芎 赤芍 延胡索 莪术 大腹皮 茯苓 葶苈子
0.0251863 0.11453 0.0229934 0.0457625 0.0293058 0.0214398 0.109727 0.0436572 0.0364232 0.0416311 0.0701455 0.0211978 0.0308811 0.022334 0.0351772 0.0201838 0.0557784
predicted yaofang:
甘草 川芎 人参 当归 茯苓 防风 葶苈子 黄芪 白术 延胡索 赤芍 附子 肉桂 大腹皮 干姜 升麻 莪术

199. 
patient text:
腹大胀满，形似蛙腹，朝宽暮急；面色苍黄或㿠白，神倦怯寒，脘闷纳呆，肢冷或下肢浮肿，小便短少不利
label yaofang:
附子 肉桂 干姜 人参 白术 茯苓 猪苓 泽泻 车前子
0.0435492 0.0544668 0.0200913 0.127296 0.0282207 0.0525075 0.02762 0.0583878 0.0435751 0.127228 0.0251919 0.0357491 0.0224102
predicted yaofang:
甘草 柴胡 陈皮 人参 当归 茯苓 黄芪 白术 附子 肉桂 泽泻 干姜 猪苓