threshold = 0.02

0. 
patient face id: 01012051367315_1_4_7
label yaofang:
防风 蜜百部 金银花 白前 蜜枇杷叶 苦杏仁 蜜紫菀 浙贝母 款冬花 干鱼腥草 紫苏梗 橘红 鸡内金
0.0261202 0.045562 0.036749 0.0464112 0.0396213 0.0379201 0.0506504 0.0356013 0.0770664 0.139901 0.0729047 0.0614253 0.0827058 0.0639248 0.0667712
predicted yaofang:
桔梗 橘红 防风 金银花 浙贝母 款冬花 白前 百部 鸡内金 苦杏仁 紫苏梗 蜜百部 蜜枇杷叶 干鱼腥草 蜜紫菀

1. 
patient face id: 02181621581257_5_1_6
label yaofang:
党参 白术 麦芽 鱼古 甘草 瓜蒌皮 厚朴 香附 茯苓 法半夏 瓦楞子 佛手 砂仁 薤白 柿蒂 山药
0.0327041 0.0700582 0.0504909 0.0374264 0.0234399 0.05162 0.0277411 0.0202118 0.0344191 0.0254748 0.0510759 0.0341892
predicted yaofang:
法半夏 党参 白术 黄连 郁金 山药 砂仁 火麻仁 柿蒂 麦芽 鱼古 瓦楞子

2. 
patient face id: 01190646126717_3_5_6
label yaofang:
鳖甲 天麻 天山雪莲 山药 败酱草 郁金 茯苓 白芍 半枝莲 蜈蚣 红豆杉 薏苡仁 党参 莪术 熟附子 甘草
0.052909 0.022342 0.0689883 0.021294 0.0677947 0.0611751 0.0684689 0.0941289 0.0641098 0.0570378 0.0729569 0.0351095 0.0909759
predicted yaofang:
白芍 薏苡仁 党参 白术 熟附子 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

3. 
patient face id: 01012101437253_1_4_2
label yaofang:
党参 益智 山药 乌药 黄芪 当归 熟附子 干姜 淫羊藿 仙茅 鹿角霜 醋龟甲 肉桂
0.0624639 0.0879071 0.0249431 0.0598363 0.084092 0.0688336 0.0250511 0.0891998 0.0686424 0.0638044 0.0627798 0.0762975 0.0663755
predicted yaofang:
当归 党参 黄芪 熟附子 乌药 肉桂 山药 干姜 淫羊藿 仙茅 益智 鹿角霜 醋龟甲

4. 
patient face id: 01122349239866_1_4_7
label yaofang:
天麻 桑寄生 天山雪莲 山药 大腹皮 白术 木香 茯苓 甘草 续断 白芍 枳壳 火麻仁 决明子 槟榔
0.0705822 0.126176 0.052185 0.0316508 0.092288 0.0524013 0.0284968 0.0359651 0.0365151 0.0202184 0.0335674 0.0227426
predicted yaofang:
白芍 党参 白术 酸枣仁 生地黄 山药 厚朴 天麻 桑寄生 鳖甲 火麻仁 白花蛇舌

5. 
patient face id: 01201319592474_5_6
label yaofang:
鳖甲 半枝莲 蜈蚣 甘草 桔梗 苦杏仁 茯苓 白花蛇舌 天麻 天山雪莲 浙贝母 诃子 法半夏 前胡
0.0403789 0.0251143 0.0407988 0.0220847 0.0599542 0.0373901 0.0879028 0.0638978 0.0439567 0.0932764 0.0250039 0.0840449 0.0486227 0.0523488
predicted yaofang:
法半夏 前胡 桔梗 金银花 浙贝母 郁金 天麻 鳖甲 苦杏仁 蜈蚣 黄芩片 白花蛇舌 天山雪莲 半枝莲

6. 
patient face id: 01312320301102_1_6
label yaofang:
醋鳖甲 半枝莲 蜈蚣 延胡索 牛膝 地黄 甘草 白花蛇舌草 天麻 桑枝 补骨脂 牡丹皮 白术 浮小麦
0.0250552 0.0298988 0.0655659 0.0502944 0.0350961 0.0676828 0.0248479 0.0431051 0.124941 0.0503753 0.0775061 0.0506157 0.0351209
predicted yaofang:
党参 延胡索 牛膝 知母 山药 天麻 鳖甲 补骨脂 桑枝 威灵仙 蜈蚣 半枝莲 醋鳖甲

7. 
patient face id: 02151813242252_4
label yaofang:
薄荷 前胡 紫菀 香薷 防风 北柴胡 荆芥穗 桔梗 紫苏梗 广藿香 甘草片 百部
0.0535159 0.0713636 0.0574182 0.0673719 0.120144 0.0737166 0.083983 0.0820865 0.0648279 0.0848933 0.0649652 0.0717261
predicted yaofang:
前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 香薷 紫菀 百部 紫苏梗 广藿香 甘草片

8. 
patient face id: 01132148039324_5
label yaofang:
鳖甲 天麻 天山雪莲 火麻仁 广藿香 枇杷叶 法半夏 甘草 半枝莲 蜈蚣 党参 砂仁 黄连 紫苏梗 茯苓
0.03306 0.0330348 0.0234812 0.0339479 0.0202478 0.0334905 0.0272098 0.0440627 0.0439978 0.0498241 0.0550665 0.0220089 0.0831906 0.0386537 0.0643978 0.0285892 0.0203188
predicted yaofang:
白芍 法半夏 桔梗 党参 白术 黄连 生地黄 浙贝母 天麻 鳖甲 火麻仁 诃子 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲

9. 
patient face id: 02141959473230_6
label yaofang:
干姜 天麻 姜半夏 合欢皮 蜈蚣 炙甘草 淡豆豉 龙骨 柏子仁
0.0654248 0.0530996 0.0995528 0.03623 0.085858 0.0251888 0.0645937 0.0235697 0.106328 0.10505 0.108866 0.0288872
predicted yaofang:
龙骨 党参 柏子仁 浙贝母 干姜 厚朴 淡豆豉 鳖甲 姜半夏 炙甘草 蜈蚣 合欢皮

10. 
patient face id: 01042334549227_7_5
label yaofang:
天麻 茯苓 杜仲 桑寄生 地黄 补骨脂 龙骨 麦芽 酸枣仁 丹参 牛膝 甘草 白芍 山茱萸 牡蛎
0.0318156 0.0305278 0.104096 0.0267296 0.261085 0.0992591 0.0452038 0.0524664 0.0247076 0.0304314 0.0442406
predicted yaofang:
龙骨 牡蛎 酸枣仁 赤芍 熟地黄 牛膝 知母 山茱萸 钩藤 天麻 乌梢蛇

11. 
patient face id: 02120804283361_4_1
label yaofang:
鳖甲 薏苡仁 蜈蚣 浙贝母 豆蔻 桔梗 法半夏 甘草 白花蛇舌 天麻 郁金 天山雪莲 苦杏仁 茯苓 砂仁 黄连
0.057956 0.059119 0.0271895 0.024984 0.0397107 0.0285585 0.0271192 0.0993973 0.0815564 0.0913918 0.10125 0.0942109 0.0657296 0.0266106
predicted yaofang:
法半夏 薏苡仁 黄连 浙贝母 郁金 砂仁 天麻 鳖甲 豆蔻 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲

12. 
patient face id: 02020948138913_5_6_1
label yaofang:
鳖甲 天麻 天山雪莲 熟附子 火麻仁 山药 佛手 半枝莲 蜈蚣 薏苡仁 败酱草 厚朴 巴戟天 甘草
0.0779994 0.0505449 0.0560723 0.07329 0.0798687 0.0612105 0.11036 0.0295295 0.0411684 0.0220615 0.0669303 0.0250125 0.0274141 0.0698254 0.0361946 0.0445839
predicted yaofang:
薏苡仁 党参 熟附子 山药 厚朴 天麻 巴戟天 鳖甲 火麻仁 豆蔻 败酱草 苦杏仁 佛手 蜈蚣 天山雪莲 半枝莲

13. 
patient face id: 02171905555390_4
label yaofang:
北沙参 百部 陈皮 细辛 太子参 紫菀 法半夏 干姜 炒紫苏子 款冬花 蜜麻黄 前胡 白前 炙甘草
0.0632664 0.0565476 0.0680328 0.029767 0.129569 0.039121 0.103365 0.0276321 0.105041 0.0892135 0.0908681 0.0619414 0.0703334
predicted yaofang:
陈皮 法半夏 前胡 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

14. 
patient face id: 01182315196524_6_4
label yaofang:
鳖甲 半枝莲 蜈蚣 苦杏仁 甘草 紫菀 苇茎 诃子 茯苓 白花蛇舌 天麻 天山雪莲 浙贝母 前胡 款冬花 细辛 桂枝
0.059506 0.091541 0.0361332 0.0255054 0.0241782 0.0512906 0.0739645 0.069472 0.0765734 0.0612622 0.0774425 0.0948532 0.0723071 0.0466193 0.0449549
predicted yaofang:
桂枝 前胡 浙贝母 细辛 天麻 鳖甲 款冬花 紫菀 诃子 苇茎 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲

15. 
patient face id: 01012047218119_1_4
label yaofang:
杜仲 盐山萸肉 蚕沙 桑寄生 延胡索 葛根 威灵仙 桑枝 豨莶草 炒山楂 桂枝 桃仁
0.090275 0.0220758 0.0272671 0.0417335 0.0339038 0.0625957 0.0913239 0.155318 0.082156 0.0713792 0.0646126 0.0304166 0.0568915 0.0742414
predicted yaofang:
桂枝 法半夏 葛根 桃仁 麦冬 延胡索 杜仲 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂

16. 
patient face id: 01032101314768_6_2
label yaofang:
鳖甲 天山雪莲 浙贝母 蜂房 生地黄 五味子 茯苓 白花蛇舌 甘草 桔梗 酸枣仁 麦冬 知母 太子参
0.0644393 0.0415852 0.0296766 0.0515942 0.150845 0.0417399 0.0547982 0.0508492 0.0226628 0.0257963 0.061436 0.0752089 0.0203563 0.0333569 0.0356845
predicted yaofang:
桔梗 麦冬 党参 太子参 酸枣仁 丹参 生地黄 浙贝母 郁金 天麻 鳖甲 白花蛇舌 天山雪莲 合欢花 蜂房

17. 
patient face id: 01130634088580_1_2_4
label yaofang:
鳖甲 浙贝母 蜂房 诃子 茯苓 党参 紫菀 甘草 白花蛇舌 桔梗 四季青 法夏 岗梅根 橘红 乌梅
0.040987 0.0242977 0.02158 0.0714372 0.053024 0.0399082 0.0375424 0.118605 0.0779396 0.0722174 0.0852527 0.0578108 0.0919069 0.0202308
predicted yaofang:
桔梗 麦冬 党参 浙贝母 乌梅 厚朴 鳖甲 诃子 法夏 白花蛇舌 蜂房 岗梅根 四季青 红豆杉

18. 
patient face id: 01312124447549_1_2_6
label yaofang:
鳖甲 天麻 天山雪莲 茯苓 白芍 女贞子 生地黄 甘草 半枝莲 蜈蚣 党参 柴胡 枳壳 墨旱莲 五灵脂 砂仁
0.114621 0.0667096 0.0559083 0.1218 0.0526712 0.023869 0.0864342 0.0250056 0.0721569 0.0438868 0.0204958 0.0684279 0.0391615
predicted yaofang:
柴胡 白芍 枳壳 党参 酸枣仁 生地黄 天麻 五灵脂 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

19. 
patient face id: 02122115124088_2_6
label yaofang:
山药 党参 合欢花 地骨皮 酸枣仁 首乌藤 女贞子 浮小麦 生地黄 茯苓 甘草 糯稻根 黄芪 牛膝 蔓荆子
0.0247798 0.107596 0.0278144 0.0471277 0.103464 0.0269283 0.0863015 0.0325756 0.0236088 0.0261711 0.0342699 0.0413296 0.0411837 0.0560217 0.0858096
predicted yaofang:
柴胡 党参 黄芪 白术 酸枣仁 丹参 生地黄 赤芍 山药 菟丝子 糯稻根 女贞子 浮小麦 首乌藤 合欢花

20. 
patient face id: 01132326450704_5_2
label yaofang:
姜半夏 太子参 丹参 炙甘草 生地黄 麦冬 三七片 瓜蒌皮 阿胶 桂枝 薤白
0.0723309 0.028409 0.161487 0.0336668 0.0451089 0.0375868 0.275492 0.0253247
predicted yaofang:
大枣 党参 丹参 黄连 生地黄 薤白 姜半夏 炙甘草

21. 
patient face id: 02191218217859_1_2_4
label yaofang:
鳖甲 半枝莲 蜈蚣 生地黄 羌活 威灵仙 防风 甘草 白花蛇舌 天麻 酸枣仁 粉葛 地黄 薏苡仁 党参 天山雪莲
0.0836081 0.0309231 0.0565378 0.0607574 0.0693376 0.124061 0.0332976 0.0555362 0.0704312 0.0375962 0.0408257 0.0963072 0.05532 0.0293049
predicted yaofang:
羌活 薏苡仁 党参 酸枣仁 生地黄 地黄 天麻 鳖甲 粉葛 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲

22. 
patient face id: 01211241234361_1_7
label yaofang:
桂枝 柴胡 蜜枇杷叶 天花粉 干姜 黄芩 人参叶 桔梗 牡蛎 炙甘草 藕节 苦杏仁
0.0328059 0.0551362 0.0334232 0.0720269 0.0335754 0.0541451 0.127195 0.0564755 0.0806039 0.039914 0.134446 0.0901345 0.0689157
predicted yaofang:
桂枝 柴胡 黄芩 桔梗 牡蛎 藕节 干姜 天花粉 苦杏仁 蝉蜕 炙甘草 蜜枇杷叶 人参叶

23. 
patient face id: 02171833303359_2
label yaofang:
防风 法半夏 紫苏梗 炒苍耳子 炒蔓荆子 炙甘草 前胡 陈皮 白芷 广藿香 百部 麸炒白术 豆蔻 辛夷
0.0469415 0.0559949 0.0326441 0.0685789 0.105012 0.0480866 0.0648035 0.0943071 0.0727065 0.0563836 0.0571384 0.0917543 0.0679 0.062958
predicted yaofang:
陈皮 法半夏 前胡 防风 白芷 百部 豆蔻 炙甘草 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术 炒蔓荆子

24. 
patient face id: 02182002082546_2_6
label yaofang:
醋鳖甲 半枝莲 蜈蚣 麦冬 郁金 诃子 甘草 白花蛇舌草 天麻 地黄 浙贝母 桔梗 猫爪草 茯苓
0.0552425 0.115601 0.0346849 0.0438696 0.0515544 0.0305789 0.0514891 0.0927003 0.0726207 0.0392994 0.0219106 0.0480993 0.108314 0.0655811
predicted yaofang:
桔梗 浙贝母 郁金 地黄 天麻 鳖甲 诃子 白花蛇舌草 蜈蚣 白花蛇舌 天山雪莲 半枝莲 醋鳖甲 猫爪草

25. 
patient face id: 02182312185320_4_6
label yaofang:
鳖甲 甘草 蜈蚣 天麻 郁金 莱菔子 枳壳 白花蛇舌 薏苡仁 天山雪莲 党参 连翘 白术 辛夷
0.0698405 0.0213269 0.0244845 0.103276 0.0477771 0.0287333 0.0394745 0.0518517 0.0413964 0.021602 0.02362 0.0234798 0.0201512 0.0325975 0.0241818
predicted yaofang:
白芍 陈皮 枳壳 党参 白术 生地黄 郁金 山药 茜草 天麻 鳖甲 辛夷 黄芩片 白花蛇舌 合欢花

26. 
patient face id: 02141934264802_1
label yaofang:
黄精 熟地黄 制何首乌 续断 白术 火麻仁 砂仁 杜仲 桑寄生 党参 枸杞子 艾叶 巴戟天 菟丝子
0.0714038 0.0769382 0.0307087 0.0711139 0.0211026 0.101823 0.0586064 0.0447707 0.0434115 0.219754 0.0306891 0.109885 0.0393411
predicted yaofang:
党参 枸杞子 白术 杜仲 砂仁 菟丝子 巴戟天 桑寄生 火麻仁 续断 制何首乌 黄精 艾叶

27. 
patient face id: 02151906061085_1_2
label yaofang:
防己 当归 盐菟丝子 炙甘草 党参片 川牛膝 续断片 茯苓 黄芪 桑寄生 木瓜 威灵仙 细辛 独活 川芎 地龙
0.0231048 0.0574982 0.0677717 0.025157 0.0614517 0.191766 0.0449312 0.0565517 0.102665 0.054262 0.0527215 0.0672677 0.0654101 0.0609012
predicted yaofang:
川芎 当归 黄芪 细辛 防己 桑寄生 木瓜 川牛膝 地龙 炙甘草 威灵仙 党参片 盐菟丝子 续断片

28. 
patient face id: 01070833060641_1_7
label yaofang:
鸡内金 土茯苓 泽泻 薏苡仁 威灵仙 苍术 车前子 炙甘草 茯苓 桃仁 萹蓄 牡丹皮 黄柏 鸡内金 土茯苓 泽泻 薏苡仁 威灵仙 苍术 车前子 炙甘草 茯苓 桃仁 萹蓄 牡丹皮 黄柏
0.0219582 0.0308795 0.134189 0.18613 0.0231054 0.0742116 0.0918215 0.0890601 0.047665 0.052362 0.0538183 0.028342
predicted yaofang:
桂枝 白芍 薏苡仁 桃仁 红花 牡丹皮 苍术 泽泻 车前子 萹蓄 威灵仙 土茯苓

29. 
patient face id: 01130633110456_1_4_6
label yaofang:
鳖甲 天麻 天山雪莲 茯苓 砂仁 紫苏梗 郁金 黄连 半枝莲 蜈蚣 党参 山药 法半夏 广藿香 甘草 莪术
0.0547797 0.0678002 0.0568103 0.109725 0.0546742 0.0259948 0.111298 0.0825713 0.0439882 0.0304312 0.0581382 0.0820627 0.0680293 0.045842
predicted yaofang:
法半夏 党参 黄连 郁金 山药 砂仁 天麻 鳖甲 莪术 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲

30. 
patient face id: 01132330588757_2_1
label yaofang:
大枣 白眉草 前胡 栀子 蝉蜕 牛蒡子 玉竹 薄荷 葶苈子 淡豆豉 芦根 白茅根
0.0253108 0.0200177 0.0426941 0.0202572 0.0349313 0.0408366 0.0347132 0.027504 0.0717648 0.0469123 0.102446 0.0289562 0.0696524 0.0260566 0.0894689 0.0802903
predicted yaofang:
白芍 大枣 桔梗 金银花 薄荷 芦根 牛蒡子 桃仁 葶苈子 玉竹 栀子 白茅根 淡豆豉 百部 蝉蜕 白眉草

31. 
patient face id: 02161838182278_1_4
label yaofang:
炒六神曲 海螵蛸 炙甘草 肉桂 茯苓 干石斛 豆蔻 炒麦芽 麸炒白术 广藿香 甘松 炒稻芽 麸炒苍术 炒白扁豆 干姜 炙黄芪
0.0353138 0.0392035 0.0989982 0.0318307 0.0416361 0.0428209 0.0725231 0.079935 0.0699098 0.0611778 0.0579658 0.0767089 0.0657697 0.0618755 0.0624981
predicted yaofang:
海螵蛸 肉桂 干姜 豆蔻 炙甘草 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炙黄芪 炒六神曲 甘松 炒稻芽 干石斛 炒麦芽

32. 
patient face id: 02120925480463_6_7_1
label yaofang:
延胡索 乌药 桃仁 党参 柴胡 益母草 吴茱萸 麦芽 川楝子 薏苡仁 牡丹皮 茯苓 赤芍 五灵脂 甘草
0.0384153 0.0544651 0.0621272 0.0523919 0.0811468 0.0355339 0.0357398 0.0362125 0.0606698 0.0434802 0.102089 0.0211827
predicted yaofang:
柴胡 防风 桃仁 党参 丹参 赤芍 川楝子 乌药 益母草 吴茱萸 麦芽 建曲

33. 
patient face id: 01180602171656_1_2
label yaofang:
鳖甲 浙贝母 蜂房 太子参 麦冬 鹿角霜 甘草 白花蛇舌 桔梗 诃子 北沙参 百合 丹参 天山雪莲
0.0313255 0.038651 0.0774123 0.0378495 0.0701389 0.0635603 0.135549 0.0422054 0.042935 0.042877 0.0364412 0.0731207 0.06512 0.020965
predicted yaofang:
桔梗 麦冬 太子参 酸枣仁 丹参 生地黄 浙贝母 鳖甲 诃子 北沙参 百合 白花蛇舌 蜂房 四季青

34. 
patient face id: 02170847109438_1_4_7
label yaofang:
制何首乌 泽泻 夏枯草 红花 钩藤 丹参 牛膝 天麻 车前子 决明子 桃仁 莱菔子
0.0870735 0.0640574 0.0646503 0.0869454 0.0488374 0.0864826 0.0811572 0.0928496 0.0496903 0.0966431 0.116934 0.113407
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

35. 
patient face id: 02182250153830_4_1
label yaofang:
鳖甲 半枝莲 蜈蚣 杜仲 酸枣仁 党参 鸡血藤 茯苓 白花蛇舌 天麻 天山雪莲 桑寄生 远志 白术 甘草
0.0469586 0.0807079 0.0214585 0.0525404 0.0325422 0.043979 0.0361649 0.0340689 0.0926471 0.0462168 0.0302507 0.0357138 0.0993453 0.0472021 0.0451501 0.0276822
predicted yaofang:
白芍 独活 薏苡仁 党参 鸡血藤 白术 酸枣仁 杜仲 知母 天麻 桑寄生 鳖甲 威灵仙 蜈蚣 白花蛇舌 天山雪莲

36. 
patient face id: 01070834571715_1_4_6
label yaofang:
党参 黄芪 郁金 麦冬 茯苓 首乌藤 百合 浮小麦 制远志 酸枣仁 牡蛎 甘草
0.0840582 0.074678 0.0930359 0.021513 0.0961533 0.0478631 0.0695398 0.125906 0.108935 0.0906361 0.102055
predicted yaofang:
牡蛎 麦冬 党参 黄芪 酸枣仁 生地黄 郁金 浮小麦 首乌藤 百合 制远志

37. 
patient face id: 02020848231642_1_6
label yaofang:
鳖甲 天麻 天山雪莲 厚朴 茯苓 党参 火麻仁 半枝莲 蜈蚣 薏苡仁 黄柏 苍术 补骨脂 甘草
0.0951112 0.021197 0.0213921 0.0247457 0.0328264 0.0367222 0.0753215 0.139184 0.0716733 0.0203663 0.0302304 0.105822 0.112391 0.112243
predicted yaofang:
薏苡仁 白术 生地黄 黄柏 牛膝 苍术 厚朴 天麻 鳖甲 火麻仁 麦芽 蜈蚣 天山雪莲 半枝莲

38. 
patient face id: 02020950137737_6_5
label yaofang:
牡丹皮 柴胡 白芍 茯苓 合欢花 生地黄 甘草 栀子 黄芩片 白术 酸枣仁 党参 当归
0.159755 0.0454581 0.0814263 0.061462 0.0252887 0.0420239 0.0517046 0.16112 0.0573101 0.0623331 0.101476 0.0257402
predicted yaofang:
柴胡 白芍 当归 党参 白术 生地黄 栀子 牡丹皮 山药 黄芩片 合欢花 艾叶

39. 
patient face id: 01061601125917_5_6
label yaofang:
鳖甲 天麻 薏苡仁 法半夏 鱼腥草 款冬花 桑白皮 桔梗 半枝莲 蜈蚣 郁金 茯苓 紫菀 苦杏仁 浙贝母 甘草
0.07597 0.0216164 0.049106 0.0454847 0.0855842 0.0223053 0.0476024 0.054299 0.0211874 0.0271371 0.0251496 0.123479 0.0526621 0.0314349
predicted yaofang:
法半夏 前胡 桔梗 薏苡仁 浙贝母 郁金 桑白皮 天麻 鳖甲 款冬花 豆蔻 苦杏仁 蜈蚣 半枝莲

40. 
patient face id: 01092051141685_6_2
label yaofang:
北沙参 乌梅 玉竹 金樱子 砂仁 鸡内金 天花粉 黄芪 冬凌草 桑螵蛸 郁金
0.0819599 0.0334749 0.0303898 0.079476 0.0469765 0.042764 0.08957 0.0743784 0.0320783 0.0619551 0.0907696 0.112927
predicted yaofang:
玉竹 黄芪 白术 乌梅 郁金 砂仁 天花粉 金樱子 鸡内金 桑螵蛸 北沙参 冬凌草

41. 
patient face id: 01061604289217_5
label yaofang:
麻黄 浙贝母 黄芩片 法半夏 紫苏子 鱼腥草 款冬花 苦杏仁 桔梗 细辛 茯苓 桑白皮 莱菔子 甘草
0.0375367 0.0208235 0.0267349 0.080881 0.061882 0.0711476 0.117756 0.0410183 0.0921717 0.0507727 0.220921 0.0204111
predicted yaofang:
麻黄 法半夏 前胡 桔梗 鱼腥草 浙贝母 桑白皮 款冬花 苦杏仁 紫苏子 黄芩片 白花蛇舌

42. 
patient face id: 01190618050244_1_2_6
label yaofang:
鳖甲 半枝莲 蜈蚣 党参 生地黄 酸枣仁 首乌藤 浮小麦 白花蛇舌 天麻 天山雪莲 茯苓 沙苑子 远志 甘草
0.138527 0.0244229 0.150001 0.0667958 0.0881595 0.0506192 0.0437109 0.0491212 0.0813794 0.0520952 0.0544577 0.0523501 0.043409
predicted yaofang:
远志 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 首乌藤 沙苑子 蜈蚣 白花蛇舌 天山雪莲 半枝莲

43. 
patient face id: 01250636099448_5_6
label yaofang:
苇茎 浙贝母 茯苓 前胡 苦杏仁 桃仁 甘草 薏苡仁 桔梗 法半夏 款冬花 鱼腥草 远志 紫苏子
0.0406086 0.0839171 0.031174 0.0272884 0.0555952 0.0280506 0.0207489 0.0716437 0.0567288 0.0514073 0.0270311 0.026551 0.0252499 0.0210583 0.0478595 0.0229174 0.0409859 0.0232929 0.0215731
predicted yaofang:
陈皮 法半夏 前胡 桔梗 桃仁 远志 党参 浙贝母 郁金 天麻 磁石 鳖甲 款冬花 莪术 苦杏仁 紫苏子 蜈蚣 白花蛇舌 半枝莲

44. 
patient face id: 02020957549977_6_2_5
label yaofang:
鳖甲 天山雪莲 天麻 党参 薏苡仁 白术 僵蚕 甘草 白花蛇舌 半枝莲 蜈蚣 白扁豆 茯苓 牡丹皮 红豆杉
0.0359338 0.0708154 0.0522751 0.0415992 0.0305265 0.0254565 0.0760694 0.0351079 0.107357 0.0279881 0.078158 0.0543504 0.0451809 0.056139
predicted yaofang:
白芍 薏苡仁 党参 白术 延胡索 山药 砂仁 天麻 僵蚕 鳖甲 鸡内金 白扁豆 蜈蚣 红豆杉

45. 
patient face id: 02182258536887_2_6
label yaofang:
生地黄 当归 菟丝子 桑寄生 砂仁 艾叶 枳壳 五灵脂 白芍 川芎 益母草 何首乌 黄柏 柴胡 甘草
0.0378306 0.0239619 0.0240707 0.0868157 0.0230246 0.0572058 0.0341169 0.0279443 0.0205231 0.0986557 0.0355639 0.0352498 0.122117 0.0551851 0.0354961 0.0464329
predicted yaofang:
柴胡 白芍 川芎 当归 党参 何首乌 黄连 生地黄 赤芍 黄柏 山药 砂仁 菟丝子 桑寄生 益母草 艾叶

46. 
patient face id: 02010019115213_1_2_7
label yaofang:
鹿角霜 山药 川加皮 茯苓 丹参 生地黄 豆蔻 山茱萸 补骨脂 党参 白术 甘草 麦芽
0.118453 0.0576398 0.0216519 0.0204906 0.105726 0.023527 0.104739 0.0698097 0.0516283 0.0476621 0.0343968 0.0208077 0.0603639
predicted yaofang:
党参 白术 酸枣仁 丹参 生地黄 赤芍 山药 山茱萸 豆蔻 鹿角霜 首乌藤 白花蛇舌 川加皮

47. 
patient face id: 02182229014865_5_6
label yaofang:
鳖甲 半枝莲 蜈蚣 郁金 茯苓 山药 甘草 天山雪莲 白花蛇舌 天麻 薏苡仁 远志 党参 豆蔻 车前子
0.0314563 0.0308457 0.0859739 0.0494732 0.151485 0.0655687 0.0724036 0.0246653 0.113113 0.0884483 0.0752025 0.0556322
predicted yaofang:
薏苡仁 远志 党参 郁金 山药 天麻 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲

48. 
patient face id: 01012057139636_1_4
label yaofang:
制何首乌 钩藤 车前子 泽泻 丹参 决明子 夏枯草 牛膝 桃仁 红花 天麻 莱菔子
0.154043 0.0942876 0.0275075 0.0706613 0.0392013 0.071506 0.10184 0.133862 0.0478649 0.0511965 0.124665 0.0531771
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

49. 
patient face id: 01172359288914_1_5
label yaofang:
半夏 白术 甘草 砂仁 酸枣仁 太子参 茯苓 橘红 山慈菇 首乌藤 合欢皮 北沙参
0.094898 0.0742743 0.0355371 0.0699454 0.101799 0.108243 0.0692323 0.0954322 0.129333 0.0749323 0.107476
predicted yaofang:
半夏 橘红 麦冬 太子参 白术 酸枣仁 砂仁 北沙参 首乌藤 合欢皮 山慈菇

50. 
patient face id: 01061607383470_6_4_7
label yaofang:
天麻 党参 白术 红花 骨碎补 黄芪 桂枝 何首乌 赤芍 桑寄生 甘草 生地黄 桑枝 地龙 土茯苓
0.0995358 0.104164 0.040203 0.025167 0.0773836 0.0438348 0.0252608 0.0483097 0.0299288 0.0448487 0.0296039 0.0420026 0.0217136 0.0783175 0.0341506 0.0274741
predicted yaofang:
桂枝 党参 黄芪 白术 生地黄 红花 赤芍 牛膝 天麻 桑寄生 补骨脂 地龙 鹿角霜 桑枝 骨碎补 土茯苓

51. 
patient face id: 02181956257943_1_4_7
label yaofang:
鳖甲 半枝莲 蜈蚣 天山雪莲 法半夏 桔梗 茯苓 砂仁 白花蛇舌 天麻 甘草 党参 浙贝母 丹参 麦芽 莪术
0.0875896 0.0387313 0.0366101 0.0472896 0.0447941 0.101307 0.0654185 0.0223282 0.0434794 0.0230446 0.0440879 0.0252056 0.0343342
predicted yaofang:
法半夏 桔梗 党参 酸枣仁 丹参 浙贝母 郁金 砂仁 天麻 鳖甲 莪术 麦芽 蜈蚣

52. 
patient face id: 02020837005799_6_4
label yaofang:
浙贝母 牡蛎 茯苓 桔梗 牡丹皮 柴胡 猫爪草 法半夏 天山雪莲 甘草 栀子 白芍
0.0263541 0.0211299 0.0483942 0.0333057 0.0450992 0.0231588 0.0481997 0.0402797 0.0243354 0.0275951 0.0865838 0.031591 0.0247999 0.0338531 0.0408887 0.0462913
predicted yaofang:
柴胡 白芍 法半夏 桔梗 党参 白术 浙贝母 僵蚕 白芷 瓜蒌皮 鳖甲 苦杏仁 黄芩片 天山雪莲 三七片 猫爪草

53. 
patient face id: 01070842226206_1_4_7
label yaofang:
党参 枳壳 丹参 法半夏 黄芪 茯苓 竹茹 橘红 厚朴 甘草 郁金 延胡索
0.0822482 0.0680736 0.0515159 0.0235466 0.216496 0.0394154 0.0700772 0.0857332 0.097188 0.0274778 0.0950747
predicted yaofang:
枳壳 法半夏 橘红 桃仁 党参 黄芪 丹参 竹茹 郁金 山药 厚朴

54. 
patient face id: 02122354206093_1_2
label yaofang:
天麻 枸杞子 墨旱莲 党参 地龙 粉葛 白术 女贞子 川芎 黄芪 甘草
0.0236317 0.120909 0.022978 0.0239983 0.0513365 0.0310925 0.0360067 0.0461744 0.0322821 0.0206572 0.0317767 0.0433002 0.0313547 0.0229562 0.0704124 0.0615777
predicted yaofang:
白芍 川芎 当归 木香 党参 枸杞子 白术 赤芍 牛膝 山药 地黄 天麻 地龙 女贞子 粉葛 墨旱莲

55. 
patient face id: 02190511234753_1_2_6
label yaofang:
醋鳖甲 半枝莲 蜈蚣 首乌藤 白芍 茯苓 浙贝母 白花蛇舌草 天麻 酸枣仁 太子参 白术 白茅根 甘草
0.0257273 0.0254658 0.0400871 0.0410573 0.0262942 0.0279159 0.0627176 0.0865647 0.048566 0.0399889 0.023007 0.0319403 0.0723387 0.0299708 0.0514907 0.0279433 0.0962796
predicted yaofang:
白芍 法半夏 党参 太子参 白术 酸枣仁 浙贝母 知母 白茅根 天麻 天花粉 鳖甲 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲

56. 
patient face id: 01190438144769_3_5_7
label yaofang:
鳖甲 甘草 红豆杉 蒲公英 皂角刺 当归 莪术 连翘 党参 蜈蚣 半枝莲 败酱草 黄芪 郁金 紫苏梗 牡丹皮
0.0385399 0.0267179 0.0221092 0.0337885 0.124737 0.129574 0.0401849 0.0662014 0.0271732 0.0221189 0.0214205 0.0314449 0.0270457 0.0200917 0.0201896 0.0359103
predicted yaofang:
白芍 川芎 当归 薏苡仁 蒲公英 党参 白术 生地黄 赤芍 牡丹皮 郁金 山药 皂角刺 蜈蚣 合欢花 红豆杉

57. 
patient face id: 01172333316006_7_6_5
label yaofang:
鳖甲 薏苡仁 天麻 浙贝母 郁金 蝉蜕 山药 白花蛇舌 莪术 蜈蚣 桔梗 诃子 天山雪莲 甘草
0.0212825 0.0268077 0.026954 0.0412188 0.0251291 0.0237381 0.0226397 0.0325072 0.0582946 0.0451911 0.118927 0.0596164 0.055729 0.0249988 0.0472778 0.102513 0.0382414
predicted yaofang:
法半夏 桔梗 薏苡仁 桃仁 党参 酸枣仁 丹参 浙贝母 郁金 天麻 鳖甲 莪术 诃子 蝉蜕 蜈蚣 白花蛇舌 天山雪莲

58. 
patient face id: 01061932296050_4
label yaofang:
炒紫苏子 款冬花 炙甘草 前胡 白前 防风 百部 法半夏 陈皮 紫菀 蜜麻黄 广藿香
0.0792086 0.112863 0.140902 0.145686 0.0787843 0.096614 0.0626222 0.0566267 0.0483109 0.0270738 0.0680436 0.0655366
predicted yaofang:
陈皮 法半夏 前胡 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

59. 
patient face id: 01132122138549_6_7_1
label yaofang:
鳖甲 山药 茯苓 白术 丹参 黄精 远志 麦芽 党参 酸枣仁 甘草 土鳖虫 益母草 赤芍 首乌藤
0.0546673 0.0263855 0.0623289 0.0972015 0.0216787 0.126925 0.0347861 0.0578368 0.17859 0.0542653 0.0533928
predicted yaofang:
远志 党参 酸枣仁 丹参 生地黄 赤芍 山药 益母草 首乌藤 黄精 土鳖虫

60. 
patient face id: 01312138430082_1_2_6
label yaofang:
鳖甲 半枝莲 蜈蚣 女贞子 党参 赤芍 杜仲 甘草 白花蛇舌 天麻 天山雪莲 墨旱莲 白芍 宽筋藤 桑寄生 山茱萸
0.109484 0.0639643 0.047934 0.0395921 0.0388535 0.0302544 0.0596115 0.023495 0.0412054 0.0349454 0.0476505 0.0246032 0.0350747 0.0380982 0.058609 0.0353271
predicted yaofang:
白芍 党参 白术 生地黄 山药 山茱萸 天麻 桑寄生 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤 墨旱莲

61. 
patient face id: 01101808493959_4_1
label yaofang:
炒紫苏子 款冬花 法半夏 广藿香 前胡 白前 蜜麻黄 茯苓 百部 桔梗 炙甘草 紫菀 陈皮 防风
0.134445 0.0718401 0.116312 0.038929 0.045639 0.090397 0.0550691 0.0588537 0.110876 0.0526679 0.0324471 0.064356 0.0914661
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

62. 
patient face id: 01201959434060_1_6_4
label yaofang:
黄芪 菟丝子 山药 稻芽 橘核 砂仁 合欢皮 白术 桑寄生 鸡内金 麦芽 厚朴 北沙参 首乌藤
0.048494 0.0584212 0.0248436 0.0656052 0.0927299 0.0797425 0.0480763 0.0440775 0.0316089 0.0358357 0.0651128 0.169445 0.0283885 0.0493301
predicted yaofang:
党参 白术 山药 厚朴 砂仁 菟丝子 桑寄生 鸡内金 麦芽 北沙参 橘核 首乌藤 合欢皮 稻芽

63. 
patient face id: 02161929314258_1_6_4
label yaofang:
黄芪 太子参 紫苏梗 鸡内金 补骨脂 合欢皮 云芝 白术 茯苓 砂仁 麦芽 海螵蛸 首乌藤 枸杞子
0.0224909 0.0360959 0.0686978 0.0565162 0.0202573 0.103813 0.0701878 0.122362 0.193648 0.039787 0.0994666 0.048086
predicted yaofang:
橘红 太子参 黄芪 枸杞子 白术 海螵蛸 补骨脂 鸡内金 首乌藤 紫苏梗 合欢皮 云芝

64. 
patient face id: 01111901118795_1_4
label yaofang:
炒紫苏子 款冬花 蜜麻黄 干姜 前胡 白前 炙甘草 细辛 百部 枸杞子 太子参 茯苓 紫菀 法半夏 北沙参 醋五味子
0.0375932 0.0231568 0.0520682 0.0595495 0.0397611 0.073879 0.0393871 0.088065 0.064122 0.0887423 0.146704 0.0761581 0.0467817 0.0662596 0.0578072
predicted yaofang:
前胡 防风 太子参 枸杞子 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子

65. 
patient face id: 01121835398485_2_1
label yaofang:
北柴胡 煅牡蛎 太子参 郁金 枸杞子 白芍 北沙参 炒酸枣仁 柏子仁 酒女贞子 煅龙骨 制远志 茯苓
0.0738735 0.063807 0.0216264 0.116613 0.0823698 0.0729253 0.0668082 0.0978679 0.0483781 0.0831935 0.056206 0.0656406
predicted yaofang:
白芍 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 制远志 酒女贞子 煅龙骨 炒酸枣仁

66. 
patient face id: 01200701550485_5_6
label yaofang:
黄芩 白术 地黄 茯苓 金银花 牡丹皮 麦芽 白芍 甘草 党参 连翘 蒲公英 黄芪 升麻
0.124317 0.0973222 0.0496497 0.0908372 0.0562522 0.118933 0.102552 0.0662784 0.0966132 0.0259836 0.0350272 0.0573022 0.0261804
predicted yaofang:
甘草 白芍 黄芩 金银花 连翘 蒲公英 党参 黄芪 白术 牡丹皮 地黄 升麻 麦芽

67. 
patient face id: 01122233461655_5_7_6
label yaofang:
法半夏 茯苓 石菖蒲 远志 巴戟天 金樱子 锁阳 首乌藤 郁金 党参 蜈蚣 甘草 当归 山药 合欢花 牡丹皮
0.0218943 0.0231807 0.0318862 0.10579 0.0334647 0.0347339 0.0484065 0.0271072 0.0795322 0.0231865 0.0242634 0.0378755 0.0317752 0.0237359 0.020255 0.0296966
predicted yaofang:
白芍 陈皮 法半夏 党参 白术 酸枣仁 生地黄 郁金 山药 石菖蒲 菟丝子 桑寄生 金樱子 锁阳 首乌藤 合欢花

68. 
patient face id: 02122100201809_1_6
label yaofang:
柴胡 茯苓 香附 桑寄生 生地黄 甘草 白芍 枳壳 木香 五灵脂 杜仲 山茱萸 山药
0.0224532 0.0554291 0.148571 0.0779856 0.0421752 0.0201113 0.0210313 0.045264 0.0318132 0.0492989 0.0227241 0.0275077 0.0811891 0.0357214
predicted yaofang:
桂枝 白芍 木香 党参 白术 酸枣仁 生地黄 赤芍 杜仲 山药 山茱萸 五灵脂 桑寄生 补骨脂

69. 
patient face id: 01132120395633_1_6_5
label yaofang:
柴胡 茯苓 合欢花 砂仁 甘草 法半夏 木香 白芍 党参 佛手 郁金 麦芽 黄连 山药
0.0687506 0.0263686 0.0966417 0.0755025 0.0221207 0.0487492 0.0216329 0.0373264 0.0302765 0.0267202 0.101022 0.0217959 0.024386 0.0478503 0.0314579 0.0446395
predicted yaofang:
枳壳 法半夏 木香 党参 酸枣仁 丹参 黄连 生地黄 赤芍 郁金 山药 砂仁 鳖甲 佛手 白花蛇舌 合欢花

70. 
patient face id: 02131313295349_1_4_7
label yaofang:
党参 乌药 肉桂 仙茅 熟附子 益智 黄芪 覆盆子 鹿角霜 山药 当归 淫羊藿 干姜
0.0475163 0.0912311 0.0370594 0.0322362 0.053477 0.0489549 0.0744965 0.0572689 0.0247803 0.0502024 0.0560224 0.0674156 0.0882953 0.0759934
predicted yaofang:
白芍 当归 党参 黄芪 白术 熟附子 乌药 肉桂 干姜 淫羊藿 仙茅 益智 鹿角霜 覆盆子

71. 
patient face id: 02190506572928_6_4_2
label yaofang:
天麻 白术 甘草 麦芽 补骨脂 竹茹 山药 夏枯草 僵蚕 党参 沙苑子 山茱萸 法半夏 益智 辛夷
0.0964991 0.120594 0.0502344 0.0540707 0.0446416 0.048039 0.0405432 0.078053 0.0804589 0.0589884 0.0708685 0.0949462 0.0429869
predicted yaofang:
法半夏 党参 竹茹 山药 山茱萸 天麻 僵蚕 补骨脂 夏枯草 麦芽 益智 辛夷 沙苑子

72. 
patient face id: 02171934369190_1_2_3
label yaofang:
北沙参 黄芪 厚朴 辛夷 冬凌草 肉桂 乌梅 玉竹 白术 火麻仁 肉苁蓉 附子 山茱萸 猫爪草
0.0425516 0.02531 0.0203964 0.0526121 0.437296 0.0488726 0.0719143 0.0243521 0.0262891
predicted yaofang:
玉竹 党参 黄芪 附子 肉桂 肉苁蓉 火麻仁 辛夷 冬凌草

73. 
patient face id: 02191622252526_6_1
label yaofang:
鳖甲 天麻 党参 甘草 天山雪莲 杜仲 益母草 白花蛇舌 蜈蚣 茯苓 半枝莲 桑寄生 菟丝子 浮小麦
0.0741153 0.0209326 0.0272584 0.0450663 0.0327376 0.0470525 0.0238229 0.0639123 0.0906914 0.0431798 0.0319999 0.0518821 0.0240433 0.0765118 0.0490194 0.0558878 0.0481771
predicted yaofang:
党参 黄芪 白术 酸枣仁 牡丹皮 杜仲 山药 天麻 菟丝子 桑寄生 益母草 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

74. 
patient face id: 02110731073939_1_6_7
label yaofang:
制何首乌 车前子 丹参 夏枯草 桃仁 天麻 钩藤 泽泻 决明子 牛膝 红花 莱菔子
0.0959739 0.0969644 0.0776059 0.109577 0.0742727 0.0861803 0.0239545 0.0295533 0.0704241 0.0656217 0.0462622 0.107087 0.0851758
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 威灵仙

75. 
patient face id: 01081940504440_2_5
label yaofang:
黄芩冲剂 柴胡冲剂 石膏冲剂 龙骨冲剂 牡蛎冲剂 远志冲剂 茯神冲剂 生地冲剂 当归冲剂 枳实冲剂 白芍冲剂 法夏冲剂 干姜冲剂 大黄冲剂
0.0238395 0.0811036 0.0790562 0.0805062 0.0710082 0.0709662 0.0732533 0.0703362 0.0644267 0.063391 0.0368189 0.0602947 0.0599923 0.0392476 0.0414438
predicted yaofang:
牛蒡子 黄芩冲剂 柴胡冲剂 石膏冲剂 当归冲剂 枳实冲剂 白芍冲剂 法夏冲剂 干姜冲剂 大黄冲剂 生地冲剂 龙骨冲剂 牡蛎冲剂 远志冲剂 茯神冲剂

76. 
patient face id: 01141134578681_6_2_4
label yaofang:
鳖甲 天麻 天山雪莲 败酱草 党参 白芍 莪术 半枝莲 蜈蚣 薏苡仁 熟附子 柴胡 牡丹皮 甘草
0.0285255 0.125518 0.0223696 0.0764118 0.0263112 0.037509 0.112224 0.0508548 0.0540902 0.0830498 0.0292149 0.0405693 0.0504656
predicted yaofang:
柴胡 白芍 川芎 党参 白术 生地黄 天麻 鳖甲 败酱草 蜈蚣 白花蛇舌 天山雪莲 半枝莲

77. 
patient face id: 02191628432476_6_1
label yaofang:
鳖甲 党参 骨碎补 山药 甘草 浙贝母 白芍 牡丹皮 白花蛇舌 薏苡仁 茯苓 生地黄 天山雪莲 细辛 栀子
0.0273201 0.0575433 0.112079 0.0419264 0.0572943 0.0333201 0.0577702 0.0702499 0.0479085 0.0305517 0.0311993 0.0294723
predicted yaofang:
白芍 薏苡仁 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 麦芽 白花蛇舌 天山雪莲

78. 
patient face id: 01062047334765_1_5_6
label yaofang:
鳖甲 天麻 天山雪莲 败酱草 薏苡仁 山药 半枝莲 蜈蚣 莪术 附子 党参 甘草
0.117684 0.0488877 0.0571306 0.0263083 0.126499 0.0619733 0.0291213 0.0711593 0.0523445 0.0487223 0.0289048
predicted yaofang:
薏苡仁 党参 赤芍 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲

79. 
patient face id: 01202004249571_3_2_6
label yaofang:
太子参 桑枝 海螵蛸 紫苏梗 土鳖虫 北沙参 砂仁 白术 夏天无 龙骨 山药 半夏 枸杞子
0.0803898 0.0464929 0.0620992 0.024889 0.0492845 0.154927 0.0467677 0.0475665
predicted yaofang:
半夏 白术 海螵蛸 浙贝母 砂仁 北沙参 威灵仙 夏天无

80. 
patient face id: 01132306473066_2_4
label yaofang:
蝉蜕 三七片 太子参 酒萸肉 鳖甲 麦冬 白芍
0.0647562 0.0207529 0.0632376 0.11378 0.0364538 0.113966 0.0671032 0.0566541 0.0207254 0.0316731 0.0334652
predicted yaofang:
白芍 桔梗 牡蛎 麦冬 党参 知母 蝉蜕 炙甘草 首乌藤 三七片 酒萸肉

81. 
patient face id: 02141631108859_1_4_7
label yaofang:
麦冬 枸杞子 天花粉 玉米须 党参 山药 甘草 黄芪 北沙参 玄参 牡丹皮 生地黄
0.0552935 0.197572 0.0579174 0.122033 0.126695 0.0287899 0.0276884 0.287246 0.0510947
predicted yaofang:
麦冬 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须

82. 
patient face id: 01201314291366_1
label yaofang:
醋鳖甲 半枝莲 蜈蚣 党参 白术 山药 甘草 浮小麦 白花蛇舌草 天麻 首乌藤 茯苓 砂仁 紫苏梗 合欢花
0.0977332 0.0370611 0.0280766 0.0262342 0.105579 0.0344684 0.0545074 0.0294763 0.0662311 0.0573503 0.07241 0.139789
predicted yaofang:
党参 丹参 山药 天麻 白花蛇舌草 浮小麦 首乌藤 紫苏梗 蜈蚣 合欢花 半枝莲 醋鳖甲

83. 
patient face id: 01312058397579_5_6
label yaofang:
柴胡 枳实 黑枣 甘草 广金钱草 党参 陈皮 黄芩 半夏 白芍 延胡索 山药 茯苓 砂仁
0.0468158 0.0469195 0.0819197 0.0289161 0.087089 0.0516702 0.0356295 0.025866 0.0674173 0.11933 0.0250836 0.0762768
predicted yaofang:
柴胡 白芍 陈皮 黄芩 半夏 白术 延胡索 枳实 山药 砂仁 鸡内金 黑枣

84. 
patient face id: 02191249286384_5_6
label yaofang:
天麻 决明子 薏苡仁 杜仲 首乌藤 白芷 连翘 甘草 钩藤 蒲公英 桑寄生 牛膝 当归 莱菔子 麦芽
0.033857 0.107792 0.0203307 0.0222769 0.0442413 0.150336 0.0549231 0.047109 0.0263623
predicted yaofang:
党参 丹参 生地黄 牛膝 钩藤 莱菔子 天麻 扁豆花 决明子

85. 
patient face id: 01182130382363_3_4_6
label yaofang:
党参 胆南星 酸枣仁 郁金 龙骨 厚朴 苍术 扁豆花 丹参 法半夏 黄连 茯苓 甘草 川加皮 莱菔子 三棱
0.044333 0.0798834 0.0284674 0.0278 0.0903902 0.0200577 0.0207564 0.0221706 0.0580433 0.0225772 0.0249194 0.13831
predicted yaofang:
法半夏 党参 白术 酸枣仁 丹参 黄连 浙贝母 山药 莱菔子 天麻 麦芽 川加皮

86. 
patient face id: 02120927549252_1_2
label yaofang:
醋鳖甲 半枝莲 蜈蚣 党参 山药 泽泻 艾叶 白花蛇舌草 天麻 地黄 山茱萸 白术 茜草 甘草
0.0215188 0.0221593 0.0221126 0.0338332 0.0365767 0.0601212 0.0244745 0.0451463 0.0244809 0.1477 0.0477 0.035077 0.0318588 0.0511546 0.026738 0.0351706 0.085428 0.0426384
predicted yaofang:
桂枝 柴胡 白芍 川芎 远志 党参 白术 酸枣仁 牡丹皮 地黄 天麻 菟丝子 益母草 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 艾叶

87. 
patient face id: 01111905168988_4
label yaofang:
茯苓 前胡 紫菀 百部 炒六神曲 防风 辛夷 款冬花 炒苍耳子 法半夏 紫苏梗 广藿香 甘草片 蜜麻黄
0.0627182 0.0736975 0.0411233 0.118396 0.13976 0.0359878 0.106861 0.0368459 0.0478364 0.135393 0.0270582 0.0660715 0.0296907
predicted yaofang:
法半夏 前胡 防风 款冬花 紫菀 白前 百部 辛夷 紫苏梗 广藿香 甘草片 蜜麻黄 炒六神曲

88. 
patient face id: 01041842133304_1_4
label yaofang:
百部 陈皮 细辛 紫菀 半夏 干姜 款冬花 麻黄 黄芪 白前 炙甘草
0.0246819 0.108224 0.042241 0.0397224 0.149254 0.0472367 0.0368519 0.0279605 0.0735815 0.0516379 0.0289945 0.0855935 0.0666438 0.0376173
predicted yaofang:
桂枝 陈皮 法半夏 桔梗 半夏 黄芪 海螵蛸 细辛 干姜 款冬花 紫菀 百部 炙甘草 广藿香

89. 
patient face id: 01201550034210_1_6
label yaofang:
郁金 甘草 天麻 厚朴 党参 金银花 百部 土茯苓 豆蔻 天山雪莲 薏苡仁 法半夏 茯苓 荆芥穗 灯心草 白鲜皮 红花
0.0218821 0.060544 0.0211086 0.0553362 0.0313893 0.102616 0.0215206 0.0381581 0.0871092 0.0458707 0.0526895 0.0364371 0.0452888 0.0256458
predicted yaofang:
法半夏 薏苡仁 桃仁 党参 白术 红花 浙贝母 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

90. 
patient face id: 02021012407689_6_1_7
label yaofang:
太子参 白术 芡实 龙眼肉 百合 茯苓 山药 薏苡仁 莲子
0.0299346 0.0705793 0.0509958 0.120844 0.0313056 0.054779 0.0366688 0.101878 0.119585 0.0286604 0.0454484
predicted yaofang:
薏苡仁 太子参 白术 龙眼肉 山药 砂仁 菟丝子 芡实 莲子 北沙参 百合

91. 
patient face id: 01192241040696_2_5
label yaofang:
柴胡 茯苓 山药 益母草 山茱萸 龙骨 水牛角 栀子 白芍 牡丹皮 菟丝子 地黄 酸枣仁 甘草 玄参
0.0504155 0.0516762 0.0238574 0.0386994 0.0217074 0.0666109 0.111029 0.0533485 0.0396863 0.127686 0.0627838 0.0726243 0.0688313
predicted yaofang:
柴胡 龙骨 白术 玄参 赤芍 栀子 牡丹皮 山药 山茱萸 地黄 水牛角 菟丝子 益母草

92. 
patient face id: 02110735409807_1_6
label yaofang:
制何首乌 泽泻 夏枯草 红花 钩藤 丹参 牛膝 天麻 车前子 决明子 桃仁 莱菔子
0.0629387 0.147 0.0800204 0.0583731 0.0651169 0.139479 0.101329 0.0542443 0.064598 0.0516219 0.10213
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

93. 
patient face id: 02161844419121_1
label yaofang:
薄荷 前胡 甘草片 白芷 炒苍耳子 防风 紫菀 百部 荆芥穗 桔梗 辛夷 广藿香 法半夏 紫苏梗
0.0861218 0.0904914 0.0258975 0.0629336 0.0643333 0.0710929 0.0217902 0.0245047 0.0724358 0.090913 0.0751123 0.0894001 0.0679594 0.0424289 0.0847872
predicted yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 百部 辛夷 紫苏梗 广藿香 甘草片 炒苍耳子

94. 
patient face id: 01031832103853_2
label yaofang:
炒紫苏子 款冬花 炙甘草 炒苍耳子 炒紫苏子 款冬花 炙甘草 炒苍耳子 炒紫苏子 款冬花 炙甘草 干姜 前胡 白前 防风 细辛 前胡 白前 防风 细辛 前胡 白前 防风 百部 法半夏 荆芥穗 干姜 百部 法半夏 荆芥穗 干姜 百部 法半夏 荆芥穗 紫菀 蜜麻黄 辛夷 紫菀 蜜麻黄 辛夷 紫菀 蜜麻黄 细辛
0.0899724 0.114814 0.0687414 0.0485413 0.0256961 0.0518473 0.0670445 0.0649272 0.0453855 0.0934975 0.0411059 0.0724149 0.0573832 0.0802014 0.0553462
predicted yaofang:
法半夏 前胡 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子

95. 
patient face id: 02191242000472_1_5
label yaofang:
醋鳖甲 薏苡仁 蜈蚣 青蒿 滑石 黄柏 山药 甘草 白花蛇舌草 天麻 莪术 牡丹皮 厚朴 党参 豆蔻 麦芽
0.0446393 0.0767439 0.0413523 0.0449976 0.100638 0.051291 0.0990133 0.0933959 0.0479362 0.0443544 0.0203707 0.0311327 0.0357704 0.0209385 0.0366393 0.0279113
predicted yaofang:
薏苡仁 党参 白术 牡丹皮 黄柏 山药 厚朴 青蒿 天麻 滑石 火麻仁 莪术 豆蔻 麦芽 蜈蚣 醋鳖甲

96. 
patient face id: 02141935004376_6
label yaofang:
白术 甘草 枳实 干姜 肉桂 附片
0.254828 0.152676 0.184891 0.0810656 0.226021
predicted yaofang:
白术 枳实 肉桂 干姜 附片

97. 
patient face id: 01190633162554_1_2_5
label yaofang:
鳖甲 薏苡仁 蜈蚣 白茅根 细辛 紫菀 百部 党参 山药 白花蛇舌 天麻 天山雪莲 炙麻黄 五味子 款冬花 茜草 甘草
0.0730052 0.0509967 0.0232937 0.0217951 0.0689388 0.0503378 0.036991 0.0265413 0.0536838 0.026373 0.0299111 0.0259313 0.0388399 0.0229997 0.0646839 0.0242928
predicted yaofang:
陈皮 法半夏 桔梗 薏苡仁 党参 山药 茜草 天麻 鳖甲 款冬花 紫菀 诃子 炙麻黄 蜈蚣 白花蛇舌 天山雪莲

98. 
patient face id: 02161927452714_5
label yaofang:
荆芥 辛夷 桑叶 白芷 紫苏叶 橘红 防风 苍耳子 菊花 枇杷叶 鸡内金 桑白皮
0.0284639 0.0422773 0.0401862 0.0225111 0.0912874 0.0446506 0.121404 0.0400758 0.0871923 0.0262228 0.0220464 0.0251638 0.118972 0.15047
predicted yaofang:
麻黄 前胡 橘红 荆芥 防风 桑叶 菊花 桑白皮 白芷 百部 鸡内金 枇杷叶 辛夷 苍耳子

99. 
patient face id: 01062338053814_1_4_7
label yaofang:
党参 厚朴 茯苓 桃仁 竹茹 法半夏 黄芪 枳实 甘草 丹参 胆南星 橘红
0.0760682 0.0383531 0.105705 0.112648 0.249334 0.0636299 0.0241053 0.0498403 0.0405804
predicted yaofang:
法半夏 党参 丹参 枳实 竹茹 胆南星 干姜 厚朴 鸡内金

100. 
patient face id: 01132309492493_1_7
label yaofang:
蝉蜕 牛蒡子 玉竹 薄荷 葶苈子 淡豆豉 芦根 白茅根 白眉草 前胡 栀子
0.0418291 0.0278409 0.0819492 0.101475 0.129119 0.0831912 0.0498218 0.0903225 0.0667349 0.0455973 0.0359913 0.0809289
predicted yaofang:
前胡 桔梗 薄荷 芦根 牛蒡子 葶苈子 玉竹 栀子 白茅根 淡豆豉 蝉蜕 白眉草

101. 
patient face id: 01031833212193_5
label yaofang:
前胡 百部 紫菀 款冬花 白前 陈皮 法半夏 炙甘草 防风 广藿香 豆蔻 茯苓 麸炒白术
0.0385837 0.140292 0.0942665 0.0808311 0.0263076 0.0535552 0.100963 0.0857369 0.0529445 0.0547225 0.0838575 0.0651743 0.0604613
predicted yaofang:
陈皮 法半夏 前胡 防风 荆芥穗 款冬花 紫菀 白前 百部 豆蔻 炙甘草 广藿香 麸炒白术

102. 
patient face id: 02131323185418_1_7
label yaofang:
制何首乌 车前子 丹参 夏枯草 桃仁 天麻 钩藤 泽泻 决明子 牛膝 红花 莱菔子
0.0780754 0.10959 0.0234424 0.105875 0.0352586 0.0423039 0.128346 0.0627241 0.143223 0.100668 0.0650487 0.0476678
predicted yaofang:
桃仁 丹参 生地黄 红花 牛膝 钩藤 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

103. 
patient face id: 02182227538034_2_1
label yaofang:
鳖甲 半枝莲 天麻 天山雪莲 谷精子 木贼 麦芽 白花蛇舌 甘草 蜈蚣 酸枣仁 丹参 首乌藤 白芍
0.04929 0.118935 0.0808129 0.0337658 0.0219722 0.0716148 0.0212487 0.262261 0.027747 0.0307075 0.0221374 0.0272518 0.0277496
predicted yaofang:
党参 酸枣仁 丹参 天麻 鳖甲 麦芽 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 谷精子

104. 
patient face id: 02182311166006_1
label yaofang:
鳖甲 天麻 莪术 桑螵蛸 红豆杉 薏苡仁 益智 菟丝子 半枝莲 蜈蚣 党参 甘草 天山雪莲 五倍子 茯苓 广升麻
0.0617961 0.0318404 0.0704441 0.0639121 0.0387769 0.121585 0.0248052 0.0312488 0.0561066 0.0817822 0.0600792 0.0316032 0.0226074 0.0414142
predicted yaofang:
薏苡仁 党参 生地黄 山药 天麻 鳖甲 莪术 五倍子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 广升麻

105. 
patient face id: 01200655104444_6_2_4
label yaofang:
鳖甲 白花蛇舌草 半枝莲 天麻 蜈蚣 天山雪莲 细辛 白芷 石膏 黄连 山茱萸 牛膝 蒲公英 麦芽 甘草 广升麻
0.0246193 0.0348486 0.0382378 0.0208799 0.0810731 0.0446013 0.0473879 0.023471 0.0229516 0.122321 0.0496014 0.0233739 0.0368078 0.03583 0.0308326
predicted yaofang:
法半夏 蒲公英 党参 白术 黄连 牛膝 石膏 山茱萸 细辛 天麻 白芷 麦芽 蜈蚣 半枝莲 广升麻

106. 
patient face id: 02191255253650_4_6
label yaofang:
鳖甲 半枝莲 蜈蚣 浙贝母 前胡 黄芩片 苦杏仁 白花蛇舌 天麻 天山雪莲 桔梗 白前 细辛 甘草
0.0232486 0.0213617 0.0703412 0.0327362 0.0293872 0.0794456 0.03766 0.0551695 0.0294469 0.0703978 0.0217215 0.103908 0.105946 0.0853812 0.0609979 0.0339677
predicted yaofang:
法半夏 大枣 前胡 桔梗 鱼腥草 浙贝母 天麻 鳖甲 白前 苦杏仁 蝉蜕 蜈蚣 黄芩片 白花蛇舌 天山雪莲 半枝莲

107. 
patient face id: 01121845562436_2
label yaofang:
炒紫苏子 款冬花 炙甘草 辛夷 前胡 白前 防风 白芷 百部 法半夏 广藿香 炒苍耳子 紫菀 蜜麻黄 细辛
0.184855 0.0613095 0.0819837 0.0429813 0.122344 0.0897027 0.0256713 0.0303928 0.0551805 0.0457949 0.0356668 0.0260383 0.0265026 0.0285385 0.121456
predicted yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子

108. 
patient face id: 01012052236803_1_4_7
label yaofang:
党参 黄芪 苦杏仁 金银花 木香 茯苓 甘草 百部 丹参 竹茹 干鱼腥草 法半夏 橘红 草豆蔻 鸡内金 六神曲
0.0271613 0.0772117 0.0921651 0.0223402 0.0877448 0.0579672 0.0279796 0.0476337 0.0285911 0.0770941 0.100807 0.0959799
predicted yaofang:
法半夏 橘红 木香 金银花 丹参 竹茹 钩藤 莱菔子 鸡内金 草豆蔻 六神曲 干鱼腥草

109. 
patient face id: 01211231484565_1_2
label yaofang:
蝉蜕 酸枣仁 附子 白术 麦冬 磁石 茯苓 柏子仁 龙骨 白芍
0.189978 0.0654105 0.0781625 0.0429549 0.1172 0.0902876 0.109664 0.0661354 0.0841116 0.0255321
predicted yaofang:
白芍 龙骨 麦冬 白术 酸枣仁 柏子仁 附子 磁石 蝉蜕 炙甘草

110. 
patient face id: 02141949377929_6
label yaofang:
车前子 黄连 干姜 肉桂 附片
0.107885 0.189406 0.290183 0.167651 0.0208634 0.195838
predicted yaofang:
黄连 肉桂 车前子 干姜 炙甘草 附片

111. 
patient face id: 02182259505353_1_2_6
label yaofang:
柴胡 茯苓 山药 砂仁 益母草 香附 甘草 麦芽 白芍 党参 白扁豆 菟丝子 酸枣仁 郁金 丹参
0.0250293 0.0561012 0.0320928 0.0303676 0.0605646 0.098838 0.0203974 0.14126 0.0346762 0.0305265 0.0330603 0.0204338 0.0416486 0.0604467 0.0561115
predicted yaofang:
柴胡 白芍 川芎 大枣 党参 酸枣仁 丹参 生地黄 赤芍 牡丹皮 山药 山茱萸 菟丝子 益母草 麦芽

112. 
patient face id: 01061611102009_5_6
label yaofang:
鳖甲 浙贝母 苦杏仁 枳壳 天山雪莲 茯苓 山药 郁金 白花蛇舌 桔梗 火麻仁 黄连 党参 白术 丹参 甘草
0.0623468 0.067189 0.117865 0.0311739 0.036871 0.0537699 0.0285866 0.0403091 0.0200522 0.0233894 0.0515112 0.0248016 0.0390829 0.063658 0.0231925
predicted yaofang:
白芍 枳壳 党参 白术 丹参 黄连 郁金 山药 车前子 天麻 鳖甲 火麻仁 麦芽 白花蛇舌 天山雪莲

113. 
patient face id: 01042304321914_4
label yaofang:
仙鹤草 豆蔻 牛膝 生石膏 苍术 川木通 甘草 干姜 姜半夏 草果 淡竹叶 浙贝母 龙脷叶
0.0546627 0.107049 0.052169 0.104513 0.0744575 0.0558728 0.0722233 0.093616 0.0360876 0.0237854 0.0673801 0.0715384 0.0733692
predicted yaofang:
浙贝母 牛膝 苍术 干姜 草果 仙鹤草 淡竹叶 生石膏 豆蔻 苦杏仁 姜半夏 川木通 龙脷叶

114. 
patient face id: 02111334042838_1_2_7
label yaofang:
麦冬 枸杞子 天花粉 玉米须 党参 山药 甘草 黄芪 北沙参 玄参 牡丹皮 生地黄
0.0283652 0.0792778 0.0897439 0.0454851 0.0798324 0.0640417 0.165598 0.0897474 0.0877243 0.0582593 0.105974 0.0758415
predicted yaofang:
薏苡仁 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须

115. 
patient face id: 02191256242879_6_2
label yaofang:
鳖甲 半枝莲 蜈蚣 柴胡 枳壳 郁金 延胡索 木香 白花蛇舌 天麻 天山雪莲 白芍 鸡内金 北沙参 甘草
0.044639 0.0716334 0.028514 0.0519269 0.0587284 0.033344 0.0371047 0.0289171 0.0825602 0.0249705 0.0468537 0.0241277 0.0597074 0.0653958 0.0632958 0.0229083
predicted yaofang:
柴胡 白芍 枳壳 木香 党参 酸枣仁 生地黄 延胡索 郁金 天麻 鳖甲 火麻仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲

116. 
patient face id: 02141936214927_4
label yaofang:
续断 徐长卿 甘草 土茯苓 补骨脂 威灵仙 玉竹 玉米须 萆薢 土鳖虫 牛膝
0.0499441 0.0501651 0.0262007 0.0674992 0.123093 0.0318916 0.0777528 0.0648875 0.0220121 0.0565016 0.0404554 0.0547249
predicted yaofang:
玉竹 生地黄 熟地黄 牛膝 泽泻 菟丝子 萆薢 续断 威灵仙 玉米须 土鳖虫 徐长卿

117. 
patient face id: 02122236475814_3_4
label yaofang:
鳖甲 天麻 党参 补骨脂 干姜 甘草 天山雪莲 木香 半枝莲 蜈蚣 山药 赤石脂 吴茱萸 建曲 白芍 车前子
0.0628094 0.0262635 0.083645 0.0217301 0.0445117 0.0218121 0.0221124 0.0951883 0.0378026 0.0203984 0.0551547 0.0279984 0.053403 0.0274555 0.0287161 0.0321402 0.0239554 0.0539108
predicted yaofang:
木香 薏苡仁 党参 白术 酸枣仁 丹参 生地黄 山药 山茱萸 车前子 天麻 赤石脂 鳖甲 补骨脂 建曲 蜈蚣 白花蛇舌 天山雪莲

118. 
patient face id: 01051906302461_2
label yaofang:
防风 棉萆薢 炙甘草 荆芥穗 钩藤 广藿香 炒蔓荆子 首乌藤 香薷 白芷 川芎 茯苓
0.0714115 0.0766938 0.0422345 0.0777601 0.0679298 0.0823803 0.0833903 0.0587641 0.0590288 0.0914617 0.0723027 0.0780868
predicted yaofang:
川芎 防风 丹参 钩藤 荆芥穗 白芷 香薷 炙甘草 首乌藤 广藿香 炒蔓荆子 棉萆薢

119. 
patient face id: 01042312130377_1
label yaofang:
砂仁 楮实子 茯苓 泽泻 红花 菟丝子 酒萸肉 山药 金樱子 黄精 熟地黄 牡丹皮
0.0208103 0.0366972 0.0723776 0.0426881 0.0556466 0.0592702 0.0453403 0.112113 0.0786583 0.0494702 0.0716933 0.0587675
predicted yaofang:
阿胶 白术 生地黄 红花 熟地黄 牡丹皮 泽泻 菟丝子 金樱子 黄精 楮实子 酒萸肉

120. 
patient face id: 01050644521371_1_2
label yaofang:
鳖甲 半枝莲 蜈蚣 党参 生地黄 白术 菟丝子 浮小麦 白花蛇舌 天麻 天山雪莲 茯苓 酸枣仁 白芍 益母草 甘草
0.0213583 0.0848691 0.0925258 0.0929504 0.160725 0.0882041 0.0357248 0.0714775 0.0332106 0.0891926 0.09216
predicted yaofang:
白芍 党参 酸枣仁 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

121. 
patient face id: 01250703432063_2_5
label yaofang:
地黄 川芎 白芷 丹参 山药 山茱萸 甘草 白芍 白鲜皮 皂角刺 茯苓 连翘 牡丹皮
0.0723272 0.0272409 0.0343283 0.0596052 0.0304445 0.0214126 0.0296051 0.028254 0.0580223 0.186815 0.0200738 0.0234697 0.0554185
predicted yaofang:
白芍 川芎 连翘 党参 白术 丹参 生地黄 山药 山茱萸 地黄 麦芽 皂角刺 白鲜皮

122. 
patient face id: 01211218527161_4
label yaofang:
钩藤 白芍 牛膝 海风藤 豨莶草 丝瓜络 嫩桑枝 胆南星 徐长卿 地龙 宽筋藤 三七粉 甘草 苏木
0.053508 0.047055 0.0917298 0.0602105 0.106695 0.0381827 0.0707598 0.0645613 0.073559 0.0608085 0.0722427 0.0694653 0.0544664
predicted yaofang:
白芍 胆南星 牛膝 钩藤 苏木 地龙 嫩桑枝 丝瓜络 豨莶草 宽筋藤 海风藤 徐长卿 三七粉

123. 
patient face id: 01132128328959_5_1
label yaofang:
鳖甲 半枝莲 红豆杉 浙贝母 薏苡仁 豆蔻 甘草 白花蛇舌 天麻 天山雪莲 苍术 桔梗 苦杏仁 滑石
0.0243961 0.0325526 0.0692475 0.0360472 0.0932776 0.0667446 0.0289865 0.0690984 0.0613782 0.0652305 0.0273893 0.0304359 0.0423097 0.0706937 0.0232626
predicted yaofang:
法半夏 桔梗 薏苡仁 浙贝母 苍术 厚朴 天麻 滑石 鳖甲 豆蔻 北沙参 蜈蚣 白花蛇舌 天山雪莲 红豆杉

124. 
patient face id: 02021010331063_1_5
label yaofang:
党参 茯苓 天麻 预知子 牛膝 桑寄生 玉竹 白术 甘草 珍珠母 浙贝母 杜仲 砂仁
0.0263171 0.0958216 0.0871959 0.0942644 0.124426 0.0316922 0.229411 0.041695
predicted yaofang:
玉竹 党参 白术 杜仲 山药 桑寄生 淫羊藿 预知子

125. 
patient face id: 01132328455976_4
label yaofang:
紫苏叶 苦杏仁 紫苏子 姜半夏 人参叶 桔梗 厚朴 蜜枇杷叶 陈皮 茯苓
0.0651067 0.127296 0.0216869 0.084534 0.0971555 0.0801504 0.116303 0.121527 0.127354 0.118897
predicted yaofang:
陈皮 桔梗 浙贝母 厚朴 苦杏仁 紫苏子 姜半夏 紫苏叶 蜜枇杷叶 人参叶

126. 
patient face id: 02141843293517_4
label yaofang:
炒紫苏子 款冬花 蜜麻黄 广藿香 前胡 白前 炙甘草 炒六神曲 百部 陈皮 细辛 黄芪 紫菀 法半夏 干姜
0.142487 0.0517287 0.10393 0.0372273 0.101618 0.0811126 0.0595428 0.0426825 0.0758516 0.0402205 0.0425936 0.0492517 0.0535926 0.0516361
predicted yaofang:
陈皮 法半夏 前胡 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄 炒六神曲

127. 
patient face id: 01121853426185_2
label yaofang:
北沙参 百部 陈皮 细辛 太子参 紫菀 半夏 干姜 紫苏子 款冬花 麻黄 黄芪 前胡 白前 炙甘草 神曲
0.0291864 0.071173 0.0824066 0.0202625 0.0207431 0.0322666 0.050138 0.0671094 0.0277775 0.0466131 0.0422133 0.0436426 0.121796 0.0923355 0.0417518 0.0908817
predicted yaofang:
麻黄 陈皮 前胡 半夏 太子参 黄芪 神曲 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 紫苏子 炙甘草

128. 
patient face id: 02111357161355_1_4_7
label yaofang:
制何首乌 泽泻 夏枯草 红花 钩藤 丹参 牛膝 天麻 车前子 决明子 桃仁 莱菔子
0.157235 0.0553401 0.0635821 0.0560447 0.0748005 0.145744 0.109527 0.0321743 0.114263 0.107825 0.0491316
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

129. 
patient face id: 01192144269748_5_1_6
label yaofang:
瓜蒌子 水蛭 甘草 三棱 党参 厚朴 豆蔻 苦杏仁 薤白 枳壳 莪术 丹参 法半夏 栀子 薏苡仁 赤芍
0.0226731 0.0226016 0.116614 0.063184 0.0282197 0.108898 0.060926 0.0340878 0.042969 0.0523814 0.0645587 0.0646837
predicted yaofang:
柴胡 枳壳 法半夏 薏苡仁 党参 赤芍 薤白 水蛭 三棱 莪术 豆蔻 瓜蒌子

130. 
patient face id: 01032105449163_6_4
label yaofang:
醋鳖甲 半枝莲 蜈蚣 羌活 赤芍 白术 麦芽 白花蛇舌草 天麻 鸡血藤 独活 川芎 骨碎补 甘草
0.0277849 0.0293705 0.100443 0.0326388 0.0439213 0.0526358 0.0312048 0.106285 0.0263966 0.0395866 0.0432062 0.0513851 0.04566
predicted yaofang:
川芎 羌活 独活 党参 鸡血藤 红花 赤芍 天麻 补骨脂 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

131. 
patient face id: 02122219175729_1_6
label yaofang:
醋鳖甲 半枝莲 蜈蚣 苦参 地肤子 白术 金银花 麦芽 白花蛇舌草 天麻 荆芥 白鲜皮 红花 黄芪 甘草
0.0885251 0.0681169 0.0237451 0.0209775 0.0514369 0.0488824 0.0305573 0.0573632 0.0201679 0.0594739 0.0743447 0.0649708 0.0370259 0.0240303 0.0520254 0.0375637
predicted yaofang:
荆芥 金银花 蒲公英 白术 红花 地黄 天麻 白花蛇舌草 麦芽 苦参 白鲜皮 地肤子 蜈蚣 半枝莲 醋鳖甲 土茯苓

132. 
patient face id: 02141847160793_4
label yaofang:
北柴胡 木香 麸炒枳壳 豆蔻 郁金 法半夏 炙甘草 广藿香 白芍 醋香附 当归 麸炒白术 茯苓 川芎
0.0482831 0.0715857 0.0294613 0.0283862 0.128387 0.0278776 0.0587523 0.0618759 0.0276743 0.0615133 0.0850588 0.0548696 0.0854718
predicted yaofang:
白芍 川芎 当归 葛根 木香 郁金 北柴胡 豆蔻 炙甘草 广藿香 麸炒白术 醋香附 麸炒枳壳

133. 
patient face id: 02142005466397_6_4
label yaofang:
香附 枳壳 麦芽 柴胡 紫苏梗 姜半夏 柏子仁 浙贝母 豆蔻 炙甘草 海螵蛸
0.103064 0.056364 0.0431959 0.174114 0.0626516 0.0405856 0.111228 0.0359726 0.121855 0.114498 0.0462544
predicted yaofang:
柴胡 香附 枳壳 柏子仁 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗

134. 
patient face id: 01012106412464_1_6_8
label yaofang:
党参 茯苓 制远志 黄芪 首乌藤 酸枣仁 郁金 百合 川芎 牡蛎 麦冬 浮小麦 甘草
0.041517 0.0922399 0.0964018 0.0325906 0.0221376 0.060161 0.0807515 0.0922952 0.13125 0.183992 0.0908909
predicted yaofang:
川芎 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志

135. 
patient face id: 02191422300259_3_4
label yaofang:
山茱萸 黄芪 桑螵蛸 生地黄 茯苓 猪苓 杜仲 甘草 山药 白术 菟丝子 泽泻 熟附子 桑寄生 车前子
0.0209062 0.0973396 0.0407009 0.0250305 0.0215252 0.106891 0.173667 0.0260647 0.087059 0.078299 0.0784075 0.0256076
predicted yaofang:
白术 生地黄 杜仲 黄柏 山药 山茱萸 泽泻 菟丝子 桑寄生 猪苓 桑螵蛸 女贞子

136. 
patient face id: 02151912039053_4
label yaofang:
炒紫苏子 款冬花 蜜麻黄 广藿香 前胡 白前 白芷 百部 桔梗 防风 辛夷 紫菀 法半夏 荆芥穗
0.119626 0.0873735 0.0420775 0.0875163 0.0546353 0.0744233 0.0647295 0.107149 0.0527573 0.0792846 0.0533875 0.0475029 0.0400607 0.0375477
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 辛夷 广藿香 炒紫苏子 蜜麻黄

137. 
patient face id: 02191434505439_2_1_6
label yaofang:
鳖甲 天麻 蜂房 甘草 浙贝母 蒺藜 酸枣仁 浮小麦 白花蛇舌 蜈蚣 四季青 岗梅根 钩藤 辛夷 茯苓
0.0289771 0.0288242 0.0239933 0.109988 0.101409 0.0333348 0.059879 0.0271125 0.0314089 0.0697023 0.0569638 0.0200232 0.0624174 0.0926813 0.0924928
predicted yaofang:
法半夏 酸枣仁 浙贝母 钩藤 天麻 鳖甲 蒺藜 辛夷 浮小麦 蜈蚣 白花蛇舌 半枝莲 蜂房 岗梅根 四季青

138. 
patient face id: 02151324327011_4_1
label yaofang:
党参 乌药 桑螵蛸 仙茅 益智 黄芪 覆盆子 鹿角霜 山药 当归 淫羊藿
0.072389 0.0395161 0.0472702 0.127351 0.139521 0.0776307 0.0515865 0.063134 0.0717852 0.173124 0.0826848
predicted yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子

139. 
patient face id: 01092336447011_4_1
label yaofang:
蒲公英 丹参 茯苓 黄连 合欢皮 枳实 陈皮 竹茹 首乌藤 炙甘草 姜半夏
0.089852 0.0627312 0.0217013 0.0519154 0.123294 0.0509734 0.0743322 0.0569698 0.0849567 0.0889501 0.0212056 0.0911686
predicted yaofang:
陈皮 蒲公英 党参 丹参 黄连 枳实 竹茹 姜半夏 炙甘草 首乌藤 土鳖虫 合欢皮

140. 
patient face id: 01031834204300_4
label yaofang:
炒紫苏子 前胡 百部 紫菀 款冬花 白前 桔梗 陈皮 法半夏 炙甘草 防风 白芷 辛夷 炒苍耳子
0.0669886 0.0634004 0.05023 0.0892856 0.0613258 0.067729 0.0991572 0.10658 0.0495513 0.0522439 0.0332927 0.0875902 0.0529404 0.0224883 0.0804435
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子

141. 
patient face id: 01122218311736_1_2_6
label yaofang:
鳖甲 半枝莲 蜈蚣 红豆杉 鸡血藤 白术 甘草 益母草 白花蛇舌 天麻 天山雪莲 生地黄 乌梢蛇 党参 菟丝子 酸枣仁
0.0356997 0.020951 0.136842 0.0424518 0.0682118 0.172949 0.0296759 0.0565792 0.0727795 0.0395289 0.0252561 0.0260507 0.0475411 0.0278705
predicted yaofang:
白芍 大枣 党参 白术 酸枣仁 生地黄 天麻 菟丝子 益母草 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲

142. 
patient face id: 01192131597036_5_3
label yaofang:
鳖甲 薏苡仁 蜈蚣 熟附子 党参 白术 杜仲 半枝莲 天麻 甘草 败酱草 山药 巴戟天 天山雪莲
0.031338 0.0497422 0.0355109 0.0875874 0.151952 0.032775 0.0213554 0.0626407 0.0325854 0.0742704 0.137335 0.0410968 0.0765085 0.0612599
predicted yaofang:
薏苡仁 党参 白术 生地黄 熟附子 山药 山茱萸 天麻 巴戟天 鳖甲 败酱草 蜈蚣 天山雪莲 半枝莲

143. 
patient face id: 01172235169237_1_4
label yaofang:
酸枣仁 党参 甘草 天麻 浮小麦 川芎 红花 生地黄 茯苓 丹参 郁金 赤芍 鸡血藤 乌梢蛇
0.231408 0.0571229 0.047477 0.128416 0.0457031 0.0403541 0.0363923 0.0756577 0.0674008 0.0366659 0.0688493 0.0466277 0.0354507
predicted yaofang:
川芎 党参 鸡血藤 酸枣仁 丹参 生地黄 红花 赤芍 郁金 天麻 浮小麦 首乌藤 乌梢蛇

144. 
patient face id: 01250705332646_2_7_6
label yaofang:
鳖甲 半枝莲 蜈蚣 酸枣仁 远志 生地黄 合欢花 浮小麦 白花蛇舌 天麻 天山雪莲 茯苓 党参 知母 甘草
0.0428586 0.135391 0.0201444 0.241482 0.0707299 0.0284654 0.0515863 0.0883452 0.0302108 0.0759847 0.0655559 0.0430508 0.0319867
predicted yaofang:
党参 酸枣仁 丹参 生地黄 知母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲

145. 
patient face id: 01201257235995_7
label yaofang:
天麻 赤芍 首乌藤 威灵仙 络石藤 桃仁 白术 甘草 桂枝 川芎 生地黄 鸡血藤 桑枝 红花 党参
0.110651 0.0245116 0.0986202 0.0461368 0.0270089 0.0735523 0.0424781 0.0581217 0.076415 0.148125 0.0530499 0.0646291 0.0311821
predicted yaofang:
桂枝 白芍 川芎 桃仁 党参 鸡血藤 白术 生地黄 红花 赤芍 天麻 首乌藤 络石藤

146. 
patient face id: 01062037534192_6_2
label yaofang:
柴胡 茯苓 酸枣仁 蒲公英 川芎 甘草 合欢花 白芍 白术 麸炒枳壳 党参 当归 麦芽
0.0306604 0.145879 0.11006 0.0856768 0.0350658 0.0242542 0.14102 0.042466 0.101337 0.0500903 0.0290704
predicted yaofang:
柴胡 白芍 当归 党参 白术 酸枣仁 砂仁 菟丝子 麦芽 首乌藤 合欢花

147. 
patient face id: 01312049250652_1_3
label yaofang:
辛夷 白芷 茯苓 骨碎补 北沙参 厚朴 肉苁蓉 桃仁 苍耳子 太子参 白术 狗脊 紫苏叶 火麻仁 土鳖虫
0.0376295 0.0278117 0.0451465 0.0381641 0.0307317 0.0433483 0.0266508 0.0226011 0.0623484 0.0349575 0.0248616 0.0335384 0.0493362 0.0430173 0.0606091 0.0309625
predicted yaofang:
白芍 陈皮 桃仁 党参 黄芪 白术 黄连 浙贝母 厚朴 白芷 火麻仁 麦芽 辛夷 紫苏叶 苍耳子 土鳖虫

148. 
patient face id: 01052203227715_2_7
label yaofang:
黄芪 山慈菇 红豆杉 土鳖虫 赤芍 墨旱莲 牛膝 白术 蛇舌草 砂仁 桃仁 海螵蛸 桑寄生
0.0635587 0.0326204 0.0276463 0.0289451 0.0358315 0.0238189 0.0637969 0.0541474 0.039963 0.100213 0.0498305 0.0662491 0.0907568 0.0877391
predicted yaofang:
桃仁 党参 黄芪 白术 赤芍 海螵蛸 牛膝 郁金 砂仁 土鳖虫 红豆杉 墨旱莲 山慈菇 蛇舌草

149. 
patient face id: 02010649058806_1_2_5
label yaofang:
鳖甲 黄芩片 浙贝母 天花粉 芦根 紫菀 四季青 麦芽 白花蛇舌 牛蒡子 桔梗 白茅根 岗梅根 款冬花 甘草
0.0216731 0.089515 0.0979305 0.0819667 0.113414 0.0732737 0.0522889 0.025956 0.0316971 0.0209157 0.0515606 0.0422336 0.0367581 0.0324666 0.0606654
predicted yaofang:
法半夏 桔梗 芦根 牛蒡子 浙贝母 白茅根 天花粉 鳖甲 款冬花 紫菀 诃子 黄芩片 白花蛇舌 岗梅根 四季青

150. 
patient face id: 01140801547976_6_2
label yaofang:
党参 白术 益母草 甘草 白芍 生地黄 桃仁 墨旱莲 茯苓 菟丝子 牡丹皮 柴胡 栀子 黄柏 合欢花
0.172517 0.0838033 0.0342012 0.0812945 0.0266793 0.0469395 0.0458946 0.0597909 0.0350579 0.0259743 0.048109 0.0437046 0.0225235 0.114185 0.0578949
predicted yaofang:
柴胡 白芍 桃仁 党参 白术 丹参 生地黄 赤芍 栀子 牡丹皮 黄柏 菟丝子 益母草 合欢花 墨旱莲

151. 
patient face id: 02182236090138_5_7
label yaofang:
鳖甲 天麻 莪术 茯苓 天山雪莲 枳壳 甘草 紫苏梗 半枝莲 蜈蚣 法半夏 党参 郁金 薏苡仁 砂仁 广藿香
0.0290909 0.0567392 0.0215858 0.0209325 0.0894919 0.0614514 0.0973851 0.112546 0.0953768 0.089487 0.0643588 0.0349026 0.0417384
predicted yaofang:
法半夏 薏苡仁 浙贝母 栀子 郁金 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

152. 
patient face id: 01172334379834_1_2
label yaofang:
鳖甲 薏苡仁 蜈蚣 莪术 郁金 白芍 黄精 白花蛇舌 天麻 天山雪莲 太子参 浙贝母 佛手 甘草
0.0374585 0.164496 0.0469493 0.0340381 0.0272907 0.038479 0.0579728 0.0213179 0.031603 0.031334 0.0467039 0.0527561 0.032871
predicted yaofang:
白芍 薏苡仁 党参 白术 山药 天麻 鳖甲 茵陈 扁豆花 莪术 蜈蚣 白花蛇舌 天山雪莲

153. 
patient face id: 02150747509106_1_4_7
label yaofang:
炙甘草 桂枝 麦冬 龙骨 党参 熟地黄 火麻仁 牡蛎 黑枣 苦参 五味子 炙甘草 桂枝 麦冬 龙骨 党参 熟地黄 火麻仁 牡蛎 黑枣 苦参 五味子
0.236124 0.0639881 0.0402329 0.0601621 0.0548569 0.0237302 0.0269212 0.061503 0.0235233 0.0673031 0.0782582 0.0365021 0.0788841
predicted yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 丹参 生地黄 熟地黄 肉桂 火麻仁 苦参 炙甘草 黑枣

154. 
patient face id: 02161901358170_1_4
label yaofang:
炒六神曲 布渣叶 炒白扁豆 醋香附 茯苓 陈皮 炒麦芽 豆蔻 麸炒白术 广藿香 炒稻芽 麸炒苍术 佩兰 甘草片
0.100456 0.0607908 0.0835691 0.0675662 0.077418 0.0651519 0.0867481 0.0479344 0.074497 0.0587707 0.0713894 0.0982706 0.075321
predicted yaofang:
陈皮 佩兰 豆蔻 广藿香 甘草片 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶 炒稻芽 醋香附 炒麦芽

155. 
patient face id: 01061859515593_1_5
label yaofang:
紫苏子 款冬花 麻黄 细辛 前胡 白前 炙甘草 干姜 百部 陈皮 防风 紫菀 半夏 广藿香
0.0406624 0.0802618 0.172343 0.0290395 0.0459522 0.0535995 0.126836 0.0735826 0.0839304 0.0546182 0.0804688 0.050505 0.0340158
predicted yaofang:
麻黄 陈皮 前胡 桔梗 半夏 干姜 款冬花 紫菀 白前 百部 紫苏子 炙甘草 广藿香

156. 
patient face id: 01312130145531_4_1_6
label yaofang:
鳖甲 薏苡仁 天麻 天山雪莲 茯苓 远志 砂仁 合欢花 白花蛇舌 莪术 蜈蚣 党参 法半夏 木香 甘草 枳壳
0.0326824 0.0471809 0.0339122 0.16072 0.121668 0.027401 0.0415519 0.0368799 0.0842946 0.0287141 0.103452 0.055829 0.0535529
predicted yaofang:
枳壳 木香 薏苡仁 远志 党参 酸枣仁 赤芍 天麻 鳖甲 莪术 白花蛇舌 天山雪莲 合欢花

157. 
patient face id: 01132142541437_1_6
label yaofang:
鳖甲 半枝莲 蜈蚣 杜仲 生地黄 山茱萸 首乌藤 白花蛇舌 天麻 天山雪莲 续断 山药 党参 甘草
0.0584657 0.0479342 0.0546032 0.262414 0.0492038 0.128051 0.0382281 0.123067 0.0342659 0.0551637 0.089858
predicted yaofang:
党参 生地黄 山茱萸 天麻 鳖甲 续断 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲

158. 
patient face id: 01032104426538_2_5
label yaofang:
醋鳖甲 半枝莲 蜈蚣 地黄 北沙参 牛膝 川木通 白花蛇舌草 天麻 酸枣仁 麦冬 白茅根 广金钱草 甘草
0.0301747 0.0470623 0.0871696 0.0398893 0.0461527 0.0207264 0.0258617 0.0729041 0.0418018 0.0409605 0.0548193 0.0478829 0.025217 0.0400727 0.045728 0.0219417
predicted yaofang:
白芍 党参 酸枣仁 丹参 生地黄 山药 地黄 天麻 鳖甲 白花蛇舌草 蜈蚣 白花蛇舌 天山雪莲 半枝莲 醋鳖甲 广金钱草

159. 
patient face id: 01040651054435_6_7_2
label yaofang:
白芍 全蝎 羌活 川芎 蔓荆子 甘草 柏子仁 天麻 细辛 白芷 牛膝 赤芍 酸枣仁
0.0323134 0.0591436 0.0575377 0.0387264 0.0607415 0.0502141 0.105883 0.0343757 0.0285915 0.0275342 0.0227476 0.0344527 0.0509875 0.0278727
predicted yaofang:
白芍 川芎 羌活 独活 党参 酸枣仁 生地黄 红花 牛膝 细辛 地黄 天麻 全蝎 桑寄生

160. 
patient face id: 01211300052209_7
label yaofang:
蝉蜕 胆南星 豨莶草 嫩桑枝 丝瓜络 僵蚕 地龙 甘草 白芍 钩藤 海风藤 徐长卿 三七粉 宽筋藤
0.0944481 0.049879 0.095828 0.0804437 0.0591675 0.0706863 0.0865239 0.0811311 0.0644777 0.0703511 0.065428 0.0718102 0.0711578
predicted yaofang:
白芍 胆南星 钩藤 僵蚕 地龙 蝉蜕 嫩桑枝 丝瓜络 豨莶草 宽筋藤 海风藤 徐长卿 三七粉

161. 
patient face id: 02182232112406_6
label yaofang:
天麻 桑寄生 甘草 法半夏 谷精子 茵陈 栀子 天花粉 杜仲 茯苓 地龙 紫苏叶 钩藤 浙贝母 麦芽
0.0649854 0.0314076 0.0210894 0.043469 0.0407431 0.0566571 0.0640489 0.0476232 0.0287264 0.049885 0.0490621 0.0369148 0.0376167
predicted yaofang:
法半夏 党参 浙贝母 栀子 牛膝 钩藤 天麻 白芷 桑寄生 扁豆花 麦芽 紫苏叶 谷精子

162. 
patient face id: 01042345291518_1_7
label yaofang:
天麻 牡蛎 首乌藤 党参 甘草 山药 夏枯草 牛膝 钩藤 地龙 酸枣仁 泽泻 麦芽 磁石 防己
0.0641793 0.0327411 0.149053 0.0235167 0.026832 0.0356261 0.0384785 0.0241988 0.0624638 0.0488338 0.0526545 0.0454795 0.050513 0.0274787
predicted yaofang:
牡蛎 党参 酸枣仁 丹参 生地黄 钩藤 泽泻 天麻 磁石 防己 夏枯草 麦芽 地龙 首乌藤

163. 
patient face id: 01052106017969_6_7
label yaofang:
黄芩冲剂 柴胡冲剂 丹皮片冲剂 桃仁冲剂 车前草冲剂 枳实冲剂 白芍冲剂 法夏冲剂 当归冲剂 川芎冲剂 泽泻冲剂 茯苓冲剂 白术冲剂 干姜冲剂 大黄冲剂
0.0705741 0.0721311 0.0899864 0.0691581 0.09163 0.0761261 0.0745849 0.0711266 0.0609603 0.0627416 0.0378703 0.0585559 0.0458584 0.0283724 0.0302456
predicted yaofang:
黄芩冲剂 柴胡冲剂 当归冲剂 枳实冲剂 白芍冲剂 法夏冲剂 干姜冲剂 大黄冲剂 白术冲剂 茯苓冲剂 川芎冲剂 泽泻冲剂 丹皮片冲剂 桃仁冲剂 车前草冲剂

164. 
patient face id: 01061557292574_1_4
label yaofang:
甘草 桂枝 车前子 白芍 山药 白术 桑螵蛸 菟丝子 泽兰 赤芍 猪苓 山茱萸 黄芪 黄芪 广升麻 益智 益母草
0.0219352 0.0269076 0.0441066 0.0896615 0.335973 0.0528163 0.0722308 0.0209204 0.129031
predicted yaofang:
白芍 熟地黄 山药 山茱萸 菟丝子 益母草 猪苓 桑螵蛸 泽兰

165. 
patient face id: 01190634410324_4
label yaofang:
醋鳖甲 半枝莲 蜈蚣 桔梗 芦根 白术 太子参 白花蛇舌草 天麻 浙贝母 诃子 茯苓 天花粉 甘草
0.049767 0.0473841 0.0966611 0.174336 0.067296 0.0839001 0.157287 0.0768072 0.0418902 0.0615934 0.0477826 0.062792
predicted yaofang:
桔梗 芦根 太子参 白术 浙贝母 天麻 天花粉 诃子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

166. 
patient face id: 01062352246860_1_4_7
label yaofang:
炙甘草 黑枣 熟地黄 火麻仁 龙骨 苦参 党参 桂枝 麦冬 五味子 牡蛎
0.0513422 0.0436018 0.0362183 0.0276295 0.0965279 0.0797998 0.0251101 0.0667452 0.0970585 0.0553036 0.059768 0.0926045
predicted yaofang:
桂枝 龙骨 牡蛎 桃仁 麦冬 五味子 赤芍 熟地黄 火麻仁 苦参 炙甘草 黑枣

167. 
patient face id: 01312134327639_5_1
label yaofang:
鳖甲 薏苡仁 天麻 红豆杉 黄芩片 麻黄 法半夏 前胡 甘草 白花蛇舌 莪术 蜈蚣 龙葵果 苦杏仁 茯苓 款冬花 鱼腥草
0.0302406 0.0444058 0.0629271 0.038568 0.0324907 0.0657718 0.0429186 0.0249228 0.0323118 0.0437854 0.0365654 0.0319236 0.0822798 0.0300988 0.0429639 0.0411906 0.0271039
predicted yaofang:
麻黄 法半夏 前胡 桔梗 薏苡仁 鱼腥草 浙贝母 细辛 桑白皮 天麻 鳖甲 款冬花 苦杏仁 蜈蚣 黄芩片 白花蛇舌 红豆杉

168. 
patient face id: 02151828175305_2
label yaofang:
前胡 桔梗 荆芥穗 辛夷 百部 陈皮 广藿香 白芷 紫菀 炙甘草 炒六神曲 款冬花 防风 茯苓
0.0777664 0.0496491 0.0690288 0.11019 0.112811 0.0307992 0.0344488 0.0323214 0.0210194 0.0852243 0.0697662 0.122231 0.0883083 0.051305
predicted yaofang:
陈皮 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒六神曲

169. 
patient face id: 01120051246013_1_7
label yaofang:
防风 苍术 川芎 天花粉 牡蛎 当归 黄芩 葛根 全蝎 炙甘草 干姜 土鳖虫 桂枝 蜈蚣 白芍 狗脊 柴胡 鸡血藤 泽泻 茯苓
0.0862535 0.045137 0.0214509 0.0425986 0.0342574 0.0494239 0.0258773 0.0517643 0.0287743 0.0534807 0.0347815 0.0939547 0.0267423 0.0393826 0.104369 0.0307491 0.0350373
predicted yaofang:
桂枝 柴胡 白芍 川芎 黄芩 当归 葛根 牡蛎 桃仁 鸡血藤 泽泻 干姜 全蝎 天花粉 炙甘草 土鳖虫 狗脊

170. 
patient face id: 01041827451344_1_4
label yaofang:
北沙参 太子参 炒紫苏子 前胡 百部 紫菀 款冬花 白前 陈皮 法半夏 蜜麻黄 炙甘草 细辛 干姜
0.137249 0.0427195 0.0353867 0.0686748 0.0726659 0.0813641 0.0238233 0.0604252 0.0373176 0.0600593 0.0677268 0.131469 0.0725745 0.0569333 0.0474799
predicted yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

171. 
patient face id: 01211217272723_6
label yaofang:
郁金 黄连 丹参 首乌藤 石菖蒲 炙甘草 茯苓 姜半夏 陈皮 合欢皮 竹茹 枳实
0.130474 0.0283961 0.0914908 0.0838757 0.121092 0.0680353 0.0397356 0.0362759 0.0986133
predicted yaofang:
陈皮 党参 黄连 枳实 竹茹 石菖蒲 砂仁 姜半夏 炙甘草

172. 
patient face id: 01182135003848_1_5_7
label yaofang:
柴胡 牡丹皮 党参 酸枣仁 菟丝子 桑寄生 白术 合欢花 白芍 栀子 生地黄 丹参 益母草 茯苓 甘草
0.0314145 0.0599323 0.0984547 0.0559781 0.0865296 0.067247 0.0211941 0.126224 0.0495974 0.059058
predicted yaofang:
柴胡 白芍 党参 白术 酸枣仁 生地黄 天麻 菟丝子 益母草 合欢花

173. 
patient face id: 01051854006500_4_1
label yaofang:
北沙参 百部 细辛 炙甘草 太子参 紫菀 陈皮 茯苓 炒紫苏子 款冬花 法半夏 干姜 前胡 白前 蜜麻黄
0.166128 0.036325 0.0533985 0.0739835 0.0228508 0.215212 0.0674365 0.0426029 0.0392292 0.0665122 0.0702972 0.0379389 0.0345502 0.0347695
predicted yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

174. 
patient face id: 01101822532611_4
label yaofang:
白芷 款冬花 炒苍耳子 蜜麻黄 前胡 白前 炙甘草 茯苓 百部 桔梗 防风 紫菀 法半夏 辛夷
0.0709119 0.173771 0.0439291 0.0341858 0.0477913 0.162171 0.050523 0.0669215 0.132238 0.0882304 0.0553453
predicted yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 蜜麻黄 炒苍耳子

175. 
patient face id: 02191632068330_5
label yaofang:
醋鳖甲 半枝莲 蜈蚣 桔梗 荆芥 牛蒡子 芦根 白花蛇舌草 天麻 浙贝母 贯众 诃子 黄芩 甘草
0.0504491 0.0205799 0.0415145 0.0202359 0.0676627 0.0580922 0.0826627 0.0711092 0.0280564 0.063582 0.0227904 0.072448 0.0477852 0.0298868 0.0405239 0.086741
predicted yaofang:
黄芩 桔梗 荆芥 金银花 芦根 牛蒡子 浙贝母 天麻 鳖甲 诃子 白花蛇舌草 蜈蚣 白花蛇舌 半枝莲 醋鳖甲 贯众

176. 
patient face id: 01100248200851_1_2
label yaofang:
醋延胡索 紫苏梗 炙甘草 蜈蚣 苏木 白芍 全蝎 牛膝
0.0304369 0.0257559 0.0291425 0.102348 0.0303215 0.0263913 0.0530142 0.036495 0.0215821 0.0279411 0.0390959 0.110708 0.18795 0.049393 0.0641592
predicted yaofang:
白芍 香附 白术 柏子仁 牛膝 天麻 全蝎 木瓜 苏木 豆蔻 麦芽 炙甘草 紫苏梗 蜈蚣 醋延胡索

177. 
patient face id: 01062353212507_1_6
label yaofang:
党参 制远志 首乌藤 郁金 川芎 麦冬 甘草 茯苓 黄芪 酸枣仁 百合 牡蛎 浮小麦
0.0780843 0.354636 0.0443536 0.116149 0.0628635 0.0721098 0.105731 0.0639409 0.0350344
predicted yaofang:
麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志

178. 
patient face id: 01111905547402_2_4
label yaofang:
炒紫苏子 款冬花 蜜麻黄 荆芥穗 前胡 白前 炙甘草 辛夷 百部 桔梗 薄荷 广藿香 紫菀 法半夏 防风
0.0322108 0.083479 0.0897276 0.0677951 0.0357317 0.0522206 0.0993323 0.0742642 0.0984411 0.0419715 0.0738994 0.0637937 0.0251154 0.0375549 0.0449569 0.0522225
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

179. 
patient face id: 02142141228870_1_2
label yaofang:
天麻 地龙 酸枣仁 甘草 川芎 麦芽 牛膝 牡蛎 首乌藤 党参 磁石 枸杞子 龟甲 生地黄
0.0274144 0.0262867 0.0673643 0.0554363 0.0686923 0.0272934 0.105788 0.0399535 0.0237277 0.0233484 0.152932 0.0428449
predicted yaofang:
柴胡 白芍 川芎 牡蛎 党参 白术 酸枣仁 牛膝 郁金 天麻 首乌藤 龟甲

180. 
patient face id: 02122058104687_1_4_6
label yaofang:
鳖甲 半枝莲 蜈蚣 酸枣仁 党参 首乌藤 生地黄 白花蛇舌 天麻 天山雪莲 远志 龙骨 茯苓 甘草
0.0354617 0.0375925 0.0638141 0.0868736 0.0226129 0.0916152 0.0542512 0.0276724 0.101792 0.0860988 0.0651779 0.0659506
predicted yaofang:
独活 党参 酸枣仁 生地黄 红花 天麻 鳖甲 桑枝 蜈蚣 白花蛇舌 天山雪莲 半枝莲

181. 
patient face id: 01041825305063_2_4
label yaofang:
麦冬 百部 桔梗 茯苓 北沙参 紫菀 陈皮 炒紫苏子 款冬花 蜜麻黄 前胡 白前 炙甘草
0.0208346 0.134222 0.0416077 0.0898048 0.108743 0.119513 0.113433 0.0908718 0.115499 0.0555053 0.0557399
predicted yaofang:
陈皮 前胡 桔梗 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

182. 
patient face id: 01250653068283_6_5
label yaofang:
党参 茯苓 薏苡仁 白花蛇舌 柴胡 合欢花 黄精 甘草 黄芪 白术 白芍 丹参 枳壳 五灵脂 砂仁
0.0897829 0.0625809 0.034683 0.157619 0.110921 0.0511965 0.0229296 0.168191 0.0306965 0.0855545
predicted yaofang:
白芍 枳壳 蒲公英 党参 黄芪 白术 生地黄 黄精 白花蛇舌 合欢花

183. 
patient face id: 02182010564815_6_1_2
label yaofang:
鳖甲 薏苡仁 浙贝母 橘红 丹参 紫苏梗 广藿香 补骨脂 天山雪莲 白花蛇舌 郁金 桔梗 太子参 砂仁 黄连 甘草 鸡血藤
0.0362169 0.0238802 0.100637 0.0492066 0.03019 0.0218483 0.0274167 0.0569752 0.0362591 0.0588068 0.0563389 0.0340949 0.0221671 0.0623433 0.0250876
predicted yaofang:
法半夏 橘红 薏苡仁 党参 太子参 鸡血藤 黄连 砂仁 天麻 鳖甲 补骨脂 紫苏梗 蜈蚣 白花蛇舌 天山雪莲

184. 
patient face id: 02142002447507_1
label yaofang:
香附 枳壳 麦芽 柴胡 紫苏梗 姜半夏 浙贝母 豆蔻 海螵蛸 炙甘草
0.184061 0.0988433 0.0723059 0.0820733 0.0833903 0.0765083 0.0927883 0.0628236 0.0697778 0.121942
predicted yaofang:
柴胡 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗

185. 
patient face id: 02170748338173_1_3
label yaofang:
党参 黄芪 郁金 牡蛎 甘草 茯苓 首乌藤 百合 麦冬 制远志 酸枣仁 川芎 浮小麦
0.130531 0.108167 0.0347749 0.0571486 0.0724427 0.0781659 0.0486275 0.0578032 0.103046 0.176574 0.0854452
predicted yaofang:
川芎 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志

186. 
patient face id: 01312310114850_2
label yaofang:
天麻 酸枣仁 牛膝 桑寄生 女贞子 生地黄 牡丹皮 山药 钩藤 茯苓 川芎 杜仲 墨旱莲 泽泻 甘草
0.0601549 0.0257046 0.121615 0.042628 0.0270708 0.0469227 0.050527 0.0814636 0.024425 0.0449301 0.111713 0.0338747 0.0306612 0.0217771
predicted yaofang:
川芎 酸枣仁 生地黄 红花 熟地黄 牡丹皮 杜仲 牛膝 山茱萸 钩藤 桑寄生 女贞子 续断 墨旱莲

187. 
patient face id: 01190705074426_4_7
label yaofang:
天麻 桑寄生 白术 地龙 赤芍 陈皮 僵蚕 杜仲 茯苓 甘草 党参 法半夏 首乌藤
0.0757858 0.0224019 0.0374025 0.031944 0.0257051 0.40637 0.0505304 0.253145
predicted yaofang:
陈皮 龙骨 党参 白术 赤芍 僵蚕 桑寄生 首乌藤

188. 
patient face id: 02161922458265_6
label yaofang:
浙贝母 桔梗 广金钱草 延胡索 莪术 瓜蒌皮 桑枝 猫爪草 甘草 北沙参 王不留行 牡蛎 砂仁 厚朴
0.0366646 0.0339098 0.0539257 0.0985242 0.0344139 0.0487806 0.0337724 0.0803014 0.079513 0.0456635 0.0601457 0.060528 0.07102
predicted yaofang:
桔梗 牡蛎 丹参 浙贝母 白茅根 厚朴 砂仁 瓜蒌皮 莪术 王不留行 桑枝 广金钱草 猫爪草

189. 
patient face id: 01192234341547_1_6
label yaofang:
鳖甲 蜈蚣 半枝莲 酸枣仁 生地黄 红花 川芎 甘草 白花蛇舌 天山雪莲 天麻 党参 桃仁 当归 赤芍
0.0245228 0.0337609 0.0815353 0.0238499 0.0778426 0.063988 0.0338868 0.0211245 0.0762813 0.0932345 0.0399509 0.164708 0.0707967 0.0306308 0.0255043
predicted yaofang:
桃仁 党参 酸枣仁 丹参 生地黄 赤芍 牡丹皮 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 乌梢蛇

190. 
patient face id: 02142147380561_2_1_4
label yaofang:
桑寄生 甘草 白术 蒺藜 杜仲 菊花 白芍 粉葛 地龙 川芎 天麻 牛膝 枸杞子 蔓荆子 麦芽
0.0311385 0.168222 0.0474836 0.0343146 0.0770615 0.0538089 0.0935656 0.0337825 0.0205939 0.0418006 0.0569647 0.0288054
predicted yaofang:
白芍 川芎 白术 杜仲 牛膝 菊花 天麻 蔓荆子 桑寄生 地龙 蒺藜 粉葛

191. 
patient face id: 01012115347471_1_3
label yaofang:
制何首乌 盐车前子 泽泻颗粒 丹参颗粒 决明子 夏枯草颗粒 牛膝颗粒 燀桃仁 天麻颗粒 莱菔子颗粒
0.142043 0.147613 0.0761894 0.0941746 0.0764476 0.100554 0.0986985 0.0859776 0.0628516 0.0663776
predicted yaofang:
决明子 制何首乌 盐车前子 泽泻颗粒 丹参颗粒 夏枯草颗粒 牛膝颗粒 燀桃仁 天麻颗粒 莱菔子颗粒

192. 
patient face id: 02191425415892_1_7
label yaofang:
生地黄 山药 黄柏 菟丝子 泽兰 赤芍 甘草 山茱萸 牡丹皮 仙茅 益母草 土鳖虫 红花 茯苓
0.0243179 0.0213401 0.0353422 0.148482 0.0563377 0.0701471 0.0379395 0.0329719 0.162962 0.112205 0.0366672
predicted yaofang:
白芍 川芎 生地黄 赤芍 牡丹皮 黄柏 山药 山茱萸 菟丝子 益母草 泽兰

193. 
patient face id: 01182055420456_7_1
label yaofang:
党参 茯苓 首乌藤 益母草 川芎 补骨脂 甘草 丹参 酸枣仁 菟丝子 红景天 白术 牛膝 枸杞子
0.0588368 0.0649429 0.0277425 0.14394 0.0346997 0.0385151 0.0993827 0.0806669 0.0447525 0.0456324 0.0591282 0.0566604 0.0737137
predicted yaofang:
党参 枸杞子 白术 酸枣仁 丹参 杜仲 牛膝 菟丝子 益母草 补骨脂 续断 首乌藤 红景天

194. 
patient face id: 02181957360140_2_6
label yaofang:
白芍 白术 山药 酸枣仁 生地黄 牡丹皮 甘草 茯苓 党参 大枣 柏子仁 山茱萸 郁李仁
0.150024 0.0394479 0.0470616 0.0263072 0.0599729 0.0710467 0.118057 0.0479852 0.0730409 0.050216 0.0554971
predicted yaofang:
白芍 大枣 党参 白术 酸枣仁 柏子仁 生地黄 牡丹皮 山药 山茱萸 郁李仁

195. 
patient face id: 01192233038041_6_7_1
label yaofang:
鳖甲 半枝莲 蜈蚣 酸枣仁 党参 桂枝 糯稻根 白花蛇舌 天麻 天山雪莲 白术 龙骨 白芍 甘草
0.0220646 0.0739348 0.0326237 0.0540708 0.0452622 0.0972185 0.0271847 0.0743569 0.0590953 0.0554912 0.0826018 0.0587146 0.0612638 0.098643
predicted yaofang:
桂枝 白芍 龙骨 党参 白术 酸枣仁 生地黄 天麻 糯稻根 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

196. 
patient face id: 02182304131167_1_6
label yaofang:
党参 酸枣仁 山药 益智 麦芽 王不留行 白芍 甘草 鳖甲 桑螵蛸 首乌藤 荆芥穗 五倍子 柏子仁
0.0320894 0.0738876 0.0307559 0.0478395 0.0798202 0.108215 0.0376737 0.0204128 0.052844 0.0324209 0.0668025 0.0405057 0.0275424
predicted yaofang:
白芍 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 补骨脂 王不留行 桑螵蛸 益智 五倍子

197. 
patient face id: 01132129373601_1_2_7
label yaofang:
黄连 丹参 山药 桃仁 乌梢蛇 赤芍 甘草 首乌藤 苍术 党参 山茱萸 红花 桂枝 太子参 天花粉
0.0886156 0.0217186 0.0301547 0.0208933 0.065053 0.0526883 0.0374186 0.0369865 0.0251738 0.0335044 0.0334846 0.0212935 0.0292983 0.0885247 0.0705517 0.025389
predicted yaofang:
桂枝 川芎 法半夏 大枣 桃仁 党参 酸枣仁 丹参 生地黄 赤芍 山药 山茱萸 天麻 菟丝子 首乌藤 蜈蚣

198. 
patient face id: 01052214499946_4
label yaofang:
三七片 西洋参 丹参
0.028403 0.0209269 0.0355312 0.0220794 0.0227138 0.0212513 0.0429615 0.0391172 0.055897 0.0240428 0.28466 0.0501956
predicted yaofang:
金银花 白术 丹参 玄参 浙贝母 牡丹皮 僵蚕 白芷 瓜蒌皮 枇杷叶 西洋参 三七片

199. 
patient face id: 02181627186318_1_5
label yaofang:
荆芥穗 白鲜皮 红花 浙贝母 黄芪 牡丹皮 甘草 防风 地肤子 金银花 皂角刺 麦芽 水牛角
0.034537 0.0256986 0.0510315 0.0249769 0.0237055 0.0851707 0.0402766 0.0418971 0.0204933 0.0319849 0.189168 0.0300181 0.0218541 0.0427226 0.0398568 0.0583578
predicted yaofang:
陈皮 龙骨 金银花 党参 酸枣仁 生地黄 浙贝母 牡丹皮 郁金 水牛角 荆芥穗 麦芽 皂角刺 白鲜皮 首乌藤 地肤子
