use new yaopin cnn 2 chanels dropout_mlp * 2: 0.6 + 0.4, best_record(?80), mlp_units: 128 * 2
sigmoid activation
threshold: 0.3


8896/8915 [============================>.] - ETA: 0s - loss: 0.1479Epoch 00000: val_loss improved from inf to 0.08338, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8915/8915 [==============================] - 88s - loss: 0.1478 - val_loss: 0.0834
Epoch 2/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0959Epoch 00001: val_loss improved from 0.08338 to 0.08198, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8915/8915 [==============================] - 86s - loss: 0.0959 - val_loss: 0.0820
Epoch 3/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0892Epoch 00002: val_loss improved from 0.08198 to 0.08077, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8915/8915 [==============================] - 86s - loss: 0.0892 - val_loss: 0.0808
Epoch 4/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0864Epoch 00003: val_loss improved from 0.08077 to 0.08041, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8915/8915 [==============================] - 86s - loss: 0.0864 - val_loss: 0.0804
Epoch 5/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0843Epoch 00004: val_loss improved from 0.08041 to 0.07574, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8915/8915 [==============================] - 86s - loss: 0.0843 - val_loss: 0.0757
Epoch 6/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0830Epoch 00005: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0830 - val_loss: 0.0758
Epoch 7/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0821Epoch 00006: val_loss improved from 0.07574 to 0.07523, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8915/8915 [==============================] - 86s - loss: 0.0821 - val_loss: 0.0752
Epoch 8/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0810Epoch 00007: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0810 - val_loss: 0.0754
Epoch 9/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0808Epoch 00008: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0808 - val_loss: 0.0776
Epoch 10/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0799Epoch 00009: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0799 - val_loss: 0.0754
Epoch 11/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0791Epoch 00010: val_loss improved from 0.07523 to 0.07419, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8915/8915 [==============================] - 86s - loss: 0.0791 - val_loss: 0.0742
Epoch 12/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0788Epoch 00011: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0788 - val_loss: 0.0744
Epoch 13/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0786Epoch 00012: val_loss improved from 0.07419 to 0.07365, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8915/8915 [==============================] - 86s - loss: 0.0786 - val_loss: 0.0736
Epoch 14/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0781Epoch 00013: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0782 - val_loss: 0.0743
Epoch 15/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0777Epoch 00014: val_loss improved from 0.07365 to 0.07287, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8915/8915 [==============================] - 86s - loss: 0.0777 - val_loss: 0.0729
Epoch 16/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0772Epoch 00015: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0772 - val_loss: 0.0739
Epoch 17/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0768Epoch 00016: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0768 - val_loss: 0.0750
Epoch 18/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0764Epoch 00017: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0764 - val_loss: 0.0745
Epoch 19/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0763Epoch 00018: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0763 - val_loss: 0.0743
Epoch 20/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0762Epoch 00019: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0762 - val_loss: 0.0730
Epoch 21/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0758Epoch 00020: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0758 - val_loss: 0.0736
Epoch 22/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0752Epoch 00021: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0752 - val_loss: 0.0742
Epoch 23/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0750Epoch 00022: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0750 - val_loss: 0.0736
Epoch 24/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0747Epoch 00023: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0747 - val_loss: 0.0736
Epoch 25/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0744Epoch 00024: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0744 - val_loss: 0.0760
Epoch 26/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0742Epoch 00025: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0742 - val_loss: 0.0748
Epoch 27/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0740Epoch 00026: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0740 - val_loss: 0.0732
Epoch 28/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0736Epoch 00027: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0736 - val_loss: 0.0751
Epoch 29/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0734Epoch 00028: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0734 - val_loss: 0.0748
Epoch 30/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0733Epoch 00029: val_loss improved from 0.07287 to 0.07255, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8915/8915 [==============================] - 86s - loss: 0.0733 - val_loss: 0.0726
Epoch 31/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0730Epoch 00030: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0730 - val_loss: 0.0736
Epoch 32/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0728Epoch 00031: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0727 - val_loss: 0.0775
Epoch 33/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0726Epoch 00032: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0726 - val_loss: 0.0728
Epoch 34/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0723Epoch 00033: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0723 - val_loss: 0.0742
Epoch 35/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0721Epoch 00034: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0721 - val_loss: 0.0739
Epoch 36/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0718Epoch 00035: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0718 - val_loss: 0.0737
Epoch 37/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0715Epoch 00036: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0715 - val_loss: 0.0728
Epoch 38/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0714Epoch 00037: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0714 - val_loss: 0.0734
Epoch 39/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0713Epoch 00038: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0713 - val_loss: 0.0741
Epoch 40/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0710Epoch 00039: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0710 - val_loss: 0.0744
Epoch 41/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0707Epoch 00040: val_loss improved from 0.07255 to 0.07241, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8915/8915 [==============================] - 86s - loss: 0.0707 - val_loss: 0.0724
Epoch 42/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0706Epoch 00041: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0707 - val_loss: 0.0724
Epoch 43/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0704Epoch 00042: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0704 - val_loss: 0.0747
Epoch 44/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0701Epoch 00043: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0701 - val_loss: 0.0735
Epoch 45/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0699Epoch 00044: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0699 - val_loss: 0.0753
Epoch 46/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0697Epoch 00045: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0698 - val_loss: 0.0756
Epoch 47/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0695Epoch 00046: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0695 - val_loss: 0.0747
Epoch 48/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0693Epoch 00047: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0693 - val_loss: 0.0757
Epoch 49/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0692Epoch 00048: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0692 - val_loss: 0.0743
Epoch 50/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0691Epoch 00049: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0691 - val_loss: 0.0744
Epoch 51/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0689Epoch 00050: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0688 - val_loss: 0.0740
Epoch 52/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0685Epoch 00051: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0685 - val_loss: 0.0741
Epoch 53/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0681Epoch 00052: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0682 - val_loss: 0.0740
Epoch 54/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0680Epoch 00053: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0680 - val_loss: 0.0760
Epoch 55/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0677Epoch 00054: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0677 - val_loss: 0.0747
Epoch 56/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0676Epoch 00055: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0676 - val_loss: 0.0741
Epoch 57/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0674Epoch 00056: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0674 - val_loss: 0.0772
Epoch 58/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0672Epoch 00057: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0672 - val_loss: 0.0754
Epoch 59/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0671Epoch 00058: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0671 - val_loss: 0.0744
Epoch 60/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0667Epoch 00059: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0667 - val_loss: 0.0751
Epoch 61/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0664Epoch 00060: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0664 - val_loss: 0.0743
Epoch 62/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0661Epoch 00061: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0661 - val_loss: 0.0738
Epoch 63/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0661Epoch 00062: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0661 - val_loss: 0.0750
Epoch 64/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0659Epoch 00063: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0659 - val_loss: 0.0769
Epoch 65/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0659Epoch 00064: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0658 - val_loss: 0.0747
Epoch 66/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0654Epoch 00065: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0654 - val_loss: 0.0742
Epoch 67/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0653Epoch 00066: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0653 - val_loss: 0.0746
Epoch 68/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0649Epoch 00067: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0649 - val_loss: 0.0746
Epoch 69/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0648Epoch 00068: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0648 - val_loss: 0.0740
Epoch 70/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0646Epoch 00069: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0646 - val_loss: 0.0768
Epoch 71/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0644Epoch 00070: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0644 - val_loss: 0.0749
Epoch 72/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0643Epoch 00071: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0643 - val_loss: 0.0746
Epoch 73/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0641Epoch 00072: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0641 - val_loss: 0.0746
Epoch 74/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0638Epoch 00073: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0638 - val_loss: 0.0752
Epoch 75/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0636Epoch 00074: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0636 - val_loss: 0.0754
Epoch 76/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0632Epoch 00075: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0632 - val_loss: 0.0745
Epoch 77/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0632Epoch 00076: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0632 - val_loss: 0.0754
Epoch 78/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0630Epoch 00077: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0630 - val_loss: 0.0768
Epoch 79/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0628Epoch 00078: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0628 - val_loss: 0.0760
Epoch 80/80
8896/8915 [============================>.] - ETA: 0s - loss: 0.0627Epoch 00079: val_loss did not improve
8915/8915 [==============================] - 84s - loss: 0.0627 - val_loss: 0.0750
history: [(0.14777076038763354, None, 0.083380266168016068, None), (0.095916396387828173, None, 0.081978704257214319, None), (0.089199707563914279, None, 0.080767346474718546, None), (0.086367086389227923, None, 0.080407515675463573, None), (0.084318070401987605, None, 0.075740506801199411, None), (0.083014255434491965, None, 0.075761653451209374, None), (0.082140661364884043, None, 0.075225533576721834, None), (0.081023547940052301, None, 0.075425631759014539, None), (0.080754975929430081, None, 0.077634316302360368, None), (0.07987172374030678, None, 0.075386464088521107, None), (0.079077784682817828, None, 0.074189287867951897, None), (0.078800654519961516, None, 0.074434840013372139, None), (0.078607900385534363, None, 0.073647957311031673, None), (0.078155782756114095, None, 0.074313297265387601, None), (0.077680418492867845, None, 0.072869157822842298, None), (0.077180010252499001, None, 0.073933729022107222, None), (0.076820816947079346, None, 0.075029750580483293, None), (0.076422350453782206, None, 0.07452242716829828, None), (0.076265800269179576, None, 0.074317114689248676, None), (0.076161515831412452, None, 0.073024680671539707, None), (0.075817330083817622, None, 0.073644784156312329, None), (0.075244618356395024, None, 0.07419175416865248, None), (0.075012663306811514, None, 0.073639925109579202, None), (0.074677077295134328, None, 0.073646693660857826, None), (0.074350797503233895, None, 0.075978875826013856, None), (0.074180400540370048, None, 0.074782170862593547, None), (0.074002023545196735, None, 0.073192637714933839, None), (0.073647259671368495, None, 0.075116314152453803, None), (0.07341168088419546, None, 0.074760415706228697, None), (0.073309995925165738, None, 0.072550066639768318, None), (0.073019361981533915, None, 0.073560431472798615, None), (0.07274448159482462, None, 0.077459021197988628, None), (0.072578186157775337, None, 0.072814042105319651, None), (0.072275753130387269, None, 0.074154972998385735, None), (0.072067743309147225, None, 0.073861857360981886, None), (0.071822650436431046, None, 0.073670600291262281, None), (0.071522926082453295, None, 0.072794933173250642, None), (0.071352309556871205, None, 0.073447415803341159, None), (0.07129763858210017, None, 0.074140628760165361, None), (0.071026451656708747, None, 0.074406569879105752, None), (0.070729161679443861, None, 0.072410772455499525, None), (0.070670036875459502, None, 0.072419988253015155, None), (0.070440820081810296, None, 0.074728481376424752, None), (0.070084908453353786, None, 0.073465160867001153, None), (0.069877918438167971, None, 0.07532440519079249, None), (0.069765653068004405, None, 0.075567410093672738, None), (0.069509765299364076, None, 0.074673495774573467, None), (0.069303797527236741, None, 0.075692585871574722, None), (0.069238347890700644, None, 0.074265501664039932, None), (0.069119427234887135, None, 0.074374225355209184, None), (0.068846407630472992, None, 0.074001468115664548, None), (0.068483988901436227, None, 0.074105382980184348, None), (0.068159136289769315, None, 0.073959612465919339, None), (0.067984407356262738, None, 0.076036549692458294, None), (0.067716282036989109, None, 0.074665673996539825, None), (0.067622024219940707, None, 0.074137426056760422, None), (0.06735341966703777, None, 0.077158623870382914, None), (0.067207444096072905, None, 0.075386683991614814, None), (0.067080418511063472, None, 0.074448618039171743, None), (0.066668010241050638, None, 0.075099176992761321, None), (0.066389008045229958, None, 0.074339428607453698, None), (0.066143895876220424, None, 0.073791399883463032, None), (0.066062649255446082, None, 0.075008096720309961, None), (0.065874889533103886, None, 0.076865215821469088, None), (0.065846691904897711, None, 0.074723108620085618, None), (0.065400672120220257, None, 0.074172520827739799, None), (0.065316163860909132, None, 0.07458861254631205, None), (0.064926282199861227, None, 0.07460107638480816, None), (0.064802410736036514, None, 0.074028175593690668, None), (0.064577348716661487, None, 0.076762956475957905, None), (0.064422926705370309, None, 0.074935385331194454, None), (0.06429644034140175, None, 0.074551102899490518, None), (0.064075994381260076, None, 0.074557902901730644, None), (0.063770075574458754, None, 0.075167039956184137, None), (0.063629712559704829, None, 0.075396173590041221, None), (0.063241958562169798, None, 0.074512783041659827, None), (0.063226107932915526, None, 0.075398412727295083, None), (0.062969433293540489, None, 0.076832704182634964, None), (0.062830067999698577, None, 0.075960365984034037, None), (0.062666555847168237, None, 0.075038188632498393, None)]
0. 
patient tongue id: 05032111505126_4
label yaofang:
桂枝 甘草 白芍 香附 当归 防风 生地黄 荆芥穗 紫草 白花蛇舌草 蒺藜 制何首乌 徐长卿
0.393632 0.408218 0.35372 0.325954 0.440298 0.348932 0.309782 0.584602 0.7124 0.341567
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.200000, recall: 0.153846, error: 0.800000
1. 
patient tongue id: 02120825167029_1_4
label yaofang:
甘草 柴胡 白芍 陈皮 龙骨 防风 白术 天麻 糯稻根 白花蛇舌草 醋龟甲 蜈蚣 半枝莲 醋鳖甲
0.972039 0.517026 0.588378 0.421914 0.302032 0.321771 0.584125 0.42938 0.486853 0.322645 0.366766 0.391654
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
2. 
patient tongue id: 03312117577276_5
label yaofang:
甘草 法半夏 桔梗 金银花 连翘 芦根 牛蒡子 浙贝母 诃子 麦芽 苦杏仁 板蓝根 炙麻黄 四季青
0.979385 0.510736 0.653675 0.4784 0.350468 0.337827 0.684358 0.507804 0.609162 0.381499 0.47673 0.547598
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.071429, error: 0.916667
3. 
patient tongue id: 06031635553995_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.31933 0.867358 0.966347 0.721904 0.637741 0.367098 0.310992 0.451768 0.891964 0.915075 0.849249 0.933847 0.431109 0.967844 0.351713 0.317387 0.57939 0.577189 0.782899
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.812500, error: 0.315789
4. 
patient tongue id: 06031042369423_6_2
label yaofang:
甘草 茯苓 党参 鸡血藤 白术 山药 地黄 天麻 三七 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲
0.89971 0.479224 0.510238 0.395231 0.347256
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 1.000000, recall: 0.357143, error: 0.000000
5. 
patient tongue id: 05102009118590_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.303951 0.930264 0.992262 0.829207 0.733791 0.352489 0.307595 0.489427 0.955877 0.972289 0.928182 0.978229 0.404944 0.993025 0.366445 0.347774 0.630843 0.58448 0.855625
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
6. 
patient tongue id: 05262210400938_5_7_1
label yaofang:
甘草 当归 金银花 紫花地丁 党参 黄芪 鸡血藤 白术 生地黄 红花 赤芍 牡丹皮 细辛 白芷 吴茱萸 麦芽 忍冬藤 白花蛇舌
0.878575 0.46034 0.549387 0.336596 0.329166 0.351572 0.31166 0.583532
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 丹参 山药 天麻

------Score: precision: 0.375000, recall: 0.166667, error: 0.625000
7. 
patient tongue id: 01201715420540_6
label yaofang:
甘草 白芍 川芎 羌活 酸枣仁 赤芍 牛膝 细辛 天麻 全蝎 白芷
0.986562 0.548465 0.60601 0.422009 0.331016 0.303166 0.363607 0.638158 0.504038 0.561787 0.393484 0.429872 0.446243
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.272727, error: 0.769231
8. 
patient tongue id: 05251945253474_5
label yaofang:
甘草 柴胡 薏苡仁 桃仁 蒲公英 黄连 红花 赤芍 栀子 牡丹皮 郁金 麦芽 北沙参 百合 蜈蚣 合欢皮 预知子 稻芽
0.863027 0.456 0.529118 0.319045 0.553134 0.3288 0.330076 0.361927
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 天麻 蜈蚣

------Score: precision: 0.250000, recall: 0.111111, error: 0.750000
9. 
patient tongue id: 05262204569733_1_2_7
label yaofang:
甘草 太子参 黄芪 鸡血藤 枸杞子 白术 酸枣仁 生地黄 山药 天麻 地龙 女贞子 沙苑子 威灵仙 灯盏细辛
0.965532 0.514918 0.591251 0.443039 0.30422 0.348258 0.589585 0.457164 0.522153 0.339798 0.389185 0.411618
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
10. 
patient tongue id: 03221618540357_1_4
label yaofang:
甘草 薏苡仁 远志 党参 白术 牡丹皮 天麻 鳖甲 款冬花 补骨脂 莪术 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.989117 0.553133 0.606744 0.407244 0.303213 0.348112 0.63787 0.515576 0.559337 0.401623 0.430457 0.443909
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
11. 
patient tongue id: 02182144582851_4_6
label yaofang:
桂枝 甘草 陈皮 法半夏 茯苓 前胡 桔梗 党参 浙贝母 细辛 白前 苦杏仁 粉葛 炙麻黄 贯众
0.317059 0.532717 0.397271 0.599298 0.485698 0.400085 0.344561 0.503065 0.521987 0.461524 0.528615 0.387989 0.669988 0.400025 0.41425
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.400000, recall: 0.400000, error: 0.600000
12. 
patient tongue id: 06181840070430_1_2
label yaofang:
甘草 葛根 党参 黄连 赤芍 山药 山茱萸 天麻 白花蛇舌草 玉米须 蜈蚣 半枝莲 醋鳖甲 南杏仁
0.997388 0.566466 0.699056 0.444637 0.356475 0.306676 0.387305 0.784535 0.616828 0.700833 0.449439 0.535885 0.589858
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
13. 
patient tongue id: 06191154442697_2_6
label yaofang:
甘草 川芎 枳壳 法半夏 白术 酸枣仁 槟榔 杜仲 牛膝 砂仁 天麻 桑寄生 麦芽 合欢花
0.923416 0.304053 0.506999 0.302985 0.531794 0.381566 0.438731 0.351472 0.345226
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
14. 
patient tongue id: 02190459031249_5_6
label yaofang:
甘草 防风 金银花 黄芪 白术 黄连 生地黄 红花 桑白皮 水牛角 荆芥穗 火麻仁 白鲜皮 地肤子 土茯苓 蛇蜕
0.455845 0.335146 0.408686 0.311738
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.125000, error: 0.500000
15. 
patient tongue id: 04241931404755_3
label yaofang:
大枣 当归 木香 茯神 远志 白术 酸枣仁 龙眼肉 熟地黄 山药 升麻 山萸肉 浮小麦 首乌藤 炙黄芪
0.657942 0.407294 0.437872 0.427359
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.066667, error: 0.750000
16. 
patient tongue id: 01061607383470_6_4_7
label yaofang:
桂枝 甘草 党参 黄芪 何首乌 白术 生地黄 红花 赤芍 天麻 桑寄生 地龙 桑枝 骨碎补 土茯苓
0.980881 0.519447 0.629791 0.491496 0.341456 0.300761 0.36608 0.641801 0.469143 0.58545 0.333167 0.418403 0.46199
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
17. 
patient tongue id: 01190143040110_1_4_6
label yaofang:
甘草 枳壳 大枣 桔梗 葶苈子 党参 浙贝母 郁金 厚朴 鳖甲 莪术 诃子 白花蛇舌 天山雪莲 蜂房 红豆杉
0.927496 0.495818 0.544578 0.494359 0.301784 0.339957 0.44512 0.305213 0.404825
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.444444, recall: 0.250000, error: 0.555556
18. 
patient tongue id: 05260700431303_6_2
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 生地黄 知母 山药 女贞子 浮小麦 首乌藤 合欢花
0.987967 0.52054 0.642774 0.449931 0.363047 0.315442 0.719757 0.546937 0.659789 0.437513 0.517791 0.617982
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.461538, error: 0.500000
19. 
patient tongue id: 01041307169732_5
label yaofang:
桂枝 白芍 茯苓 桃仁 阿胶 海螵蛸 牡丹皮 茜草
0.306019 0.447438 0.433832 0.505663
predicted yaofang:
党参 车前子 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
20. 
patient tongue id: 04130632494196_2_7
label yaofang:
甘草 桃仁 党参 枸杞子 酸枣仁 丹参 生地黄 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.995354 0.561977 0.660474 0.441576 0.341146 0.302582 0.376647 0.728996 0.586773 0.664515 0.440043 0.505316 0.547744
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
21. 
patient tongue id: 04291506135523_6_4_2
label yaofang:
甘草 茯苓 龙骨 远志 酸枣仁 知母 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.998571 0.555694 0.726155 0.457495 0.431009 0.321985 0.364265 0.862698 0.689009 0.819868 0.547889 0.658642 0.794628
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
22. 
patient tongue id: 03261702068428_3_2
label yaofang:
芦根 桃仁 麦冬 太子参 玄参 生地黄 乌药 决明子 珍珠母 百合 紫苏梗 合欢皮 青果 土牛膝
0.446654 0.385041 0.414286 0.408257 0.518709 0.307425
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 砂仁

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
23. 
patient tongue id: 02122118376482_2_6
label yaofang:
甘草 白芍 当归 枸杞子 白术 牛膝 山药 山茱萸 地黄 天麻 肉苁蓉 火麻仁 补骨脂 制何首乌
0.973128 0.507987 0.587532 0.478208 0.349646 0.542569 0.42092 0.506144 0.308934 0.343878 0.352272
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
24. 
patient tongue id: 02190456571456_5_6
label yaofang:
甘草 柴胡 川芎 黄芩 桔梗 金银花 白术 浙贝母 白芷 皂角刺 辛夷 苍耳子 蜂房
0.985265 0.540457 0.583247 0.401977 0.318125 0.581255 0.43293 0.489891 0.321976 0.345407 0.354308
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
25. 
patient tongue id: 03291857372147_1
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.365193 0.378364 0.328881 0.374138 0.408049 0.490707 0.589891
predicted yaofang:
柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
26. 
patient tongue id: 01192129410257_6_5_2
label yaofang:
甘草 枳壳 连翘 玉竹 太子参 山药 山茱萸 泽泻 茵陈 扁豆花 麦芽 北沙参 建曲 稻芽
0.974801 0.528372 0.607324 0.433968 0.35658 0.322175 0.350259 0.64955 0.461711 0.537773 0.350617 0.407085 0.441912
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.142857, error: 0.846154
27. 
patient tongue id: 05162033334007_1
label yaofang:
大枣 当归 茯苓 木香 牛蒡子 远志 党参 黄芪 白术 柏子仁 淫羊藿 仙茅 炙甘草
0.34376 0.35655 0.388166 0.446592 0.343682 0.450452 0.513968 0.317734
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
28. 
patient tongue id: 05031849508342_1_3
label yaofang:
甘草 香附 茯苓 龙骨 牡蛎 何首乌 酸枣仁 熟地黄 山茱萸 磁石 菟丝子 珍珠母 浮小麦 黑枣 龟甲
0.378286 0.354743 0.364992 0.592286 0.585319 0.395944 0.418904 0.523497 0.303474
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.222222, recall: 0.133333, error: 0.777778
29. 
patient tongue id: 05190810194013_1_4_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.31164 0.494963 0.387776 0.395551 0.591107 0.447488 0.507564 0.46607 0.479163 0.513484 0.461758 0.423856 0.4623 0.478271 0.476423
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
30. 
patient tongue id: 06091952380161_1_4_7
label yaofang:
甘草 陈皮 茯苓 半夏 木香 党参 枸杞子 白术 杜仲 山药 厚朴 桑寄生 鸡内金 紫苏叶 广藿香
0.370155 0.372485 0.331696 0.395877 0.331866
predicted yaofang:
甘草 茯苓 党参 黄芪 北沙参

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
31. 
patient tongue id: 01211320313922_2_4
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 红花 牡丹皮 干姜 茜草 天花粉 旋覆花 炙甘草
0.371775 0.30418 0.312724 0.37729
predicted yaofang:
党参 白术 车前子 炙甘草

------Score: precision: 0.250000, recall: 0.066667, error: 0.750000
32. 
patient tongue id: 03012047207357_6_2
label yaofang:
甘草 白芍 茯苓 桔梗 浙贝母 山茱萸 桑叶 荷叶 磁石 天花粉 白花蛇舌草 沙苑子 蜂房 醋鳖甲
0.987934 0.545485 0.601909 0.427114 0.323492 0.353806 0.626371 0.488404 0.558761 0.37613 0.414886 0.436146
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
33. 
patient tongue id: 03221817596943_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.35115 0.683195 0.3999 0.768959 0.568888 0.510605 0.404939 0.335806 0.310022 0.405217 0.343407 0.664175 0.682137 0.627663 0.715687 0.456989 0.7932 0.365721 0.330188 0.504386 0.504588 0.592287
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.636364, recall: 1.000000, error: 0.363636
34. 
patient tongue id: 05252014335896_4_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 豆蔻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.339928 0.346115 0.305975 0.413356 0.417999 0.326177 0.411245 0.490799
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
35. 
patient tongue id: 04101851509337_4
label yaofang:
甘草 法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.946714 0.993481 0.835444 0.747231 0.351077 0.504557 0.960373 0.975931 0.932541 0.980718 0.411056 0.993958 0.373371 0.338086 0.649161 0.595113 0.869075
predicted yaofang:
法半夏 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.647059, recall: 0.785714, error: 0.352941
36. 
patient tongue id: 04020813015921_1_5_6
label yaofang:
甘草 法半夏 桃仁 生地黄 浙贝母 鳖甲 淡竹叶 瓜蒌子 蜈蚣 白花蛇舌 蜂房 四季青 川木通 红豆杉
0.997636 0.577814 0.687188 0.431622 0.370763 0.319645 0.392655 0.792049 0.637872 0.714866 0.482747 0.560236 0.607771
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
37. 
patient tongue id: 05092108072209_2_6
label yaofang:
桂枝 当归 枸杞子 熟地黄 杜仲 山药 山茱萸 菟丝子 制川乌 鹿角霜 覆盆子
0.690898 0.422847 0.446475 0.337696
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
38. 
patient tongue id: 03240711434948_3_7
label yaofang:
茯苓 黄芪 白术 五味子 熟地黄 牡丹皮 杜仲 山药 山茱萸 石菖蒲 泽泻 砂仁 磁石
0.39758 0.369565 0.360058 0.520266 0.566628 0.338445 0.377533 0.384589
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
39. 
patient tongue id: 06062300403636_2_6
label yaofang:
甘草 茯苓 木香 龙骨 党参 太子参 酸枣仁 丹参 黄连 生地黄 山茱萸 火麻仁 补骨脂 浮小麦
0.932217 0.489522 0.546711 0.457839 0.448976 0.319405 0.393496
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
40. 
patient tongue id: 05162038421755_6_2
label yaofang:
柴胡 白芍 当归 茯苓 熟地黄 栀子 牡丹皮 山药 泽泻 鳖甲 白花蛇舌草 酒萸肉
0.402833 0.420554 0.376581 0.366116 0.434588 0.332149 0.606189 0.634073 0.325591
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.222222, recall: 0.166667, error: 0.777778
41. 
patient tongue id: 01041642503947_4
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 升麻 炙甘草 覆盆子 广金钱草 徐长卿
0.436027 0.3554 0.423842 0.523469 0.571647 0.319836 0.364382
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
42. 
patient tongue id: 02191249286384_5_6
label yaofang:
甘草 当归 连翘 薏苡仁 蒲公英 杜仲 牛膝 钩藤 莱菔子 天麻 白芷 桑寄生 决明子 麦芽 首乌藤
0.992526 0.534367 0.652499 0.44623 0.325142 0.331681 0.705936 0.476822 0.593541 0.32935 0.412852 0.477234
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
43. 
patient tongue id: 03231058256534_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 桃仁 酸枣仁 黄连 竹茹 浙贝母 牡丹皮 天花粉 威灵仙 合欢花
0.988406 0.523734 0.660905 0.463329 0.408516 0.335389 0.356013 0.758132 0.601613 0.709354 0.477238 0.576171 0.674294
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
44. 
patient tongue id: 06091945367639_5
label yaofang:
甘草 金银花 赤芍 茵陈 香薷 板蓝根 白扁豆 土茯苓 羚羊骨
0.426108 0.339896 0.384889 0.451003
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.111111, error: 0.750000
45. 
patient tongue id: 05092051534023_1_4_6
label yaofang:
麻黄 桂枝 白芍 羌活 牛蒡子 五味子 浙贝母 细辛 干姜 荷叶 射干 紫菀 炙甘草
0.375408 0.394804 0.354226 0.381272 0.402903 0.315659 0.300202 0.527659 0.59382 0.30014
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.300000, recall: 0.230769, error: 0.700000
46. 
patient tongue id: 02171830080765_4_1
label yaofang:
法半夏 前胡 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.351419 0.71054 0.370636 0.84608 0.599685 0.548112 0.398096 0.330745 0.40512 0.310165 0.729908 0.749066 0.690005 0.792736 0.458711 0.832868 0.356794 0.313893 0.503307 0.52628 0.654743
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
47. 
patient tongue id: 03242120296952_1
label yaofang:
甘草 柴胡 白芍 香附 当归 茯苓 薄荷 白术 胆南星 白芷 蔓荆子 麦芽 广藿香 山慈菇
0.386006 0.358339 0.384761 0.306159 0.41012 0.417595 0.314706 0.479561
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
48. 
patient tongue id: 05092243531358_1_2
label yaofang:
黄芪 白术 熟地黄 浙贝母 牡丹皮 山茱萸 厚朴 砂仁 肉苁蓉 北沙参 桑枝 合欢皮 冬凌草
0.526166 0.349519 0.358207 0.354347 0.682871 0.745823 0.309216 0.339614 0.494173 0.530333 0.313195 0.513951 0.372919
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 赤芍 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.461538, recall: 0.461538, error: 0.538462
49. 
patient tongue id: 03061806377584_5
label yaofang:
甘草 川芎 黄芩 桔梗 黄芪 浙贝母 石膏 白芷 蔓荆子 皂角刺 辛夷 广藿香 苍耳子
0.994205 0.553286 0.661949 0.451686 0.380806 0.321828 0.388177 0.754459 0.605393 0.695853 0.479288 0.553272 0.618293
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.076923, recall: 0.076923, error: 0.923077
50. 
patient tongue id: 05221859575912_1_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒苍耳子
0.319632 0.844342 0.964389 0.724366 0.624303 0.359651 0.316048 0.420942 0.884977 0.911973 0.850572 0.929857 0.395996 0.97014 0.330981 0.323468 0.554346 0.55661 0.775068
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
51. 
patient tongue id: 02211411418224_1_7_6
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.365087 0.310037 0.328797 0.658033 0.52827 0.397987 0.359192 0.3234 0.455362
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
52. 
patient tongue id: 03081807286240_1_6
label yaofang:
桂枝 白芍 川芎 法半夏 大枣 龙骨 麦冬 党参 柏子仁 牡丹皮 吴茱萸
0.692446 0.389299 0.513261 0.470765
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.090909, error: 0.750000
53. 
patient tongue id: 01041316071294_4
label yaofang:
甘草 桔梗 阿胶 生地黄 红花 冬瓜子 人参叶
0.524504 0.322818 0.513214 0.549186 0.392102 0.529787 0.312416 0.783456 0.324583
predicted yaofang:
法半夏 茯苓 前胡 桔梗 款冬花 紫菀 百部 炙甘草 广藿香

------Score: precision: 0.111111, recall: 0.142857, error: 0.888889
54. 
patient tongue id: 01130632137243_6_5
label yaofang:
甘草 茯苓 独活 薏苡仁 党参 白术 赤芍 山药 桑寄生 鳖甲 茵陈 虎杖 土鳖虫 牛大力 千斤拔 木棉花
0.973048 0.501155 0.579322 0.329931 0.309446 0.318981 0.65627 0.350348
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 蜈蚣

------Score: precision: 0.625000, recall: 0.312500, error: 0.375000
55. 
patient tongue id: 02212011270440_2
label yaofang:
甘草 白芍 当归 白术 栀子 牡丹皮 牛膝 山药 山茱萸 地黄 天麻 肉苁蓉 火麻仁 珍珠母 浮小麦 制何首乌
0.976367 0.523365 0.584495 0.444324 0.338793 0.556526 0.409576 0.485691 0.30076 0.338856 0.355233
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
56. 
patient tongue id: 03161713206874_2
label yaofang:
前胡 桔梗 麦冬 太子参 荷叶 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子
0.340838 0.691404 0.349223 0.843915 0.608976 0.54704 0.373136 0.351594 0.325048 0.402683 0.327993 0.724224 0.769771 0.69912 0.790162 0.396533 0.888112 0.356303 0.351247 0.49963 0.493145 0.636823
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.454545, recall: 0.833333, error: 0.545455
57. 
patient tongue id: 02281659408475_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.41155 0.353021 0.394472 0.450902 0.371983 0.325119 0.301439
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 牛膝

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
58. 
patient tongue id: 03012139128664_6_1
label yaofang:
甘草 茯苓 远志 党参 白术 山药 砂仁 天麻 赤石脂 鳖甲 建曲 蜈蚣 天山雪莲 半枝莲
0.991773 0.573918 0.631441 0.436101 0.315059 0.30251 0.382602 0.659781 0.562441 0.606347 0.432416 0.468011 0.47049
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
59. 
patient tongue id: 01140806328188_5_6
label yaofang:
甘草 川芎 茯苓 党参 白术 丹参 赤芍 杜仲 牛膝 天麻 蔓荆子 桑寄生 地龙 蒺藜
0.99326 0.533101 0.667058 0.464722 0.419025 0.338917 0.382327 0.783014 0.614989 0.738694 0.488908 0.580832 0.689587
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
60. 
patient tongue id: 03192301282720_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 金银花 牛蒡子 浙贝母 细辛 桑白皮 瓜蒌皮 款冬花 苦杏仁
0.749814 0.425343 0.455975 0.433413
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.153846, error: 0.500000
61. 
patient tongue id: 02281828451555_4_2
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.327797 0.732014 0.336482 0.86532 0.613804 0.53042 0.386085 0.313746 0.380254 0.737948 0.790608 0.712434 0.811583 0.439224 0.898539 0.308971 0.325019 0.498992 0.508391 0.660785
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
62. 
patient tongue id: 03021435064873_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.418433 0.35856 0.332691 0.396963 0.451733 0.404823 0.359516 0.311756
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 北沙参

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
63. 
patient tongue id: 01200558357134_1_2_6
label yaofang:
甘草 龙骨 牡蛎 酸枣仁 山茱萸 地黄 天麻 火麻仁 白花蛇舌草 建曲 蜈蚣 半枝莲 醋鳖甲 五加皮
0.989226 0.538022 0.628836 0.42305 0.347679 0.303194 0.340232 0.694607 0.535262 0.610671 0.418862 0.47829 0.538431
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
64. 
patient tongue id: 04251951159999_1_4
label yaofang:
陈皮 桔梗 太子参 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.581276 0.306113 0.383436 0.475169 0.463406
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
65. 
patient tongue id: 04272308485765_6
label yaofang:
麻黄 桂枝 甘草 白芍 牡蛎 薏苡仁 桃仁 丹参 红花 赤芍 熟地黄 益母草 夏枯草 鹿角霜 姜炭 芥子
0.480878 0.307001 0.353687 0.437462 0.372654 0.31182
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
66. 
patient tongue id: 02281255405354_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.30001 0.313216 0.369533 0.353484 0.349243
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
67. 
patient tongue id: 02221311493797_1_4_7
label yaofang:
甘草 枳壳 木香 太子参 丹参 海螵蛸 厚朴 莱菔子 高良姜 鸡内金 草豆蔻 六神曲
0.347474 0.307052 0.384912 0.425316 0.368884 0.461168 0.349439 0.415131 0.306766 0.373282 0.438347 0.316525 0.358186 0.315425 0.322128 0.321221
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.250000, error: 0.812500
68. 
patient tongue id: 05162106199672_2_6_7
label yaofang:
甘草 丹参 杜仲 郁金 天麻 桑寄生 鳖甲 莪术 诃子 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.965265 0.497102 0.582112 0.477242 0.33933 0.545427 0.339165 0.474799 0.30407
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
69. 
patient tongue id: 05181825178638_6
label yaofang:
麦冬 酸枣仁 丹参 钩藤 灯心草 三七 煅牡蛎 煅龙骨 红景天 毛冬青
0.788678 0.451762 0.528898 0.480006 0.304735 0.380909
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
70. 
patient tongue id: 06070641418291_6_2
label yaofang:
甘草 酸枣仁 生地黄 牡丹皮 山药 山茱萸 仙鹤草 天麻 槐花 鳖甲 五倍子 蜈蚣 天山雪莲 半枝莲
0.989282 0.533011 0.648447 0.454615 0.354213 0.304776 0.361011 0.704674 0.542245 0.623002 0.413459 0.491623 0.540989
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
71. 
patient tongue id: 04192245499946_2_4_6
label yaofang:
甘草 法半夏 茯苓 党参 酸枣仁 牡丹皮 杜仲 山茱萸 佩兰 桑寄生 补骨脂 鹿角霜 蜈蚣 土茯苓
0.933794 0.498436 0.568292 0.437651 0.302338 0.322959 0.520948 0.37769 0.427816 0.318865 0.323925
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
72. 
patient tongue id: 02161924210806_4_7
label yaofang:
桂枝 薏苡仁 黄芪 白术 杜仲 水蛭 砂仁 红豆杉 穿破石 山慈菇 石上柏
0.350538 0.33316 0.351411 0.476623 0.33399 0.306457 0.335484
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 北沙参

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
73. 
patient tongue id: 03141951083772_3
label yaofang:
茯苓 前胡 桔梗 防风 薄荷 钩藤 荆芥穗 白芷 香薷 百部 炙甘草 首乌藤 广藿香 威灵仙
0.699318 0.319728 0.79698 0.600094 0.504026 0.333831 0.323206 0.660437 0.718106 0.634129 0.72674 0.384097 0.884921 0.485942 0.424173 0.55023
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.571429, error: 0.500000
74. 
patient tongue id: 06130818199397_1_2
label yaofang:
川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.461808 0.356757 0.444124 0.469336 0.470228 0.304031
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
75. 
patient tongue id: 02181621581257_5_1_6
label yaofang:
甘草 香附 法半夏 茯苓 党参 白术 山药 薤白 厚朴 砂仁 瓜蒌皮 柿蒂 麦芽 佛手 鱼古 瓦楞子
0.997055 0.569938 0.665059 0.452175 0.355769 0.311075 0.390296 0.748292 0.610627 0.703207 0.469334 0.536627 0.581641
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
76. 
patient tongue id: 02151810038457_1_4_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 高良姜 鸡内金 草豆蔻 六神曲
0.48707 0.309781 0.430638 0.456665 0.356442 0.540915 0.422035 0.454818 0.384487 0.399822 0.34973 0.501815 0.312007 0.318206
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 决明子 夏枯草

------Score: precision: 0.285714, recall: 0.333333, error: 0.714286
77. 
patient tongue id: 01012053145200_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.622534 0.388195 0.397501 0.469981 0.476423 0.399042 0.399221 0.333868 0.381289 0.327971 0.528126
predicted yaofang:
甘草 茯苓 桃仁 党参 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
78. 
patient tongue id: 01061854494532_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.495836 0.380121 0.52057 0.433033 0.33863 0.350127 0.323932 0.380267 0.42429 0.370566 0.493602 0.547023 0.604536 0.324046
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.785714, recall: 0.733333, error: 0.214286
79. 
patient tongue id: 03311619563889_6_7
label yaofang:
甘草 半夏 橘红 牡蛎 薏苡仁 党参 白术 浙贝母 鸡内金 浮小麦 黑枣 合欢皮 墨旱莲
0.48202 0.377269 0.438371 0.355628 0.432329
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
80. 
patient tongue id: 01051903009901_1_5
label yaofang:
法半夏 前胡 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.334066 0.819713 0.324701 0.931963 0.670869 0.610972 0.387546 0.32799 0.443873 0.30978 0.834989 0.860806 0.781253 0.884696 0.453086 0.925997 0.374824 0.316298 0.554892 0.555449 0.723199
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 1.000000, error: 0.285714
81. 
patient tongue id: 05221927067473_4_6
label yaofang:
甘草 白芍 川芎 羌活 独活 牛膝 细辛 干姜 白芷 蜈蚣 姜黄 海桐皮 鹿衔草
0.416657 0.434014 0.418713 0.334401 0.341317 0.433912 0.424905 0.332614 0.687977 0.717818 0.384504 0.308745
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶 紫苏梗

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
82. 
patient tongue id: 02211954346969_1_2
label yaofang:
甘草 白芍 茯苓 党参 枸杞子 白术 生地黄 牡丹皮 牛膝 山药 山茱萸 白茅根 菟丝子 益母草 麦芽
0.950981 0.497462 0.587249 0.416737 0.340574 0.308427 0.347281 0.619474 0.361091 0.431494 0.302595 0.324707
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
83. 
patient tongue id: 04122149059520_1_4
label yaofang:
甘草 白芍 赤芍 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜 宽筋藤 田七末
0.992899 0.540461 0.666235 0.473743 0.369353 0.310199 0.377346 0.733646 0.59318 0.683267 0.462802 0.546343 0.61593
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
84. 
patient tongue id: 05252221545381_1
label yaofang:
川芎 当归 茯苓 防风 党参 太子参 黄芪 枸杞子 熟地黄 白芷 炙甘草 续断 首乌藤 麸炒白术 盐菟丝子 酒女贞子
0.313969 0.772518 0.919425 0.683583 0.609585 0.340982 0.314075 0.438683 0.813003 0.845406 0.771553 0.874072 0.370129 0.936387 0.347504 0.337817 0.548729 0.50576 0.702208
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.157895, recall: 0.187500, error: 0.842105
85. 
patient tongue id: 04020819469960_1_4_6
label yaofang:
甘草 茯苓 薏苡仁 党参 郁金 仙鹤草 茜草 天麻 赤石脂 鳖甲 蜈蚣 半枝莲 艾叶
0.991816 0.538732 0.655583 0.465397 0.332685 0.361245 0.697117 0.546687 0.631876 0.410393 0.484649 0.524287
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.538462, error: 0.416667
86. 
patient tongue id: 05040340157053_2_5
label yaofang:
甘草 茯苓 金银花 麦冬 党参 玄参 生地黄 白茅根 水牛角 白花蛇舌草 白扁豆 白鲜皮 女贞子 建曲 天山雪莲
0.307035 0.358994 0.393597 0.394252
predicted yaofang:
茯苓 党参 黄芪 白术

------Score: precision: 0.500000, recall: 0.133333, error: 0.500000
87. 
patient tongue id: 06191153252984_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 远志 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.932273 0.490576 0.558079 0.428836 0.491211 0.367504
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 1.000000, recall: 0.400000, error: 0.000000
88. 
patient tongue id: 03152024532951_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.436723 0.383346 0.374776 0.446022 0.325011 0.333166 0.356085
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 北沙参

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
89. 
patient tongue id: 05260645141054_2_6
label yaofang:
甘草 枳壳 白术 玄参 生地黄 牛膝 天麻 肉苁蓉 鳖甲 火麻仁 补骨脂 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.999451 0.576194 0.742915 0.457219 0.441241 0.318953 0.372571 0.889897 0.718407 0.853154 0.568234 0.692121 0.823308
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.562500, error: 0.307692
90. 
patient tongue id: 01041810433628_3
label yaofang:
法半夏 茯苓 前胡 防风 荆芥穗 款冬花 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子 紫苑
0.380611 0.37669 0.348904 0.397052 0.309718 0.323946 0.372121 0.586694
predicted yaofang:
法半夏 茯苓 前胡 桔梗 黄芪 紫菀 北沙参 炙甘草

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
91. 
patient tongue id: 05162129531434_1_4
label yaofang:
甘草 川芎 茯苓 党参 黄芪 白术 赤芍 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤
0.957553 0.504153 0.567634 0.430409 0.303142 0.504966 0.360293 0.413817
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.875000, recall: 0.466667, error: 0.125000
92. 
patient tongue id: 02211948551441_1
label yaofang:
甘草 太子参 白术 黄连 山药 白茅根 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 合欢花 红豆杉
0.972848 0.525892 0.594355 0.435748 0.324641 0.300222 0.358541 0.615145 0.459767 0.520418 0.345106 0.391013 0.403022
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
93. 
patient tongue id: 06031110344577_1_2_4
label yaofang:
甘草 防风 薏苡仁 党参 黄芪 白术 五味子 厚朴 砂仁 补骨脂 扁豆花 麦芽 紫苏梗 木棉花
0.988609 0.547547 0.628999 0.436946 0.343318 0.304944 0.370295 0.679832 0.538373 0.601538 0.419874 0.470783 0.497141
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
94. 
patient tongue id: 03231032101261_1_2
label yaofang:
甘草 白芍 川芎 茯苓 党参 枸杞子 白术 丹参 山药 地黄 菟丝子 浮小麦 合欢花
0.994431 0.559838 0.658141 0.444348 0.359131 0.317692 0.388109 0.736943 0.570271 0.654857 0.426145 0.497664 0.534211
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.384615, error: 0.615385
95. 
patient tongue id: 01202010470170_7_5
label yaofang:
桃仁 黄芪 白术 赤芍 浙贝母 杜仲 厚朴 砂仁 莪术 北沙参 土鳖虫 红豆杉 合欢皮 蛇舌草
0.599844 0.425569 0.353058 0.395301 0.442529 0.362087
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
96. 
patient tongue id: 04121310514640_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.373997 0.37815 0.334818 0.370695 0.351756 0.305363 0.307584 0.433762 0.531339
predicted yaofang:
法半夏 茯苓 前胡 桔梗 黄芪 紫菀 百部 北沙参 炙甘草

------Score: precision: 0.777778, recall: 0.583333, error: 0.222222
97. 
patient tongue id: 03111508488463_2_1
label yaofang:
甘草 川芎 茯苓 麦冬 太子参 白术 五味子 牛膝 郁金 山药 补骨脂 莪术 浮小麦
0.98687 0.536613 0.616815 0.452489 0.317251 0.357782 0.643232 0.503969 0.58206 0.378887 0.432759 0.466145
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
98. 
patient tongue id: 04130019502437_1_6
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.990449 0.524705 0.671716 0.47217 0.379446 0.30357 0.341988 0.749826 0.563232 0.687277 0.429108 0.5308 0.638394
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.846154, error: 0.153846
99. 
patient tongue id: 04300934023356_4_6
label yaofang:
甘草 茯苓 羌活 独活 薏苡仁 党参 郁金 天麻 鳖甲 补骨脂 粉葛 威灵仙 蜈蚣 白花蛇舌 天山雪莲
0.928504 0.490644 0.529667 0.397109 0.453322 0.342692
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
100. 
patient tongue id: 04210650146115_6
label yaofang:
甘草 龙骨 白术 酸枣仁 生地黄 知母 山茱萸 天麻 地骨皮 糯稻根 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.996434 0.552215 0.68503 0.449484 0.419253 0.336681 0.389681 0.813122 0.654847 0.759325 0.528629 0.616912 0.714612
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.666667, error: 0.230769
101. 
patient tongue id: 04202053147183_6
label yaofang:
甘草 柴胡 川芎 香附 防风 桃仁 白术 柏子仁 赤芍 荆芥穗 郁李仁 芥子
0.691575 0.324998 0.384255 0.51316 0.449487
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
102. 
patient tongue id: 04260652227646_4_7
label yaofang:
甘草 川芎 法半夏 桃仁 白术 红花 细辛 天麻 全蝎 僵蚕 麦芽 蒺藜
0.996805 0.575392 0.675007 0.429359 0.368372 0.32046 0.398076 0.771936 0.622793 0.695958 0.481248 0.548193 0.591381
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.250000, error: 0.769231
103. 
patient tongue id: 03242127541579_6_4
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 白花蛇舌草 白扁豆 广藿香
0.301837 0.308489 0.317007 0.391756 0.47727 0.303438 0.338458 0.43035
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.272727, error: 0.625000
104. 
patient tongue id: 04111859059501_1_4
label yaofang:
法半夏 前胡 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.325139 0.836361 0.952249 0.698185 0.614325 0.385189 0.30944 0.436207 0.300587 0.864957 0.887797 0.822076 0.913041 0.445151 0.947131 0.350386 0.318908 0.563307 0.562631 0.749397
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
105. 
patient tongue id: 03152048311128_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.381233 0.335411 0.32096 0.418194 0.406895 0.3242 0.392472 0.359736 0.336272
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝 车前子

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
106. 
patient tongue id: 06111024184873_2_6
label yaofang:
甘草 柴胡 白芍 延胡索 郁金 天麻 鳖甲 鸡内金 虎杖 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 广金钱草
0.989761 0.548159 0.625117 0.427775 0.328893 0.357896 0.669388 0.545092 0.599471 0.429474 0.478213 0.504761
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
107. 
patient tongue id: 03222002337521_1_7
label yaofang:
甘草 薏苡仁 党参 鸡血藤 黄连 生地黄 砂仁 天麻 鳖甲 补骨脂 麦芽 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.99567 0.542401 0.679275 0.456488 0.403473 0.336675 0.406936 0.798266 0.658327 0.750503 0.526301 0.601132 0.694665
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
108. 
patient tongue id: 03151853495905_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.337125 0.737668 0.344601 0.865694 0.619607 0.58162 0.392264 0.338306 0.305798 0.458434 0.337161 0.750461 0.792797 0.71293 0.811796 0.433441 0.893742 0.379816 0.369541 0.539187 0.513991 0.657255
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.636364, recall: 1.000000, error: 0.363636
109. 
patient tongue id: 01132141507251_6_1
label yaofang:
甘草 党参 白术 酸枣仁 丹参 大腹皮 砂仁 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.862938 0.446916 0.548592 0.439991 0.461329 0.340129
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
110. 
patient tongue id: 01211317407833_3_7
label yaofang:
白芍 远志 太子参 天麻 三七 鳖甲
0.321929 0.419261 0.354803 0.365705
predicted yaofang:
甘草 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
111. 
patient tongue id: 02201310078907_2
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 金樱子 麦芽 百合 紫苏叶
0.409734 0.309811 0.350585 0.322953 0.407932 0.429201 0.396945
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
112. 
patient tongue id: 04271535117913_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.365295 0.350269 0.3512 0.307404 0.545595
predicted yaofang:
法半夏 茯苓 桔梗 北沙参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
113. 
patient tongue id: 04061943587990_2_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 麦芽 百合 紫苏叶
0.710313 0.406025 0.482354 0.432254
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.111111, error: 0.750000
114. 
patient tongue id: 02181617184194_4_7_6
label yaofang:
黄芪 白术 砂仁 莪术 鸡内金 珍珠母 麦芽 橘核 桑椹 首乌藤 红豆杉 合欢皮 墨旱莲
0.807738 0.459656 0.425706 0.368055
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
115. 
patient tongue id: 02120926570077_1_6_5
label yaofang:
甘草 白芍 法半夏 茯苓 木香 防风 党参 白术 黄连 郁金 山药 厚朴 白花蛇舌草 醋鳖甲 麸炒枳壳
0.990417 0.554227 0.639178 0.439965 0.353264 0.318705 0.38346 0.697865 0.553644 0.622047 0.424888 0.48378 0.510207
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
116. 
patient tongue id: 01211241234361_1_7
label yaofang:
桂枝 柴胡 黄芩 桔梗 牡蛎 藕节 干姜 天花粉 苦杏仁 炙甘草 蜜枇杷叶 人参叶
0.302532 0.341298 0.313034 0.440655
predicted yaofang:
甘草 党参 白术 炙甘草

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
117. 
patient tongue id: 02122232354163_2_5
label yaofang:
甘草 当归 牛蒡子 太子参 黄芪 鸡血藤 丹参 黄连 生地黄 鳖甲 补骨脂 虎杖 白花蛇舌 蜂房 广升麻
0.987724 0.541975 0.610434 0.428867 0.307867 0.357606 0.625417 0.492941 0.551759 0.372615 0.413776 0.430006
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
118. 
patient tongue id: 01250658303561_6_2
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 桑白皮 款冬花 紫菀 苇茎 苦杏仁 板蓝根
0.950098 0.502539 0.560585 0.423671 0.327147 0.529498 0.320377 0.400025
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
119. 
patient tongue id: 01062340548391_1_4_7
label yaofang:
黄芩 金银花 牛蒡子 蒲公英 麦冬 细辛 山楂 蔓荆子 鸡内金 干鱼腥草 苍耳子 炒六神曲
0.876354 0.449681 0.487129 0.318874 0.306095 0.330068 0.487358
predicted yaofang:
甘草 茯苓 党参 白术 丹参 山药 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
120. 
patient tongue id: 03291319498197_1_6
label yaofang:
柴胡 白芍 香附 枳壳 龙骨 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 浮小麦 紫苏梗
0.432141 0.448213 0.432492 0.320205 0.327016 0.41857 0.399522 0.340157 0.709284 0.751339 0.367896 0.307288
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶 紫苏梗

------Score: precision: 0.666667, recall: 0.666667, error: 0.333333
121. 
patient tongue id: 05112036489343_1_4_5
label yaofang:
枳壳 太子参 黄芪 白术 赤芍 海螵蛸 牛膝 厚朴 砂仁 鸡内金 红豆杉 土茯苓 山慈菇 稻芽
0.400587 0.360356 0.481446 0.588002 0.30613 0.351202 0.379105
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
122. 
patient tongue id: 04121904528489_3
label yaofang:
枳壳 薏苡仁 黄芪 白术 海螵蛸 杜仲 牛膝 附子 泽泻 厚朴 桑寄生 麦芽 续断 紫苏叶 骨碎补 土鳖虫 狗脊
0.855557 0.464162 0.523013 0.499584 0.329365 0.37837 0.35346
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.058824, error: 0.857143
123. 
patient tongue id: 03062137564464_1_6
label yaofang:
甘草 茯苓 党参 白术 山药 砂仁 天麻 赤石脂 鳖甲 麦芽 紫苏梗 蜈蚣 天山雪莲 半枝莲
0.996334 0.565703 0.658276 0.439747 0.335628 0.381977 0.732865 0.589982 0.673155 0.44695 0.509522 0.55273
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
124. 
patient tongue id: 04150748083599_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.768532 0.312354 0.348825 0.363712 0.842134 0.783823 0.764713 0.827779 0.806332 0.81656 0.845502 0.682185 0.867179 0.869657 0.887695
predicted yaofang:
桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
125. 
patient tongue id: 04131552072948_1_4_7
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.458614 0.318039 0.408936 0.433994 0.366126 0.503326 0.381583 0.4446 0.310047 0.377997 0.41053 0.347134 0.416319 0.315702 0.330463 0.302709
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.125000, recall: 0.181818, error: 0.875000
126. 
patient tongue id: 03261716512378
label yaofang:
陈皮 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 莱菔子 鸡内金 莲子 炙甘草 紫苏梗
0.623012 0.373812 0.520547 0.423804 0.391022
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
127. 
patient tongue id: 04122152532197_4_6
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 酸枣仁 栀子 天麻 鳖甲 扁豆花 首乌藤 蜈蚣 天山雪莲 半枝莲 红豆杉
0.920307 0.482016 0.589635 0.484387 0.337898 0.30157 0.358416 0.561116 0.372706 0.472488 0.331482 0.356427
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
128. 
patient tongue id: 05161918251176_4
label yaofang:
陈皮 前胡 半夏 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.854463 0.956219 0.704574 0.586521 0.304925 0.364585 0.869666 0.87496 0.802403 0.898324 0.318434 0.917983 0.545596 0.452737 0.710353
predicted yaofang:
法半夏 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.533333, recall: 0.533333, error: 0.466667
129. 
patient tongue id: 03101848314575_4
label yaofang:
陈皮 桔梗 牛蒡子 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.310659 0.422349 0.408478 0.344183 0.390191
predicted yaofang:
白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
130. 
patient tongue id: 05131312072449_2_1_6
label yaofang:
甘草 木香 黄连 浙贝母 天麻 赤石脂 糯稻根 鳖甲 补骨脂 豆蔻 粉葛 建曲 蜈蚣 天山雪莲 半枝莲 龟甲
0.985668 0.542709 0.602549 0.415472 0.337859 0.619591 0.482274 0.533482 0.365266 0.403611 0.421275
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
131. 
patient tongue id: 05032240225166_1_4_7
label yaofang:
甘草 茯苓 赤芍 杜仲 车前子 天麻 桑寄生 鳖甲 鹿角霜 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫
0.978718 0.517912 0.632624 0.447793 0.335313 0.663187 0.48963 0.581345 0.374691 0.453829 0.529298
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
132. 
patient tongue id: 01040251058404_7_6_5
label yaofang:
甘草 薏苡仁 党参 白术 延胡索 细辛 天麻 鳖甲 补骨脂 三棱 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.988543 0.539817 0.629496 0.480891 0.326885 0.305132 0.381575 0.64407 0.489687 0.590986 0.347405 0.410788 0.435721
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
133. 
patient tongue id: 05022100069039_6_7
label yaofang:
甘草 茯苓 龙骨 党参 酸枣仁 牡丹皮 黄柏 菟丝子 益母草 淫羊藿 仙茅 浮小麦 酒女贞子 墨旱莲
0.991145 0.540363 0.644455 0.454565 0.350771 0.308257 0.377947 0.699594 0.52877 0.613265 0.392797 0.46486 0.501229
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
134. 
patient tongue id: 03221324312196_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子 木贼 素馨花
0.504944 0.395164 0.476513 0.446365 0.365925 0.412643 0.445364 0.345584 0.397308 0.323703 0.634197 0.374168
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
135. 
patient tongue id: 03062132360335_2
label yaofang:
甘草 白芍 川芎 香附 枳壳 黄芩 党参 白术 丹参 生地黄 菟丝子 桑寄生
0.97291 0.513286 0.62216 0.453271 0.306547 0.317884 0.603784 0.41694 0.49753 0.364443 0.389627
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
136. 
patient tongue id: 01012049183656_1_3
label yaofang:
甘草 白芍 桔梗 金银花 连翘 薄荷 蒲公英 麦冬 玄参 生地黄 浙贝母 牡丹皮 败酱草
0.530519 0.377436 0.477377 0.343167 0.357145 0.354364 0.312025 0.365475
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 牛膝 天麻

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
137. 
patient tongue id: 01250653068283_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 薏苡仁 党参 黄芪 白术 丹参 砂仁 五灵脂 黄精 白花蛇舌 合欢花
0.920541 0.477341 0.531203 0.397728 0.465693 0.33896
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
138. 
patient tongue id: 04291504543648_7_2_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 桔梗 防风 玉竹 党参 浙贝母 款冬花 麦芽 北沙参 百合 大青叶
0.984522 0.522528 0.637382 0.45255 0.371194 0.303382 0.336235 0.703235 0.537235 0.641862 0.42089 0.499789 0.591096
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.200000, error: 0.769231
139. 
patient tongue id: 03290232393996_2
label yaofang:
甘草 柴胡 白芍 茯苓 党参 山药 天麻 鳖甲 扁豆花 佛手 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.971854 0.519936 0.594514 0.436403 0.312589 0.34797 0.583311 0.439647 0.493678 0.328086 0.3731 0.382778
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
140. 
patient tongue id: 03151915350566_4
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 半枝莲 土茵陈
0.334882 0.325984 0.409135 0.311559
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
141. 
patient tongue id: 01052214499946_4
label yaofang:
丹参 三七 西洋参
0.51569 0.395225 0.350543 0.426389 0.480545 0.364464
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
142. 
patient tongue id: 03291355470417_1_2
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 丹参 生地黄 山药 桑叶 泽泻 地骨皮 糯稻根 胡黄连 淫羊藿 仙茅 龟甲
0.997718 0.580382 0.67103 0.405942 0.345258 0.307093 0.411813 0.778141 0.653786 0.705727 0.516284 0.575709 0.605972
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.437500, error: 0.461538
143. 
patient tongue id: 03302130480924_1_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 党参 浙贝母 莱菔子 天麻 莪术 紫菀 白花蛇舌草 蜈蚣 醋鳖甲
0.976188 0.521183 0.615405 0.491666 0.316562 0.364553 0.581527 0.423789 0.524609 0.359913 0.376623
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
144. 
patient tongue id: 04102041194722_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗 广金钱草
0.349193 0.371562 0.306637 0.380606 0.402492 0.436502 0.562751
predicted yaofang:
柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.714286, recall: 0.500000, error: 0.285714
145. 
patient tongue id: 01202007072002_3_1
label yaofang:
桂枝 当归 黄芪 白术 黄连 知母 附子 山茱萸 厚朴 补骨脂 鸡内金 玉米须 稻芽 积雪草
0.651571 0.408599 0.386516 0.444284 0.508912 0.303349 0.375835
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 砂仁 北沙参

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
146. 
patient tongue id: 03231218459984_4
label yaofang:
陈皮 法半夏 茯苓 党参 黄芪 海螵蛸 郁金 北柴胡 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 甘松
0.303119 0.569182 0.37868 0.625409 0.481427 0.389147 0.364327 0.489279 0.530817 0.459421 0.56979 0.501056 0.667616 0.350393 0.328769 0.423786
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.312500, recall: 0.357143, error: 0.687500
147. 
patient tongue id: 06091943578110_5
label yaofang:
甘草 金银花 麦冬 玉竹 桑叶 荷叶 天花粉 火麻仁 茵陈 香薷 扁豆花 鸡内金 夏枯草 麦芽 北沙参 广藿香
0.551582 0.411129 0.434342 0.40294 0.504001 0.301734
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 砂仁

------Score: precision: 0.166667, recall: 0.062500, error: 0.833333
148. 
patient tongue id: 05242115541267_1_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 五味子 细辛 天麻 鳖甲 款冬花 苦杏仁 炙麻黄 紫苏梗 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.986182 0.546349 0.625853 0.418285 0.334996 0.30312 0.350883 0.665646 0.491755 0.55059 0.370956 0.419584 0.439495
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.437500, error: 0.461538
149. 
patient tongue id: 05221906133315_1_2_4
label yaofang:
葛根 玉竹 太子参 黄芪 枸杞子 柏子仁 山药 芡实 莲子 北沙参 百合 制远志 人参叶 干石斛
0.51487 0.374491 0.560977 0.438816 0.349771 0.345842 0.316047 0.427953 0.44473 0.4085 0.496834 0.48377 0.606699 0.324852 0.354895
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.200000, recall: 0.214286, error: 0.800000
150. 
patient tongue id: 02020850314113_4_6
label yaofang:
甘草 桔梗 白术 浙贝母 牛膝 天麻 桑寄生 鳖甲 款冬花 紫菀 苦杏仁 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986581 0.531702 0.628928 0.439485 0.353297 0.306525 0.341498 0.70313 0.563353 0.639881 0.462103 0.516651 0.588834
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
151. 
patient tongue id: 04102112264740_5
label yaofang:
甘草 桔梗 连翘 薄荷 芦根 牛蒡子 浙贝母 桑叶 菊花 射干 百部 苦杏仁 木蝴蝶 青果
0.558889 0.402101 0.3954 0.338622 0.341232
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
152. 
patient tongue id: 05201507280681_2_6_1
label yaofang:
甘草 枳壳 橘红 玉竹 太子参 砂仁 天麻 鳖甲 火麻仁 茵陈 苦杏仁 蜈蚣 白花蛇舌 天山雪莲
0.771398 0.433622 0.443466 0.37762
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
153. 
patient tongue id: 03151831550977_4
label yaofang:
茯苓 前胡 半夏 防风 神曲 白芷 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 苍耳子
0.305092 0.718477 0.34177 0.832167 0.597879 0.546211 0.361149 0.311953 0.392908 0.308257 0.711772 0.752325 0.668721 0.773712 0.412452 0.869334 0.344578 0.322795 0.508458 0.486908 0.626752
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.476190, recall: 0.769231, error: 0.523810
154. 
patient tongue id: 02021011368988_6_2_1
label yaofang:
牡蛎 党参 白术 牛膝 厚朴 砂仁 地榆 槐花 地龙 北沙参 橘络 首乌藤 合欢皮 墨旱莲
0.634531 0.433338 0.389034 0.418575
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
155. 
patient tongue id: 02182159201703_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 桃仁 远志 浙贝母 细辛 干姜 厚朴 款冬花 苦杏仁 炙麻黄
0.900136 0.464363 0.526228 0.406318 0.400627
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
156. 
patient tongue id: 02221227455801_1_3
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.536578 0.384691 0.391653 0.613099 0.505171 0.558364 0.539774 0.56049 0.582092 0.564341 0.426656 0.571123 0.589211 0.604737
predicted yaofang:
桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.142857, recall: 0.166667, error: 0.857143
157. 
patient tongue id: 03142013409163_6
label yaofang:
白芍 香附 黄芩 法半夏 大枣 党参 延胡索 海螵蛸 北柴胡 麦芽 炙甘草 紫苏梗
0.315317 0.33633 0.386413 0.440026 0.36968 0.491306
predicted yaofang:
柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
158. 
patient tongue id: 01041827451344_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.466275 0.403305 0.345037 0.423437 0.340561 0.401589
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
159. 
patient tongue id: 02120748346639_4
label yaofang:
甘草 茯苓 半夏 橘红 薏苡仁 太子参 白术 苍术 鸡内金 枇杷叶 辛夷 稻芽
0.313728 0.555156 0.360285 0.655034 0.526777 0.438145 0.345023 0.534475 0.595368 0.522602 0.605359 0.40903 0.766527 0.301454 0.426695 0.382246 0.487502
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.117647, recall: 0.166667, error: 0.882353
160. 
patient tongue id: 06141841599626_5
label yaofang:
甘草 桃仁 红花 赤芍 牡丹皮 杜仲 僵蚕 肉苁蓉 莪术 北沙参 蜈蚣 合欢皮 蛇舌草 鸭脚艾
0.458115 0.366471 0.421226 0.301805 0.343234
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
161. 
patient tongue id: 04112002415134_6_1
label yaofang:
甘草 党参 丹参 生地黄 延胡索 天麻 鳖甲 补骨脂 佛手 浮小麦 威灵仙 蜈蚣 半枝莲 红豆杉
0.992563 0.551545 0.647084 0.427863 0.349302 0.305917 0.365527 0.717243 0.537854 0.614004 0.400557 0.46784 0.513655
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
162. 
patient tongue id: 02232010093512_1_4
label yaofang:
陈皮 法半夏 茯苓 防风 佩兰 荆芥穗 白芷 豆蔻 炙甘草 紫苏梗 广藿香 麸炒白术 炒六神曲 醋香附
0.324998 0.707156 0.356962 0.868252 0.640015 0.549863 0.35936 0.328999 0.391591 0.301128 0.753005 0.772105 0.712456 0.813056 0.372677 0.881424 0.327905 0.315315 0.509954 0.492325 0.63907
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.428571, recall: 0.642857, error: 0.571429
163. 
patient tongue id: 05032145036954_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.65422 0.38834 0.459346 0.479589
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
164. 
patient tongue id: 04131944088081_5
label yaofang:
甘草 桔梗 金银花 连翘 薄荷 牛蒡子 紫花地丁 淡豆豉 淡竹叶 四季青
0.388167 0.371043 0.402246 0.361013 0.35728
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
165. 
patient tongue id: 05222018064920_4_2
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 龙脷叶
0.40718 0.419377 0.378756 0.3235 0.339687 0.451797 0.394725 0.326457 0.597898 0.699476 0.369924 0.309737
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶 紫苏梗

------Score: precision: 0.666667, recall: 0.666667, error: 0.333333
166. 
patient tongue id: 01041635054330_6_1
label yaofang:
龙骨 牛蒡子 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 蜈蚣 合欢皮
0.865906 0.459057 0.527581 0.429008 0.389182
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
167. 
patient tongue id: 05032230145191_5
label yaofang:
甘草 黄芩 法半夏 桔梗 金银花 芦根 牛蒡子 浙贝母 桑白皮 天花粉 淡竹叶 款冬花 枇杷叶 苦杏仁
0.999202 0.558879 0.737597 0.463194 0.442808 0.320225 0.369604 0.88557 0.713476 0.850049 0.565366 0.68901 0.828302
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.076923, recall: 0.071429, error: 0.923077
168. 
patient tongue id: 04221926339968_2_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.33344 0.683066 0.347185 0.825236 0.582614 0.529829 0.401045 0.364753 0.679751 0.733653 0.649416 0.764688 0.486267 0.847193 0.313874 0.318635 0.467007 0.46495 0.610451
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
169. 
patient tongue id: 04120002442167_7_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.309813 0.31519 0.323199 0.383998 0.481869 0.310806 0.321933 0.455017
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.454545, error: 0.375000
170. 
patient tongue id: 03101855254948_1
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 车前子 砂仁 升麻 炙甘草 浮小麦
0.347704 0.354742 0.313385 0.300173 0.362608 0.413277 0.360062 0.493249 0.592218 0.328381
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.400000, recall: 0.363636, error: 0.600000
171. 
patient tongue id: 04182019209745_1
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.380679 0.316893 0.347432 0.309313 0.355755
predicted yaofang:
党参 黄芪 丹参 牛膝 车前子

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
172. 
patient tongue id: 02222059261226_1_2
label yaofang:
陈皮 枳壳 当归 黄芪 白术 海螵蛸 浙贝母 厚朴 生半夏 火麻仁 鸡内金 北沙参 山慈菇 蛇舌草
0.343513 0.363629 0.337466 0.442612 0.411866 0.334464
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
173. 
patient tongue id: 03081819332794_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.30748 0.494886 0.405422 0.439953 0.436478 0.350126 0.376753 0.385044 0.329063 0.35239 0.366745 0.523295 0.356449
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香

------Score: precision: 0.615385, recall: 0.533333, error: 0.384615
174. 
patient tongue id: 05102016137759_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.325767 0.365207 0.486704 0.353462 0.499586
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
175. 
patient tongue id: 01200501306087_2_6
label yaofang:
甘草 川芎 葛根 枸杞子 酸枣仁 地黄 天麻 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲 酒女贞子 墨旱莲
0.955707 0.485836 0.594954 0.525347 0.426204 0.393685
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
176. 
patient tongue id: 05162033021700_2
label yaofang:
桂枝 大枣 龙骨 党参 黄连 生地黄 干姜 淫羊藿 火麻仁 炙甘草 覆盆子
0.3339 0.353145 0.399146 0.433271 0.408069 0.483625
predicted yaofang:
柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
177. 
patient tongue id: 03141229351042_1_4_7
label yaofang:
甘草 白芍 桔梗 金银花 连翘 薄荷 蒲公英 麦冬 玄参 生地黄 鸡内金
0.417814 0.355145 0.419783 0.505832 0.461112 0.312425 0.304415 0.307043
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 厚朴 北沙参

------Score: precision: 0.125000, recall: 0.090909, error: 0.875000
178. 
patient tongue id: 03151920512881_6_7
label yaofang:
柴胡 白芍 香附 枳壳 木香 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.355575 0.375355 0.307783 0.38265 0.416111 0.442487 0.558393
predicted yaofang:
柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.714286, recall: 0.454545, error: 0.285714
179. 
patient tongue id: 02270751520827_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.62712 0.425568 0.464023 0.343714 0.360079
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
180. 
patient tongue id: 03081826358732_1_4
label yaofang:
生姜 茯苓 防风 钩藤 荆芥穗 白芷 香薷 炙甘草 辛夷 首乌藤 紫苏梗 广藿香 威灵仙 麸炒白术 炒六神曲
0.526242 0.379395 0.3978 0.406356 0.32093 0.321784 0.363328 0.359308 0.337109 0.347959 0.555724 0.315098
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
181. 
patient tongue id: 04181933476013_1_2
label yaofang:
甘草 法半夏 麦冬 太子参 黄连 砂仁 天麻 鳖甲 麦芽 北沙参 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.978509 0.531849 0.575978 0.417805 0.311915 0.537432 0.433533 0.473262 0.330513 0.351657 0.35044
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
182. 
patient tongue id: 02122221457940_5
label yaofang:
甘草 茯苓 薏苡仁 党参 黄连 生地黄 赤芍 牛膝 石膏 山药 山茱萸 细辛 白芷 粉葛 广升麻
0.993581 0.552357 0.65077 0.446171 0.347923 0.310646 0.385065 0.708608 0.516987 0.623775 0.376767 0.437825 0.479283
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
183. 
patient tongue id: 02191450327385_6_4_2
label yaofang:
川芎 薏苡仁 党参 鸡血藤 白术 红花 赤芍 山药 地黄 天麻 白花蛇舌草 蜈蚣 醋鳖甲 乌梢蛇
0.945155 0.486798 0.573428 0.504151 0.312747 0.47869 0.319513 0.447074
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
184. 
patient tongue id: 02281931253064_4
label yaofang:
大枣 党参 海藻 苍术 泽泻 荷叶 决明子 紫苏叶 焦山楂 芥子
0.398398 0.412258 0.367072 0.330778 0.335962 0.45132 0.416748 0.301439 0.627798 0.691182 0.384597
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.181818, recall: 0.200000, error: 0.818182
185. 
patient tongue id: 06091950127204_3
label yaofang:
当归 枸杞子 熟地黄 杜仲 附子 肉桂 山药 山茱萸 菟丝子 巴戟天 芡实 鹿角霜 广藿香 沙苑子
0.544024 0.388941 0.399716 0.547812 0.666105 0.303946 0.318092 0.399123 0.451486 0.391794
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 赤芍 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.100000, recall: 0.071429, error: 0.900000
186. 
patient tongue id: 04300931383558_1_6
label yaofang:
甘草 白芍 陈皮 木香 防风 党参 白术 黄连 天麻 鳖甲 粉葛 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.943243 0.510779 0.554838 0.416656 0.312779 0.300102 0.335185 0.547843 0.417144 0.45427 0.329974 0.349482 0.35819
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.562500, error: 0.307692
187. 
patient tongue id: 04260637226146_4
label yaofang:
甘草 茯苓 远志 党参 浙贝母 蔓荆子 鳖甲 广藿香 苍耳子 白花蛇舌 蜂房 岗梅根 四季青 红豆杉
0.988011 0.540252 0.61291 0.460312 0.305229 0.354987 0.608454 0.488382 0.571331 0.370443 0.413021 0.429978
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
188. 
patient tongue id: 04071908376449_4_1
label yaofang:
甘草 陈皮 茯苓 前胡 半夏 防风 黄芪 白术 白芷 白前 百部 紫苏梗 广藿香
0.342564 0.801081 0.327486 0.926309 0.667767 0.612012 0.412531 0.343631 0.303112 0.454925 0.316905 0.820464 0.859618 0.77392 0.874393 0.466364 0.931176 0.370203 0.350801 0.53682 0.541471 0.710011
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.409091, recall: 0.692308, error: 0.590909
189. 
patient tongue id: 05262051059841_1_6
label yaofang:
甘草 黄芩 法半夏 前胡 桔梗 浙贝母 细辛 桑白皮 天麻 鳖甲 款冬花 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.9946 0.533046 0.688409 0.471101 0.409567 0.321933 0.356963 0.7982 0.625729 0.750284 0.498328 0.600841 0.725067
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.437500, error: 0.461538
190. 
patient tongue id: 03221956354977_1_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 延胡索 天麻 五灵脂 鳖甲 蜈蚣 天山雪莲 合欢花 半枝莲 姜黄
0.983545 0.532003 0.607776 0.482358 0.310287 0.36865 0.59943 0.468368 0.56567 0.345385 0.396166 0.423356
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
191. 
patient tongue id: 03111731563864_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 连翘 芦根 牛蒡子 浙贝母 栀子 牡丹皮 决明子 化橘红
0.985027 0.542776 0.605392 0.431793 0.319033 0.368333 0.622427 0.492161 0.550006 0.38071 0.416229 0.426467
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
192. 
patient tongue id: 02182156019208_5
label yaofang:
甘草 枳壳 黄芩 茯苓 木香 党参 白术 黄连 槟榔 山药 砂仁 扁豆花 粉葛 建曲
0.712724 0.408373 0.452528 0.499856
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.285714, error: 0.000000
193. 
patient tongue id: 01211213086112_5
label yaofang:
白芍 当归 麦冬 党参 白术 五味子 熟地黄 杜仲 肉苁蓉 巴戟天 补骨脂
0.361068 0.382118 0.303977 0.314914 0.355801 0.302578 0.333058 0.531676 0.680971
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.272727, error: 0.666667
194. 
patient tongue id: 03311823203178_4
label yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.317043 0.832588 0.956454 0.720452 0.637331 0.35788 0.313111 0.43681 0.868473 0.899313 0.82812 0.917178 0.397982 0.962569 0.35215 0.332867 0.564515 0.538136 0.751965
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
195. 
patient tongue id: 03311621410847_5_4_7
label yaofang:
牡蛎 薏苡仁 桃仁 黄芪 白术 浙贝母 杜仲 牛膝 厚朴 砂仁 北沙参 土鳖虫 红豆杉 山慈菇 蛇舌草
0.95674 0.485565 0.538073 0.479945 0.337475 0.418794 0.326178 0.464462
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.125000, recall: 0.066667, error: 0.875000
196. 
patient tongue id: 04211341312324_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.317128 0.591006 0.372775 0.717169 0.523261 0.455575 0.370959 0.576916 0.596779 0.547021 0.658225 0.466332 0.743161 0.399699 0.395517 0.519403
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.687500, recall: 0.687500, error: 0.312500
197. 
patient tongue id: 05262053546021_2_6
label yaofang:
甘草 白术 酸枣仁 生地黄 杜仲 天麻 糯稻根 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 田七末
0.995915 0.550959 0.681971 0.452365 0.388206 0.316338 0.367062 0.789033 0.625764 0.725694 0.498988 0.586911 0.678572
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
198. 
patient tongue id: 02020820063498_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 款冬花 紫菀 白前 苇茎 苦杏仁 蜜麻黄 化橘红
0.991291 0.547347 0.636404 0.437327 0.341319 0.302317 0.372705 0.694468 0.546931 0.622752 0.418752 0.47903 0.526888
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.133333, error: 0.846154
199. 
patient tongue id: 03161305353494_2
label yaofang:
麻黄 陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 紫苏子 炙甘草
0.328322 0.584758 0.371807 0.719053 0.544527 0.481528 0.365852 0.328175 0.595715 0.618768 0.563617 0.668004 0.417683 0.73127 0.302586 0.449793 0.403692 0.519736
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.555556, recall: 0.714286, error: 0.444444
------Average Score: average precision: 0.419559, average recall: 0.335330, error: 0.580441
