threshold = 0.3 validation_split = 0.1 sorted

0. 
patient face id: 04210655190679_1_7
label yaofang:
桂枝 甘草 当归 茯苓 黄芪 鸡血藤 生地黄 红花 赤芍 山茱萸 细辛 麦芽 地龙
0.938119 0.744019 0.541137 0.476299 0.562611 0.414691
predicted yaofang:
甘草 茯苓 黄芪 白术 生地黄 赤芍

1. 
patient face id: 01012051367315_1_4_7
label yaofang:
橘红 防风 金银花 浙贝母 款冬花 白前 鸡内金 苦杏仁 紫苏梗 蜜百部 蜜枇杷叶 干鱼腥草 蜜紫菀
0.468562 0.461817
predicted yaofang:
浙贝母 紫苏梗

2. 
patient face id: 03101746448539_4
label yaofang:
法半夏 茯苓 前胡 桔梗 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.93535 0.870102 0.903582 0.720894 0.87735 0.848295 0.717766 0.778959 0.860659 0.4837 0.610824
predicted yaofang:
法半夏 茯苓 前胡 桔梗 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄

3. 
patient face id: 02181621581257_5_1_6
label yaofang:
甘草 香附 法半夏 茯苓 党参 白术 山药 薤白 厚朴 砂仁 瓜蒌皮 柿蒂 麦芽 佛手 鱼古 瓦楞子
0.974704 0.910369 0.891225 0.815777 0.406717 0.647153 0.592396 0.434375
predicted yaofang:
甘草 茯苓 党参 白术 郁金 山药 砂仁 麦芽

4. 
patient face id: 04112204121749_6_4_7
label yaofang:
甘草 枳壳 法半夏 茯苓 桔梗 党参 丹参 胆南星 郁金 薤白 瓜蒌皮 莪术 诃子 建曲 紫苏梗
0.977769 0.82796 0.900947 0.469015 0.846283 0.511421 0.732785
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 丹参 郁金

5. 
patient face id: 04151235327602_2
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.846145 0.955251 0.699782 0.961516 0.857786 0.790754 0.79447 0.961521 0.930132 0.918222 0.934687 0.814266 0.975415 0.850042 0.867687
predicted yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

6. 
patient face id: 04130858590740_4_6
label yaofang:
甘草 川芎 法半夏 茯苓 远志 党参 酸枣仁 丹参 黄连 石菖蒲 天麻 僵蚕 豆蔻 首乌藤 桑枝
0.963931 0.606812 0.928815 0.562459 0.912884 0.71793 0.582443 0.64299 0.554496
predicted yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 丹参 天麻 首乌藤

7. 
patient face id: 01190646126717_3_5_6
label yaofang:
甘草 白芍 茯苓 薏苡仁 党参 熟附子 郁金 山药 天麻 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲 红豆杉
0.99485 0.538692 0.685226 0.874645 0.916383 0.56624 0.728223 0.954555 0.919618 0.572795 0.963717 0.65767 0.79514 0.744419 0.466139
predicted yaofang:
甘草 白芍 茯苓 薏苡仁 党参 郁金 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

8. 
patient face id: 02212004102929_1_2_5
label yaofang:
甘草 白芍 大枣 茯苓 白术 酸枣仁 丹参 生地黄 牡丹皮 山药 肉苁蓉 鳖甲 火麻仁 浮小麦
0.948579 0.56813 0.877284 0.560428 0.670037 0.631281 0.459258 0.749325 0.411712 0.75502
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 丹参 生地黄 牡丹皮 山药

9. 
patient face id: 03221959244788_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮 山慈菇
0.432704 0.603843 0.562415 0.786486 0.513718 0.578663
predicted yaofang:
柏子仁 干姜 姜半夏 炙甘草 百合 紫苏叶

10. 
patient face id: 01012101437253_1_4_2
label yaofang:
当归 党参 黄芪 熟附子 乌药 肉桂 山药 干姜 淫羊藿 仙茅 益智 鹿角霜 醋龟甲
0.914932 0.772585 0.569805
predicted yaofang:
党参 黄芪 山药

11. 
patient face id: 03180120024623_7_1
label yaofang:
甘草 柴胡 川芎 香附 防风 赤芍 青蒿 荆芥穗 白芷 郁李仁 芥子
0.807239 0.52095 0.759045 0.465612
predicted yaofang:
甘草 柴胡 防风 白芷

12. 
patient face id: 01122349239866_1_4_7
label yaofang:
甘草 白芍 枳壳 茯苓 木香 白术 槟榔 山药 大腹皮 天麻 桑寄生 火麻仁 决明子 续断 天山雪莲
0.874415 0.549262 0.644761 0.584419 0.81823 0.511164 0.641763 0.508362
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 蜈蚣

13. 
patient face id: 04150847077650
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.937281 0.933897 0.911193 0.915902 0.917617 0.900388 0.881424 0.901038 0.91106 0.874651 0.867077 0.842325
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

14. 
patient face id: 01201319592474_5_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 天麻 鳖甲 诃子 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991167 0.727898 0.794964 0.859308 0.772556 0.911077 0.950643 0.505861 0.908283 0.825876 0.818045 0.790443
predicted yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲

15. 
patient face id: 03171025485215_2_1
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.887005 0.743713 0.826723 0.843327 0.495627 0.744642 0.767226 0.90638 0.442409 0.810797
predicted yaofang:
甘草 麦冬 党参 黄芪 枸杞子 生地黄 牡丹皮 山药 天花粉 北沙参

16. 
patient face id: 01312320301102_1_6
label yaofang:
甘草 白术 延胡索 牡丹皮 牛膝 地黄 天麻 补骨脂 白花蛇舌草 浮小麦 桑枝 蜈蚣 半枝莲 醋鳖甲
0.986502 0.558097 0.97865 0.579894 0.849336 0.840002 0.612276
predicted yaofang:
甘草 白术 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

17. 
patient face id: 02151813242252_4
label yaofang:
前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 香薷 紫菀 百部 紫苏梗 广藿香 甘草片
0.691644 0.474107 0.94923 0.708671 0.419267 0.646009 0.597048 0.495813 0.570997 0.517745 0.818378
predicted yaofang:
前胡 桔梗 防风 荆芥穗 白芷 紫菀 百部 炙甘草 辛夷 紫苏梗 广藿香

18. 
patient face id: 03170936238896_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.939582 0.912484 0.897209 0.925381 0.903559 0.89603 0.884958 0.895124 0.921431 0.868376 0.859855 0.836362
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

19. 
patient face id: 02221236430347_3_1_7
label yaofang:
甘草 柴胡 白芍 当归 茯苓 薄荷 白术 酸枣仁 栀子 牡丹皮
0.797827 0.733465 0.756343 0.928854 0.686367
predicted yaofang:
甘草 柴胡 白芍 茯苓 白术

20. 
patient face id: 03221622080727_6
label yaofang:
甘草 香附 茯苓 党参 白术 酸枣仁 生地黄 黄柏 郁金 山茱萸 菟丝子 益母草 王不留行 浮小麦 合欢花
0.990664 0.934026 0.943248 0.699402 0.765318 0.676831 0.440944 0.437259 0.721777
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 郁金 山药 浮小麦

21. 
patient face id: 02281248109491_1_3_7
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.914178 0.77779 0.498411
predicted yaofang:
党参 黄芪 山药

22. 
patient face id: 04112217493264_2_6
label yaofang:
甘草 龙骨 党参 白术 生地黄 黄柏 山药 山茱萸 地骨皮 糯稻根 银柴胡 胡黄连 淫羊藿 首乌藤 龟甲
0.8503 0.736369 0.577114 0.628033 0.795155 0.692148
predicted yaofang:
甘草 党参 白术 酸枣仁 生地黄 山药

23. 
patient face id: 01132148039324_5
label yaofang:
甘草 法半夏 茯苓 党参 黄连 砂仁 天麻 鳖甲 火麻仁 枇杷叶 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.992164 0.786885 0.754435 0.471966 0.481947 0.843918 0.919959 0.404778 0.907446 0.595205 0.884275 0.84266
predicted yaofang:
甘草 茯苓 党参 白术 砂仁 天麻 鳖甲 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲

24. 
patient face id: 04150712352117_4_7_6
label yaofang:
甘草 川芎 茯苓 薏苡仁 党参 黄连 生地黄 赤芍 山药 补骨脂 浮小麦 白花蛇舌 土鳖虫
0.99658 0.839255 0.475686 0.926642 0.521075 0.452438 0.778759 0.421416
predicted yaofang:
甘草 茯苓 薏苡仁 党参 生地黄 赤芍 山药 鳖甲

25. 
patient face id: 02251125392362_4
label yaofang:
法半夏 葛根 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.921751 0.93863 0.637436 0.889897 0.593673 0.871363 0.894119 0.749698 0.897742 0.910952 0.521755 0.479745 0.775242 0.642695
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄

26. 
patient face id: 02141959473230_6
label yaofang:
龙骨 柏子仁 干姜 淡豆豉 天麻 姜半夏 炙甘草 蜈蚣 合欢皮
0.485191 0.676165 0.436019 0.67403
predicted yaofang:
干姜 天麻 姜半夏 炙甘草

27. 
patient face id: 03020743139804_1_6
label yaofang:
甘草 茯苓 党参 白术 丹参 赤芍 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.998856 0.781565 0.941623 0.824959 0.511773 0.665343 0.966344 0.96771 0.459949 0.914636 0.714793 0.919696 0.844552
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

28. 
patient face id: 03221631066641_1_7_6
label yaofang:
茯苓 桃仁 党参 白术 赤芍 厚朴 火麻仁 虎杖 枇杷叶 北沙参 首乌藤 土鳖虫 合欢皮
0.60739 0.762441 0.543796 0.6506 0.838617 0.483466 0.651184 0.672072 0.404563
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 赤芍 厚朴 北沙参 首乌藤

29. 
patient face id: 03221643460807_1_4
label yaofang:
枳壳 太子参 黄芪 白术 赤芍 海螵蛸 牛膝 厚朴 火麻仁 鸡内金 紫苏梗 红豆杉 土茯苓 稻芽
0.657158 0.917476 0.912083 0.747666 0.821489 0.568699 0.496966 0.564891
predicted yaofang:
枳壳 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参

30. 
patient face id: 01042334549227_7_5
label yaofang:
甘草 白芍 茯苓 龙骨 牡蛎 酸枣仁 丹参 杜仲 牛膝 山茱萸 地黄 天麻 桑寄生 补骨脂 麦芽
0.958819 0.444561 0.818829 0.432036 0.614486 0.606553 0.400175 0.651231 0.793661 0.613944 0.628233
predicted yaofang:
甘草 白芍 茯苓 党参 酸枣仁 丹参 杜仲 牛膝 天麻 桑寄生 麦芽

31. 
patient face id: 03111712589485_6_2_7
label yaofang:
甘草 柴胡 白芍 香附 延胡索 砂仁 天麻 五灵脂 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲 红豆杉
0.97096 0.597454 0.825292 0.96215 0.903918 0.941639 0.476772 0.836725 0.902422
predicted yaofang:
甘草 柴胡 白芍 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

32. 
patient face id: 04020815397570_1_2
label yaofang:
甘草 茯苓 桔梗 浙贝母 乌梅 郁金 山药 诃子 白花蛇舌草 紫苏梗 广藿香 蜈蚣 醋鳖甲
0.984023 0.843233 0.70933 0.836105 0.617273 0.464052 0.482332
predicted yaofang:
甘草 茯苓 桔梗 浙贝母 白花蛇舌草 蜈蚣 醋鳖甲

33. 
patient face id: 03061802223128_2_1
label yaofang:
甘草 茯苓 玉竹 太子参 生地黄 山药 山茱萸 山楂 砂仁 天花粉 三棱 鸡内金 麦芽 紫苏梗
0.939915 0.844471 0.413512 0.43533 0.432355 0.779314 0.742229 0.619833
predicted yaofang:
甘草 茯苓 白术 生地黄 牡丹皮 山药 砂仁 麦芽

34. 
patient face id: 02120804283361_4_1
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 黄连 浙贝母 郁金 砂仁 天麻 鳖甲 豆蔻 苦杏仁 蜈蚣 白花蛇舌 天山雪莲
0.994615 0.756976 0.847622 0.481891 0.672663 0.811486 0.740253 0.90919 0.45923 0.788062 0.860086 0.71873
predicted yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 浙贝母 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲

35. 
patient face id: 02020948138913_5_6_1
label yaofang:
甘草 薏苡仁 熟附子 山药 厚朴 天麻 巴戟天 鳖甲 火麻仁 败酱草 佛手 蜈蚣 天山雪莲 半枝莲
0.988134 0.535899 0.533461 0.541313 0.943768 0.904869 0.936649 0.528726 0.818888 0.772881
predicted yaofang:
甘草 薏苡仁 党参 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

36. 
patient face id: 02171905555390_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.714111 0.944625 0.944044 0.846401 0.835695 0.804771 0.953487 0.922292 0.922441 0.922729 0.839319 0.957518 0.875269 0.89587
predicted yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

37. 
patient face id: 03231446152271_2_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.737235 0.938996 0.951155 0.853687 0.831358 0.841213 0.958207 0.93343 0.920197 0.927841 0.845515 0.966568 0.892143 0.897969
predicted yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

38. 
patient face id: 04120005314309_5
label yaofang:
甘草 法半夏 黄连 栀子 泽泻 大黄 淡豆豉 紫草 皂角刺 紫苏叶
0.741278
predicted yaofang:
甘草

39. 
patient face id: 04131906153040_2_1
label yaofang:
甘草 半夏 蒲公英 枸杞子 黄连 砂仁 僵蚕 莪术 柿蒂 枇杷叶 北沙参 赭石 紫苏叶 合欢皮 蛇舌草
0.78465 0.41375 0.565856 0.596315 0.515546 0.641713 0.786331 0.439158
predicted yaofang:
甘草 薏苡仁 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

40. 
patient face id: 01182315196524_6_4
label yaofang:
桂枝 甘草 茯苓 前胡 浙贝母 细辛 天麻 鳖甲 款冬花 紫菀 诃子 苇茎 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.967594 0.510623 0.664849 0.589867 0.523333 0.666929 0.625006 0.921571 0.959501 0.577651 0.585547 0.623708 0.917698 0.876271 0.850953 0.771998
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 天麻 鳖甲 款冬花 紫菀 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲

41. 
patient face id: 01012047218119_1_4
label yaofang:
桂枝 葛根 桃仁 延胡索 杜仲 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.678521 0.485827 0.574669 0.560391 0.528881
predicted yaofang:
桂枝 桃仁 杜仲 牛膝 桑寄生

42. 
patient face id: 01032101314768_6_2
label yaofang:
甘草 茯苓 桔梗 麦冬 太子参 酸枣仁 五味子 生地黄 浙贝母 知母 鳖甲 白花蛇舌 天山雪莲 蜂房
0.97556 0.819363 0.482136 0.451675 0.645971 0.423454 0.59634 0.841445 0.748505 0.53652
predicted yaofang:
甘草 茯苓 桔梗 党参 酸枣仁 生地黄 浙贝母 鳖甲 白花蛇舌 天山雪莲

43. 
patient face id: 03021205351054_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.939903 0.742425 0.918076 0.677584 0.628365 0.946568 0.833133 0.828374 0.762508 0.784818 0.86495 0.670213 0.531577
predicted yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志

44. 
patient face id: 03242123166313_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.423888 0.462815 0.51803 0.56274 0.755131 0.502623 0.583593
predicted yaofang:
柏子仁 干姜 天麻 姜半夏 炙甘草 百合 紫苏叶

45. 
patient face id: 03081815010155_3
label yaofang:
黄芪 白术 附子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.704515 0.865079 0.40887 0.488562 0.665102
predicted yaofang:
黄芪 白术 干姜 砂仁 炙甘草

46. 
patient face id: 02212123403940_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.729279 0.945906 0.731624 0.928922 0.867438 0.66158 0.767976 0.716075 0.92239 0.880561 0.892405 0.910882 0.904476 0.94612 0.825518 0.875192
predicted yaofang:
陈皮 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

47. 
patient face id: 03111516539803_7_6
label yaofang:
甘草 柴胡 白芍 川芎 羌活 桃仁 红花 赤芍 栀子 牡丹皮 牛膝 细辛 天麻 全蝎 白芷
0.910663 0.584212 0.863263 0.780291 0.680801 0.4136 0.445832 0.733989 0.62087
predicted yaofang:
甘草 柴胡 白芍 川芎 桃仁 红花 赤芍 牛膝 天麻

48. 
patient face id: 01130634088580_1_2_4
label yaofang:
甘草 茯苓 桔梗 橘红 党参 浙贝母 乌梅 鳖甲 紫菀 诃子 法夏 白花蛇舌 蜂房 岗梅根 四季青
0.971785 0.785095 0.80703 0.528994 0.805393 0.752224 0.741198
predicted yaofang:
甘草 茯苓 桔梗 党参 浙贝母 鳖甲 白花蛇舌

49. 
patient face id: 04102054266041_6_1_4
label yaofang:
桂枝 白芍 牛蒡子 太子参 五味子 细辛 干姜 白芷 紫菀 姜半夏 炙甘草
0.65766 0.851607 0.811611 0.911652 0.637785 0.441156 0.987349
predicted yaofang:
桂枝 白芍 细辛 干姜 紫菀 姜半夏 炙甘草

50. 
patient face id: 01312124447549_1_2_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 生地黄 砂仁 天麻 五灵脂 鳖甲 女贞子 蜈蚣 天山雪莲 半枝莲 墨旱莲
0.994436 0.60601 0.729707 0.48512 0.753923 0.461058 0.535345 0.72407 0.819331 0.882986 0.522781 0.742135 0.769405
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

51. 
patient face id: 03151843219295_1_2
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 牛膝 茵陈 麦芽 赭石 龟甲
0.712249 0.674905 0.438924
predicted yaofang:
甘草 白芍 牛膝

52. 
patient face id: 03291647313649_1_2_6
label yaofang:
甘草 党参 酸枣仁 生地黄 山药 山茱萸 天麻 桑寄生 鳖甲 补骨脂 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.999089 0.895092 0.627217 0.870264 0.8613 0.444076 0.979781 0.927715 0.965696 0.816051 0.866288 0.937926
predicted yaofang:
甘草 党参 酸枣仁 生地黄 山药 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

53. 
patient face id: 02202303194372_5_6
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 黄连 栀子 山药 灯心草 厚朴 淡豆豉 扁豆花 豆蔻 麦芽 苦杏仁
0.911507 0.606314 0.793806 0.620843 0.813993 0.630159
predicted yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 山药

54. 
patient face id: 03021915153066_2_1
label yaofang:
川芎 茯苓 独活 黄芪 细辛 防己 桑寄生 秦艽 木瓜 川牛膝 北沙参 炙甘草 威灵仙 党参片 盐菟丝子 续断片
0.411887 0.625597 0.480369 0.590775 0.439634 0.496026 0.47265
predicted yaofang:
桂枝 茯苓 黄芪 细辛 干姜 桑寄生 炙甘草

55. 
patient face id: 03022001181738_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷
0.406165 0.92285 0.703424 0.928508 0.498545 0.55886 0.826202 0.91823 0.831882 0.871086 0.852548 0.84135 0.592069 0.546154
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄

56. 
patient face id: 04111905410371_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 款冬花 紫菀 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.668598 0.928534 0.92882 0.650139 0.73131 0.895752 0.887111 0.719986 0.883848 0.906375 0.646652 0.588364 0.740205
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

57. 
patient face id: 04181156248343_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.926394 0.926837 0.899848 0.916073 0.915296 0.90601 0.885731 0.891911 0.886205 0.870937 0.846431 0.849171
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

58. 
patient face id: 03151850445368_2_1
label yaofang:
桂枝 枳壳 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶
0.470109 0.435795 0.435019 0.862479 0.416741 0.560936
predicted yaofang:
枳壳 太子参 黄芪 白术 海螵蛸 砂仁

59. 
patient face id: 02122115124088_2_6
label yaofang:
甘草 茯苓 党参 黄芪 酸枣仁 生地黄 牛膝 山药 地骨皮 蔓荆子 糯稻根 女贞子 浮小麦 首乌藤 合欢花
0.987962 0.768742 0.917299 0.448974 0.892852 0.724994 0.644364 0.480591 0.610859 0.692371
predicted yaofang:
甘草 茯苓 党参 黄芪 酸枣仁 生地黄 山药 天麻 浮小麦 首乌藤

60. 
patient face id: 04221850426233_2
label yaofang:
茯苓 葛根 麦冬 玉竹 玄参 牡丹皮 北沙参 百合 甘草片 人参叶 干石斛
0.692613 0.57609 0.402063 0.689756
predicted yaofang:
茯苓 麦冬 牡丹皮 北沙参

61. 
patient face id: 02202221571366_6_4
label yaofang:
甘草 法半夏 前胡 桔梗 浙贝母 天麻 鳖甲 白前 苦杏仁 紫苏子 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.982958 0.711272 0.475748 0.866041 0.758271 0.95299 0.956476 0.531964 0.625356 0.938142 0.818733 0.851485 0.87698
predicted yaofang:
甘草 法半夏 前胡 桔梗 浙贝母 天麻 鳖甲 款冬花 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲

62. 
patient face id: 01132326450704_5_2
label yaofang:
桂枝 麦冬 太子参 阿胶 丹参 生地黄 薤白 瓜蒌皮 姜半夏 炙甘草 三七片
0.486437 0.536597
predicted yaofang:
丹参 炙甘草

63. 
patient face id: 03012053212754_6_2_4
label yaofang:
甘草 薏苡仁 党参 黄芪 生地黄 郁金 山药 天麻 鳖甲 莪术 北沙参 丝瓜络 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.988438 0.883433 0.840916 0.613159 0.496605 0.800204 0.768635 0.934437 0.680363 0.484522 0.908396 0.818635 0.824655 0.673765
predicted yaofang:
甘草 薏苡仁 党参 黄芪 郁金 山药 天麻 鳖甲 莪术 北沙参 蜈蚣 白花蛇舌 天山雪莲 红豆杉

64. 
patient face id: 02191218217859_1_2_4
label yaofang:
甘草 防风 羌活 薏苡仁 党参 酸枣仁 生地黄 地黄 天麻 鳖甲 粉葛 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.99693 0.605428 0.634857 0.581254 0.548991 0.960583 0.978615 0.962605 0.915852 0.941763 0.881558
predicted yaofang:
甘草 薏苡仁 党参 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

65. 
patient face id: 03280649043639_3_7
label yaofang:
桂枝 柴胡 白芍 当归 茯苓 桃仁 党参 白术 红花 延胡索 炙甘草 女贞子 墨旱莲 两面针
0.683015 0.755092 0.921337 0.489064 0.712074 0.525846 0.636926 0.835723 0.558576
predicted yaofang:
桂枝 柴胡 白芍 当归 茯苓 桃仁 党参 白术 炙甘草

66. 
patient face id: 01211241234361_1_7
label yaofang:
桂枝 柴胡 黄芩 桔梗 牡蛎 藕节 干姜 天花粉 苦杏仁 炙甘草 蜜枇杷叶 人参叶
0.408859 0.427957 0.48093 0.609286
predicted yaofang:
桂枝 柴胡 桔梗 炙甘草

67. 
patient face id: 03221311417781_4_6
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 桃仁 鱼腥草 浙贝母 细辛 桑白皮 地骨皮 苇茎 苦杏仁 黄芩片
0.959061 0.772626 0.904089 0.722982 0.435865 0.828522 0.406187 0.702026
predicted yaofang:
甘草 法半夏 茯苓 桔梗 桃仁 浙贝母 细辛 苦杏仁

68. 
patient face id: 04102104502542_3
label yaofang:
桂枝 甘草 独活 党参 黄芪 乳香 没药 豨莶草 合欢皮 海桐皮 鹿衔草 走马胎
0.794874 0.671096 0.650685
predicted yaofang:
甘草 党参 黄芪

69. 
patient face id: 03161711331590_2_1
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.89273 0.893702 0.798191 0.566374 0.493757 0.620113 0.835782 0.883743 0.810069 0.789984 0.932551 0.57552 0.429075 0.625514
predicted yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄

70. 
patient face id: 04182002469956_1_6
label yaofang:
甘草 白芍 川芎 独活 牛膝 细辛 干姜 蜈蚣 海桐皮 姜黄 鹿衔草
0.816058 0.863979 0.444181 0.579824 0.550235 0.435013
predicted yaofang:
甘草 白芍 牛膝 细辛 干姜 天麻

71. 
patient face id: 04121257317367_2_4
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.940806 0.958177 0.60052 0.873447 0.841076 0.734292 0.96216 0.956767 0.917088 0.926755 0.841935 0.920014 0.844117 0.897771
predicted yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

72. 
patient face id: 02171833303359_2
label yaofang:
陈皮 法半夏 前胡 防风 白芷 百部 豆蔻 炙甘草 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术 炒蔓荆子
0.522445 0.544469 0.635213 0.91854 0.665862 0.610062 0.527287 0.935361 0.545712 0.809969 0.903978
predicted yaofang:
陈皮 法半夏 前胡 防风 白芷 百部 豆蔻 炙甘草 辛夷 紫苏梗 广藿香

73. 
patient face id: 02182002082546_2_6
label yaofang:
甘草 茯苓 桔梗 麦冬 浙贝母 郁金 地黄 天麻 诃子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 猫爪草
0.994898 0.713402 0.621872 0.782241 0.843971 0.66217 0.818604 0.755543 0.655207
predicted yaofang:
甘草 茯苓 桔梗 浙贝母 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

74. 
patient face id: 02182312185320_4_6
label yaofang:
甘草 枳壳 连翘 薏苡仁 党参 白术 郁金 莱菔子 天麻 鳖甲 辛夷 蜈蚣 白花蛇舌 天山雪莲
0.962226 0.763897 0.787747 0.506979 0.883884 0.883308 0.789426 0.693622 0.737371
predicted yaofang:
甘草 薏苡仁 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

75. 
patient face id: 03020843542164_4
label yaofang:
甘草 龙骨 酸枣仁 生地黄 知母 白茅根 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 半枝莲
0.982853 0.831128 0.516379 0.942466 0.728472 0.407689 0.827837 0.700964 0.586313 0.788459
predicted yaofang:
甘草 酸枣仁 生地黄 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲

76. 
patient face id: 03240559184418_1
label yaofang:
桂枝 甘草 法半夏 大枣 茯苓 龙骨 牡蛎 黄芪 白术 泽泻 干姜 滑石 糯稻根 猪苓
0.627079 0.859951 0.703623 0.689191 0.889234
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

77. 
patient face id: 02251227179338_2
label yaofang:
陈皮 法半夏 茯苓 前胡 麦冬 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.669221 0.949982 0.807549 0.934682 0.828964 0.523111 0.928301 0.861902 0.897896 0.940202 0.864766 0.864165 0.770598 0.857218
predicted yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

78. 
patient face id: 02141934264802_1
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 砂仁 菟丝子 巴戟天 桑寄生 火麻仁 续断 制何首乌 黄精 艾叶
0.648977 0.490474 0.871852 0.76253 0.571937 0.539401
predicted yaofang:
党参 黄芪 白术 杜仲 砂仁 桑寄生

79. 
patient face id: 02151906061085_1_2
label yaofang:
川芎 当归 茯苓 独活 黄芪 细辛 防己 桑寄生 木瓜 川牛膝 地龙 炙甘草 威灵仙 党参片 盐菟丝子 续断片
0.594951 0.559594 0.631826 0.529242 0.583019 0.438433 0.583244
predicted yaofang:
川芎 当归 茯苓 黄芪 细辛 桑寄生 炙甘草

80. 
patient face id: 04191711550929_1_6_4
label yaofang:
当归 牡蛎 黄芪 白术 赤芍 厚朴 火麻仁 北沙参 橘络 首乌藤 合欢皮 山慈菇 素馨花
0.968195 0.898516 0.42306 0.630898 0.4032 0.792418 0.481795
predicted yaofang:
黄芪 白术 赤芍 厚朴 砂仁 北沙参 首乌藤

81. 
patient face id: 04132022376503_1_5_7
label yaofang:
甘草 白芍 黄芪 白术 赤芍 海螵蛸 牡丹皮 生半夏 砂仁 茵陈 鸡内金 北沙参 红豆杉 合欢皮 预知子 蛇舌草 稻芽
0.639329 0.954077 0.948615 0.654454 0.534022 0.872549 0.545324 0.785667 0.505428 0.511391
predicted yaofang:
甘草 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 红豆杉 合欢皮

82. 
patient face id: 03062134430399_6
label yaofang:
甘草 川芎 党参 酸枣仁 杜仲 牛膝 钩藤 泽泻 天麻 石决明 桑寄生 益母草 麦芽 首乌藤
0.911126 0.507928 0.814415 0.717455 0.46296 0.460479 0.710426 0.922153 0.490095 0.725696
predicted yaofang:
甘草 川芎 党参 酸枣仁 丹参 杜仲 牛膝 天麻 桑寄生 首乌藤

83. 
patient face id: 04182035148776_4
label yaofang:
党参 丹参 海藻 苍术 泽泻 大黄 荷叶 山楂 菟丝子 桑寄生 决明子 女贞子
0.64488 0.580562 0.51431
predicted yaofang:
党参 丹参 泽泻

84. 
patient face id: 01070833060641_1_7
label yaofang:
茯苓 茯苓 薏苡仁 薏苡仁 桃仁 桃仁 牡丹皮 牡丹皮 黄柏 黄柏 苍术 苍术 泽泻 泽泻 车前子 车前子 鸡内金 鸡内金 萹蓄 萹蓄 炙甘草 炙甘草 威灵仙 威灵仙 土茯苓 土茯苓
0.594364 0.426195 0.553176 0.448689
predicted yaofang:
茯苓 薏苡仁 桃仁 泽泻

85. 
patient face id: 01130633110456_1_4_6
label yaofang:
甘草 法半夏 茯苓 党参 黄连 郁金 山药 砂仁 天麻 鳖甲 莪术 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.993009 0.558293 0.880453 0.559957 0.767245 0.55215 0.468411 0.430981 0.763671 0.802033 0.827232 0.494577 0.682358 0.571924
predicted yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 郁金 山药 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

86. 
patient face id: 02202236196599_7_6_4
label yaofang:
甘草 防风 金银花 连翘 白术 红花 牡丹皮 水牛角 荆芥穗 莱菔子 火麻仁 麦芽 白鲜皮 地肤子
0.762676 0.63789 0.699006 0.550019 0.430591
predicted yaofang:
甘草 防风 白术 红花 牡丹皮

87. 
patient face id: 03111433583975_7_6
label yaofang:
甘草 白芍 当归 桃仁 党参 鸡血藤 白术 生地黄 熟附子 红花 延胡索 赤芍 全蝎 制川乌 麦芽 忍冬藤 络石藤
0.874286 0.819086 0.515359 0.749042 0.839853 0.47443 0.454761
predicted yaofang:
甘草 白芍 桃仁 党参 白术 生地黄 红花

88. 
patient face id: 01132330588757_2_1
label yaofang:
大枣 前胡 薄荷 芦根 牛蒡子 葶苈子 玉竹 栀子 白茅根 淡豆豉 蝉蜕 白眉草

predicted yaofang:


89. 
patient face id: 04072031110674_1_2
label yaofang:
当归 党参 黄芪 鸡血藤 白术 砂仁 瓜蒌皮 补骨脂 鸡内金 北沙参 女贞子 合欢皮 稻芽
0.544321 0.640344 0.933569 0.966144 0.659812 0.469066 0.68527
predicted yaofang:
当归 党参 黄芪 白术 砂仁 鸡内金 北沙参

90. 
patient face id: 04112351041774_7_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 白芷 蔓荆子 炙甘草 百合 紫苏叶
0.65308 0.886893 0.915096 0.880902 0.436734 0.71096 0.515392
predicted yaofang:
当归 党参 黄芪 白术 柏子仁 炙甘草 百合

91. 
patient face id: 03312120267243_4_2
label yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 肉桂 山药 山茱萸 泽泻 干姜 砂仁 菟丝子 淫羊藿 白扁豆 建曲 艾叶
0.812516 0.902621 0.859449 0.653833 0.92712 0.930734 0.707296
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 砂仁

92. 
patient face id: 02161838182278_1_4
label yaofang:
茯苓 海螵蛸 肉桂 干姜 豆蔻 炙甘草 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炙黄芪 炒六神曲 甘松 炒稻芽 干石斛 炒麦芽
0.544693 0.750219 0.451202 0.464237 0.469686 0.820337 0.684973
predicted yaofang:
陈皮 茯苓 海螵蛸 干姜 豆蔻 炙甘草 广藿香

93. 
patient face id: 04071400545306_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.934313 0.916358 0.912914 0.919268 0.913782 0.902873 0.887186 0.89513 0.908727 0.874259 0.861494 0.836815
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

94. 
patient face id: 02120925480463_6_7_1
label yaofang:
甘草 柴胡 茯苓 薏苡仁 桃仁 党参 延胡索 赤芍 牡丹皮 川楝子 乌药 五灵脂 益母草 吴茱萸 麦芽
0.966806 0.695053 0.538828 0.820307 0.460152 0.425081 0.876793 0.514503 0.447977 0.542803
predicted yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 桃仁 党参 白术 赤芍 牡丹皮

95. 
patient face id: 03291344015485_5
label yaofang:
甘草 川芎 茯苓 葛根 桔梗 防风 白术 浙贝母 天麻 蔓荆子 辛夷 蜈蚣 半枝莲 醋鳖甲
0.991363 0.584326 0.658544 0.510175 0.469937 0.730605 0.689471 0.681629
predicted yaofang:
甘草 茯苓 桔梗 白术 浙贝母 天麻 蜈蚣 半枝莲

96. 
patient face id: 03141232217844_3_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 干姜 鸡内金
0.583426 0.5631 0.667361 0.769682 0.899257 0.818061 0.77455
predicted yaofang:
桂枝 甘草 白芍 茯苓 党参 黄芪 白术

97. 
patient face id: 01180602171656_1_2
label yaofang:
甘草 桔梗 麦冬 太子参 丹参 浙贝母 鳖甲 诃子 北沙参 鹿角霜 百合 白花蛇舌 天山雪莲 蜂房
0.880073 0.488489 0.428185 0.403782 0.715646 0.745472 0.691429 0.500458
predicted yaofang:
甘草 桔梗 太子参 丹参 浙贝母 鳖甲 北沙参 白花蛇舌

98. 
patient face id: 02170847109438_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.933586 0.930623 0.916322 0.914717 0.90836 0.902739 0.897274 0.896165 0.904989 0.865994 0.856036 0.840489
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

99. 
patient face id: 04081620477456_1_4_7
label yaofang:
甘草 法半夏 橘红 防风 金银花 太子参 藿香 白前 鸡内金 辛夷 蜜百部 干鱼腥草
0.512778 0.52661 0.607023 0.412254 0.417948 0.41767 0.464327
predicted yaofang:
甘草 法半夏 防风 太子参 白前 百部 辛夷

100. 
patient face id: 03291932235567_1_2
label yaofang:
甘草 香附 茯苓 党参 白术 酸枣仁 生地黄 杜仲 山药 菟丝子 王不留行 续断 黄芩片 合欢花
0.988804 0.914124 0.96121 0.813736 0.580827 0.666533 0.715657
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药

101. 
patient face id: 03041422455844_3_5_6
label yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 酸枣仁 丹参 熟附子 山茱萸 桑白皮 大黄 荆芥穗 菟丝子 益母草 款冬花
0.947281 0.501933 0.464745 0.906338 0.883484 0.549259 0.715112 0.498541
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 黄芪 白术 酸枣仁

102. 
patient face id: 03221319500926_6_2_7
label yaofang:
甘草 党参 酸枣仁 浙贝母 郁金 山药 天麻 鳖甲 女贞子 浮小麦 蜈蚣 白花蛇舌 半枝莲 红豆杉 墨旱莲
0.995606 0.751767 0.476957 0.429168 0.603681 0.937204 0.885991 0.414462 0.888208 0.641404 0.656657 0.69394
predicted yaofang:
甘草 党参 酸枣仁 浙贝母 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

103. 
patient face id: 02182250153830_4_1
label yaofang:
甘草 茯苓 远志 党参 鸡血藤 白术 酸枣仁 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.993176 0.849097 0.400171 0.914664 0.852294 0.665818 0.949957 0.912589 0.931359 0.683303 0.810856 0.881484
predicted yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

104. 
patient face id: 03282213324820_5_2
label yaofang:
甘草 茯苓 桔梗 薄荷 牛蒡子 党参 浙贝母 天花粉 鳖甲 诃子 黄芩片 白花蛇舌 天山雪莲 四季青
0.988761 0.747375 0.85065 0.683975 0.904341 0.909405 0.837564 0.563466
predicted yaofang:
甘草 茯苓 桔梗 党参 浙贝母 鳖甲 白花蛇舌 天山雪莲

105. 
patient face id: 03020658058921_6_1
label yaofang:
甘草 香附 桃仁 生地黄 赤芍 牡丹皮 山茱萸 天麻 鳖甲 莪术 佛手 浮小麦 蜈蚣 白花蛇舌 半枝莲
0.996127 0.753021 0.963112 0.759553 0.892406 0.501459 0.549518 0.656072
predicted yaofang:
甘草 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

106. 
patient face id: 03091845428922_1_4
label yaofang:
陈皮 法半夏 前胡 防风 黄芪 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 麸炒白术
0.579376 0.836515 0.884993 0.863265 0.576831 0.505055 0.768429 0.742732 0.783758 0.855974 0.890723 0.475783 0.461148 0.434076 0.563892
predicted yaofang:
陈皮 法半夏 前胡 防风 黄芪 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

107. 
patient face id: 03151925242935_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 太子参 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.775482 0.852217 0.582609 0.516225 0.736517 0.870646 0.897583 0.599205 0.434398 0.645552 0.960029
predicted yaofang:
桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 紫菀 苦杏仁 姜半夏 炙甘草

108. 
patient face id: 03290715081744_5
label yaofang:
甘草 黄芩 前胡 桔梗 薄荷 牛蒡子 桃仁 浙贝母 桑白皮 白前 枇杷叶 苦杏仁
0.685809 0.426308 0.941093 0.422974 0.86071 0.459499 0.619419
predicted yaofang:
甘草 前胡 桔梗 桃仁 浙贝母 紫菀 苦杏仁

109. 
patient face id: 01070834571715_1_4_6
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.942478 0.408834 0.920828 0.564365 0.62233 0.955071 0.790333 0.852001 0.734743 0.758101 0.848433 0.620934 0.444174
predicted yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志

110. 
patient face id: 03020755441836_1_2_6
label yaofang:
甘草 党参 酸枣仁 赤芍 山药 天麻 鳖甲 浮小麦 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫
0.996285 0.854548 0.518589 0.696862 0.963264 0.958488 0.486747 0.91818 0.718194 0.872813 0.880567
predicted yaofang:
甘草 党参 酸枣仁 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

111. 
patient face id: 02020848231642_1_6
label yaofang:
甘草 茯苓 薏苡仁 党参 黄柏 苍术 厚朴 天麻 鳖甲 火麻仁 补骨脂 蜈蚣 天山雪莲 半枝莲
0.984115 0.554707 0.585102 0.85901 0.467379 0.895588 0.938037 0.908283 0.423625 0.847375 0.749475
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

112. 
patient face id: 04202108513924_6_1
label yaofang:
党参 枸杞子 白术 柏子仁 熟地黄 海螵蛸 杜仲 菟丝子 巴戟天 桑寄生 续断 制何首乌 艾叶
0.744331 0.438488 0.77406 0.707737 0.58997
predicted yaofang:
党参 黄芪 白术 杜仲 桑寄生

113. 
patient face id: 02020950137737_6_5
label yaofang:
甘草 柴胡 白芍 当归 茯苓 党参 白术 酸枣仁 生地黄 栀子 牡丹皮 黄芩片 合欢花
0.974893 0.811625 0.873474 0.949982 0.937571 0.731817 0.640993 0.664227 0.431692 0.418736
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 酸枣仁 生地黄 牡丹皮 合欢花

114. 
patient face id: 03221324312196_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子 木贼 素馨花
0.487723 0.922903 0.968903 0.87372 0.93566 0.710092 0.942929 0.951335 0.926507 0.946974 0.911346 0.84436 0.535449 0.555893 0.825523
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

115. 
patient face id: 04051927225104_1
label yaofang:
桂枝 甘草 当归 半夏 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 厚朴 砂仁 肉苁蓉 巴戟天 桑寄生 补骨脂 紫苏叶 骨碎补
0.637375 0.409049 0.424368 0.928862 0.95993 0.506589 0.497157 0.769028 0.628707 0.671276 0.539174
predicted yaofang:
甘草 半夏 党参 黄芪 白术 赤芍 海螵蛸 杜仲 厚朴 砂仁 桑寄生

116. 
patient face id: 01061601125917_5_6
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 鱼腥草 浙贝母 郁金 桑白皮 天麻 鳖甲 款冬花 紫菀 苦杏仁 蜈蚣 半枝莲
0.992383 0.867862 0.825541 0.852427 0.572897 0.786054 0.854984 0.846368 0.572997 0.577539 0.843198 0.652104 0.568156 0.441008
predicted yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 浙贝母 天麻 鳖甲 款冬花 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲

117. 
patient face id: 03041421382814_2
label yaofang:
甘草 白芍 薏苡仁 红花 赤芍 山茱萸 鳖甲 莪术 浮小麦 蜈蚣 白花蛇舌 川木瓜 红豆杉 宽筋藤 龙葵果
0.967062 0.447412 0.791603 0.749845 0.790538 0.443277 0.797144 0.576682 0.401432 0.435893
predicted yaofang:
甘草 白芍 薏苡仁 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 红豆杉

118. 
patient face id: 04150747128194_1_2
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 白术 丹参 枳实 竹茹 胆南星 厚朴
0.940797 0.640619 0.884759 0.6388 0.816087 0.855861 0.760794 0.676751 0.54862
predicted yaofang:
甘草 法半夏 茯苓 桃仁 党参 黄芪 白术 丹参 厚朴

119. 
patient face id: 02272158459546_6_4
label yaofang:
桂枝 甘草 甘草 白芍 川芎 川芎 陈皮 枳壳 当归 茯苓 龙骨 牡蛎 牛蒡子 远志 麦冬 党参 酸枣仁 柏子仁 竹茹 牡丹皮 吴茱萸 姜半夏 姜半夏
0.511328 0.81293 0.661328 0.601974 0.560943 0.861426 0.428671 0.424025 0.967005 0.548501
predicted yaofang:
桂枝 甘草 白芍 川芎 当归 茯苓 龙骨 牡蛎 党参 酸枣仁

120. 
patient face id: 04132045505339_2_1_5
label yaofang:
甘草 茯苓 桔梗 牛蒡子 麦冬 党参 丹参 浙贝母 天花粉 鳖甲 黄芩片 白花蛇舌 蜂房 四季青
0.981778 0.773183 0.735712 0.755263 0.874754 0.732379 0.661195
predicted yaofang:
甘草 茯苓 桔梗 党参 浙贝母 鳖甲 白花蛇舌

121. 
patient face id: 03312117577276_5
label yaofang:
甘草 法半夏 桔梗 金银花 连翘 芦根 牛蒡子 浙贝母 诃子 麦芽 苦杏仁 板蓝根 炙麻黄 四季青
0.95169 0.563917 0.945257 0.520331 0.978083 0.626482
predicted yaofang:
甘草 法半夏 桔梗 牛蒡子 浙贝母 苦杏仁

122. 
patient face id: 01092051141685_6_2
label yaofang:
玉竹 黄芪 乌梅 郁金 砂仁 天花粉 金樱子 鸡内金 桑螵蛸 北沙参 冬凌草
0.484066 0.821674 0.660362 0.691965
predicted yaofang:
甘草 黄芪 砂仁 北沙参

123. 
patient face id: 01061604289217_5
label yaofang:
麻黄 甘草 法半夏 茯苓 桔梗 鱼腥草 浙贝母 细辛 桑白皮 莱菔子 款冬花 苦杏仁 紫苏子 黄芩片
0.894751 0.882008 0.875721 0.890049 0.93981 0.657417 0.649408 0.823192 0.412493
predicted yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 细辛 款冬花 苦杏仁 黄芩片

124. 
patient face id: 01190618050244_1_2_6
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 首乌藤 沙苑子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.997688 0.86639 0.88747 0.951559 0.499139 0.974248 0.95015 0.543979 0.587986 0.921576 0.888534 0.90691 0.912374
predicted yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲

125. 
patient face id: 01250636099448_5_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 薏苡仁 桃仁 鱼腥草 远志 浙贝母 款冬花 苇茎 苦杏仁 紫苏子
0.83844 0.890892 0.912298 0.519484 0.815734 0.486935 0.857433 0.673556 0.668062
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 薏苡仁 浙贝母 款冬花 苦杏仁

126. 
patient face id: 02212023480910_2_6
label yaofang:
甘草 川芎 法半夏 茯苓 桃仁 党参 枸杞子 白术 红花 牛膝 山药 天麻 蔓荆子 蒺藜 粉葛
0.948516 0.410355 0.43378 0.828978 0.755711 0.752305 0.578034 0.566724 0.610963 0.715803
predicted yaofang:
甘草 川芎 法半夏 茯苓 桃仁 党参 白术 牛膝 山药 天麻

127. 
patient face id: 02020957549977_6_2_5
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 牡丹皮 天麻 僵蚕 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.994763 0.841037 0.840037 0.891687 0.899268 0.501686 0.906853 0.969635 0.950466 0.843639 0.915537 0.738424 0.46491
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

128. 
patient face id: 02182258536887_2_6
label yaofang:
甘草 柴胡 白芍 川芎 枳壳 当归 何首乌 生地黄 黄柏 砂仁 菟丝子 五灵脂 桑寄生 益母草 艾叶
0.885838 0.727117 0.896325 0.506115 0.544704 0.420848 0.656477
predicted yaofang:
甘草 柴胡 白芍 枳壳 当归 白术 生地黄

129. 
patient face id: 03021211111687_1_3_7
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 厚朴
0.910569 0.559617 0.83854 0.626601 0.808378 0.804461 0.654649 0.470425
predicted yaofang:
甘草 法半夏 茯苓 桃仁 党参 黄芪 丹参 厚朴

130. 
patient face id: 03291754397159_6_2
label yaofang:
甘草 白芍 香附 桃仁 党参 白术 丹参 生地黄 车前子 水牛角 荆芥穗 菟丝子 桑寄生 地肤子 黄芩片
0.895088 0.449116 0.619942 0.449836 0.641293 0.564575 0.626888 0.59514
predicted yaofang:
甘草 柴胡 白芍 桃仁 党参 白术 丹参 生地黄

131. 
patient face id: 02010019115213_1_2_7
label yaofang:
甘草 茯苓 党参 白术 丹参 生地黄 山药 山茱萸 补骨脂 豆蔻 麦芽 鹿角霜 川加皮
0.960822 0.832469 0.89864 0.678231 0.473604 0.477162 0.858412 0.402366
predicted yaofang:
甘草 茯苓 党参 白术 丹参 生地黄 山药 山茱萸

132. 
patient face id: 04071314152526_4
label yaofang:
法半夏 葛根 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.87938 0.939835 0.748427 0.958095 0.629529 0.776382 0.82952 0.888322 0.70793 0.88488 0.8915 0.789391 0.656467 0.857522 0.629559
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄

133. 
patient face id: 03021903530526_4
label yaofang:
白芍 茯苓 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 甘草片 炒僵蚕
0.449957 0.452451 0.721611 0.909761 0.590574 0.464355 0.476837 0.539333
predicted yaofang:
甘草 白芍 茯苓 防风 薏苡仁 生地黄 牡丹皮 荆芥穗

134. 
patient face id: 04131914240668_1_2
label yaofang:
甘草 半夏 薏苡仁 蒲公英 黄芪 枸杞子 黄连 海螵蛸 牡丹皮 山茱萸 砂仁 紫苏叶 蛇舌草
0.736479 0.543147 0.790711 0.563139 0.449023 0.507628 0.467218 0.573297
predicted yaofang:
甘草 薏苡仁 黄芪 白术 海螵蛸 牡丹皮 山药 砂仁

135. 
patient face id: 04132026568367_1_7_6
label yaofang:
半夏 黄芪 何首乌 白术 赤芍 浙贝母 杜仲 山药 砂仁 桑寄生 橘络 土鳖虫 红豆杉 山慈菇
0.419074 0.790543 0.941803 0.620459 0.694703 0.491499
predicted yaofang:
甘草 黄芪 白术 杜仲 砂仁 北沙参

136. 
patient face id: 02260116375585_6_1
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 丹参 地黄 天麻 白花蛇舌草 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.994253 0.85919 0.547589 0.829588 0.900085 0.574928 0.982121 0.54253 0.744901 0.664471 0.749795 0.870531 0.596266
predicted yaofang:
甘草 茯苓 远志 党参 酸枣仁 丹参 天麻 白花蛇舌草 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲

137. 
patient face id: 02182229014865_5_6
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 郁金 山药 车前子 天麻 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.992283 0.790281 0.710008 0.936299 0.669445 0.967886 0.941575 0.934614 0.823451 0.856345 0.650774
predicted yaofang:
甘草 茯苓 薏苡仁 党参 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

138. 
patient face id: 03312109382609_4_6
label yaofang:
甘草 茯苓 木香 龙骨 牡蛎 党参 枸杞子 白术 荷叶 砂仁 天麻 磁石 蜈蚣 半枝莲 醋鳖甲
0.934886 0.76657 0.901438 0.752654 0.556375 0.769486 0.727999 0.66909
predicted yaofang:
甘草 茯苓 党参 白术 砂仁 天麻 蜈蚣 半枝莲

139. 
patient face id: 01012057139636_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.932991 0.931249 0.91936 0.933796 0.915521 0.91794 0.908413 0.908761 0.918063 0.883244 0.88004 0.852409
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

140. 
patient face id: 03221950339135_6_1
label yaofang:
甘草 香附 茯苓 党参 白术 酸枣仁 天麻 鳖甲 佛手 百合 威灵仙 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.996806 0.852455 0.927696 0.773623 0.774736 0.930973 0.961384 0.546069 0.923234 0.783867 0.937358 0.902345
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

141. 
patient face id: 04071319055151_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 百部 炙甘草 广藿香 蜜麻黄
0.670133 0.942994 0.896611 0.918539 0.692569 0.744709 0.47261 0.865846 0.821846 0.665509 0.82421 0.870925 0.762531 0.66422
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄

142. 
patient face id: 03101915299969_6_4
label yaofang:
甘草 柴胡 川芎 香附 防风 赤芍 荆芥穗 白芷 蔓荆子 郁李仁 芥子
0.864446 0.566179 0.452704 0.496866 0.747918 0.461717
predicted yaofang:
甘草 柴胡 白芍 川芎 防风 白芷

143. 
patient face id: 03142013409163_6
label yaofang:
白芍 香附 黄芩 法半夏 大枣 党参 延胡索 海螵蛸 北柴胡 麦芽 炙甘草 紫苏梗
0.841832 0.568764 0.499399 0.886113 0.604788
predicted yaofang:
白芍 党参 海螵蛸 炙甘草 紫苏梗

144. 
patient face id: 04131557407654_1_3_4
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.897836 0.792334 0.813971 0.852032 0.52528 0.786362 0.810911 0.909322 0.496489 0.855628
predicted yaofang:
甘草 麦冬 党参 黄芪 枸杞子 生地黄 牡丹皮 山药 天花粉 北沙参

145. 
patient face id: 02211848064935_7_1
label yaofang:
甘草 白芍 川芎 独活 牛膝 细辛 干姜 蜈蚣 海桐皮 姜黄 鹿衔草
0.827483 0.877057 0.42691 0.531729 0.619497 0.591012
predicted yaofang:
甘草 白芍 川芎 牛膝 细辛 干姜

146. 
patient face id: 04150842037235
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志 牡荆子
0.91625 0.446507 0.911268 0.640355 0.650664 0.945288 0.767107 0.863452 0.714089 0.774156 0.850125 0.716428 0.520277
predicted yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志

147. 
patient face id: 01172359288914_1_5
label yaofang:
甘草 茯苓 半夏 橘红 太子参 白术 酸枣仁 砂仁 北沙参 首乌藤 合欢皮 山慈菇
0.719917 0.89284 0.590784 0.549005 0.889072 0.432632 0.812577 0.761162 0.586253
predicted yaofang:
甘草 茯苓 太子参 黄芪 白术 酸枣仁 砂仁 北沙参 首乌藤

148. 
patient face id: 03242130590095_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.48384 0.802406 0.821023 0.664773 0.564238 0.813709 0.83694 0.87332 0.684018 0.533933 0.771246 0.959424
predicted yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 紫菀 苦杏仁 姜半夏 炙甘草

149. 
patient face id: 03022208219652_2_4
label yaofang:
甘草 川芎 茯苓 黄芪 杜仲 牛膝 泽泻 仙鹤草 天麻 磁石 桑寄生 麦芽 地龙 蒺藜 女贞子 粉葛 墨旱莲
0.785145 0.47147 0.55114 0.402707 0.542421 0.753474 0.525498 0.540518
predicted yaofang:
甘草 川芎 茯苓 白术 杜仲 牛膝 天麻 桑寄生

150. 
patient face id: 03312044594120_4_7
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 独活 浙贝母 杜仲 细辛 桑寄生 款冬花 白前 牛大力
0.909908 0.755 0.864071 0.648295 0.584416 0.710585 0.61826 0.404657
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 细辛 款冬花 白前

151. 
patient face id: 01061607383470_6_4_7
label yaofang:
桂枝 甘草 党参 黄芪 何首乌 白术 生地黄 红花 赤芍 天麻 桑寄生 地龙 桑枝 骨碎补 土茯苓
0.942958 0.411122 0.657411 0.659338 0.720205 0.424598 0.437304 0.430766 0.404979
predicted yaofang:
甘草 桃仁 党参 黄芪 白术 生地黄 赤芍 杜仲 桑寄生

152. 
patient face id: 03011107530990_6_4
label yaofang:
甘草 甘草 法半夏 浙贝母 牡丹皮 石膏 苍术 青蒿 升麻 银柴胡 淡竹叶 百合 紫苏叶 醋鳖甲 川木通
0.858181 0.409695
predicted yaofang:
甘草 浙贝母

153. 
patient face id: 02181956257943_1_4_7
label yaofang:
甘草 法半夏 茯苓 桔梗 党参 丹参 浙贝母 砂仁 天麻 鳖甲 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.998725 0.467427 0.822733 0.511259 0.716497 0.6633 0.943632 0.963031 0.949432 0.922147 0.919923 0.790943
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

154. 
patient face id: 03062132360335_2
label yaofang:
甘草 白芍 川芎 香附 枳壳 党参 白术 丹参 生地黄 菟丝子 桑寄生 黄芩片
0.94726 0.424761 0.872202 0.774547 0.51991 0.473689 0.425765
predicted yaofang:
甘草 柴胡 白芍 党参 白术 丹参 生地黄

155. 
patient face id: 02020837005799_6_4
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 桔梗 牡蛎 浙贝母 栀子 牡丹皮 天山雪莲 猫爪草
0.962257 0.712243 0.645964 0.46211 0.857129 0.544142 0.577442
predicted yaofang:
甘草 柴胡 白芍 法半夏 茯苓 桔梗 浙贝母

156. 
patient face id: 04102129269260_5_2
label yaofang:
甘草 桔梗 荆芥 防风 芦根 牛蒡子 苦杏仁 紫苏叶 野马追
0.764103 0.693455 0.455743
predicted yaofang:
甘草 桔梗 浙贝母

157. 
patient face id: 01070842226206_1_4_7
label yaofang:
甘草 枳壳 法半夏 茯苓 橘红 党参 黄芪 丹参 延胡索 竹茹 郁金 厚朴
0.951005 0.508135 0.717041 0.842673 0.668443 0.650513 0.579006 0.507531
predicted yaofang:
甘草 法半夏 茯苓 党参 黄芪 丹参 郁金 厚朴

158. 
patient face id: 04101859238702_1_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄 炒苍耳子
0.93376 0.976471 0.823731 0.981746 0.790532 0.624701 0.936031 0.969956 0.916142 0.976035 0.928252 0.900532 0.872929 0.522357 0.834272 0.47909
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子

159. 
patient face id: 03132018088532_4_1_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.93207 0.732327 0.93995 0.710961 0.707322 0.962066 0.88577 0.847658 0.794763 0.792756 0.893782 0.703171 0.576446
predicted yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志

160. 
patient face id: 02122354206093_1_2
label yaofang:
甘草 川芎 党参 黄芪 枸杞子 白术 天麻 地龙 女贞子 粉葛 墨旱莲
0.878699 0.771563 0.728376 0.644359 0.443886
predicted yaofang:
甘草 党参 黄芪 白术 天麻

161. 
patient face id: 03061515189561_1_4
label yaofang:
麻黄 桂枝 白芍 法半夏 牛蒡子 太子参 五味子 浙贝母 炮姜 细辛 射干 紫菀 苦杏仁 炙甘草
0.614593 0.782606 0.506771 0.756195 0.838774 0.61464 0.603477 0.437037 0.891908
predicted yaofang:
桂枝 白芍 牛蒡子 浙贝母 细辛 干姜 紫菀 苦杏仁 炙甘草

162. 
patient face id: 02190511234753_1_2_6
label yaofang:
甘草 白芍 茯苓 太子参 白术 酸枣仁 浙贝母 白茅根 天麻 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.974677 0.58912 0.87466 0.527565 0.735493 0.529357 0.527374 0.879537 0.650516 0.869406 0.883963 0.594578
predicted yaofang:
甘草 白芍 茯苓 太子参 白术 酸枣仁 浙贝母 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

163. 
patient face id: 02212238528554_1_2_7
label yaofang:
甘草 薏苡仁 党参 浙贝母 郁金 山药 砂仁 天麻 鳖甲 莪术 丝瓜络 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.990703 0.967974 0.784998 0.574198 0.55925 0.748688 0.505291 0.887362 0.94959 0.831605 0.928415 0.900615 0.747184 0.669357
predicted yaofang:
甘草 薏苡仁 党参 浙贝母 郁金 山药 砂仁 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 红豆杉

164. 
patient face id: 01190438144769_3_5_7
label yaofang:
甘草 当归 连翘 蒲公英 党参 黄芪 牡丹皮 郁金 鳖甲 莪术 败酱草 皂角刺 紫苏梗 蜈蚣 半枝莲 红豆杉
0.981676 0.607607 0.835499 0.634408 0.595819 0.543175 0.730359 0.525325 0.77067 0.460484 0.430246
predicted yaofang:
甘草 薏苡仁 党参 黄芪 白术 天麻 鳖甲 莪术 蜈蚣 天山雪莲 红豆杉

165. 
patient face id: 03310920118550_2_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 紫菀 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.497573 0.688899 0.539267 0.496311 0.740594 0.673515 0.753201 0.827695 0.648491 0.41878 0.441135 0.694769 0.933318 0.489512 0.453193
predicted yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

166. 
patient face id: 04210453379784_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 桑白皮 款冬花 诃子 白花蛇舌草 苦杏仁 蜈蚣 醋鳖甲
0.975584 0.790957 0.86378 0.495932 0.955557 0.925499 0.523215 0.414342 0.525827 0.492405
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 款冬花 白花蛇舌草 苦杏仁 蜈蚣

167. 
patient face id: 04131953023106_5
label yaofang:
黄芩 半夏 蒲公英 白术 五味子 黄柏 山药 豆蔻 板蓝根 土茯苓 石榴皮
0.771561 0.441485
predicted yaofang:
白术 山药

168. 
patient face id: 03062138575886_7_5
label yaofang:
黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 火麻仁 鸡内金 北沙参 红豆杉 合欢皮 山慈菇 蛇舌草
0.971384 0.965816 0.756086 0.467468 0.834056 0.913259 0.678819 0.860611 0.506043 0.679633
predicted yaofang:
黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 红豆杉 合欢皮

169. 
patient face id: 03102001132934_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.734052 0.902716 0.916221 0.844408 0.739608 0.816548 0.94337 0.895949 0.867916 0.890238 0.852923 0.958688 0.848652 0.855069
predicted yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

170. 
patient face id: 04200629521828_1
label yaofang:
甘草 白芍 独活 党参 白术 生地黄 红花 延胡索 桑寄生 补骨脂 锁阳 续断 牛大力 千斤拔
0.929142 0.762791 0.734743 0.756188 0.57806 0.515596 0.545487
predicted yaofang:
甘草 白芍 党参 白术 生地黄 杜仲 桑寄生

171. 
patient face id: 02201315053807_6_1
label yaofang:
桂枝 甘草 法半夏 大枣 大枣 当归 茯苓 木香 牛蒡子 桃仁 党参 党参 黄芪 白术 五味子 柏子仁 郁金 肉桂 北柴胡 虎杖 白花蛇舌草 炙甘草 黄精 土茯苓
0.523001 0.417405 0.475754 0.456718 0.871424 0.932563 0.827941 0.816045
predicted yaofang:
桂枝 甘草 白芍 当归 茯苓 党参 黄芪 白术

172. 
patient face id: 01172333316006_7_6_5
label yaofang:
甘草 桔梗 薏苡仁 浙贝母 郁金 山药 天麻 鳖甲 莪术 诃子 蝉蜕 蜈蚣 白花蛇舌 天山雪莲
0.997097 0.627389 0.840276 0.424038 0.737255 0.468228 0.76483 0.922899 0.633645 0.917904 0.830051 0.662376 0.414994
predicted yaofang:
甘草 桔梗 薏苡仁 党参 浙贝母 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲

173. 
patient face id: 04201904314676_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.682838 0.967536 0.982426 0.777295 0.81161 0.70369 0.642704 0.977597 0.975966 0.955023 0.950808 0.937381 0.616727 0.648165 0.825645 0.913302
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

174. 
patient face id: 04192224230241_4_6
label yaofang:
甘草 陈皮 法半夏 茯苓 细辛 天麻 鳖甲 豆蔻 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.949042 0.814414 0.687862 0.881852 0.861942 0.891293 0.608512 0.736596 0.754803
predicted yaofang:
甘草 法半夏 茯苓 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

175. 
patient face id: 02281825386197_2_4
label yaofang:
龙骨 牡蛎 党参 白术 黄连 附子 钩藤 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.400348 0.590729 0.812366 0.567269
predicted yaofang:
龙骨 党参 白术 炙甘草

176. 
patient face id: 03231036155787_6_7
label yaofang:
甘草 白芍 川芎 香附 白术 丹参 牛膝 郁金 薤白 厚朴 砂仁 天麻 全蝎 瓜蒌皮 降香
0.963648 0.496552 0.481943 0.547842 0.632194 0.590101 0.501122 0.451645 0.460842 0.703015
predicted yaofang:
甘草 白芍 川芎 白术 丹参 牛膝 郁金 厚朴 砂仁 天麻

177. 
patient face id: 04202223509750_1_5
label yaofang:
甘草 柴胡 丹参 赤芍 杜仲 山药 天麻 桑寄生 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.998455 0.464325 0.966426 0.895947 0.923569 0.633195 0.7817 0.886995
predicted yaofang:
甘草 党参 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

178. 
patient face id: 02231750304135_1_6
label yaofang:
白芍 川芎 法半夏 当归 茯苓 木香 太子参 丹参 川楝子 郁金 北柴胡 炙甘草 佛手 麸炒白术 麸炒枳壳
0.819053 0.419898 0.684353 0.438641 0.866929 0.498402 0.677694
predicted yaofang:
白芍 川芎 法半夏 当归 茯苓 丹参 炙甘草

179. 
patient face id: 03091831215493_1_4_5
label yaofang:
法半夏 葛根 前胡 桔梗 防风 薄荷 荷叶 荆芥穗 香薷 紫苏梗 广藿香 甘草片
0.455292 0.406157 0.421435 0.860487 0.526118 0.550276 0.649463
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 紫苏梗 广藿香

180. 
patient face id: 04120054457047_4_6
label yaofang:
甘草 枳壳 法半夏 桔梗 薏苡仁 浙贝母 郁金 干姜 厚朴 佩兰 豆蔻 紫苏梗 广藿香 威灵仙
0.821146 0.556119 0.749441 0.445494 0.670535 0.454892 0.526074 0.632609 0.54041
predicted yaofang:
甘草 枳壳 法半夏 薏苡仁 浙贝母 厚朴 豆蔻 紫苏梗 广藿香

181. 
patient face id: 04061359408200_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 百部 辛夷 紫苏梗 广藿香 甘草片 炒苍耳子
0.896407 0.641829 0.933912 0.805714 0.945578 0.425947 0.706186 0.835188 0.903961 0.59768 0.825523 0.517485 0.772273 0.545763 0.852581 0.425553
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄

182. 
patient face id: 01061932296050_4
label yaofang:
陈皮 法半夏 前胡 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.652167 0.922232 0.934294 0.761959 0.89555 0.858454 0.819988 0.901941 0.921697 0.568262 0.608564 0.74591
predicted yaofang:
陈皮 法半夏 前胡 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

183. 
patient face id: 03291617141958_2_1
label yaofang:
甘草 茯苓 前胡 桔梗 桃仁 远志 浙贝母 天麻 鳖甲 白前 苦杏仁 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.982476 0.737626 0.886023 0.680895 0.951172 0.950062 0.581237 0.892009 0.835939 0.833408 0.831574
predicted yaofang:
甘草 茯苓 桔梗 浙贝母 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲

184. 
patient face id: 03040850557983_6_4
label yaofang:
甘草 川芎 陈皮 法半夏 茯苓 远志 党参 白术 酸枣仁 生地黄 竹茹 胆南星 浮小麦 首乌藤
0.957381 0.446419 0.751613 0.993418 0.88078 0.557781 0.853867 0.44515 0.577224
predicted yaofang:
甘草 川芎 法半夏 茯苓 党参 白术 酸枣仁 浮小麦 首乌藤

185. 
patient face id: 03021945363191_4
label yaofang:
麻黄 陈皮 茯苓 前胡 半夏 防风 神曲 细辛 款冬花 紫菀 白前 百部 紫苏子 炙甘草 广藿香
0.634477 0.518478 0.769535 0.905998 0.617373 0.53428 0.825586 0.881971 0.796511 0.819947 0.932525 0.680103 0.514807
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄

186. 
patient face id: 01132122138549_6_7_1
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 丹参 赤芍 山药 益母草 鳖甲 麦芽 首乌藤 黄精 土鳖虫
0.994832 0.93643 0.433307 0.974625 0.889345 0.710715 0.542718 0.511836
predicted yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 丹参 山药

187. 
patient face id: 01312138430082_1_2_6
label yaofang:
甘草 白芍 党参 赤芍 杜仲 山茱萸 天麻 桑寄生 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤 墨旱莲
0.995818 0.530912 0.725557 0.493953 0.427898 0.941394 0.433436 0.913881 0.956585 0.65163 0.74692 0.892248
predicted yaofang:
甘草 白芍 党参 生地黄 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

188. 
patient face id: 01101808493959_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.759787 0.973029 0.893326 0.959866 0.727502 0.678677 0.934721 0.89087 0.848417 0.914909 0.886289 0.655138 0.59871 0.796715
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

189. 
patient face id: 03301255468679_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子 木贼
0.962504 0.689843 0.964112 0.833126 0.917851 0.571636 0.91225 0.931555 0.840966 0.933884 0.803855 0.754098 0.454284 0.486041 0.698205
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄

190. 
patient face id: 04181951103840_2_1
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 车前子 砂仁 菟丝子 巴戟天 桑寄生 鹿角霜 续断 艾叶
0.761703 0.471379 0.848909 0.746837 0.507819 0.525777
predicted yaofang:
党参 黄芪 白术 杜仲 砂仁 桑寄生

191. 
patient face id: 04122201154543_6_4
label yaofang:
甘草 柴胡 白芍 党参 延胡索 牡丹皮 山药 车前子 荆芥穗 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.984005 0.602016 0.770603 0.832187 0.428115 0.587093 0.95193 0.915942 0.852294 0.643368 0.836003 0.835926
predicted yaofang:
甘草 柴胡 白芍 党参 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

192. 
patient face id: 03231100483596_1_6
label yaofang:
甘草 川芎 茯苓 远志 党参 酸枣仁 山药 天麻 扁豆花 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.998024 0.405836 0.637712 0.520781 0.914621 0.796233 0.497832 0.991342 0.412279 0.715465 0.518227 0.539022 0.939585 0.417358 0.968899 0.720076
predicted yaofang:
甘草 川芎 茯苓 远志 党参 酸枣仁 山药 天麻 鳖甲 白花蛇舌草 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲 醋鳖甲

193. 
patient face id: 02272228002897_6_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.812621 0.837882 0.727682 0.769673 0.735855 0.591979 0.69873 0.77204 0.820255 0.84688
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗

194. 
patient face id: 03221956354977_1_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 延胡索 天麻 五灵脂 鳖甲 蜈蚣 天山雪莲 合欢花 半枝莲 姜黄
0.9919 0.699603 0.919487 0.746737 0.854092 0.861241 0.851142 0.856407 0.891464 0.81195 0.838085
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

195. 
patient face id: 02222043184960_7_1_5
label yaofang:
麦冬 黄芪 白术 赤芍 黄柏 牛膝 知母 灯心草 橘核 首乌藤 合欢皮 路路通
0.860837 0.68767 0.573903
predicted yaofang:
黄芪 白术 首乌藤

196. 
patient face id: 03242133426313_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.852448 0.90357 0.758387 0.798466 0.772813 0.547375 0.696226 0.767226 0.789437 0.816095
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗

197. 
patient face id: 01201959434060_1_6_4
label yaofang:
黄芪 白术 山药 厚朴 砂仁 菟丝子 桑寄生 鸡内金 麦芽 北沙参 橘核 首乌藤 合欢皮 稻芽
0.437031 0.854486 0.926488 0.468833 0.871268 0.531239 0.728804 0.423156 0.463466
predicted yaofang:
甘草 黄芪 白术 厚朴 砂仁 鸡内金 北沙参 首乌藤 合欢皮

198. 
patient face id: 04052221342305_2_7
label yaofang:
甘草 黄芩 枸杞子 赤芍 牡丹皮 郁金 山茱萸 莪术 北沙参 赭石 蜈蚣 合欢皮 预知子
0.947634 0.459948 0.430959 0.542936 0.477079 0.624739
predicted yaofang:
甘草 赤芍 牡丹皮 郁金 山药 北沙参

199. 
patient face id: 02161929314258_1_6_4
label yaofang:
茯苓 太子参 黄芪 枸杞子 白术 海螵蛸 砂仁 补骨脂 鸡内金 麦芽 首乌藤 紫苏梗 合欢皮 云芝
0.778822 0.421418 0.805866 0.965334 0.64584 0.904847 0.553621 0.492614
predicted yaofang:
茯苓 太子参 黄芪 白术 海螵蛸 砂仁 鸡内金 首乌藤