threshold = 0.3 validation_split = 0.1 sorted

0. 
patient face id: 04210655190679_1_7
label yaofang:
桂枝 甘草 当归 茯苓 黄芪 鸡血藤 生地黄 红花 赤芍 山茱萸 细辛 麦芽 地龙
0.40598 0.954272 0.437222 0.869223 0.398279 0.91404 0.333202 0.763969 0.410999 0.445504 0.323928 0.379339 0.362513
predicted yaofang:
桂枝 甘草 当归 茯苓 桃仁 黄芪 白术 生地黄 红花 赤芍 山茱萸 细辛 麦芽

1. 
patient face id: 01012051367315_1_4_7
label yaofang:
橘红 防风 金银花 浙贝母 款冬花 白前 鸡内金 苦杏仁 紫苏梗 蜜百部 蜜枇杷叶 干鱼腥草 蜜紫菀
0.371988 0.383515 0.324534 0.61211 0.616612 0.400029 0.364807 0.332004 0.346655 0.315593 0.577353
predicted yaofang:
法半夏 前胡 桔梗 防风 浙贝母 款冬花 白前 百部 苦杏仁 辛夷 紫苏梗

2. 
patient face id: 05022044032748_1_2_6
label yaofang:
甘草 川芎 茯苓 桃仁 黄芪 酸枣仁 浙贝母 牛膝 荆芥穗 天麻 全蝎 板蓝根 紫苏梗 猫爪草 贯众
0.89955 0.52704 0.562922 0.698519 0.52569 0.334048 0.402586 0.679667 0.562659 0.461957
predicted yaofang:
甘草 川芎 法半夏 茯苓 桃仁 黄芪 酸枣仁 浙贝母 牛膝 天麻

3. 
patient face id: 05290757097418_2_1
label yaofang:
甘草 白芍 茯苓 远志 党参 生地黄 杜仲 菟丝子 桑寄生 金樱子 蛇床子 锁阳 覆盆子
0.943016 0.723695 0.824216 0.91607 0.6678 0.657718 0.561132
predicted yaofang:
甘草 白芍 茯苓 党参 生地黄 杜仲 桑寄生

4. 
patient face id: 03101746448539_4
label yaofang:
法半夏 茯苓 前胡 桔梗 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.964984 0.944586 0.954326 0.764784 0.334469 0.907064 0.920844 0.81594 0.860117 0.885913 0.585426 0.747041
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄

5. 
patient face id: 02181621581257_5_1_6
label yaofang:
甘草 香附 法半夏 茯苓 党参 白术 山药 薤白 厚朴 砂仁 瓜蒌皮 柿蒂 麦芽 佛手 鱼古 瓦楞子
0.995768 0.303959 0.309795 0.705992 0.976796 0.961644 0.833241 0.410322 0.746804 0.344668 0.798504 0.733309 0.387452
predicted yaofang:
甘草 香附 枳壳 法半夏 茯苓 党参 白术 黄连 山药 厚朴 砂仁 麦芽 紫苏梗

6. 
patient face id: 04112204121749_6_4_7
label yaofang:
甘草 枳壳 法半夏 茯苓 桔梗 党参 丹参 胆南星 郁金 薤白 瓜蒌皮 莪术 诃子 建曲 紫苏梗
0.981573 0.334975 0.833021 0.96218 0.702569 0.952165 0.702016 0.428036 0.609657 0.432499 0.670734
predicted yaofang:
甘草 枳壳 法半夏 茯苓 桔梗 党参 丹参 浙贝母 郁金 厚朴 紫苏梗

7. 
patient face id: 04151235327602_2
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.843613 0.97357 0.836362 0.96113 0.861679 0.884768 0.889487 0.95578 0.966401 0.967047 0.931274 0.844836 0.974676 0.900547 0.937968
predicted yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

8. 
patient face id: 04130858590740_4_6
label yaofang:
甘草 川芎 法半夏 茯苓 远志 党参 酸枣仁 丹参 黄连 石菖蒲 天麻 僵蚕 豆蔻 首乌藤 桑枝
0.99054 0.404435 0.86442 0.908499 0.498316 0.914662 0.79031 0.50905 0.365033 0.794077 0.714555
predicted yaofang:
甘草 川芎 法半夏 茯苓 远志 党参 酸枣仁 丹参 黄连 天麻 首乌藤

9. 
patient face id: 06111046078853_2_1
label yaofang:
甘草 白芍 当归 党参 黄芪 鸡血藤 白术 生地黄 天麻 鳖甲 补骨脂 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.985118 0.786762 0.507852 0.95144 0.892027 0.523772 0.93769 0.85913 0.969002 0.959223 0.372769 0.978406 0.646865 0.938319 0.899785
predicted yaofang:
甘草 白芍 当归 党参 黄芪 鸡血藤 白术 生地黄 天麻 鳖甲 补骨脂 蜈蚣 白花蛇舌 天山雪莲 半枝莲

10. 
patient face id: 01190646126717_3_5_6
label yaofang:
甘草 白芍 茯苓 薏苡仁 党参 熟附子 郁金 山药 天麻 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲 红豆杉
0.998814 0.641591 0.874232 0.881354 0.980948 0.716014 0.776828 0.908498 0.962729 0.711667 0.992169 0.632796 0.801761 0.880085 0.600236
predicted yaofang:
甘草 白芍 茯苓 薏苡仁 党参 郁金 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

11. 
patient face id: 05290818271347_2_1_5
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 天麻 菟丝子 糯稻根 益母草 鳖甲 女贞子 蜈蚣 天山雪莲 半枝莲 墨旱莲
0.99635 0.810819 0.390567 0.936974 0.33573 0.866753 0.733735 0.378387 0.918847 0.392651 0.31631 0.829484 0.345195 0.934254 0.545534 0.814922 0.868074
predicted yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 生地黄 山茱萸 天麻 菟丝子 益母草 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

12. 
patient face id: 02212004102929_1_2_5
label yaofang:
甘草 白芍 大枣 茯苓 白术 酸枣仁 丹参 生地黄 牡丹皮 山药 肉苁蓉 鳖甲 火麻仁 浮小麦
0.967038 0.793681 0.984683 0.435695 0.703989 0.804999 0.464236 0.925106 0.675581 0.771074 0.480468 0.530246
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 丹参 生地黄 牡丹皮 山药 鳖甲 浮小麦

13. 
patient face id: 04291616571593_6_4
label yaofang:
甘草 玉竹 太子参 鸡血藤 生地黄 砂仁 天麻 鳖甲 麦芽 北沙参 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.95927 0.479663 0.368236 0.304274 0.541788 0.69442 0.886683 0.993393 0.337422 0.936449 0.960548 0.97288 0.865026
predicted yaofang:
甘草 太子参 黄芪 白术 生地黄 砂仁 天麻 鳖甲 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲

14. 
patient face id: 03221959244788_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮 山慈菇
0.681984 0.372635 0.584123 0.468013 0.776493 0.349609 0.723919 0.909415 0.747594 0.809076 0.70384 0.530884
predicted yaofang:
龙骨 牡蛎 柏子仁 栀子 干姜 淡豆豉 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮

15. 
patient face id: 05092139598441_4_1_6
label yaofang:
甘草 法半夏 桔梗 浙贝母 细辛 桑白皮 鳖甲 款冬花 紫菀 苦杏仁 黄芩片 白花蛇舌 蜂房 四季青
0.982872 0.956359 0.613143 0.949235 0.97574 0.712493 0.326152 0.833787 0.852095 0.696891 0.819528 0.571255 0.89072 0.422979 0.395128
predicted yaofang:
甘草 法半夏 前胡 桔梗 浙贝母 细辛 桑白皮 鳖甲 款冬花 紫菀 苦杏仁 黄芩片 白花蛇舌 蜂房 四季青

16. 
patient face id: 01012101437253_1_4_2
label yaofang:
当归 党参 黄芪 熟附子 乌药 肉桂 山药 干姜 淫羊藿 仙茅 益智 鹿角霜 醋龟甲
0.309743 0.72965 0.918589 0.973977 0.679123 0.32252
predicted yaofang:
甘草 当归 党参 黄芪 山药 干姜

17. 
patient face id: 05260710181006_7_4
label yaofang:
甘草 法半夏 茯苓 龙骨 远志 党参 竹茹 胆南星 郁金 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.99863 0.863964 0.853032 0.31568 0.422554 0.939584 0.350228 0.562369 0.778288 0.468677 0.87862 0.691171 0.442115
predicted yaofang:
甘草 法半夏 茯苓 龙骨 远志 党参 酸枣仁 郁金 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

18. 
patient face id: 05251944068097_6
label yaofang:
甘草 柴胡 枳壳 半夏 龙骨 黄芪 枸杞子 白术 酸枣仁 黄连 牡丹皮 杜仲 牛膝 淡豆豉 续断 浮小麦 合欢皮 预知子
0.84063 0.360793 0.587222 0.362337 0.362081 0.631063 0.832775 0.471351 0.302073 0.418486 0.563976 0.368092 0.751399 0.754096 0.611418 0.451787 0.524035 0.648176
predicted yaofang:
甘草 柴胡 枳壳 半夏 龙骨 黄芪 白术 酸枣仁 黄连 生地黄 海螵蛸 栀子 牡丹皮 杜仲 浮小麦 百合 紫苏叶 合欢皮

19. 
patient face id: 05140736422531_6_5
label yaofang:
甘草 白芍 茯苓 党参 白术 黄连 延胡索 乌梅 山药 蒲黄 砂仁 五灵脂 建曲 醋香附 合欢花
0.975943 0.341743 0.789468 0.988329 0.961504 0.909545 0.353619 0.426095 0.818302 0.68204 0.328716 0.400235
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 黄连 延胡索 山药 砂仁 麦芽 合欢花

20. 
patient face id: 03180120024623_7_1
label yaofang:
甘草 柴胡 川芎 香附 防风 赤芍 青蒿 荆芥穗 白芷 郁李仁 芥子
0.850919 0.524515 0.391358 0.644276 0.320947 0.696083 0.359665 0.666254
predicted yaofang:
甘草 柴胡 白芍 川芎 桔梗 防风 赤芍 白芷

21. 
patient face id: 06092004526441_1_4_6
label yaofang:
甘草 川芎 当归 防风 独活 党参 白术 海螵蛸 杜仲 牛膝 厚朴 巴戟天 桑寄生 秦艽 紫苏叶 蜈蚣 骨碎补
0.867166 0.486446 0.50587 0.316175 0.922658 0.555777 0.922144 0.406974 0.876981 0.788437 0.563871 0.306487 0.64982 0.427649 0.565776
predicted yaofang:
甘草 川芎 当归 半夏 党参 黄芪 白术 海螵蛸 杜仲 牛膝 厚朴 菟丝子 桑寄生 紫苏叶 蜈蚣

22. 
patient face id: 01122349239866_1_4_7
label yaofang:
甘草 白芍 枳壳 茯苓 木香 白术 槟榔 山药 大腹皮 天麻 桑寄生 火麻仁 决明子 续断 天山雪莲
0.76172 0.786089 0.343436 0.744629 0.898213 0.348852 0.585374
predicted yaofang:
甘草 白芍 枳壳 茯苓 白术 山药 天麻

23. 
patient face id: 04150847077650
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.927986 0.941151 0.897751 0.952786 0.917221 0.925583 0.882402 0.891697 0.886936 0.883222 0.859939 0.878179
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

24. 
patient face id: 01201319592474_5_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 天麻 鳖甲 诃子 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.999621 0.931078 0.910307 0.634035 0.962801 0.975344 0.843662 0.985329 0.432524 0.692303 0.973709 0.971881 0.936589 0.906513
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 天麻 鳖甲 款冬花 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲

25. 
patient face id: 05192003204053_2_6
label yaofang:
甘草 法半夏 茯苓 龙骨 远志 党参 酸枣仁 知母 菟丝子 益母草 女贞子 浮小麦 首乌藤
0.972705 0.808957 0.976143 0.38189 0.639793 0.967441 0.967881 0.335024 0.351344 0.758394 0.397708
predicted yaofang:
甘草 法半夏 茯苓 龙骨 远志 党参 酸枣仁 菟丝子 益母草 浮小麦 首乌藤

26. 
patient face id: 06010208339212_6_4_7
label yaofang:
甘草 法半夏 茯苓 党参 白术 砂仁 天麻 鳖甲 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986893 0.840711 0.939725 0.960663 0.872898 0.689169 0.929745 0.947492 0.714831 0.549228 0.94984 0.77531 0.920168 0.891773
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 砂仁 天麻 鳖甲 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲

27. 
patient face id: 06071955501722_4_7
label yaofang:
甘草 独活 党参 鸡血藤 生地黄 牛膝 细辛 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.99123 0.334149 0.801316 0.685453 0.366336 0.372597 0.996545 0.310136 0.962337 0.982384 0.78906 0.959892 0.911972
predicted yaofang:
甘草 白芍 党参 生地黄 牛膝 细辛 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

28. 
patient face id: 06062305528235_5_7
label yaofang:
甘草 金银花 丹参 玄参 红花 延胡索 牡丹皮 细辛 天麻 鳖甲 忍冬藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.998045 0.449621 0.471061 0.718531 0.990024 0.944537 0.986506 0.802289 0.915481 0.903367
predicted yaofang:
甘草 丹参 生地黄 红花 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

29. 
patient face id: 06111111314336_7_5
label yaofang:
甘草 当归 金银花 紫花地丁 党参 黄芪 鸡血藤 白术 生地黄 红花 赤芍 细辛 白芷 吴茱萸 麦芽 忍冬藤 白花蛇舌
0.986815 0.436416 0.600909 0.881183 0.795169 0.918819 0.84352 0.50633 0.407881 0.311602 0.585048
predicted yaofang:
甘草 川芎 当归 党参 黄芪 白术 生地黄 红花 赤芍 细辛 麦芽

30. 
patient face id: 03171025485215_2_1
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.973409 0.873887 0.803333 0.935936 0.829357 0.567435 0.864939 0.868616 0.788163 0.477295 0.93796
predicted yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参

31. 
patient face id: 05172120391389_1_7
label yaofang:
甘草 白芍 茯苓 薏苡仁 党参 黄芪 山药 水牛角 天麻 鳖甲 茵陈 莪术 虎杖 麦芽 蜈蚣 白花蛇舌 红豆杉
0.994775 0.455096 0.529605 0.935155 0.945162 0.628117 0.815424 0.711597 0.902397 0.79519 0.46726 0.906367 0.715332 0.320054 0.532504
predicted yaofang:
甘草 白芍 茯苓 薏苡仁 党参 黄芪 山药 天麻 鳖甲 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲 红豆杉

32. 
patient face id: 01312320301102_1_6
label yaofang:
甘草 白术 延胡索 牡丹皮 牛膝 地黄 天麻 补骨脂 白花蛇舌草 浮小麦 桑枝 蜈蚣 半枝莲 醋鳖甲
0.974371 0.656039 0.365013 0.49237 0.383639 0.855741 0.710841 0.865892 0.589502 0.74761
predicted yaofang:
甘草 白术 牡丹皮 牛膝 地黄 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

33. 
patient face id: 02151813242252_4
label yaofang:
前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 香薷 紫菀 百部 紫苏梗 广藿香 甘草片
0.362228 0.871388 0.802577 0.924684 0.35468 0.761367 0.397648 0.462304 0.767448 0.483022 0.782103 0.610171 0.739677 0.870406
predicted yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香

34. 
patient face id: 05022130270697_2_1_6
label yaofang:
甘草 茯苓 党参 鸡血藤 黄连 砂仁 天麻 鳖甲 麦芽 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.983518 0.320535 0.790451 0.974469 0.597358 0.547398 0.770153 0.829653 0.328371 0.675803 0.507944 0.8379 0.360824 0.859881 0.639048
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 砂仁 天麻 鳖甲 麦芽 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲

35. 
patient face id: 04300931383558_1_6
label yaofang:
甘草 白芍 陈皮 木香 防风 党参 白术 黄连 天麻 鳖甲 粉葛 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.9772 0.453449 0.53703 0.858101 0.843512 0.401254 0.956645 0.875491 0.928267 0.693864 0.891303 0.766937
predicted yaofang:
甘草 白芍 防风 党参 白术 黄连 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

36. 
patient face id: 03170936238896_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.930734 0.915923 0.865555 0.933614 0.89032 0.910314 0.858292 0.883896 0.889405 0.853938 0.858132 0.830914
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

37. 
patient face id: 05131618439416_5_6
label yaofang:
甘草 陈皮 法半夏 茯苓 木香 蒲公英 白及 党参 黄连 苍术 山药 厚朴 砂仁 三棱 莪术 豆蔻
0.944569 0.754623 0.840198 0.88914 0.542087 0.870473 0.618991 0.565206 0.522358 0.585377 0.364626 0.384755 0.306704
predicted yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 党参 黄连 山药 厚朴 砂仁 莪术 紫苏梗 广藿香

38. 
patient face id: 02221236430347_3_1_7
label yaofang:
甘草 柴胡 白芍 当归 茯苓 薄荷 白术 酸枣仁 栀子 牡丹皮
0.925185 0.875406 0.861285 0.980606 0.787303 0.46291 0.520189
predicted yaofang:
甘草 柴胡 白芍 茯苓 白术 酸枣仁 牡丹皮

39. 
patient face id: 06190129420008_1
label yaofang:
甘草 太子参 白术 玄参 地黄 山楂 火麻仁 枇杷叶 麦芽 苦杏仁 郁李仁 谷芽
0.793939 0.422954 0.623182 0.339997 0.627776
predicted yaofang:
甘草 太子参 白术 浙贝母 麦芽

40. 
patient face id: 03221622080727_6
label yaofang:
甘草 香附 茯苓 党参 白术 酸枣仁 生地黄 黄柏 郁金 山茱萸 菟丝子 益母草 王不留行 浮小麦 合欢花
0.997427 0.987787 0.889059 0.837537 0.917115 0.817995 0.456641 0.307491 0.49829 0.584799 0.574192 0.670982 0.598493
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 郁金 山药 山茱萸 菟丝子 益母草 浮小麦 合欢花

41. 
patient face id: 02281248109491_1_3_7
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.725398 0.94378 0.971538 0.826737
predicted yaofang:
当归 党参 黄芪 山药

42. 
patient face id: 04112217493264_2_6
label yaofang:
甘草 龙骨 党参 白术 生地黄 黄柏 山药 山茱萸 地骨皮 糯稻根 银柴胡 胡黄连 淫羊藿 首乌藤 龟甲
0.976763 0.486593 0.546777 0.926559 0.462464 0.738336 0.328737 0.879748 0.345685 0.37871 0.929618 0.80963 0.308228 0.351694
predicted yaofang:
甘草 茯苓 龙骨 党参 黄芪 白术 酸枣仁 生地黄 杜仲 黄柏 山药 山茱萸 益母草 首乌藤

43. 
patient face id: 01132148039324_5
label yaofang:
甘草 法半夏 茯苓 党参 黄连 砂仁 天麻 鳖甲 火麻仁 枇杷叶 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.989129 0.831638 0.826752 0.889181 0.320737 0.31135 0.587898 0.731998 0.822776 0.877541 0.415122 0.887896 0.358128 0.878375 0.837954
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 黄连 砂仁 天麻 鳖甲 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲

44. 
patient face id: 04150712352117_4_7_6
label yaofang:
甘草 川芎 茯苓 薏苡仁 党参 黄连 生地黄 赤芍 山药 补骨脂 浮小麦 白花蛇舌 土鳖虫
0.995954 0.39826 0.940313 0.463148 0.900685 0.383577 0.675179 0.81402 0.637697 0.442262 0.453489 0.339442
predicted yaofang:
甘草 川芎 茯苓 薏苡仁 党参 黄连 生地黄 赤芍 山药 鳖甲 浮小麦 白花蛇舌

45. 
patient face id: 02251125392362_4
label yaofang:
法半夏 葛根 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.973631 0.98355 0.898031 0.94886 0.444658 0.694242 0.412485 0.400657 0.929673 0.964176 0.904681 0.961716 0.985304 0.4459 0.869023 0.911851 0.809727 0.308569
predicted yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄 炒苍耳子

46. 
patient face id: 06091956252385_1_4_6
label yaofang:
甘草 半夏 牡蛎 黄芪 阿胶 白术 海螵蛸 杜仲 牛膝 山药 菊花 白茅根 芡实 鸡内金 北沙参 百合 紫苏梗 玉米须 蜈蚣 骨碎补 红豆杉 预知子
0.397664 0.861285 0.363657 0.968761 0.453582 0.797688 0.804194 0.608707 0.343904 0.806557 0.482645 0.66007 0.79464 0.54027 0.412778 0.408538 0.507284 0.58003 0.300351
predicted yaofang:
甘草 半夏 麦冬 黄芪 枸杞子 白术 海螵蛸 杜仲 牛膝 厚朴 砂仁 鸡内金 北沙参 百合 紫苏叶 紫苏梗 蜈蚣 红豆杉 预知子

47. 
patient face id: 02141959473230_6
label yaofang:
龙骨 柏子仁 干姜 淡豆豉 天麻 姜半夏 炙甘草 蜈蚣 合欢皮
0.611113 0.535064 0.775332 0.545477 0.715614 0.927182 0.31429 0.812034
predicted yaofang:
龙骨 柏子仁 干姜 天麻 姜半夏 炙甘草 紫苏叶 蜈蚣

48. 
patient face id: 03020743139804_1_6
label yaofang:
甘草 茯苓 党参 白术 丹参 赤芍 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.997865 0.866479 0.960231 0.740215 0.425357 0.467713 0.675929 0.983621 0.980879 0.404379 0.952181 0.823938 0.940091 0.94021
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 丹参 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

49. 
patient face id: 03221631066641_1_7_6
label yaofang:
茯苓 桃仁 党参 白术 赤芍 厚朴 火麻仁 虎杖 枇杷叶 北沙参 首乌藤 土鳖虫 合欢皮
0.460943 0.781186 0.716417 0.683086 0.451892 0.907661 0.483923 0.414432 0.645932 0.662431 0.414666 0.552311
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 赤芍 厚朴 北沙参 首乌藤 合欢皮

50. 
patient face id: 03221643460807_1_4
label yaofang:
枳壳 太子参 黄芪 白术 赤芍 海螵蛸 牛膝 厚朴 火麻仁 鸡内金 紫苏梗 红豆杉 土茯苓 稻芽
0.517017 0.834287 0.875562 0.897075 0.307275 0.77926 0.50452 0.729797 0.479284 0.412363
predicted yaofang:
枳壳 黄芪 白术 海螵蛸 牛膝 厚朴 砂仁 鸡内金 北沙参 紫苏梗

51. 
patient face id: 05032221028899_4_6
label yaofang:
甘草 黄芩 桔梗 金银花 党参 玄参 黄连 浙贝母 黄柏 石膏 山茱萸 地黄 灯心草 胡黄连 火麻仁 广藿香
0.996417 0.59981 0.49182 0.619927 0.447598 0.456749 0.311317 0.40266 0.302594 0.305253
predicted yaofang:
甘草 桔梗 金银花 党参 黄连 浙贝母 牡丹皮 山茱萸 地黄 火麻仁

52. 
patient face id: 01042334549227_7_5
label yaofang:
甘草 白芍 茯苓 龙骨 牡蛎 酸枣仁 丹参 杜仲 牛膝 山茱萸 地黄 天麻 桑寄生 补骨脂 麦芽
0.968122 0.683616 0.897608 0.330226 0.669305 0.673889 0.348924 0.695526 0.48793 0.622271 0.72761 0.822773 0.309088 0.505063 0.312455
predicted yaofang:
甘草 白芍 茯苓 党参 酸枣仁 丹参 生地黄 杜仲 牛膝 山茱萸 天麻 桑寄生 补骨脂 麦芽 首乌藤

53. 
patient face id: 05221858325757_1_2
label yaofang:
麦冬 太子参 黄芪 酸枣仁 煅牡蛎 煅龙骨
0.615454 0.806283 0.772324 0.309544 0.354735 0.335616
predicted yaofang:
麦冬 太子参 黄芪 酸枣仁 北沙参 炙甘草

54. 
patient face id: 05162045203884_5_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 黄柏 郁金 山药 厚朴 砂仁 豆蔻 苦杏仁 紫苏梗 广藿香 白花蛇舌
0.929936 0.374079 0.302064 0.952443 0.646901 0.96201 0.765696 0.349701 0.44935 0.315953 0.702444 0.320739 0.673288 0.452137
predicted yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 党参 白术 浙贝母 山药 厚朴 砂仁 麦芽 紫苏梗 广藿香

55. 
patient face id: 03111712589485_6_2_7
label yaofang:
甘草 柴胡 白芍 香附 延胡索 砂仁 天麻 五灵脂 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲 红豆杉
0.957844 0.638551 0.85048 0.478476 0.632713 0.903474 0.902919 0.666929 0.931807 0.408922 0.781441 0.850622
predicted yaofang:
甘草 柴胡 白芍 延胡索 砂仁 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

56. 
patient face id: 04020815397570_1_2
label yaofang:
甘草 茯苓 桔梗 浙贝母 乌梅 郁金 山药 诃子 白花蛇舌草 紫苏梗 广藿香 蜈蚣 醋鳖甲
0.987268 0.359405 0.906832 0.914255 0.328928 0.837569 0.573702 0.683225 0.760613 0.452307 0.313932 0.568661 0.63998
predicted yaofang:
甘草 法半夏 茯苓 桔梗 牛蒡子 浙贝母 郁金 山药 白花蛇舌草 紫苏梗 广藿香 蜈蚣 醋鳖甲

57. 
patient face id: 03061802223128_2_1
label yaofang:
甘草 茯苓 玉竹 太子参 生地黄 山药 山茱萸 山楂 砂仁 天花粉 三棱 鸡内金 麦芽 紫苏梗
0.83801 0.88729 0.526572 0.574844 0.395293 0.661172 0.347348 0.770605 0.469212 0.611566
predicted yaofang:
甘草 茯苓 太子参 黄芪 生地黄 山药 山茱萸 砂仁 鸡内金 麦芽

58. 
patient face id: 02120804283361_4_1
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 黄连 浙贝母 郁金 砂仁 天麻 鳖甲 豆蔻 苦杏仁 蜈蚣 白花蛇舌 天山雪莲
0.992545 0.899225 0.85548 0.480144 0.667112 0.915845 0.436881 0.463981 0.486932 0.958251 0.526107 0.737397 0.89365 0.822794
predicted yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 浙贝母 郁金 砂仁 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲

59. 
patient face id: 02020948138913_5_6_1
label yaofang:
甘草 薏苡仁 熟附子 山药 厚朴 天麻 巴戟天 鳖甲 火麻仁 败酱草 佛手 蜈蚣 天山雪莲 半枝莲
0.970454 0.640105 0.608743 0.361882 0.943694 0.828743 0.392435 0.979557 0.754253 0.786411 0.309168
predicted yaofang:
甘草 薏苡仁 山药 厚朴 天麻 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 红豆杉

60. 
patient face id: 02171905555390_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.721408 0.96572 0.983199 0.924464 0.932362 0.901751 0.977149 0.976653 0.977404 0.95927 0.926066 0.957176 0.925222 0.961428
predicted yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

61. 
patient face id: 05172138294878_1_2_5
label yaofang:
甘草 陈皮 法半夏 茯苓 党参 天麻 鳖甲 射干 苦杏仁 紫苏子 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 蜂房 四季青
0.991842 0.446726 0.843197 0.878323 0.736203 0.429695 0.794029 0.965863 0.672573 0.729631 0.942623 0.829237
predicted yaofang:
甘草 陈皮 法半夏 茯苓 党参 浙贝母 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲

62. 
patient face id: 03231446152271_2_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.742554 0.941344 0.964741 0.895718 0.894484 0.902271 0.945802 0.952345 0.95811 0.914651 0.877357 0.926448 0.882872 0.925714
predicted yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

63. 
patient face id: 04120005314309_5
label yaofang:
甘草 法半夏 黄连 栀子 泽泻 大黄 淡豆豉 紫草 皂角刺 紫苏叶
0.861279 0.558251 0.342169
predicted yaofang:
甘草 法半夏 栀子

64. 
patient face id: 05221909407436_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 黄芪 白术 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香
0.355806 0.965547 0.832383 0.78387 0.975341 0.610478 0.634247 0.340627 0.924899 0.923011 0.970158 0.891609 0.975991 0.982811 0.946833 0.899976 0.804774 0.514791
predicted yaofang:
麻黄 前胡 桔梗 半夏 防风 黄芪 白术 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄

65. 
patient face id: 04131906153040_2_1
label yaofang:
甘草 半夏 蒲公英 枸杞子 黄连 砂仁 僵蚕 莪术 柿蒂 枇杷叶 北沙参 赭石 紫苏叶 合欢皮 蛇舌草
0.761759 0.824005 0.320767 0.303938 0.645364 0.388205 0.553678 0.420956 0.734283 0.631155 0.478015 0.608194 0.854753 0.361488 0.661509 0.326978 0.56672
predicted yaofang:
甘草 半夏 薏苡仁 蒲公英 黄芪 枸杞子 白术 牡丹皮 厚朴 砂仁 僵蚕 莪术 北沙参 紫苏叶 合欢皮 预知子 蛇舌草

66. 
patient face id: 01182315196524_6_4
label yaofang:
桂枝 甘草 茯苓 前胡 浙贝母 细辛 天麻 鳖甲 款冬花 紫菀 诃子 苇茎 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.9757 0.373228 0.854848 0.761671 0.40639 0.845076 0.835412 0.891463 0.941585 0.797702 0.746063 0.318456 0.764566 0.973679 0.839046 0.891306 0.662815
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 天麻 鳖甲 款冬花 紫菀 白前 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲

67. 
patient face id: 01012047218119_1_4
label yaofang:
桂枝 葛根 桃仁 延胡索 杜仲 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.665525 0.620433 0.672564 0.385801 0.514288
predicted yaofang:
桂枝 桃仁 杜仲 牛膝 桑寄生

68. 
patient face id: 01032101314768_6_2
label yaofang:
甘草 茯苓 桔梗 麦冬 太子参 酸枣仁 五味子 生地黄 浙贝母 知母 鳖甲 白花蛇舌 天山雪莲 蜂房
0.979314 0.907045 0.854274 0.454919 0.769291 0.70986 0.605708 0.846727 0.921707 0.930236 0.656335 0.340486
predicted yaofang:
甘草 茯苓 桔梗 麦冬 太子参 酸枣仁 生地黄 浙贝母 鳖甲 白花蛇舌 天山雪莲 蜂房

69. 
patient face id: 03021205351054_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.875645 0.736788 0.906087 0.768647 0.847123 0.904327 0.895849 0.909471 0.857608 0.822884 0.880686 0.838319 0.642541
predicted yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志

70. 
patient face id: 03242123166313_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.762697 0.679933 0.493094 0.615136 0.361577 0.517799 0.75648 0.869494 0.806446 0.809911 0.687448 0.82001 0.426773
predicted yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮

71. 
patient face id: 06092009585836_1_4_7
label yaofang:
甘草 茯苓 党参 枸杞子 白术 杜仲 僵蚕 菟丝子 补骨脂 百部 苦杏仁 紫苏子 紫苏叶 蜈蚣 人参叶 骨碎补 紫苑
0.935505 0.897144 0.469039 0.709903 0.523831 0.929476 0.698549 0.337583 0.376567 0.39274 0.376976 0.396538 0.63193
predicted yaofang:
甘草 茯苓 半夏 党参 枸杞子 白术 杜仲 山药 厚朴 僵蚕 菟丝子 紫苏叶 蜈蚣

72. 
patient face id: 03081815010155_3
label yaofang:
黄芪 白术 附子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.407298 0.915324 0.909792 0.389896 0.760369 0.602871 0.873138 0.310763
predicted yaofang:
太子参 黄芪 白术 海螵蛸 干姜 砂仁 炙甘草 紫苏叶

73. 
patient face id: 02212123403940_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.816722 0.981842 0.846208 0.970984 0.933103 0.722683 0.918115 0.90252 0.961828 0.960531 0.96864 0.956332 0.909577 0.963938 0.92116 0.953245
predicted yaofang:
陈皮 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

74. 
patient face id: 06190814404475_7_6
label yaofang:
甘草 白芍 川芎 茯苓 羌活 酸枣仁 赤芍 牛膝 天麻 全蝎 白芷 蔓荆子 麦芽 合欢花
0.976017 0.320409 0.813454 0.840497 0.686712 0.542425 0.394383 0.465855 0.734502 0.426755 0.601754 0.435871
predicted yaofang:
甘草 柴胡 白芍 川芎 茯苓 酸枣仁 赤芍 牛膝 天麻 白芷 麦芽 合欢花

75. 
patient face id: 06010646418162_1_2
label yaofang:
甘草 白芍 桔梗 牛蒡子 玉竹 党参 太子参 生地黄 浙贝母 乌梅 天花粉 鳖甲 北沙参 白花蛇舌 蜂房 四季青
0.962565 0.593318 0.822379 0.305279 0.323612 0.785574 0.642603 0.909607 0.318738 0.812382 0.71574 0.848586 0.467604 0.54223
predicted yaofang:
甘草 白芍 桔梗 芦根 麦冬 太子参 生地黄 浙贝母 天花粉 鳖甲 北沙参 白花蛇舌 蜂房 四季青

76. 
patient face id: 05112030104760_1_7_4
label yaofang:
桔梗 橘红 黄芪 白术 海螵蛸 浙贝母 厚朴 生半夏 砂仁 石斛 鸡内金 蜈蚣 红豆杉 山慈菇 蛇舌草
0.824895 0.943531 0.732353 0.921997 0.703237 0.892973 0.765308 0.504758 0.426092 0.38665 0.448008 0.371202 0.363474
predicted yaofang:
黄芪 白术 海螵蛸 浙贝母 厚朴 砂仁 鸡内金 北沙参 紫苏梗 蜈蚣 红豆杉 合欢皮 蛇舌草

77. 
patient face id: 03111516539803_7_6
label yaofang:
甘草 柴胡 白芍 川芎 羌活 桃仁 红花 赤芍 栀子 牡丹皮 牛膝 细辛 天麻 全蝎 白芷
0.975925 0.43347 0.787021 0.861328 0.747968 0.335031 0.599862 0.655298 0.364313 0.8357 0.576055 0.731249
predicted yaofang:
甘草 柴胡 白芍 川芎 桃仁 生地黄 红花 赤芍 牡丹皮 牛膝 细辛 天麻

78. 
patient face id: 06191154442697_2_6
label yaofang:
甘草 川芎 枳壳 法半夏 白术 酸枣仁 槟榔 杜仲 牛膝 砂仁 天麻 桑寄生 麦芽 合欢花
0.972431 0.448146 0.316175 0.729343 0.325624 0.804164 0.678254 0.76101 0.323902 0.494543 0.549557 0.749308 0.609297
predicted yaofang:
甘草 川芎 枳壳 法半夏 党参 白术 酸枣仁 杜仲 牛膝 砂仁 天麻 桑寄生 麦芽

79. 
patient face id: 06022255192274_1_4_6
label yaofang:
甘草 陈皮 半夏 荆芥 枸杞子 浙贝母 僵蚕 白前 百部 苦杏仁 紫苏子 蝉蜕 炙麻黄 紫苏叶 紫苑 芥子
0.761518 0.679934 0.354103 0.687495 0.479499 0.426253 0.371909 0.329028 0.315532 0.344327 0.383556 0.416181 0.327904
predicted yaofang:
甘草 陈皮 前胡 半夏 浙贝母 牡丹皮 厚朴 僵蚕 款冬花 紫菀 百部 苦杏仁 紫苏叶

80. 
patient face id: 01130634088580_1_2_4
label yaofang:
甘草 茯苓 桔梗 橘红 党参 浙贝母 乌梅 鳖甲 紫菀 诃子 法夏 白花蛇舌 蜂房 岗梅根 四季青
0.947127 0.387527 0.864531 0.952505 0.327971 0.699624 0.898007 0.771314 0.863221 0.437558 0.479812
predicted yaofang:
甘草 法半夏 茯苓 桔梗 芦根 党参 浙贝母 鳖甲 白花蛇舌 蜂房 四季青

81. 
patient face id: 04102054266041_6_1_4
label yaofang:
桂枝 白芍 牛蒡子 太子参 五味子 细辛 干姜 白芷 紫菀 姜半夏 炙甘草
0.361704 0.675927 0.92849 0.438105 0.620796 0.915986 0.945936 0.594485 0.627955 0.97709
predicted yaofang:
麻黄 桂枝 白芍 牛蒡子 太子参 细辛 干姜 紫菀 姜半夏 炙甘草

82. 
patient face id: 03271537155520_4
label yaofang:
白芍 黄芩 当归 牡蛎 桃仁 黄连 熟地黄 胆南星 牛膝 苍术 地黄 石菖蒲 水蛭 三七 鸡内金 虎杖 浮小麦 麻黄根 红参 半边莲 金钗石斛
0.345323 0.364243 0.650191 0.395897 0.448129 0.385653 0.528692 0.497425 0.353328 0.347044
predicted yaofang:
桂枝 柴胡 白芍 川芎 黄芩 当归 牡蛎 桃仁 黄芪 浮小麦

83. 
patient face id: 01312124447549_1_2_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 生地黄 砂仁 天麻 五灵脂 鳖甲 女贞子 蜈蚣 天山雪莲 半枝莲 墨旱莲
0.988402 0.671783 0.896089 0.609128 0.59833 0.777522 0.603632 0.412805 0.841801 0.947935 0.901632 0.602779 0.894487 0.858564
predicted yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 生地黄 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

84. 
patient face id: 03151843219295_1_2
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 牛膝 茵陈 麦芽 赭石 龟甲
0.86331 0.562283 0.319524 0.333944 0.370798 0.382455
predicted yaofang:
甘草 白芍 龙骨 桃仁 牛膝 麦芽

85. 
patient face id: 03291647313649_1_2_6
label yaofang:
甘草 党参 酸枣仁 生地黄 山药 山茱萸 天麻 桑寄生 鳖甲 补骨脂 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.99835 0.478028 0.902542 0.558623 0.77821 0.454156 0.803468 0.724615 0.988735 0.605699 0.984711 0.965842 0.829943 0.93425 0.916407
predicted yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 杜仲 山药 山茱萸 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

86. 
patient face id: 02202303194372_5_6
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 黄连 栀子 山药 灯心草 厚朴 淡豆豉 扁豆花 豆蔻 麦芽 苦杏仁
0.996584 0.376536 0.421824 0.846202 0.877418 0.782982 0.38345 0.967423 0.659286 0.677593 0.367431 0.712982 0.489853
predicted yaofang:
甘草 柴胡 陈皮 法半夏 茯苓 薏苡仁 远志 党参 黄连 山药 厚朴 麦芽 苦杏仁

87. 
patient face id: 05251934206841_2_6
label yaofang:
茯苓 桔梗 薏苡仁 黄芪 白术 黄连 山药 砂仁 白扁豆 炙甘草 紫苏叶 合欢皮 蛇舌草
0.371732 0.832642 0.313145 0.588185 0.729583 0.982354 0.607754 0.807105 0.307063 0.450074 0.539619
predicted yaofang:
陈皮 茯苓 半夏 薏苡仁 黄芪 白术 山药 砂仁 北沙参 炙甘草 合欢皮

88. 
patient face id: 03021915153066_2_1
label yaofang:
川芎 茯苓 独活 黄芪 细辛 防己 桑寄生 秦艽 木瓜 川牛膝 北沙参 炙甘草 威灵仙 党参片 盐菟丝子 续断片
0.487679 0.470386 0.520699 0.732963 0.731086 0.903641 0.366394 0.661686 0.370945 0.731911 0.533277
predicted yaofang:
白芍 川芎 法半夏 茯苓 太子参 黄芪 山药 细辛 桑寄生 北沙参 炙甘草

89. 
patient face id: 03022001181738_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷
0.449932 0.961287 0.893466 0.612595 0.95606 0.544849 0.824626 0.934126 0.978469 0.881338 0.962812 0.962698 0.899435 0.301567 0.462337 0.402983
predicted yaofang:
麻黄 前胡 桔梗 半夏 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄

90. 
patient face id: 04111905410371_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 款冬花 紫菀 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.78633 0.948959 0.964874 0.749448 0.755136 0.939229 0.940591 0.853617 0.934256 0.926402 0.829421 0.669944 0.843845
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

91. 
patient face id: 06072117334297_1_6
label yaofang:
甘草 党参 白术 酸枣仁 杜仲 地黄 天麻 桑寄生 白花蛇舌草 续断 蜈蚣 半枝莲 醋鳖甲 牛大力
0.958492 0.607429 0.66521 0.772406 0.74181 0.624734 0.908959 0.687671 0.584687 0.526667
predicted yaofang:
甘草 党参 白术 杜仲 天麻 桑寄生 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

92. 
patient face id: 04181156248343_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.926345 0.958657 0.917946 0.945285 0.931196 0.93579 0.93282 0.921146 0.806755 0.91005 0.897654 0.889547
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

93. 
patient face id: 03151850445368_2_1
label yaofang:
桂枝 枳壳 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶
0.609658 0.75212 0.361066 0.865062 0.577871 0.369762 0.63187
predicted yaofang:
太子参 白术 海螵蛸 砂仁 麦芽 炙甘草 紫苏叶

94. 
patient face id: 02122115124088_2_6
label yaofang:
甘草 茯苓 党参 黄芪 酸枣仁 生地黄 牛膝 山药 地骨皮 蔓荆子 糯稻根 女贞子 浮小麦 首乌藤 合欢花
0.974974 0.399182 0.750004 0.854995 0.712367 0.948374 0.411921 0.93417 0.845923 0.31364 0.928756 0.660084 0.447865
predicted yaofang:
甘草 川芎 茯苓 党参 黄芪 酸枣仁 丹参 生地黄 山药 天麻 浮小麦 首乌藤 合欢花

95. 
patient face id: 04221850426233_2
label yaofang:
茯苓 葛根 麦冬 玉竹 玄参 牡丹皮 北沙参 百合 甘草片 人参叶 干石斛
0.781021 0.75911 0.345324 0.662235 0.907612 0.304845
predicted yaofang:
茯苓 麦冬 玄参 牡丹皮 北沙参 百合

96. 
patient face id: 06190128269523_1_4
label yaofang:
甘草 茯苓 前胡 桔梗 薄荷 鱼腥草 桑叶 瓜蒌皮 紫菀 麦芽 苦杏仁 炙麻黄
0.867353 0.913402 0.738246 0.779584 0.493715 0.698435 0.490024 0.619927
predicted yaofang:
甘草 茯苓 前胡 桔梗 浙贝母 款冬花 麦芽 苦杏仁

97. 
patient face id: 06141827091324_5
label yaofang:
甘草 金银花 赤芍 茵陈 香薷 板蓝根 白扁豆 土茯苓 羚羊骨
0.84011 0.491808
predicted yaofang:
甘草 赤芍

98. 
patient face id: 05222122120632_1_4_7
label yaofang:
当归 黄芪 鸡血藤 白术 丹参 厚朴 砂仁 肉苁蓉 火麻仁 鸡内金 北沙参 稻芽 冬凌草 红参
0.519493 0.982314 0.979394 0.504955 0.536454 0.736243 0.564715 0.819581 0.822868 0.319678
predicted yaofang:
当归 黄芪 白术 丹参 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

99. 
patient face id: 05232112099092_1_7
label yaofang:
陈皮 茯苓 半夏 牛蒡子 党参 枸杞子 白术 海螵蛸 杜仲 牛膝 厚朴 僵蚕 莪术 鸡内金 紫苏子 紫苏叶 骨碎补 红豆杉
0.470577 0.663129 0.673404 0.943312 0.312546 0.453343 0.360434 0.872733 0.640471 0.810113 0.311193 0.970658 0.606904 0.478334 0.771617 0.744489 0.304588
predicted yaofang:
甘草 陈皮 茯苓 半夏 党参 黄芪 枸杞子 白术 海螵蛸 杜仲 牛膝 厚朴 僵蚕 莪术 鸡内金 紫苏叶 红豆杉

100. 
patient face id: 02202221571366_6_4
label yaofang:
甘草 法半夏 前胡 桔梗 浙贝母 天麻 鳖甲 白前 苦杏仁 紫苏子 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.994617 0.933745 0.832096 0.900719 0.897298 0.369038 0.842028 0.946533 0.809017 0.559892 0.416449 0.648614 0.890921 0.901719 0.8848 0.704162
predicted yaofang:
甘草 法半夏 前胡 桔梗 浙贝母 细辛 天麻 鳖甲 款冬花 紫菀 白前 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲

101. 
patient face id: 01132326450704_5_2
label yaofang:
桂枝 麦冬 太子参 阿胶 丹参 生地黄 薤白 瓜蒌皮 姜半夏 炙甘草 三七片
0.329468 0.491305 0.698823 0.558713 0.402736 0.844514
predicted yaofang:
白芍 麦冬 太子参 丹参 生地黄 炙甘草

102. 
patient face id: 06070547548992_2_6
label yaofang:
甘草 茯苓 木香 远志 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.997169 0.934687 0.572266 0.956896 0.917493 0.672234 0.957095 0.973857 0.77143 0.95873 0.898631 0.92999 0.869521
predicted yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

103. 
patient face id: 03012053212754_6_2_4
label yaofang:
甘草 薏苡仁 党参 黄芪 生地黄 郁金 山药 天麻 鳖甲 莪术 北沙参 丝瓜络 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.99455 0.777222 0.830599 0.901186 0.434384 0.742188 0.665431 0.695422 0.986861 0.882442 0.699744 0.971177 0.9511 0.773559 0.734378
predicted yaofang:
甘草 薏苡仁 党参 黄芪 生地黄 郁金 山药 天麻 鳖甲 莪术 北沙参 蜈蚣 白花蛇舌 天山雪莲 红豆杉

104. 
patient face id: 02191218217859_1_2_4
label yaofang:
甘草 防风 羌活 薏苡仁 党参 酸枣仁 生地黄 地黄 天麻 鳖甲 粉葛 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.999411 0.358118 0.496882 0.695548 0.814634 0.495643 0.994652 0.982274 0.976048 0.922637 0.974844 0.98089
predicted yaofang:
甘草 茯苓 防风 薏苡仁 党参 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

105. 
patient face id: 05260617010198_7_2
label yaofang:
甘草 柴胡 法半夏 玄参 生地黄 赤芍 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 猫爪草
0.999845 0.633918 0.608299 0.375109 0.632132 0.830474 0.936835 0.905476 0.888446 0.850926 0.84608
predicted yaofang:
甘草 法半夏 生地黄 赤芍 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

106. 
patient face id: 03280649043639_3_7
label yaofang:
桂枝 柴胡 白芍 当归 茯苓 桃仁 党参 白术 红花 延胡索 炙甘草 女贞子 墨旱莲 两面针
0.704147 0.52434 0.950523 0.691014 0.924267 0.529831 0.795418 0.681531 0.63688
predicted yaofang:
桂枝 柴胡 白芍 当归 茯苓 桃仁 党参 白术 炙甘草

107. 
patient face id: 01211241234361_1_7
label yaofang:
桂枝 柴胡 黄芩 桔梗 牡蛎 藕节 干姜 天花粉 苦杏仁 炙甘草 蜜枇杷叶 人参叶
0.705588 0.511939 0.342464 0.491589 0.337764 0.302625 0.415052 0.524692 0.486207 0.6575
predicted yaofang:
桂枝 柴胡 白芍 桔梗 牡蛎 麦冬 浙贝母 干姜 苦杏仁 炙甘草

108. 
patient face id: 03221311417781_4_6
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 桃仁 鱼腥草 浙贝母 细辛 桑白皮 地骨皮 苇茎 苦杏仁 黄芩片
0.991578 0.942073 0.96334 0.831137 0.363734 0.778677 0.9295 0.624254 0.307628 0.795194 0.507004
predicted yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 桃仁 浙贝母 细辛 桑白皮 苦杏仁 黄芩片

109. 
patient face id: 04102104502542_3
label yaofang:
桂枝 甘草 独活 党参 黄芪 乳香 没药 豨莶草 合欢皮 海桐皮 鹿衔草 走马胎
0.415622 0.709846 0.707345 0.78799 0.440561
predicted yaofang:
桂枝 甘草 党参 黄芪 干姜

110. 
patient face id: 06171344565722_6_1
label yaofang:
甘草 肉桂 干姜 砂仁 制川乌
0.7705 0.414505 0.383483
predicted yaofang:
甘草 干姜 砂仁

111. 
patient face id: 03161711331590_2_1
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.945839 0.968286 0.837449 0.820774 0.76755 0.775163 0.936775 0.961878 0.947344 0.935953 0.975014 0.805827 0.765049 0.870425
predicted yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄

112. 
patient face id: 03180113238193_6_1
label yaofang:
柴胡 陈皮 当归 牡蛎 党参 黄芪 白术 车前子 砂仁 升麻 蝉蜕 炙甘草
0.517107 0.392492 0.730504 0.832589 0.973998 0.81153 0.452703 0.81915
predicted yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 砂仁 炙甘草

113. 
patient face id: 04182002469956_1_6
label yaofang:
甘草 白芍 川芎 独活 牛膝 细辛 干姜 蜈蚣 海桐皮 姜黄 鹿衔草
0.905828 0.942751 0.63999 0.51462 0.825221 0.883921 0.480568 0.596169
predicted yaofang:
甘草 白芍 川芎 牛膝 细辛 干姜 天麻 蜈蚣

114. 
patient face id: 05140641211587_6_1_4
label yaofang:
甘草 川芎 桃仁 丹参 红花 牛膝 水蛭 天麻 鳖甲 白花蛇舌草 浮小麦 蜈蚣 天山雪莲 半枝莲
0.984646 0.526686 0.719069 0.625606 0.78956 0.65553 0.993218 0.612819 0.447126 0.952865 0.512974 0.904901
predicted yaofang:
甘草 川芎 桃仁 丹参 红花 牛膝 天麻 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲

115. 
patient face id: 06181840070430_1_2
label yaofang:
甘草 葛根 党参 黄连 赤芍 山药 山茱萸 天麻 白花蛇舌草 玉米须 蜈蚣 半枝莲 醋鳖甲 南杏仁
0.998808 0.773573 0.440725 0.549993 0.844515 0.465638 0.810252 0.664573 0.898334 0.730211 0.560506
predicted yaofang:
甘草 党参 黄连 赤芍 山药 山茱萸 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

116. 
patient face id: 04121257317367_2_4
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.961464 0.984669 0.833354 0.926907 0.905642 0.872875 0.973697 0.983586 0.974778 0.953239 0.926393 0.912847 0.918873 0.952846
predicted yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

117. 
patient face id: 04112208554968_6
label yaofang:
甘草 甘草 法半夏 龙齿 酸枣仁 柏子仁 柏子仁 栀子 肉桂 干姜 淡豆豉 砂仁 天麻 蝉蜕 附片 百合 紫苏叶 蜈蚣
0.806448 0.594837 0.324934 0.411577 0.415157 0.646352 0.569081 0.311136 0.480103 0.411426 0.734614
predicted yaofang:
甘草 法半夏 龙骨 酸枣仁 栀子 干姜 天麻 浮小麦 百合 紫苏叶 蜈蚣

118. 
patient face id: 02171833303359_2
label yaofang:
陈皮 法半夏 前胡 防风 白芷 百部 豆蔻 炙甘草 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术 炒蔓荆子
0.706524 0.849459 0.687118 0.958101 0.342061 0.460863 0.789438 0.419668 0.513462 0.722884 0.605815 0.971707 0.774115 0.835597 0.977107 0.362705 0.350789
predicted yaofang:
陈皮 法半夏 前胡 防风 黄芪 荆芥穗 白芷 紫菀 白前 百部 豆蔻 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄 麸炒白术

119. 
patient face id: 02182002082546_2_6
label yaofang:
甘草 茯苓 桔梗 麦冬 浙贝母 郁金 地黄 天麻 诃子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 猫爪草
0.998702 0.799054 0.799868 0.369996 0.881093 0.786157 0.737267 0.836205 0.94438 0.841707 0.814316
predicted yaofang:
甘草 茯苓 桔梗 酸枣仁 浙贝母 郁金 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

120. 
patient face id: 05242105405556_2_5
label yaofang:
甘草 龙骨 党参 白术 酸枣仁 生地黄 知母 菟丝子 糯稻根 益母草 淫羊藿 仙茅 女贞子 龟甲
0.973744 0.545426 0.975298 0.88513 0.667181 0.769198 0.625941 0.455185 0.343659
predicted yaofang:
甘草 龙骨 党参 白术 酸枣仁 生地黄 菟丝子 益母草 浮小麦

121. 
patient face id: 02182312185320_4_6
label yaofang:
甘草 枳壳 连翘 薏苡仁 党参 白术 郁金 莱菔子 天麻 鳖甲 辛夷 蜈蚣 白花蛇舌 天山雪莲
0.964393 0.725303 0.861652 0.593689 0.35097 0.917794 0.938821 0.879187 0.74185 0.872737 0.327016
predicted yaofang:
甘草 薏苡仁 党参 白术 郁金 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

122. 
patient face id: 04251852246925_1
label yaofang:
当归 茯苓 白术 酒川芎
0.439695 0.90846 0.34247 0.878456
predicted yaofang:
当归 茯苓 黄芪 白术

123. 
patient face id: 03020843542164_4
label yaofang:
甘草 龙骨 酸枣仁 生地黄 知母 白茅根 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 半枝莲
0.989502 0.758109 0.603533 0.894721 0.716296 0.43901 0.52304 0.833882 0.600382 0.510457 0.576313
predicted yaofang:
甘草 酸枣仁 生地黄 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲

124. 
patient face id: 03240559184418_1
label yaofang:
桂枝 甘草 法半夏 大枣 茯苓 龙骨 牡蛎 黄芪 白术 泽泻 干姜 滑石 糯稻根 猪苓
0.678542 0.803916 0.474246 0.954871 0.577894 0.334096 0.460928 0.320947 0.683654 0.740279 0.615537
predicted yaofang:
桂枝 甘草 白芍 茯苓 龙骨 牡蛎 桃仁 党参 黄芪 白术 干姜

125. 
patient face id: 02251227179338_2
label yaofang:
陈皮 法半夏 茯苓 前胡 麦冬 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.786509 0.965036 0.805727 0.990715 0.460361 0.444062 0.468773 0.848134 0.682732 0.487191 0.977964 0.967612 0.983769 0.980518 0.928792 0.977354 0.488938 0.893455 0.961958
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 麦冬 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄

126. 
patient face id: 02141934264802_1
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 砂仁 菟丝子 巴戟天 桑寄生 火麻仁 续断 制何首乌 黄精 艾叶
0.927215 0.592463 0.896871 0.432785 0.813482 0.334864 0.789849 0.738694 0.794894
predicted yaofang:
党参 枸杞子 白术 熟地黄 杜仲 山药 砂仁 菟丝子 桑寄生

127. 
patient face id: 02151906061085_1_2
label yaofang:
川芎 当归 茯苓 独活 黄芪 细辛 防己 桑寄生 木瓜 川牛膝 地龙 炙甘草 威灵仙 党参片 盐菟丝子 续断片
0.364026 0.712941 0.78541 0.316253 0.686408 0.630103 0.932013 0.414526 0.599648 0.454792 0.57642 0.74658 0.36753 0.341033
predicted yaofang:
桂枝 白芍 川芎 法半夏 当归 太子参 黄芪 牛膝 细辛 干姜 桑寄生 炙甘草 威灵仙 麸炒白术

128. 
patient face id: 05222037493436_5
label yaofang:
金银花 蒲公英 丹参 黄连 乌梅 郁金 灯心草 厚朴 王不留行 枇杷叶 木蝴蝶 土茯苓 青天葵
0.551851 0.351232 0.723727 0.38673 0.41906 0.424464
predicted yaofang:
甘草 金银花 丹参 黄连 郁金 厚朴

129. 
patient face id: 06162245121306_1_4
label yaofang:
陈皮 茯苓 佩兰 砂仁 广藿香 甘草片 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶 炒稻芽 炒麦芽
0.92004 0.976678 0.422252 0.357012 0.487231 0.348451 0.840388 0.315145 0.453371
predicted yaofang:
陈皮 茯苓 防风 薏苡仁 砂仁 炙甘草 广藿香 甘草片 麸炒白术

130. 
patient face id: 04260640300741_1_7_4
label yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 党参 浙贝母 天麻 蔓荆子 鳖甲 莪术 白花蛇舌草 蜈蚣 红豆杉 龙葵果
0.992594 0.62532 0.853152 0.828994 0.966561 0.540259 0.668148 0.700957 0.333109 0.750037 0.302049 0.931359 0.506851
predicted yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 党参 浙贝母 天麻 鳖甲 莪术 苦杏仁 蜈蚣 红豆杉

131. 
patient face id: 04300932510868_5_2
label yaofang:
甘草 桔梗 薏苡仁 蒲公英 白术 黄连 红花 浙贝母 鳖甲 忍冬藤 白花蛇舌 天山雪莲 川木瓜 蜂房 土茯苓
0.980131 0.834626 0.704509 0.51065 0.465781 0.422844 0.706707 0.891489 0.796225 0.79647
predicted yaofang:
甘草 桔梗 薏苡仁 白术 黄连 红花 浙贝母 鳖甲 白花蛇舌 天山雪莲

132. 
patient face id: 04191711550929_1_6_4
label yaofang:
当归 牡蛎 黄芪 白术 赤芍 厚朴 火麻仁 北沙参 橘络 首乌藤 合欢皮 山慈菇 素馨花
0.54488 0.991874 0.82187 0.57051 0.682093 0.348867 0.922416 0.651805 0.614461 0.358544
predicted yaofang:
牡蛎 黄芪 白术 赤芍 厚朴 鸡内金 北沙参 首乌藤 合欢皮 山慈菇

133. 
patient face id: 04132022376503_1_5_7
label yaofang:
甘草 白芍 黄芪 白术 赤芍 海螵蛸 牡丹皮 生半夏 砂仁 茵陈 鸡内金 北沙参 红豆杉 合欢皮 预知子 蛇舌草 稻芽
0.692517 0.959847 0.372073 0.986398 0.731749 0.701377 0.436927 0.618148 0.785381 0.398256 0.377263 0.898625 0.337954 0.385837 0.388219
predicted yaofang:
甘草 黄芪 枸杞子 白术 赤芍 海螵蛸 牡丹皮 厚朴 砂仁 莪术 鸡内金 北沙参 红豆杉 合欢皮 蛇舌草

134. 
patient face id: 03062134430399_6
label yaofang:
甘草 川芎 党参 酸枣仁 杜仲 牛膝 钩藤 泽泻 天麻 石决明 桑寄生 益母草 麦芽 首乌藤
0.956686 0.833811 0.911424 0.869205 0.338826 0.314853 0.712226 0.736471 0.635525 0.437211 0.949346 0.320299 0.839019 0.505759 0.865817
predicted yaofang:
甘草 川芎 党参 酸枣仁 丹参 生地黄 杜仲 牛膝 钩藤 泽泻 天麻 菟丝子 桑寄生 麦芽 首乌藤

135. 
patient face id: 04182010470140_1
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 炙甘草 百合 紫苏叶
0.756777 0.609852 0.448449 0.48281 0.981061 0.979806 0.42117 0.971508 0.65031 0.927972 0.616723 0.559656
predicted yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 炙甘草 百合 紫苏叶

136. 
patient face id: 04182035148776_4
label yaofang:
党参 丹参 海藻 苍术 泽泻 大黄 荷叶 山楂 菟丝子 桑寄生 决明子 女贞子
0.683851 0.770932 0.319961 0.448422
predicted yaofang:
党参 丹参 牛膝 泽泻

137. 
patient face id: 05092107371144_1_4
label yaofang:
桂枝 甘草 白芍 川芎 羌活 独活 牛蒡子 牛膝 细辛 干姜 蜈蚣 海桐皮 姜黄 鹿衔草 青葙子
0.673514 0.818893 0.979105 0.549431 0.486071 0.873033 0.925951 0.310845 0.536918
predicted yaofang:
桂枝 甘草 白芍 川芎 牛膝 细辛 干姜 天麻 蜈蚣

138. 
patient face id: 05222101403330_4_7_1
label yaofang:
甘草 白芍 桔梗 薏苡仁 黄芪 白术 生地黄 海螵蛸 苍术 厚朴 火麻仁 北沙参 木蝴蝶 岗梅
0.80864 0.369731 0.372247 0.441538 0.695069 0.340376 0.597422 0.846939
predicted yaofang:
甘草 白芍 桔梗 黄芪 白术 海螵蛸 厚朴 北沙参

139. 
patient face id: 05080848357997_1_3
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.825111 0.964164 0.984501 0.919504
predicted yaofang:
当归 党参 黄芪 山药

140. 
patient face id: 01070833060641_1_7
label yaofang:
茯苓 茯苓 薏苡仁 薏苡仁 桃仁 桃仁 牡丹皮 牡丹皮 黄柏 黄柏 苍术 苍术 泽泻 泽泻 车前子 车前子 鸡内金 鸡内金 萹蓄 萹蓄 炙甘草 炙甘草 威灵仙 威灵仙 土茯苓 土茯苓
0.833216 0.506617 0.5576 0.56822 0.419582 0.308994
predicted yaofang:
茯苓 薏苡仁 桃仁 泽泻 车前子 莱菔子

141. 
patient face id: 01130633110456_1_4_6
label yaofang:
甘草 法半夏 茯苓 党参 黄连 郁金 山药 砂仁 天麻 鳖甲 莪术 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.996213 0.891249 0.931829 0.308868 0.982971 0.33626 0.384286 0.407043 0.358713 0.811756 0.824897 0.332933 0.721774 0.478254 0.963408 0.421427 0.758472 0.7197
predicted yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 黄连 郁金 山药 砂仁 天麻 鳖甲 莪术 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲

142. 
patient face id: 02202236196599_7_6_4
label yaofang:
甘草 防风 金银花 连翘 白术 红花 牡丹皮 水牛角 荆芥穗 莱菔子 火麻仁 麦芽 白鲜皮 地肤子
0.797778 0.754112 0.666451 0.608651 0.63357 0.592356 0.488164 0.354215
predicted yaofang:
甘草 防风 金银花 白术 红花 牡丹皮 麦芽 白鲜皮

143. 
patient face id: 03111433583975_7_6
label yaofang:
甘草 白芍 当归 桃仁 党参 鸡血藤 白术 生地黄 熟附子 红花 延胡索 赤芍 全蝎 制川乌 麦芽 忍冬藤 络石藤
0.3498 0.989661 0.852524 0.47754 0.616788 0.508725 0.963888 0.482992 0.936044 0.326254 0.708375 0.718631 0.395697 0.631554 0.474625 0.647095
predicted yaofang:
桂枝 甘草 白芍 川芎 当归 桃仁 党参 黄芪 白术 黄连 生地黄 红花 延胡索 赤芍 牛膝 麦芽

144. 
patient face id: 01132330588757_2_1
label yaofang:
大枣 前胡 薄荷 芦根 牛蒡子 葶苈子 玉竹 栀子 白茅根 淡豆豉 蝉蜕 白眉草
0.386174 0.310864 0.338787 0.358221
predicted yaofang:
柴胡 前胡 桔梗 炙甘草

145. 
patient face id: 04072031110674_1_2
label yaofang:
当归 党参 黄芪 鸡血藤 白术 砂仁 瓜蒌皮 补骨脂 鸡内金 北沙参 女贞子 合欢皮 稻芽
0.548657 0.765128 0.997019 0.399342 0.996394 0.792743 0.67692 0.632511 0.35024
predicted yaofang:
当归 党参 黄芪 鸡血藤 白术 砂仁 鸡内金 北沙参 合欢皮

146. 
patient face id: 04112351041774_7_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 白芷 蔓荆子 炙甘草 百合 紫苏叶
0.827746 0.569254 0.523511 0.506572 0.961951 0.9635 0.402925 0.986065 0.752832 0.391655 0.933926 0.647734 0.686835
predicted yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 白芷 炙甘草 百合 紫苏叶

147. 
patient face id: 03312120267243_4_2
label yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 肉桂 山药 山茱萸 泽泻 干姜 砂仁 菟丝子 淫羊藿 白扁豆 建曲 艾叶
0.89083 0.986028 0.315419 0.992082 0.778047 0.961419 0.957184 0.33526 0.834197 0.304727
predicted yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 山药 山茱萸 砂仁 菟丝子

148. 
patient face id: 02161838182278_1_4
label yaofang:
茯苓 海螵蛸 肉桂 干姜 豆蔻 炙甘草 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炙黄芪 炒六神曲 甘松 炒稻芽 干石斛 炒麦芽
0.689005 0.868354 0.53146 0.56731 0.53866 0.948044 0.752276 0.413904
predicted yaofang:
陈皮 茯苓 海螵蛸 干姜 豆蔻 炙甘草 广藿香 麸炒白术

149. 
patient face id: 05221851386836_5
label yaofang:
甘草 桔梗 芦根 牛蒡子 薏苡仁 桃仁 鱼腥草 黄连 黄柏 桑叶 山楂 百部 鸡内金 苦杏仁
0.89253 0.862619 0.401229 0.451888 0.414632 0.594072 0.53819
predicted yaofang:
甘草 桔梗 牛蒡子 薏苡仁 桃仁 浙贝母 苦杏仁

150. 
patient face id: 04071400545306_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.902037 0.916308 0.900843 0.924661 0.90634 0.880554 0.85316 0.878841 0.909367 0.845289 0.848738 0.812889
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

151. 
patient face id: 02120925480463_6_7_1
label yaofang:
甘草 柴胡 茯苓 薏苡仁 桃仁 党参 延胡索 赤芍 牡丹皮 川楝子 乌药 五灵脂 益母草 吴茱萸 麦芽
0.992992 0.556264 0.88866 0.530613 0.613977 0.912307 0.639064 0.35417 0.613618
predicted yaofang:
甘草 柴胡 茯苓 薏苡仁 桃仁 党参 赤芍 牡丹皮 麦芽

152. 
patient face id: 03291344015485_5
label yaofang:
甘草 川芎 茯苓 葛根 桔梗 防风 白术 浙贝母 天麻 蔓荆子 辛夷 蜈蚣 半枝莲 醋鳖甲
0.982144 0.414191 0.700906 0.809359 0.445059 0.782633 0.472753 0.881619 0.488101 0.395193 0.468274 0.725617 0.679448 0.549542
predicted yaofang:
甘草 川芎 茯苓 桔梗 防风 白术 浙贝母 天麻 白芷 白花蛇舌草 辛夷 蜈蚣 半枝莲 醋鳖甲

153. 
patient face id: 06072250294527_1_2
label yaofang:
甘草 白芍 陈皮 薏苡仁 党参 白术 山药 天麻 鳖甲 白扁豆 建曲 蜈蚣 天山雪莲 半枝莲
0.981056 0.566737 0.351947 0.92187 0.890917 0.759441 0.916609 0.944359 0.890025 0.972732 0.345257 0.820391 0.858708
predicted yaofang:
甘草 白芍 陈皮 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

154. 
patient face id: 03141232217844_3_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 干姜 鸡内金
0.587449 0.792626 0.659164 0.827744 0.887471 0.875852 0.722583 0.595375
predicted yaofang:
桂枝 甘草 白芍 茯苓 党参 黄芪 白术 干姜

155. 
patient face id: 01180602171656_1_2
label yaofang:
甘草 桔梗 麦冬 太子参 丹参 浙贝母 鳖甲 诃子 北沙参 鹿角霜 百合 白花蛇舌 天山雪莲 蜂房
0.769791 0.837061 0.617311 0.691237 0.309323 0.82565 0.836384 0.743945 0.841535
predicted yaofang:
甘草 桔梗 麦冬 太子参 丹参 浙贝母 鳖甲 北沙参 白花蛇舌

156. 
patient face id: 02170847109438_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.931834 0.923173 0.867027 0.934103 0.904927 0.920997 0.882656 0.897476 0.876066 0.876625 0.867215 0.855726
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

157. 
patient face id: 05260713547048_5
label yaofang:
甘草 茯苓 党参 白术 栀子 山药 灯心草 淡豆豉 天麻 扁豆花 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 木棉花 鸡蛋花
0.99617 0.866449 0.891544 0.777201 0.707005 0.917456 0.58353 0.889131 0.783398 0.607636
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲

158. 
patient face id: 03282208494275_1_6
label yaofang:
桂枝 大枣 龙骨 牡蛎 太子参 生地黄 肉桂 干姜 淫羊藿 火麻仁 炙甘草 附片
0.526032 0.327964 0.52365 0.341117 0.465219 0.386041 0.353406 0.752886 0.811645
predicted yaofang:
桂枝 白芍 龙骨 牡蛎 太子参 黄芪 生地黄 干姜 炙甘草

159. 
patient face id: 04081620477456_1_4_7
label yaofang:
甘草 法半夏 橘红 防风 金银花 太子参 藿香 白前 鸡内金 辛夷 蜜百部 干鱼腥草
0.753386 0.347482 0.792078 0.59818 0.43669 0.392455 0.305687 0.455287
predicted yaofang:
甘草 陈皮 法半夏 防风 金银花 太子参 鸡内金 辛夷

160. 
patient face id: 03291932235567_1_2
label yaofang:
甘草 香附 茯苓 党参 白术 酸枣仁 生地黄 杜仲 山药 菟丝子 王不留行 续断 黄芩片 合欢花
0.993023 0.992792 0.911628 0.941498 0.736981 0.851006 0.691973 0.718726 0.409981 0.318153 0.443662
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 杜仲 山药 菟丝子 桑寄生 合欢花

161. 
patient face id: 03041422455844_3_5_6
label yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 酸枣仁 丹参 熟附子 山茱萸 桑白皮 大黄 荆芥穗 菟丝子 益母草 款冬花
0.897195 0.530676 0.318553 0.991139 0.970402 0.434146 0.816415 0.616697 0.318838 0.395231
predicted yaofang:
甘草 白芍 川芎 茯苓 党参 黄芪 白术 酸枣仁 丹参 菟丝子

162. 
patient face id: 03221319500926_6_2_7
label yaofang:
甘草 党参 酸枣仁 浙贝母 郁金 山药 天麻 鳖甲 女贞子 浮小麦 蜈蚣 白花蛇舌 半枝莲 红豆杉 墨旱莲
0.998223 0.913872 0.822718 0.708036 0.846969 0.67698 0.969561 0.95089 0.571588 0.983112 0.863222 0.741156 0.837677 0.482509
predicted yaofang:
甘草 党参 酸枣仁 浙贝母 郁金 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉

163. 
patient face id: 02182250153830_4_1
label yaofang:
甘草 茯苓 远志 党参 鸡血藤 白术 酸枣仁 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.993539 0.877797 0.611309 0.971208 0.899135 0.747316 0.672608 0.989699 0.593386 0.920821 0.978361 0.759582 0.907905 0.866176
predicted yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

164. 
patient face id: 06181704221521_2_1
label yaofang:
甘草 半夏 黄芪 枸杞子 黄连 牡丹皮 杜仲 僵蚕 莪术 柿蒂 枇杷叶 北沙参 赭石 紫苏叶 合欢皮 蛇舌草
0.76808 0.760797 0.95753 0.712586 0.551562 0.331718 0.383311 0.348397 0.807941 0.640264 0.686326 0.571987 0.565115 0.890349 0.503913 0.701418 0.416199 0.570174
predicted yaofang:
甘草 半夏 黄芪 枸杞子 白术 黄连 生地黄 赤芍 牡丹皮 杜仲 厚朴 僵蚕 莪术 北沙参 紫苏叶 合欢皮 预知子 蛇舌草

165. 
patient face id: 03311656017417_1_6
label yaofang:
桃仁 党参 枸杞子 白术 熟地黄 杜仲 牛膝 砂仁 菟丝子 巴戟天 桑寄生 续断 制何首乌 艾叶
0.547718 0.79106 0.309707 0.482287 0.844475 0.302586 0.859689 0.749601 0.596125 0.636401 0.801435
predicted yaofang:
桃仁 党参 黄芪 枸杞子 白术 熟地黄 杜仲 牛膝 砂仁 菟丝子 桑寄生

166. 
patient face id: 03282213324820_5_2
label yaofang:
甘草 茯苓 桔梗 薄荷 牛蒡子 党参 浙贝母 天花粉 鳖甲 诃子 黄芩片 白花蛇舌 天山雪莲 四季青
0.998453 0.91016 0.949009 0.360659 0.378421 0.776443 0.941441 0.957572 0.450008 0.525965 0.950653 0.621326 0.420703
predicted yaofang:
甘草 茯苓 桔梗 芦根 牛蒡子 党参 浙贝母 鳖甲 苦杏仁 黄芩片 白花蛇舌 天山雪莲 四季青

167. 
patient face id: 05162138495065_1_2_6
label yaofang:
甘草 茯苓 党参 太子参 酸枣仁 丹参 红花 山药 天麻 白芷 鳖甲 皂角刺 浮小麦 蜈蚣 白花蛇舌 天山雪莲
0.973587 0.916169 0.758851 0.727837 0.535583 0.629573 0.958047 0.951047 0.499213 0.829595 0.836712 0.782227 0.528578
predicted yaofang:
甘草 茯苓 党参 酸枣仁 丹参 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

168. 
patient face id: 05080844507562_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.929988 0.929111 0.923613 0.944084 0.887669 0.888567 0.888817 0.91112 0.899118 0.870849 0.8764 0.841172
predicted yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

169. 
patient face id: 03020658058921_6_1
label yaofang:
甘草 香附 桃仁 生地黄 赤芍 牡丹皮 山茱萸 天麻 鳖甲 莪术 佛手 浮小麦 蜈蚣 白花蛇舌 半枝莲
0.999025 0.31156 0.845738 0.586633 0.423537 0.871851 0.8729 0.435895 0.502229 0.957426 0.616009 0.675549 0.70067
predicted yaofang:
甘草 桃仁 生地黄 赤芍 牡丹皮 天麻 鳖甲 莪术 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

170. 
patient face id: 03091845428922_1_4
label yaofang:
陈皮 法半夏 前胡 防风 黄芪 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 麸炒白术
0.678902 0.844483 0.948043 0.914784 0.861019 0.70207 0.918233 0.888688 0.874343 0.956567 0.950177 0.786782 0.528974 0.555888 0.688201
predicted yaofang:
陈皮 法半夏 前胡 防风 黄芪 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

171. 
patient face id: 05191953220086_1_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 郁金 山药 石菖蒲 天麻 鳖甲 扁豆花 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.999588 0.946429 0.968371 0.762098 0.640085 0.538943 0.722874 0.97561 0.960707 0.956759 0.798249 0.870436 0.817115
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 郁金 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

172. 
patient face id: 05022139537858_1
label yaofang:
甘草 陈皮 茯苓 党参 黄芪 白术 浙贝母 山药 鳖甲 补骨脂 白花蛇舌 天山雪莲 蜂房 岗梅根
0.992492 0.946181 0.799875 0.467284 0.892405 0.506383 0.793514 0.418236 0.899484 0.408079 0.80406 0.458137
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 浙贝母 山药 砂仁 鳖甲 蜈蚣 白花蛇舌 天山雪莲

173. 
patient face id: 04282013247881_4_1_6
label yaofang:
甘草 陈皮 法半夏 茯苓 木香 党参 白术 黄连 厚朴 佩兰 砂仁 扁豆花 柿蒂 豆蔻 麦芽 紫苏梗 稻芽 稻芽
0.936967 0.7276 0.943988 0.961268 0.364662 0.305462 0.945768 0.301079 0.935785 0.742242 0.379484 0.483163 0.787958 0.33299 0.305782 0.708223 0.791465 0.380339
predicted yaofang:
甘草 陈皮 法半夏 茯苓 木香 薏苡仁 党参 黄芪 白术 黄连 海螵蛸 厚朴 砂仁 鸡内金 豆蔻 麦芽 紫苏梗 广藿香

174. 
patient face id: 03151925242935_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 太子参 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.656744 0.883009 0.962645 0.78168 0.562475 0.637164 0.913688 0.955519 0.943658 0.416217 0.739466 0.754746 0.800298 0.978301 0.321618
predicted yaofang:
麻黄 桂枝 白芍 牛蒡子 太子参 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶

175. 
patient face id: 03290715081744_5
label yaofang:
甘草 黄芩 前胡 桔梗 薄荷 牛蒡子 桃仁 浙贝母 桑白皮 白前 枇杷叶 苦杏仁
0.743815 0.400102 0.62891 0.97655 0.465848 0.520659 0.969334 0.524989 0.334695 0.322897 0.819797
predicted yaofang:
甘草 法半夏 前胡 桔梗 牛蒡子 桃仁 浙贝母 款冬花 紫菀 白前 苦杏仁

176. 
patient face id: 01070834571715_1_4_6
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.860631 0.936179 0.835822 0.869016 0.881907 0.842007 0.922433 0.881703 0.825266 0.870832 0.805462 0.568948
predicted yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志

177. 
patient face id: 05262102230378_2_4_1
label yaofang:
甘草 茯苓 薏苡仁 酸枣仁 生地黄 浙贝母 郁金 山药 山茱萸 车前子 天麻 猪苓 鳖甲 白花蛇舌草 蜈蚣 红豆杉
0.99921 0.921663 0.404134 0.567856 0.36645 0.35974 0.823651 0.69083 0.333856 0.913099 0.654077 0.302516 0.913996 0.315045 0.420383 0.366894
predicted yaofang:
甘草 茯苓 薏苡仁 酸枣仁 生地黄 浙贝母 郁金 山药 山茱萸 天麻 鳖甲 白花蛇舌草 蜈蚣 白花蛇舌 半枝莲 红豆杉

178. 
patient face id: 03020755441836_1_2_6
label yaofang:
甘草 党参 酸枣仁 赤芍 山药 天麻 鳖甲 浮小麦 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫
0.994765 0.918195 0.682798 0.402226 0.727008 0.962492 0.975295 0.73415 0.917071 0.851218 0.933618 0.896338
predicted yaofang:
甘草 党参 酸枣仁 赤芍 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲

179. 
patient face id: 02020848231642_1_6
label yaofang:
甘草 茯苓 薏苡仁 党参 黄柏 苍术 厚朴 天麻 鳖甲 火麻仁 补骨脂 蜈蚣 天山雪莲 半枝莲
0.99758 0.760207 0.79699 0.679138 0.349712 0.389232 0.887189 0.732916 0.890267 0.75065 0.817444
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 厚朴 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

180. 
patient face id: 04202108513924_6_1
label yaofang:
党参 枸杞子 白术 柏子仁 熟地黄 海螵蛸 杜仲 菟丝子 巴戟天 桑寄生 续断 制何首乌 艾叶
0.748821 0.484014 0.90194 0.322218 0.468188 0.828429 0.439504 0.348978 0.526505 0.744424 0.320867
predicted yaofang:
党参 枸杞子 白术 熟地黄 海螵蛸 杜仲 牛膝 砂仁 菟丝子 桑寄生 炙甘草

181. 
patient face id: 05191952517503_1_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 郁金 山药 石菖蒲 天麻 鳖甲 扁豆花 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.999588 0.946429 0.968371 0.762098 0.640085 0.538943 0.722874 0.97561 0.960707 0.956759 0.798249 0.870436 0.817115
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 郁金 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

182. 
patient face id: 02020950137737_6_5
label yaofang:
甘草 柴胡 白芍 当归 茯苓 党参 白术 酸枣仁 生地黄 栀子 牡丹皮 黄芩片 合欢花
0.98976 0.88239 0.901458 0.392139 0.994712 0.921091 0.885925 0.549547 0.853094 0.611087 0.344533
predicted yaofang:
甘草 柴胡 白芍 当归 茯苓 党参 白术 酸枣仁 生地黄 牡丹皮 合欢花

183. 
patient face id: 03221324312196_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子 木贼 素馨花
0.622927 0.816782 0.969474 0.885813 0.925471 0.788856 0.959916 0.938362 0.913196 0.959105 0.902286 0.898098 0.308801 0.582047 0.384194 0.823401 0.471706
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄 炒苍耳子

184. 
patient face id: 04051927225104_1
label yaofang:
桂枝 甘草 当归 半夏 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 厚朴 砂仁 肉苁蓉 巴戟天 桑寄生 补骨脂 紫苏叶 骨碎补
0.351487 0.300541 0.317553 0.558848 0.820764 0.977269 0.529255 0.958156 0.348047 0.794176 0.932783 0.776627 0.464769 0.460368 0.598109 0.335593 0.417532
predicted yaofang:
桂枝 甘草 白芍 当归 半夏 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 厚朴 砂仁 僵蚕 桑寄生 补骨脂 紫苏叶

185. 
patient face id: 05090803301884_1_4_7
label yaofang:
葛根 桃仁 杜仲 牛膝 天麻 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.506128 0.836804 0.72655 0.504016 0.730378
predicted yaofang:
桃仁 杜仲 牛膝 天麻 桑寄生

186. 
patient face id: 01061601125917_5_6
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 鱼腥草 浙贝母 郁金 桑白皮 天麻 鳖甲 款冬花 紫菀 苦杏仁 蜈蚣 半枝莲
0.994528 0.915653 0.885068 0.655201 0.880935 0.685885 0.963874 0.418298 0.526561 0.675955 0.800959 0.536469 0.736099 0.875588 0.416615 0.40525
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 薏苡仁 浙贝母 郁金 天麻 鳖甲 款冬花 紫菀 苦杏仁 蜈蚣 白花蛇舌 半枝莲

187. 
patient face id: 03041421382814_2
label yaofang:
甘草 白芍 薏苡仁 红花 赤芍 山茱萸 鳖甲 莪术 浮小麦 蜈蚣 白花蛇舌 川木瓜 红豆杉 宽筋藤 龙葵果
0.980666 0.351405 0.772574 0.626296 0.385405 0.758585 0.784815 0.804116 0.491096 0.327327 0.375127
predicted yaofang:
甘草 白芍 薏苡仁 赤芍 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 红豆杉

188. 
patient face id: 04150747128194_1_2
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 白术 丹参 枳实 竹茹 胆南星 厚朴
0.946736 0.817767 0.930868 0.684289 0.969722 0.785148 0.798447 0.766425 0.743541
predicted yaofang:
甘草 法半夏 茯苓 桃仁 党参 黄芪 白术 丹参 厚朴

189. 
patient face id: 02272158459546_6_4
label yaofang:
桂枝 甘草 甘草 白芍 川芎 川芎 陈皮 枳壳 当归 茯苓 龙骨 牡蛎 牛蒡子 远志 麦冬 党参 酸枣仁 柏子仁 竹茹 牡丹皮 吴茱萸 姜半夏 姜半夏
0.681074 0.9222 0.452472 0.948485 0.325018 0.304767 0.934509 0.494261 0.517723 0.626828 0.596469 0.856968 0.434736 0.35355 0.330877 0.61577 0.410089 0.48734 0.404872 0.435455
predicted yaofang:
桂枝 甘草 柴胡 白芍 川芎 当归 茯苓 龙骨 牡蛎 远志 麦冬 党参 酸枣仁 柏子仁 栀子 牡丹皮 干姜 姜半夏 炙甘草 百合

190. 
patient face id: 04132045505339_2_1_5
label yaofang:
甘草 茯苓 桔梗 牛蒡子 麦冬 党参 丹参 浙贝母 天花粉 鳖甲 黄芩片 白花蛇舌 蜂房 四季青
0.982456 0.826203 0.898332 0.313596 0.310392 0.416804 0.845852 0.503231 0.960755 0.678298 0.367069 0.448217 0.733896 0.447451 0.447381
predicted yaofang:
甘草 茯苓 桔梗 芦根 牛蒡子 麦冬 党参 丹参 浙贝母 鳖甲 苦杏仁 黄芩片 白花蛇舌 蜂房 四季青

191. 
patient face id: 05051928228293_5
label yaofang:
柴胡 葛根 连翘 薄荷 玄参 浙贝母 滑石 射干 广藿香 黄芩片 木蝴蝶
0.423949 0.741951 0.430998 0.304526 0.567808
predicted yaofang:
甘草 柴胡 桔梗 薄荷 浙贝母

192. 
patient face id: 03312117577276_5
label yaofang:
甘草 法半夏 桔梗 金银花 连翘 芦根 牛蒡子 浙贝母 诃子 麦芽 苦杏仁 板蓝根 炙麻黄 四季青
0.991723 0.608998 0.98529 0.520203 0.358638 0.39048 0.581239 0.986453 0.837845 0.438172 0.340749 0.389358
predicted yaofang:
甘草 法半夏 桔梗 金银花 连翘 芦根 牛蒡子 浙贝母 苦杏仁 黄芩片 蜂房 四季青

193. 
patient face id: 06062157305351_4_2
label yaofang:
白芍 川芎 茯苓 防风 丹参 郁金 钩藤 天麻 白芷 石决明 北柴胡 炙甘草 首乌藤 广藿香 炒蔓荆子
0.31091 0.8249 0.64398 0.804749 0.521084 0.614708 0.569158 0.674259 0.650589 0.680544 0.810692 0.485826 0.486909
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄

194. 
patient face id: 01092051141685_6_2
label yaofang:
玉竹 黄芪 乌梅 郁金 砂仁 天花粉 金樱子 鸡内金 桑螵蛸 北沙参 冬凌草
0.330052 0.917229 0.549764 0.571597 0.325515 0.801041
predicted yaofang:
麦冬 黄芪 郁金 砂仁 鸡内金 北沙参

195. 
patient face id: 01061604289217_5
label yaofang:
麻黄 甘草 法半夏 茯苓 桔梗 鱼腥草 浙贝母 细辛 桑白皮 莱菔子 款冬花 苦杏仁 紫苏子 黄芩片
0.954513 0.957892 0.917054 0.810459 0.917374 0.960614 0.871502 0.347989 0.892457 0.702763 0.401858 0.911967 0.604328 0.644723
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 桑白皮 款冬花 紫菀 白前 苦杏仁 紫苏子 黄芩片

196. 
patient face id: 01190618050244_1_2_6
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 首乌藤 沙苑子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.998293 0.946835 0.615248 0.962272 0.960856 0.681223 0.967509 0.974855 0.626661 0.55785 0.884231 0.932825 0.952607 0.881491
predicted yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲

197. 
patient face id: 06190627350227_2_7
label yaofang:
甘草 川芎 龙骨 桃仁 党参 枸杞子 酸枣仁 红花 杜仲 山药 钩藤 天麻 桑寄生 女贞子 浮小麦 墨旱莲
0.904405 0.496602 0.576352 0.935552 0.368373 0.712677 0.403186 0.355285 0.693856 0.52411 0.681909 0.391677 0.854853 0.766749 0.562398 0.386062
predicted yaofang:
甘草 川芎 桃仁 党参 黄芪 酸枣仁 生地黄 红花 杜仲 牛膝 山药 山茱萸 天麻 桑寄生 浮小麦 首乌藤

198. 
patient face id: 06111116378668_5
label yaofang:
甘草 川芎 陈皮 法半夏 茯苓 前胡 桔梗 牛蒡子 白术 浙贝母 牛膝 天麻 款冬花 紫苏梗 黄芩片
0.973642 0.355177 0.960236 0.96216 0.492282 0.872484 0.492951 0.923416 0.732974 0.354076 0.652008 0.394125
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 白术 浙贝母 款冬花 紫菀 紫苏梗 黄芩片

199. 
patient face id: 01250636099448_5_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 薏苡仁 桃仁 鱼腥草 远志 浙贝母 款冬花 苇茎 苦杏仁 紫苏子
0.942266 0.964787 0.964852 0.713332 0.915278 0.42302 0.518566 0.379013 0.813462 0.814589 0.500367 0.870209 0.310295
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 薏苡仁 桃仁 远志 浙贝母 款冬花 紫菀 苦杏仁 紫苏子