5184/8539 [=================>............] - ETA: 39s - loss: 0.17682017-10-20 15:39:38.139694: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:247] PoolAllocator: After 31395 get requests, put_count=31392 evicted_count=1000 eviction_rate=0.0318552 and unsatisfied allocation rate=0.035133
2017-10-20 15:39:38.139755: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
8512/8539 [============================>.] - ETA: 0s - loss: 0.1492Epoch 00000: val_loss improved from inf to 0.08876, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 102s - loss: 0.1491 - val_loss: 0.0888
Epoch 2/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0959Epoch 00001: val_loss improved from 0.08876 to 0.08266, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0959 - val_loss: 0.0827
Epoch 3/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0901Epoch 00002: val_loss improved from 0.08266 to 0.07914, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0900 - val_loss: 0.0791
Epoch 4/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0870Epoch 00003: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0870 - val_loss: 0.0800
Epoch 5/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0847Epoch 00004: val_loss improved from 0.07914 to 0.07872, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0847 - val_loss: 0.0787
Epoch 6/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0840Epoch 00005: val_loss improved from 0.07872 to 0.07620, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0840 - val_loss: 0.0762
Epoch 7/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0825Epoch 00006: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0825 - val_loss: 0.0766
Epoch 8/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0817Epoch 00007: val_loss improved from 0.07620 to 0.07564, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0818 - val_loss: 0.0756
Epoch 9/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0808Epoch 00008: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0808 - val_loss: 0.0784
Epoch 10/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0803Epoch 00009: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0803 - val_loss: 0.0759
Epoch 11/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0796Epoch 00010: val_loss improved from 0.07564 to 0.07434, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0796 - val_loss: 0.0743
Epoch 12/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0792Epoch 00011: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0792 - val_loss: 0.0758
Epoch 13/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0787Epoch 00012: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0787 - val_loss: 0.0747
Epoch 14/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0783Epoch 00013: val_loss improved from 0.07434 to 0.07368, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0783 - val_loss: 0.0737
Epoch 15/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0776Epoch 00014: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0776 - val_loss: 0.0737
Epoch 16/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0771Epoch 00015: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0771 - val_loss: 0.0739
Epoch 17/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0769Epoch 00016: val_loss improved from 0.07368 to 0.07353, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0768 - val_loss: 0.0735
Epoch 18/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0765Epoch 00017: val_loss improved from 0.07353 to 0.07293, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0765 - val_loss: 0.0729
Epoch 19/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0761Epoch 00018: val_loss improved from 0.07293 to 0.07277, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0762 - val_loss: 0.0728
Epoch 20/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0759Epoch 00019: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0759 - val_loss: 0.0731
Epoch 21/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0754Epoch 00020: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0754 - val_loss: 0.0729
Epoch 22/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0753Epoch 00021: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0753 - val_loss: 0.0740
Epoch 23/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0751Epoch 00022: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0751 - val_loss: 0.0731
Epoch 24/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0745Epoch 00023: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0745 - val_loss: 0.0735
Epoch 25/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0744Epoch 00024: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0744 - val_loss: 0.0731
Epoch 26/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0737Epoch 00025: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0737 - val_loss: 0.0729
Epoch 27/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0738Epoch 00026: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0738 - val_loss: 0.0729
Epoch 28/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0735Epoch 00027: val_loss improved from 0.07277 to 0.07270, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0735 - val_loss: 0.0727
Epoch 29/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0731Epoch 00028: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0731 - val_loss: 0.0730
Epoch 30/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0728Epoch 00029: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0728 - val_loss: 0.0739
Epoch 31/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0728Epoch 00030: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0728 - val_loss: 0.0744
Epoch 32/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0727Epoch 00031: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0727 - val_loss: 0.0735
Epoch 33/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0721Epoch 00032: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0722 - val_loss: 0.0732
Epoch 34/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0719Epoch 00033: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0719 - val_loss: 0.0728
Epoch 35/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0716Epoch 00034: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0716 - val_loss: 0.0749
Epoch 36/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0715Epoch 00035: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0715 - val_loss: 0.0737
Epoch 37/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0712Epoch 00036: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0711 - val_loss: 0.0729
Epoch 38/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0708Epoch 00037: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0709 - val_loss: 0.0737
Epoch 39/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0706Epoch 00038: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0706 - val_loss: 0.0734
Epoch 40/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0703Epoch 00039: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0704 - val_loss: 0.0732
Epoch 41/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0703Epoch 00040: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0703 - val_loss: 0.0738
Epoch 42/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0700Epoch 00041: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0700 - val_loss: 0.0735
Epoch 43/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0697Epoch 00042: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0697 - val_loss: 0.0738
Epoch 44/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0695Epoch 00043: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0695 - val_loss: 0.0733
Epoch 45/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0694Epoch 00044: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0694 - val_loss: 0.0737
Epoch 46/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0693Epoch 00045: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0692 - val_loss: 0.0740
Epoch 47/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0687Epoch 00046: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0687 - val_loss: 0.0732
Epoch 48/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0688Epoch 00047: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0688 - val_loss: 0.0733
Epoch 49/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0684Epoch 00048: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0684 - val_loss: 0.0735
Epoch 50/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0681Epoch 00049: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0681 - val_loss: 0.0740
Epoch 51/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0679Epoch 00050: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0679 - val_loss: 0.0742
Epoch 52/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0676Epoch 00051: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0677 - val_loss: 0.0734
Epoch 53/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0676Epoch 00052: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0676 - val_loss: 0.0739
Epoch 54/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0672Epoch 00053: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0672 - val_loss: 0.0737
Epoch 55/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0670Epoch 00054: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0670 - val_loss: 0.0743
Epoch 56/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0667Epoch 00055: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0667 - val_loss: 0.0742
Epoch 57/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0664Epoch 00056: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0664 - val_loss: 0.0741
Epoch 58/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0662Epoch 00057: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0662 - val_loss: 0.0747
Epoch 59/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00058: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0660 - val_loss: 0.0740
Epoch 60/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0657Epoch 00059: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0657 - val_loss: 0.0750
Epoch 61/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0654Epoch 00060: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0654 - val_loss: 0.0748
Epoch 62/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0653Epoch 00061: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0653 - val_loss: 0.0746
Epoch 63/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0652Epoch 00062: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0652 - val_loss: 0.0751
Epoch 64/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0648Epoch 00063: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0648 - val_loss: 0.0752
Epoch 65/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0647Epoch 00064: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0647 - val_loss: 0.0752
Epoch 66/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0644Epoch 00065: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0644 - val_loss: 0.0750
Epoch 67/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0641Epoch 00066: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0641 - val_loss: 0.0749
Epoch 68/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0640Epoch 00067: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0640 - val_loss: 0.0752
Epoch 69/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0640Epoch 00068: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0640 - val_loss: 0.0752
Epoch 70/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0637Epoch 00069: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0637 - val_loss: 0.0756
Epoch 71/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0634Epoch 00070: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0634 - val_loss: 0.0758
Epoch 72/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0632Epoch 00071: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0632 - val_loss: 0.0761
Epoch 73/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0630Epoch 00072: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0630 - val_loss: 0.0758
Epoch 74/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0627Epoch 00073: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0627 - val_loss: 0.0767
Epoch 75/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0626Epoch 00074: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0626 - val_loss: 0.0761
Epoch 76/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0624Epoch 00075: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0625 - val_loss: 0.0765
Epoch 77/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0623Epoch 00076: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0622 - val_loss: 0.0764
Epoch 78/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0621Epoch 00077: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0621 - val_loss: 0.0770
Epoch 79/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0618Epoch 00078: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0618 - val_loss: 0.0766
Epoch 80/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0617Epoch 00079: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0617 - val_loss: 0.0760
history: [(0.14906243302843333, None, 0.088757864967152308, None), (0.095891560709564422, None, 0.082655872999530131, None), (0.090049077960112731, None, 0.079142452405267585, None), (0.086982030305884486, None, 0.079992194260869703, None), (0.084695810096327262, None, 0.078718938506566555, None), (0.083988273462418273, None, 0.076204181836419929, None), (0.082477913583305015, None, 0.076573568304161455, None), (0.081751514549472604, None, 0.075641333319983642, None), (0.08081471287774207, None, 0.078374737402894995, None), (0.080250515347203344, None, 0.075903776910278817, None), (0.079578285609961025, None, 0.074343535080279188, None), (0.079161447958981682, None, 0.075814816432121471, None), (0.078657310740047823, None, 0.074704253575304053, None), (0.078256090039991358, None, 0.073683533312636856, None), (0.07764631609075423, None, 0.073737604823304617, None), (0.077121907260758849, None, 0.073867760789700046, None), (0.07683938430014281, None, 0.073530386382843552, None), (0.076513708743289333, None, 0.072926034311671828, None), (0.076158893108018905, None, 0.072774643317247048, None), (0.075918375643037606, None, 0.073127444519664783, None), (0.075426475452600561, None, 0.072909655806782478, None), (0.075305825983881886, None, 0.073951462577114171, None), (0.075081430306645713, None, 0.073121116274879092, None), (0.074530710869426545, None, 0.073474419832011278, None), (0.074357101846661278, None, 0.073112435447864041, None), (0.073740021177862131, None, 0.072928274234572613, None), (0.073827151246198736, None, 0.072914972300931205, None), (0.073543495086215535, None, 0.072704193902103018, None), (0.073109590542345754, None, 0.073039124191025678, None), (0.0728190322269711, None, 0.073881470485702982, None), (0.072777262399683573, None, 0.074407474516512279, None), (0.072672174623342287, None, 0.073510481133347461, None), (0.072150513974770625, None, 0.073159405108773223, None), (0.071913666297232379, None, 0.07279773127465021, None), (0.071635178278419226, None, 0.074867391269722264, None), (0.071466068919459697, None, 0.073735715978311536, None), (0.071148975355617608, None, 0.07290281832982333, None), (0.070856806309179343, None, 0.073658405233433838, None), (0.070552162740552773, None, 0.073421069253713653, None), (0.07035174626093138, None, 0.073174437432935391, None), (0.070288117189278354, None, 0.073813120169298987, None), (0.070018016448455386, None, 0.073477904356661294, None), (0.069723694104823875, None, 0.073814284752358447, None), (0.069514357770741553, None, 0.073267788186178101, None), (0.069380783960737991, None, 0.073729964457588754, None), (0.069244033321415405, None, 0.074037874028796247, None), (0.068690520749743786, None, 0.073223292581982666, None), (0.068839996337667256, None, 0.073335680414687146, None), (0.068409106546158061, None, 0.073490749730731983, None), (0.068101018721318268, None, 0.073968607645768389, None), (0.067942642446793641, None, 0.074229438089844071, None), (0.067660790238241938, None, 0.073390883294653986, None), (0.067584375471194294, None, 0.073880891332696208, None), (0.067201680224901458, None, 0.073671834045277412, None), (0.067039443376067376, None, 0.074329569853924138, None), (0.066707249130084731, None, 0.074238693102812156, None), (0.066396382471649265, None, 0.07410077505059294, None), (0.066172972509977987, None, 0.074683101158657353, None), (0.066015009373157699, None, 0.074000536958813229, None), (0.065673084503133736, None, 0.075000857477223043, None), (0.065444057360370012, None, 0.07477966955293229, None), (0.065270878565661841, None, 0.074634079122063005, None), (0.065160450290106323, None, 0.075139639796791502, None), (0.064827837821718734, None, 0.075227684099158962, None), (0.064719984942436609, None, 0.075216554050698825, None), (0.064362261428188308, None, 0.074972870367350591, None), (0.06411303517115606, None, 0.074927930293720718, None), (0.064021071600389085, None, 0.075247971402419789, None), (0.06399858238801337, None, 0.075203236779232172, None), (0.063720165380501528, None, 0.075647146055549924, None), (0.063400134544578338, None, 0.075793697611316213, None), (0.063210755133778218, None, 0.076102358954293389, None), (0.062984875685937067, None, 0.075818814637460111, None), (0.062697680493626298, None, 0.076724742003631247, None), (0.06261095918810107, None, 0.076105541089078882, None), (0.062454880611904053, None, 0.076515378778452395, None), (0.062239292336317871, None, 0.076431683077043663, None), (0.062058810503274948, None, 0.076979748959288052, None), (0.061833284400025688, None, 0.076567458637031446, None), (0.061659831156257665, None, 0.076014095528440156, None)]
0. 
patient tongue id: 05242132105103_2_4
label yaofang:
甘草 茯苓 前胡 桔梗 芦根 桃仁 远志 太子参 浙贝母 细辛 白前 诃子 紫苏子
0.969852 0.470369 0.61677 0.404013 0.306722 0.317164 0.596784 0.536698 0.496644 0.443384 0.457531 0.424062
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
1. 
patient tongue id: 03230716219670_1_2_6
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 郁金 天麻 鳖甲 莪术 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.988441 0.48386 0.662267 0.396928 0.318711 0.329183 0.678197 0.604443 0.551279 0.500714 0.515091 0.489087
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
2. 
patient tongue id: 04241935110955_4
label yaofang:
陈皮 茯苓 桔梗 薏苡仁 党参 白术 黄柏 牛膝 苍术 山药 砂仁 桑寄生 白扁豆 续断
0.94752 0.471562 0.560224 0.379916 0.479986 0.414109 0.392133 0.324363 0.328338
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.333333, recall: 0.214286, error: 0.666667
3. 
patient tongue id: 03221303504034_6_4_2
label yaofang:
甘草 党参 玄参 浙贝母 郁金 天麻 鳖甲 莪术 夏枯草 麦芽 百合 蜈蚣 白花蛇舌 红豆杉 猫爪草
0.815367 0.398562 0.502699 0.408454 0.33415
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
4. 
patient tongue id: 04282206071724_2_6
label yaofang:
甘草 薏苡仁 太子参 白术 生地黄 山药 天麻 巴戟天 鳖甲 补骨脂 莪术 续断 蜈蚣 天山雪莲 半枝莲
0.949864 0.444994 0.615544 0.44272 0.323815 0.543856 0.441629 0.452667 0.33904 0.366851 0.343774
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
5. 
patient tongue id: 05131655022872_6_1
label yaofang:
甘草 川芎 法半夏 羌活 党参 牛膝 细辛 天麻 僵蚕 白芷 鳖甲 蜈蚣 白花蛇舌 天山雪莲 猫爪草
0.795659 0.354059 0.554631 0.433688 0.381907
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
6. 
patient tongue id: 02191217103571_6_1
label yaofang:
柴胡 白芍 法半夏 茯苓 木香 党参 白术 黄连 山药 砂仁 鸡内金 白扁豆 紫苏梗
0.785024 0.394399 0.506181 0.424313 0.348817
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
7. 
patient tongue id: 05172130278123_5
label yaofang:
甘草 黄芩 前胡 桔梗 薄荷 鱼腥草 浙贝母 细辛 桑白皮 款冬花 紫菀 诃子 苇茎 苦杏仁 瓜蒌子 木蝴蝶
0.96621 0.427092 0.622665 0.444111 0.321217 0.60873 0.497929 0.549079 0.402208 0.439473 0.471028
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.062500, error: 0.909091
8. 
patient tongue id: 04102050063168_4_3
label yaofang:
桂枝 陈皮 茯苓 半夏 芦根 薏苡仁 白术 酸枣仁 厚朴 佩兰 砂仁 煅牡蛎 珍珠母 广藿香 土茯苓 煅龙骨 木棉花
0.541113 0.363611 0.43233 0.50574 0.518949 0.353248 0.306111 0.32097
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金

------Score: precision: 0.500000, recall: 0.235294, error: 0.500000
9. 
patient tongue id: 06140838565102_1_3_7
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 芡实 浮小麦 首乌藤 百合 制远志 石榴皮
0.519663 0.372201 0.486695 0.409691
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 1.000000, recall: 0.307692, error: 0.000000
10. 
patient tongue id: 05032246351434_2_7_4
label yaofang:
甘草 黄芪 丹参 生地黄 山药 山茱萸 泽泻 车前子 天麻 鳖甲 皂角刺 鹿角霜 蜈蚣 天山雪莲 半枝莲
0.976134 0.453518 0.640275 0.428853 0.327552 0.348794 0.666619 0.563026 0.580877 0.478352 0.505014 0.545054
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
11. 
patient tongue id: 01211321219422_4_3_6
label yaofang:
陈皮 大枣 茯苓 桔梗 薏苡仁 太子参 白术 山药 砂仁 白扁豆 炙甘草
0.50562 0.349188 0.462122 0.405178 0.403583
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
12. 
patient tongue id: 05092052429433_1_4
label yaofang:
甘草 白芍 川芎 独活 鸡血藤 牛膝 细辛 干姜 威灵仙 蜈蚣 姜黄 海桐皮 鹿衔草
0.303459 0.398521 0.310032 0.425046 0.476435 0.306131 0.322322 0.522427 0.59159 0.389312
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.100000, recall: 0.076923, error: 0.900000
13. 
patient tongue id: 03232316368104_4
label yaofang:
甘草 白芍 法半夏 茯苓 薏苡仁 党参 赤芍 厚朴 滑石 补骨脂 豆蔻 苦杏仁 宽筋藤 路路通
0.921687 0.321801 0.407425 0.572721 0.446741 0.490702 0.376157 0.432939 0.303355 0.303921
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
14. 
patient tongue id: 03301354502104_4
label yaofang:
麻黄 法半夏 前胡 桔梗 防风 薄荷 白芷 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗
0.319998 0.80274 0.378615 0.910923 0.479104 0.681023 0.349138 0.309431 0.809797 0.881777 0.748621 0.865191 0.90802 0.375399 0.481487 0.527627 0.734279
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.588235, recall: 0.666667, error: 0.411765
15. 
patient tongue id: 05102200510046_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.315681 0.895213 0.326488 0.968854 0.552328 0.769753 0.400994 0.347009 0.332336 0.332058 0.899009 0.953232 0.866214 0.938699 0.972008 0.425505 0.538717 0.598241 0.823038
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
16. 
patient tongue id: 03021840477706_4
label yaofang:
麻黄 柴胡 前胡 桔梗 半夏 防风 荆芥穗 款冬花 紫菀 白前 百部 紫苏子 炙甘草 广藿香
0.353316 0.857589 0.361037 0.945385 0.530753 0.743002 0.403293 0.35068 0.348464 0.352028 0.859412 0.92292 0.822185 0.908162 0.945383 0.439056 0.535577 0.58776 0.766556
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.714286, error: 0.473684
17. 
patient tongue id: 01132125433209_6_4
label yaofang:
甘草 枳壳 蒲公英 白及 党参 白术 槟榔 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.847866 0.425864 0.312753 0.541601 0.314703 0.461181 0.300115 0.351438 0.476174 0.33912 0.429248
predicted yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 生地黄 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
18. 
patient tongue id: 05230830340455_1_4_7
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.4497 0.409481 0.523977 0.611746 0.381917 0.31814 0.47787 0.304711 0.35606 0.389738 0.409854 0.392106 0.3469 0.381796
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.214286, recall: 0.250000, error: 0.785714
19. 
patient tongue id: 04260737028094_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.411445 0.406479 0.311947 0.491173 0.531864 0.405453 0.301936 0.42644 0.355941 0.337809 0.373135 0.390802 0.359861 0.348096 0.371608
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.266667, recall: 0.307692, error: 0.733333
20. 
patient tongue id: 03021948296585_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.336626 0.867003 0.342829 0.95133 0.528275 0.734088 0.39359 0.348602 0.347707 0.334227 0.866433 0.930476 0.831601 0.913762 0.957744 0.419671 0.518944 0.588033 0.789101
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
21. 
patient tongue id: 02211951264696_6_4
label yaofang:
柴胡 白芍 法半夏 大枣 茯苓 龙骨 牡蛎 党参 栀子 牡丹皮 石菖蒲 大黄 淫羊藿 豆蔻 炙甘草 浮小麦
0.987199 0.482602 0.664319 0.384369 0.305745 0.319508 0.654976 0.581923 0.521248 0.47641 0.493054 0.449249
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.125000, error: 0.833333
22. 
patient tongue id: 06191336334153_1_6
label yaofang:
甘草 川芎 茯苓 羌活 独活 党参 鸡血藤 白术 生地黄 红花 延胡索 赤芍 忍冬藤 威灵仙 牛大力 千斤拔
0.985816 0.48578 0.660605 0.392748 0.324267 0.329152 0.65407 0.592581 0.521975 0.492677 0.503806 0.455577
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
23. 
patient tongue id: 03282216419969_6_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 砂仁 天麻 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.992207 0.471623 0.678067 0.41205 0.328508 0.324537 0.709756 0.629097 0.607315 0.521928 0.55659 0.552677
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
24. 
patient tongue id: 05131448353962_2_1_6
label yaofang:
甘草 枳壳 薏苡仁 太子参 丹参 山茱萸 薤白 瓜蒌皮 鳖甲 莪术 降香 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.941935 0.300398 0.441079 0.614796 0.423154 0.305956 0.549894 0.459905 0.450281 0.365072 0.376541 0.347047
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
25. 
patient tongue id: 05180840552358_6
label yaofang:
甘草 柴胡 白芍 羌活 独活 党参 酸枣仁 延胡索 赤芍 牡丹皮 细辛 天麻 全蝎 白芷 威灵仙 合欢花
0.984935 0.48605 0.650044 0.393668 0.324416 0.337919 0.652696 0.592768 0.53081 0.492695 0.506258 0.465541
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
26. 
patient tongue id: 02190548364354_4
label yaofang:
甘草 黄芩 法半夏 前胡 桃仁 远志 桑白皮 苏子 款冬花 紫菀 地龙 苦杏仁 蜜麻黄
0.818507 0.427501 0.503051 0.396325 0.37282
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
27. 
patient tongue id: 03020821206680_1_5_6
label yaofang:
甘草 柴胡 白芍 枳壳 薏苡仁 党参 牡丹皮 郁金 山药 砂仁 鳖甲 白花蛇舌草 麦芽 天山雪莲
0.902345 0.405199 0.559709 0.506237 0.320095 0.485542 0.362496 0.47993 0.308923 0.348093
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
28. 
patient tongue id: 01201943127971_6_2
label yaofang:
甘草 柴胡 白芍 酸枣仁 牡丹皮 白茅根 地黄 天麻 补骨脂 白花蛇舌草 蜈蚣 合欢花 半枝莲 醋鳖甲
0.989535 0.485128 0.644571 0.384449 0.33647 0.345148 0.68523 0.60449 0.553732 0.495991 0.511114 0.487973
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
29. 
patient tongue id: 04202032314874_1_7_4
label yaofang:
柴胡 白芍 陈皮 当归 党参 黄芪 白术 牛膝 车前子 升麻 炙甘草
0.312583 0.310919 0.465726 0.342548 0.433929 0.306236 0.343933 0.427454 0.303566
predicted yaofang:
甘草 白芍 党参 黄芪 白术 车前子 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.666667, recall: 0.545455, error: 0.333333
30. 
patient tongue id: 06071922405605_6_7
label yaofang:
甘草 黄芩 半夏 枸杞子 生地黄 红花 赤芍 海螵蛸 牡丹皮 杜仲 莪术 续断 赭石
0.601569 0.390653 0.40173 0.350905 0.405243
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
31. 
patient tongue id: 02141937483142_1_4
label yaofang:
香附 枳壳 法半夏 党参 延胡索 海螵蛸 北柴胡 麦芽 炙甘草 紫苏梗 广藿香
0.906318 0.443098 0.546889 0.393186 0.43886 0.329525 0.344193
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
32. 
patient tongue id: 01041842548170_1_2
label yaofang:
白芍 川芎 当归 党参 太子参 枸杞子 熟地黄 山萸肉 炙甘草 续断 沙苑子 炙黄芪 盐菟丝子 酒女贞子 盐杜仲 盐巴戟天
0.414454 0.301093 0.576665 0.433987 0.626959 0.41164 0.467442 0.312688 0.542587 0.559536 0.455222 0.491151 0.548744 0.302041 0.349243 0.38983
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.062500, recall: 0.062500, error: 0.937500
33. 
patient tongue id: 04012004092485_2_5
label yaofang:
桔梗 荆芥 防风 牛蒡子 薏苡仁 酸枣仁 乳香 没药 苦杏仁 炙甘草 浮小麦 木棉花 东风桔 咸竹蜂
0.369727 0.741326 0.38024 0.864316 0.480629 0.622579 0.33316 0.38979 0.361753 0.362268 0.340035 0.752365 0.833977 0.725686 0.816702 0.34335 0.874888 0.410678 0.326246 0.471255 0.550924 0.708542
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.136364, recall: 0.214286, error: 0.863636
34. 
patient tongue id: 02231847526655_2
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 麦冬 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.367111 0.757303 0.369349 0.879699 0.474611 0.667724 0.351655 0.306916 0.340812 0.319229 0.765082 0.844338 0.735047 0.836219 0.880517 0.401362 0.496562 0.555635 0.688507
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
35. 
patient tongue id: 04281837048971_5
label yaofang:
甘草 桔梗 荆芥 芦根 薏苡仁 鱼腥草 白茅根 桑白皮 莱菔子 白芷 瓜蒌皮 紫菀 白前 百部 苦杏仁 紫苏子 辛夷 蜜麻黄 炒苍耳子
0.665382 0.351098 0.347884 0.503541 0.442194
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.052632, error: 0.800000
36. 
patient tongue id: 01182111404656_6_7
label yaofang:
甘草 桃仁 太子参 黄芪 白术 酸枣仁 海螵蛸 厚朴 当归尾 橘核 首乌藤 土鳖虫 红豆杉 合欢皮
0.457969 0.347395 0.349759 0.41504 0.403903
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
37. 
patient tongue id: 01312255123191_1_7
label yaofang:
甘草 羌活 独活 党参 白术 红花 地黄 天麻 白花蛇舌草 桑枝 威灵仙 蜈蚣 半枝莲 醋鳖甲
0.941989 0.308794 0.479958 0.56978 0.381901 0.340096 0.349631 0.562446 0.499738 0.451127 0.427738 0.426138 0.399287
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
38. 
patient tongue id: 03261611575991_6
label yaofang:
甘草 柴胡 白芍 川芎 香附 远志 枳实 泽泻 升麻 首乌藤 合欢皮
0.336378 0.428623 0.456355 0.391841
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.250000, recall: 0.090909, error: 0.750000
39. 
patient tongue id: 04200628534554_6_2_5
label yaofang:
甘草 白芍 枳壳 茯苓 龙骨 党参 丹参 黄连 胆南星 牡丹皮 郁金 薤白 瓜蒌皮 麦芽
0.976561 0.471961 0.632891 0.394921 0.307234 0.592594 0.527329 0.476921 0.424347 0.439319 0.389454
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
40. 
patient tongue id: 03141954364482_6_1
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.319616 0.417771 0.337482 0.397797 0.431113 0.357392 0.318196 0.33686 0.560289 0.642568 0.376245
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.545455, recall: 0.545455, error: 0.454545
41. 
patient tongue id: 03021302058625_1_4
label yaofang:
麻黄 甘草 法半夏 葛根 前胡 桔梗 防风 薄荷 荆芥穗 香薷 辛夷 紫苏梗 广藿香 炒苍耳子
0.783952 0.382925 0.883397 0.46526 0.663986 0.346216 0.776618 0.851778 0.692234 0.809456 0.892993 0.321642 0.447449 0.444795 0.649451
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.428571, error: 0.600000
42. 
patient tongue id: 04181952445996_5_1_6
label yaofang:
甘草 白芍 川芎 羌活 独活 金银花 薏苡仁 党参 白术 牛膝 桑寄生 补骨脂 忍冬藤 威灵仙 白花蛇舌 天山雪莲
0.988672 0.482453 0.662567 0.388533 0.312507 0.323447 0.666816 0.592542 0.540756 0.4911 0.504887 0.470037
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
43. 
patient tongue id: 03301343345239_4_1
label yaofang:
甘草 葛根 党参 太子参 黄芪 柏子仁 生地黄 熟地黄 火麻仁 木瓜 冬瓜子 北沙参 炒白扁豆
0.327028 0.818779 0.35911 0.920789 0.507355 0.690513 0.380382 0.349392 0.333597 0.319717 0.821347 0.896565 0.782339 0.875948 0.931399 0.396068 0.485355 0.570445 0.759476
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
44. 
patient tongue id: 04300856518439_1
label yaofang:
甘草 茯苓 远志 党参 白术 山药 天麻 鳖甲 扁豆花 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.861387 0.412428 0.513868 0.493136 0.389684 0.39172
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 1.000000, recall: 0.428571, error: 0.000000
45. 
patient tongue id: 01211240516602_7_4
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 鸡血藤 牡丹皮 干姜 全蝎 天花粉 炙甘草 蜈蚣 土鳖虫 狗脊
0.592243 0.331213 0.352128 0.424734 0.352939
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.117647, error: 0.600000
46. 
patient tongue id: 04271852039237_2_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.328858 0.858641 0.350671 0.941378 0.525969 0.735835 0.371227 0.328698 0.33838 0.324372 0.847546 0.917812 0.801306 0.899411 0.947565 0.425688 0.524202 0.571531 0.773492
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
47. 
patient tongue id: 01202009450908_5_1
label yaofang:
甘草 茯苓 薏苡仁 蒲公英 太子参 白术 山药 砂仁 补骨脂 鸡内金 北沙参 稻芽
0.52748 0.32013 0.548086 0.589318 0.371082 0.312751 0.300344
predicted yaofang:
甘草 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
48. 
patient tongue id: 06132106352388_6
label yaofang:
柴胡 白芍 香附 枳壳 丹参 海螵蛸 浙贝母 豆蔻 白花蛇舌草 姜半夏 炙甘草 紫苏梗
0.300532 0.404394 0.399493 0.408223 0.319097 0.331231 0.491073 0.62788 0.325531
predicted yaofang:
柴胡 白芍 党参 白术 柏子仁 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.444444, recall: 0.333333, error: 0.555556
49. 
patient tongue id: 06010646418162_1_2
label yaofang:
甘草 白芍 桔梗 牛蒡子 玉竹 党参 太子参 生地黄 浙贝母 乌梅 天花粉 鳖甲 北沙参 白花蛇舌 蜂房 四季青
0.997496 0.481968 0.714962 0.4087 0.347131 0.355401 0.789602 0.69518 0.701488 0.584866 0.635009 0.665948
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
50. 
patient tongue id: 05160622235734_4
label yaofang:
麦冬 黄芪 白术 五味子 浙贝母 郁金 厚朴 火麻仁 莪术 夏枯草 北沙参 猫爪草 合欢皮 冬凌草
0.522168 0.348468 0.313428 0.467243 0.503678 0.330026
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
51. 
patient tongue id: 04181944125599_1
label yaofang:
甘草 白芍 川芎 当归 龙骨 生地黄 熟地黄 杜仲 山药 山茱萸 续断 墨旱莲 艾叶
0.963494 0.461086 0.607866 0.420262 0.316243 0.327626 0.589202 0.518559 0.497815 0.428459 0.443613 0.423753
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
52. 
patient tongue id: 03142008207106_2_4
label yaofang:
甘草 柴胡 白芍 枳壳 桔梗 黄芪 白术 生地黄 槟榔 厚朴 火麻仁 柿蒂 紫菀 珍珠母 出肉苁蓉
0.329515 0.311278 0.416093 0.427222 0.452671 0.305191 0.301863 0.463298 0.56392 0.359728
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
53. 
patient tongue id: 05100801390725_1_3
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.425646 0.426698 0.584539 0.349829 0.345144
predicted yaofang:
甘草 党参 黄芪 白术 牛膝

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
54. 
patient tongue id: 03291632350250_1_5
label yaofang:
甘草 茯苓 远志 党参 白术 杜仲 黄柏 泽泻 车前子 菟丝子 桑寄生 金樱子 蛇床子 覆盆子 川木瓜
0.978465 0.477776 0.628423 0.39444 0.310619 0.593263 0.526523 0.476839 0.428716 0.442231 0.3998
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
55. 
patient tongue id: 01041854131839_9_5
label yaofang:
柴胡 白芍 黄芩 枳实 石膏 杏仁 细辛 干姜 大黄 生地 滑石 川朴 法夏
0.496947 0.300457 0.338841 0.422337 0.323125 0.408962
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
56. 
patient tongue id: 05261924337732_3
label yaofang:
桔梗 半夏 荆芥 防风 牛蒡子 酸枣仁 桑白皮 珍珠母 炙甘草 百合 紫苏叶 木蝴蝶 紫苑
0.470938 0.405326 0.419702 0.355295 0.34011 0.31852 0.316415 0.351558 0.413446
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 炙甘草

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
57. 
patient tongue id: 02182145524315_6_1
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 酸枣仁 厚朴 仙鹤草 肉苁蓉 地榆 槐花 火麻仁
0.963253 0.486452 0.571837 0.361974 0.532991 0.475989 0.419651 0.384673 0.377102 0.340932
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
58. 
patient tongue id: 01182127052075_6_4
label yaofang:
甘草 法半夏 茯苓 党参 栀子 淡豆豉 莱菔子 茵陈 麦芽 紫苏子 白扁豆 谷芽 麸炒枳壳 木棉花
0.975172 0.472057 0.628245 0.393061 0.342755 0.343045 0.629179 0.569863 0.520531 0.475774 0.491464 0.465237
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
59. 
patient tongue id: 03311644459818_1
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗 徐长卿
0.468259 0.499786 0.391425 0.444191
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
60. 
patient tongue id: 06191214431422_6_1
label yaofang:
甘草 茯苓 党参 石膏 山药 天麻 胡黄连 鳖甲 浮小麦 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.978402 0.469208 0.636462 0.413644 0.319558 0.328194 0.64707 0.577568 0.546257 0.484689 0.502818 0.487095
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
61. 
patient tongue id: 03311620517282_1_4_6
label yaofang:
蒲公英 太子参 黄芪 白术 当归尾 砂仁 磁石 菟丝子 桑寄生 鸡内金 首乌藤 红豆杉 合欢皮
0.529135 0.335354 0.305416 0.370975 0.546335 0.568214 0.305111 0.380176 0.325429 0.320896 0.343956
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
62. 
patient tongue id: 06111106505276_2_4
label yaofang:
甘草 柴胡 黄芩 法半夏 薏苡仁 党参 浙贝母 车前子 鳖甲 麦芽 白花蛇舌 蜂房 四季青 龙胆
0.945272 0.469141 0.591209 0.408007 0.31352 0.528388 0.477721 0.442364 0.3941 0.40184 0.359551
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
63. 
patient tongue id: 05092129571701_1_2
label yaofang:
甘草 龙骨 党参 太子参 丹参 红花 山茱萸 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989494 0.480025 0.651849 0.397327 0.307737 0.317287 0.667014 0.584279 0.54981 0.479911 0.500171 0.48367
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
64. 
patient tongue id: 03061807376459_6_1
label yaofang:
甘草 柴胡 茯苓 丹参 赤芍 青皮 郁金 山药 天花粉 瓜蒌皮 王不留行 皂角刺 合欢花
0.973105 0.478473 0.603861 0.383984 0.565419 0.498615 0.44701 0.403954 0.4042 0.345386
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.153846, error: 0.800000
65. 
patient tongue id: 04171749042943_4_2
label yaofang:
甘草 浙贝母 牛膝 苍术 干姜 草果 淡竹叶 生石膏 豆蔻 姜半夏 川木通 龙脷叶
0.315956 0.416257 0.350038 0.379038 0.424827 0.375232 0.321456 0.355807 0.60815 0.709665 0.408138
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.181818, recall: 0.166667, error: 0.818182
66. 
patient tongue id: 02191409300920_4_1
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 蝉蜕 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.346443 0.824128 0.368004 0.929574 0.499934 0.704957 0.384454 0.336338 0.326572 0.319112 0.83385 0.903201 0.79319 0.88685 0.931618 0.406753 0.498181 0.566777 0.756262
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 0.937500, error: 0.210526
67. 
patient tongue id: 01211231484565_1_2
label yaofang:
白芍 茯苓 龙骨 麦冬 白术 酸枣仁 柏子仁 附子 磁石 蝉蜕
0.345667 0.328585 0.39641 0.403204 0.403787
predicted yaofang:
甘草 党参 黄芪 白术 炙甘草

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
68. 
patient tongue id: 04222153139524_1_2
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.303091 0.937669 0.318348 0.984772 0.58762 0.823137 0.406074 0.342719 0.342297 0.329473 0.934576 0.974937 0.902618 0.962798 0.986564 0.432242 0.563282 0.620229 0.861096
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
69. 
patient tongue id: 01190619030405_6_2_4
label yaofang:
甘草 枳壳 黄芩 法半夏 茯苓 连翘 党参 莱菔子 天麻 鳖甲 紫苏子 蜈蚣 天山雪莲 半枝莲 红豆杉
0.879334 0.465129 0.510341 0.397748 0.320403 0.449822 0.368472 0.371433
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.400000, error: 0.250000
70. 
patient tongue id: 01211310032594_1
label yaofang:
桂枝 白芍 川芎 陈皮 当归 茯苓 防风 独活 党参 黄芪 熟地黄 杜仲 牛膝 细辛 秦艽 炙甘草 续断
0.343324 0.305822 0.320788 0.377235 0.375631 0.41977
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.666667, recall: 0.235294, error: 0.333333
71. 
patient tongue id: 03261600108015_1
label yaofang:
茯苓 桔梗 太子参 黄芪 山楂 升麻 鸡内金 麦芽 稻芽 云芝
0.514168 0.329365 0.411857 0.551754 0.505263 0.349189 0.314679
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 鸡内金

------Score: precision: 0.428571, recall: 0.300000, error: 0.571429
72. 
patient tongue id: 03222021329290_6_1
label yaofang:
甘草 柴胡 川芎 香附 防风 赤芍 荆芥穗 白芷 蔓荆子 郁李仁 辛夷 芥子
0.414239 0.348813 0.487135 0.441548 0.366645
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
73. 
patient tongue id: 03310917126402_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 青蒿 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄 炒苍耳子
0.369573 0.747557 0.386994 0.855018 0.4799 0.635703 0.312747 0.376191 0.351052 0.36296 0.336304 0.743632 0.825521 0.702184 0.801626 0.870759 0.393566 0.30179 0.470405 0.54614 0.676117
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.571429, recall: 0.750000, error: 0.428571
74. 
patient tongue id: 01130633110456_1_4_6
label yaofang:
甘草 法半夏 茯苓 党参 黄连 郁金 山药 砂仁 天麻 鳖甲 莪术 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.928154 0.326498 0.472466 0.308491 0.592297 0.402124 0.309137 0.355894 0.352508 0.579396 0.537341 0.48974 0.468224 0.465645 0.466545
predicted yaofang:
甘草 白芍 茯苓 薏苡仁 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.562500, error: 0.400000
75. 
patient tongue id: 06052014161266_3_2
label yaofang:
麻黄 川芎 桔梗 橘红 麦冬 五味子 石菖蒲 白芷 三七 百部 紫苏子 炙甘草 浮小麦 紫苑 芥子 东风桔
0.518815 0.347008 0.38647 0.496116 0.510131 0.320458
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
76. 
patient tongue id: 03211841249339_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.367476 0.710546 0.393361 0.828622 0.473741 0.622864 0.314547 0.378105 0.349652 0.358447 0.336562 0.719724 0.801093 0.683455 0.777971 0.310718 0.844779 0.401897 0.304853 0.466827 0.524586 0.659204
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.681818, recall: 1.000000, error: 0.318182
77. 
patient tongue id: 02191248292562_2_4_6
label yaofang:
甘草 柴胡 白芍 枳壳 当归 茯苓 党参 白术 丹参 栀子 牡丹皮 山药 车前子 麦芽 木贼 有瓜石斛
0.995707 0.502451 0.687631 0.355126 0.330778 0.332187 0.730534 0.653323 0.575803 0.538706 0.545697 0.501049
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
78. 
patient tongue id: 03312042063947_5
label yaofang:
甘草 薏苡仁 白术 熟附子 苍术 山药 厚朴 天麻 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲 龙葵果
0.931708 0.464943 0.309648 0.607614 0.407596 0.341817 0.366249 0.586707 0.463488 0.449485 0.360608 0.378392 0.359128
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
79. 
patient tongue id: 04151213515221_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.31745 0.881964 0.333979 0.959749 0.535309 0.751319 0.388726 0.336835 0.338124 0.321523 0.879405 0.941517 0.847356 0.927628 0.966909 0.411945 0.527594 0.594547 0.812002
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.875000, error: 0.263158
80. 
patient tongue id: 06111031519512_2_1
label yaofang:
甘草 柴胡 黄芩 茯苓 党参 白术 生地黄 赤芍 青皮 牡丹皮 郁金 天花粉 益母草 王不留行 鹿衔草
0.985025 0.472422 0.657543 0.384826 0.639772 0.560503 0.521215 0.466529 0.481736 0.451113
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
81. 
patient tongue id: 01182135003848_1_5_7
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 酸枣仁 丹参 生地黄 栀子 牡丹皮 菟丝子 桑寄生 益母草 合欢花
0.953733 0.464428 0.587451 0.393222 0.515144 0.440033 0.416121 0.349798 0.359297 0.337117
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
82. 
patient tongue id: 05092020277175_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 石菖蒲 炙甘草 百合 紫苏叶 青葙子
0.331901 0.476385 0.351058 0.367616 0.48679
predicted yaofang:
白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
83. 
patient tongue id: 03041406070224_4_6
label yaofang:
甘草 柴胡 白芍 茯苓 桃仁 浙贝母 干姜 厚朴 诃子 蝉蜕 浮小麦 紫苏梗 合欢花 猫爪草
0.98504 0.492057 0.64577 0.390324 0.313647 0.329271 0.6381 0.57 0.504553 0.470753 0.475486 0.422636
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
84. 
patient tongue id: 05080849339847_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.500795 0.328643 0.405372 0.310635 0.53669 0.521697 0.397064 0.332581 0.438352 0.328782 0.349358 0.373183 0.405185 0.314228 0.38029 0.371635 0.392603
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.705882, recall: 1.000000, error: 0.294118
85. 
patient tongue id: 04271837132477_1
label yaofang:
甘草 茯苓 半夏 黄芪 海螵蛸 杜仲 厚朴 砂仁 僵蚕 紫苏叶 蜈蚣 红参 鸭脚艾
0.48636 0.302318 0.399913 0.585822 0.493061 0.362367 0.337506
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 鸡内金

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
86. 
patient tongue id: 01180613272480_6_4_1
label yaofang:
甘草 川芎 党参 生地黄 杜仲 牛膝 山药 山茱萸 钩藤 天麻 防己 桑寄生 补骨脂 麦芽 狗脊 牛大力 红曲
0.990107 0.491307 0.669632 0.392318 0.32706 0.349 0.686796 0.609568 0.555801 0.504343 0.518141 0.487135
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.294118, error: 0.583333
87. 
patient tongue id: 03232305545008_2
label yaofang:
甘草 川芎 茯苓 荆芥 党参 白术 酸枣仁 红花 熟地黄 山茱萸 侧柏叶 地黄 菟丝子 桑椹 首乌藤 制何首乌
0.963656 0.322298 0.464083 0.606264 0.395446 0.548538 0.486225 0.448405 0.38635 0.398782 0.35518
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
88. 
patient tongue id: 03021128578741_1_2
label yaofang:
桂枝 葛根 桃仁 延胡索 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草
0.385463 0.443657 0.440357 0.373346
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
89. 
patient tongue id: 05191017063065_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.443308 0.30915 0.443595 0.338201 0.517309 0.505378 0.442511 0.361908 0.467828 0.408177 0.387358 0.403851 0.451699 0.310986 0.411398 0.428357 0.455231
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.705882, recall: 0.923077, error: 0.294118
90. 
patient tongue id: 02141940404896_1_2
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 款冬花 麦芽 百合 紫苏叶 独脚金
0.799338 0.352076 0.411361 0.512286 0.421114 0.369459 0.316831
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
91. 
patient tongue id: 06080144204730_1_2
label yaofang:
甘草 党参 丹参 生地黄 浙贝母 天麻 益母草 鳖甲 虎杖 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.869793 0.301938 0.378162 0.581684 0.454218 0.424539 0.351619
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
92. 
patient tongue id: 04271433218756_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.599868 0.381433 0.356982 0.56096 0.407836 0.349507 0.300387 0.360787 0.31332 0.380487
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 车前子 天麻

------Score: precision: 0.600000, recall: 0.500000, error: 0.400000
93. 
patient tongue id: 03111722556066_6_5
label yaofang:
甘草 法半夏 茯苓 薏苡仁 蒲公英 党参 山药 天麻 莪术 浮小麦 蜈蚣 半枝莲 醋鳖甲 化橘红
0.729914 0.35219 0.4311 0.337922 0.482588
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
94. 
patient tongue id: 04061955538030_4_2_1
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 白花蛇舌草 炙甘草 百合 紫苏叶
0.445493 0.386929 0.458905 0.475322 0.399991
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
95. 
patient tongue id: 02190539414508_4_6
label yaofang:
甘草 川芎 法半夏 远志 白术 杜仲 牛膝 钩藤 天麻 桑寄生 决明子 麦芽 蒺藜
0.856551 0.422163 0.565513 0.429386 0.311906 0.450456 0.309118 0.348309
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
96. 
patient tongue id: 04182008173944_6_1
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 龙骨 桃仁 柏子仁 生地黄 红花 赤芍 牛膝 姜半夏 合欢皮
0.353781 0.417633 0.444376 0.443428 0.442538 0.551165
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
97. 
patient tongue id: 02151823091572_1_2
label yaofang:
甘草 陈皮 茯苓 佩兰 茵陈 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶 木棉花 姜厚朴
0.34624 0.805228 0.376545 0.913197 0.489207 0.677974 0.382893 0.339337 0.330016 0.309317 0.811806 0.887831 0.763768 0.863504 0.918981 0.387255 0.479738 0.560263 0.731388
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.157895, recall: 0.230769, error: 0.842105
98. 
patient tongue id: 05182113274928_1_4
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.390428 0.394669 0.483187 0.329398 0.336772 0.48728 0.626423 0.418287
predicted yaofang:
白芍 党参 白术 柏子仁 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
99. 
patient tongue id: 02190529343889_5_6_1
label yaofang:
甘草 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 三棱 莪术 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.988016 0.474578 0.651873 0.399279 0.312724 0.321686 0.676567 0.585595 0.571591 0.485575 0.513311 0.516654
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.625000, error: 0.166667
100. 
patient tongue id: 06181701557961_2_5
label yaofang:
甘草 牛蒡子 浙贝母 郁金 厚朴 生半夏 莪术 北沙参 赭石 蜈蚣 猫爪草 土牛膝
0.594602 0.307457 0.364357 0.591133 0.635863 0.327408 0.424079 0.333945 0.336796 0.305174
predicted yaofang:
甘草 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.300000, recall: 0.250000, error: 0.700000
101. 
patient tongue id: 03201835251300_1_6
label yaofang:
桂枝 甘草 白芍 法半夏 大枣 桃仁 党参 郁金 大蓟 北柴胡 淫羊藿 广藿香 土茯苓
0.31385 0.423989 0.317922 0.392175 0.415593 0.360726 0.300983 0.353355 0.551667 0.676833 0.367401
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
102. 
patient tongue id: 02260707247775_1_4
label yaofang:
甘草 前胡 桔梗 浙贝母 桑白皮 天麻 鳖甲 款冬花 枇杷叶 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 田七末
0.987766 0.459741 0.669557 0.42296 0.317656 0.330521 0.696884 0.60058 0.598966 0.49714 0.522328 0.55578
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
103. 
patient tongue id: 03302119258776_1_5
label yaofang:
甘草 白芍 木香 独活 桃仁 党参 鸡血藤 丹参 五味子 赤芍 山药 茵陈 补骨脂 虎杖
0.840082 0.401201 0.490657 0.352265 0.507656 0.304386 0.35196 0.358107
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 天麻 蜈蚣

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
104. 
patient tongue id: 04210740217461_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.814237 0.310335 0.412474 0.543813 0.445021 0.404301 0.340051
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
105. 
patient tongue id: 02281208346837_1_2
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.479258 0.345279 0.441875 0.531719 0.390277 0.344805
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
106. 
patient tongue id: 04131849529759_1_7
label yaofang:
甘草 枳壳 茯苓 龙骨 薏苡仁 黄芪 白术 黄连 海螵蛸 杜仲 泽泻 厚朴 莪术 麦芽 合欢皮 蛇舌草 荔枝核
0.791046 0.429631 0.304733 0.509091 0.334827 0.454408 0.328743 0.390125 0.350078
predicted yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 山药 天麻 蜈蚣

------Score: precision: 0.555556, recall: 0.294118, error: 0.444444
107. 
patient tongue id: 05092115287211_2_5
label yaofang:
甘草 黄芩 茯苓 党参 白术 生地黄 天麻 磁石 白芷 蔓荆子 桑寄生 麦芽 辛夷 广藿香 沙苑子 苍耳子
0.985514 0.463365 0.655118 0.39469 0.317783 0.6445 0.537652 0.523283 0.422333 0.454916 0.434844
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
108. 
patient tongue id: 03231106169980_6_4
label yaofang:
甘草 连翘 白术 生地黄 赤芍 郁金 车前子 天麻 菟丝子 鳖甲 鹿角霜 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.99609 0.469414 0.712542 0.400676 0.314378 0.353137 0.359362 0.794753 0.68949 0.702886 0.586825 0.63465 0.689296
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.562500, error: 0.307692
109. 
patient tongue id: 01140827116311_6_2
label yaofang:
甘草 独活 党参 鸡血藤 白术 酸枣仁 红花 苍术 地黄 天麻 白花蛇舌草 威灵仙 蜈蚣 半枝莲 醋鳖甲
0.922028 0.343839 0.450458 0.550009 0.367617 0.483894 0.39404 0.387591 0.316565 0.332676 0.315216
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
110. 
patient tongue id: 04202111302599_4
label yaofang:
甘草 法半夏 桃仁 黄连 海螵蛸 栀子 大黄 紫草 川牛膝 皂角刺 紫苏叶
0.369446 0.410498 0.411861 0.434226 0.339023 0.531311
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
111. 
patient tongue id: 06012004236927_2_1
label yaofang:
甘草 薏苡仁 太子参 酸枣仁 山药 山茱萸 泽泻 车前子 天麻 猪苓 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉
0.46809 0.330343 0.306729 0.455931 0.310579 0.444443 0.322579
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.142857, recall: 0.066667, error: 0.857143
112. 
patient tongue id: 06091836257860_2_7
label yaofang:
白芍 茯苓 茯神 鸡血藤 丹参 牡丹皮 杜仲 山药 地黄 泽泻 补骨脂 山萸肉 炙甘草
0.80512 0.347984 0.378311 0.521623 0.4376 0.346761
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
113. 
patient tongue id: 02241359186060_1_7_5
label yaofang:
黄芪 白术 赤芍 牡丹皮 杜仲 黄柏 牛膝 水蛭 砂仁 菟丝子 桑螵蛸 北沙参 红豆杉 山慈菇 石上柏
0.488275 0.314653 0.448915 0.520527 0.432611 0.305246
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
114. 
patient tongue id: 02211434499371_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.454334 0.33298 0.352252 0.496708 0.495174 0.336633 0.319348
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
115. 
patient tongue id: 04021140327072_1_5
label yaofang:
甘草 当归 桔梗 连翘 薏苡仁 党参 黄芪 丹参 生地黄 牡丹皮 川楝子 山药 大黄 败酱草 麦芽 皂角刺
0.94086 0.309476 0.444125 0.611733 0.430342 0.322491 0.339609 0.582791 0.504777 0.510877 0.420309 0.44313 0.444828
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.250000, error: 0.692308
116. 
patient tongue id: 05182024138694_5_7_6
label yaofang:
半夏 牡蛎 麦冬 酸枣仁 赤芍 浙贝母 郁金 厚朴 夏枯草 北沙参 合欢皮
0.494878 0.331281 0.38306 0.557713 0.499223 0.384086 0.304833 0.399734 0.319981 0.332728 0.368772 0.356032 0.318679 0.355765 0.352952 0.33889
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.062500, recall: 0.090909, error: 0.937500
117. 
patient tongue id: 06062245391606_4_2
label yaofang:
甘草 茯苓 桔梗 薏苡仁 太子参 白术 延胡索 川楝子 山药 砂仁 糯稻根 鳖甲 北沙参 白扁豆 丝瓜络 白花蛇舌
0.923415 0.432505 0.606865 0.432517 0.350515 0.555713 0.374201 0.430553
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.312500, error: 0.375000
118. 
patient tongue id: 04112320271024_2_1_6
label yaofang:
桂枝 当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.416884 0.330563 0.498096 0.455193 0.346104
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
119. 
patient tongue id: 02142319550887_5_1_6
label yaofang:
甘草 木香 薏苡仁 党参 黄连 山药 厚朴 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.987291 0.475542 0.671642 0.418328 0.331048 0.362441 0.69456 0.600189 0.58842 0.492657 0.524925 0.515862
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
120. 
patient tongue id: 04202009273167_1_2_5
label yaofang:
甘草 茯苓 薏苡仁 玉竹 党参 白术 赤芍 浙贝母 全蝎 鸡内金 北沙参 蛤壳 辛夷 猫爪草 冬凌草
0.492653 0.338876 0.370661 0.31414 0.504706 0.558207 0.368943 0.300269 0.412417 0.312336 0.335482 0.349291 0.324999 0.307668 0.320628
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.200000, error: 0.800000
121. 
patient tongue id: 04081602413364_1_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 赤芍 牛膝 郁金 六神曲
0.954608 0.441611 0.609926 0.446749 0.329606 0.584884 0.452301 0.524229 0.362658 0.396642 0.416249
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.076923, error: 0.909091
122. 
patient tongue id: 04272230288084_1_2
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.333932 0.611356 0.378023 0.704362 0.395612 0.507014 0.582658 0.662473 0.552483 0.652403 0.335 0.750045 0.311645 0.354775 0.372347 0.517088
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.687500, recall: 0.733333, error: 0.312500
123. 
patient tongue id: 04061344130144_4_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 薏苡仁 党参 白术 天麻 败酱草 蜈蚣 半枝莲 醋鳖甲 淡附片
0.974749 0.465746 0.644532 0.418557 0.323046 0.346693 0.63904 0.556467 0.551469 0.458774 0.489594 0.483244
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
124. 
patient tongue id: 01092328393225_3
label yaofang:
川芎 当归 党参 黄芪 白术 丹参 红花 黄柏 牛膝 桑叶 益母草 炙甘草
0.326643 0.463015 0.364509 0.335687
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.750000, recall: 0.250000, error: 0.250000
125. 
patient tongue id: 03111715303406_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 桃仁 紫花地丁 浙贝母 厚朴 白芷 火麻仁 麦芽 苦杏仁 皂角刺 白鲜皮
0.572759 0.368976 0.42933 0.345323 0.452612
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
126. 
patient tongue id: 01180619216835_1_7
label yaofang:
桂枝 甘草 川芎 茯苓 鸡血藤 白术 酸枣仁 生地黄 赤芍 牛膝 天麻 桑寄生 桑枝 乌梢蛇
0.952642 0.455922 0.577044 0.416811 0.325756 0.520189 0.425611 0.412049 0.335609 0.336932 0.304935
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
127. 
patient tongue id: 03311812474863_1_3
label yaofang:
防风 海螵蛸 钩藤 干姜 白芷 香薷 豆蔻 炙甘草 首乌藤 广藿香 麸炒白术 麸炒苍术 甘松 炒蔓荆子
0.353138 0.749466 0.37798 0.870163 0.483545 0.639778 0.314375 0.390588 0.361038 0.355045 0.338098 0.760892 0.838388 0.73349 0.823717 0.332415 0.878955 0.409284 0.325257 0.479643 0.544694 0.713609
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.227273, recall: 0.357143, error: 0.772727
128. 
patient tongue id: 04271434407503_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.307938 0.64558 0.382258 0.731914 0.380388 0.604016 0.608037 0.719579 0.622002 0.717855 0.747072 0.333889 0.407495 0.4354 0.559719
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
129. 
patient tongue id: 01041825305063_2_4
label yaofang:
陈皮 茯苓 前胡 桔梗 麦冬 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.34712 0.905458 0.344653 0.9732 0.54133 0.782723 0.411356 0.335114 0.329464 0.329239 0.910183 0.958557 0.870828 0.945538 0.974412 0.427739 0.555159 0.607807 0.8086
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.846154, error: 0.421053
130. 
patient tongue id: 01201321236386_1_7_5
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 延胡索 砂仁 天麻 鳖甲 莪术 诃子 紫苏梗 威灵仙 蜈蚣 白花蛇舌 天山雪莲
0.979241 0.461842 0.660343 0.407316 0.331373 0.37629 0.670511 0.56457 0.534511 0.462686 0.474282 0.476452
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
131. 
patient tongue id: 04252313425279_5_6
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 独活 芦根 牛蒡子 红花 浙贝母 白茅根 诃子 蝉蜕
0.967103 0.470504 0.611343 0.390659 0.567806 0.495183 0.458243 0.405988 0.411699 0.373715
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
132. 
patient tongue id: 06072117334297_1_6
label yaofang:
甘草 党参 白术 酸枣仁 杜仲 地黄 天麻 桑寄生 白花蛇舌草 续断 蜈蚣 半枝莲 醋鳖甲 牛大力
0.981341 0.429151 0.649623 0.445545 0.30976 0.657398 0.541776 0.587267 0.43416 0.479169 0.530169
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
133. 
patient tongue id: 04071435068708_1_5
label yaofang:
甘草 茯苓 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 炒僵蚕
0.332369 0.888574 0.349529 0.961663 0.563511 0.757011 0.415637 0.36665 0.356005 0.349202 0.887517 0.946879 0.849455 0.924666 0.966376 0.426565 0.322742 0.539774 0.590697 0.798956
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.214286, error: 0.850000
134. 
patient tongue id: 03012140128412_6_1_2
label yaofang:
甘草 白芍 木香 薏苡仁 党参 黄连 山茱萸 天麻 赤石脂 鳖甲 补骨脂 莪术 豆蔻 建曲 蜈蚣 白花蛇舌 天山雪莲
0.910701 0.310462 0.43259 0.562515 0.428899 0.465714 0.371978 0.396806
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.352941, error: 0.250000
135. 
patient tongue id: 03062136387886_1_6_2
label yaofang:
甘草 白芍 党参 酸枣仁 郁金 山药 天麻 鳖甲 莪术 虎杖 浮小麦 蜈蚣 白花蛇舌 合欢花 红豆杉
0.973986 0.476276 0.614141 0.400142 0.303134 0.319109 0.594824 0.515598 0.479819 0.417964 0.428519 0.382923
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
136. 
patient tongue id: 04261334490446_2_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.331988 0.370795 0.498919 0.30369 0.35518 0.560949 0.369328
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
137. 
patient tongue id: 03232109450926_6_2_1
label yaofang:
甘草 桔梗 太子参 酸枣仁 丹参 浙贝母 郁金 天麻 天花粉 鳖甲 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.997013 0.495497 0.703739 0.377417 0.334209 0.340502 0.763403 0.675973 0.632596 0.559472 0.59009 0.568913
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
138. 
patient tongue id: 04141900555595_4
label yaofang:
甘草 法半夏 前胡 桔梗 防风 黄芪 细辛 荆芥穗 白芷 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术
0.314805 0.885871 0.324477 0.966338 0.525526 0.759585 0.387145 0.324704 0.895977 0.951587 0.860852 0.938716 0.969191 0.40055 0.512209 0.586547 0.819844
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.411765, recall: 0.500000, error: 0.588235
139. 
patient tongue id: 03211947277137_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗
0.386376 0.301242 0.45124 0.458669 0.486792 0.533944 0.347818
predicted yaofang:
白芍 香附 党参 白术 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.571429, recall: 0.363636, error: 0.428571
140. 
patient tongue id: 04052200245154_1
label yaofang:
桂枝 当归 半夏 桃仁 黄芪 白术 赤芍 海螵蛸 杜仲 厚朴 砂仁 僵蚕 赭石 蜈蚣 土鳖虫
0.488638 0.343872 0.397066 0.546024 0.49953 0.343733 0.316371 0.337615
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
141. 
patient tongue id: 05172138193437_3
label yaofang:
桂枝 薏苡仁 远志 酸枣仁 杜仲 山药 厚朴 巴戟天 淫羊藿 补骨脂 吴茱萸 鸡内金 珍珠母 广藿香 土茯苓
0.579777 0.352649 0.35301 0.401924 0.482758
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
142. 
patient tongue id: 06132139032818_6_4
label yaofang:
甘草 白芍 独活 桃仁 牛膝 细辛 干姜 土鳖虫 姜黄 穿破石 鹿衔草 透骨消
0.313043 0.404501 0.324392 0.383268 0.438704 0.364351 0.324803 0.356451 0.578739 0.686996 0.402795
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.181818, recall: 0.166667, error: 0.818182
143. 
patient tongue id: 06111004392602_1_4
label yaofang:
甘草 茯苓 龙骨 远志 党参 白术 酸枣仁 山药 山茱萸 补骨脂 芡实 麦芽 益智 鹿角霜 川加皮
0.981504 0.477536 0.633523 0.390574 0.320013 0.336612 0.62871 0.561839 0.508638 0.463272 0.469691 0.432291
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
144. 
patient tongue id: 04282258099554_2_5_6
label yaofang:
甘草 茯苓 牡蛎 酸枣仁 生地黄 牡丹皮 杜仲 山药 山茱萸 泽泻 天麻 桑寄生 决明子 麦芽 牛大力
0.93097 0.340483 0.439932 0.567865 0.419562 0.494694 0.431762 0.426267 0.350053 0.370493 0.347344
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
145. 
patient tongue id: 04122208228468_1_6_2
label yaofang:
甘草 大枣 龙骨 党参 酸枣仁 生地黄 山药 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.949874 0.392645 0.622042 0.466451 0.534652 0.383164 0.46416 0.321349 0.336409
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.777778, recall: 0.500000, error: 0.222222
146. 
patient tongue id: 04181928396457_6_4
label yaofang:
桂枝 甘草 白芍 香附 当归 防风 生地黄 荆芥穗 虎杖 白花蛇舌草 蒺藜 制何首乌 徐长卿
0.343778 0.462529 0.405232 0.309796 0.401515 0.451609 0.434791 0.335094 0.356506 0.674122 0.734385 0.413183
predicted yaofang:
柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
147. 
patient tongue id: 03040859418804_4_6
label yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 桃仁 远志 党参 浙贝母 杜仲 桑寄生 益母草 豆蔻 蜈蚣 合欢花 鹿衔草
0.904208 0.420985 0.587542 0.452283 0.339517 0.507924 0.329554 0.408159
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
148. 
patient tongue id: 05181047208803_6_2
label yaofang:
甘草 柴胡 白芍 茯苓 党参 酸枣仁 生地黄 栀子 牡丹皮 鳖甲 北沙参 浮小麦 百合 白花蛇舌 合欢花 蜂房 四季青
0.985464 0.46024 0.647722 0.390822 0.313554 0.305349 0.675689 0.597991 0.58526 0.507052 0.528508 0.545869
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.352941, error: 0.500000
149. 
patient tongue id: 06162202190157_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.516015 0.381052 0.385456 0.398178 0.442189
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
150. 
patient tongue id: 03222006228858_4
label yaofang:
甘草 香附 茯苓 党参 白术 海螵蛸 紫苏梗 瓦楞子 猫爪草 山慈菇
0.312603 0.416208 0.309315 0.397073 0.431055 0.31475 0.322502 0.5117 0.630414 0.350747
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.300000, recall: 0.300000, error: 0.700000
151. 
patient tongue id: 01032053202599_3_4
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 熟附子 山茱萸 车前子 大腹皮 桑寄生 猪苓 麦芽 茺蔚子 川木瓜
0.303902 0.315471 0.579506 0.425633 0.65759 0.406047 0.479873 0.556687 0.587838 0.492825 0.55483 0.642214 0.314082 0.345273 0.316883 0.451614
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.125000, recall: 0.133333, error: 0.875000
152. 
patient tongue id: 02201800576481_1_4
label yaofang:
麻黄 甘草 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 香薷 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子
0.351019 0.763678 0.397222 0.8753 0.482185 0.646969 0.387286 0.357694 0.346287 0.335694 0.766579 0.842378 0.718922 0.815284 0.883682 0.396479 0.303592 0.484 0.539827 0.699282
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.600000, error: 0.550000
153. 
patient tongue id: 04112047525895_2_5
label yaofang:
甘草 柴胡 白芍 蒲公英 党参 黄连 栀子 天麻 白芷 鳖甲 麦芽 皂角刺 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.96318 0.441479 0.591015 0.441364 0.543515 0.456474 0.481767 0.358716 0.381913 0.378201
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.500000, error: 0.200000
154. 
patient tongue id: 03061514250045_6_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.367837 0.330335 0.43135 0.315359 0.457199 0.468418 0.30053 0.442908 0.519223 0.321424
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.600000, recall: 0.545455, error: 0.400000
155. 
patient tongue id: 02021012407689_6_1_7
label yaofang:
茯苓 薏苡仁 太子参 白术 龙眼肉 山药 芡实 莲子 百合
0.879586 0.415426 0.484967 0.460643 0.373211 0.353584
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.222222, error: 0.666667
156. 
patient tongue id: 03271536347983_4_5
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 大枣 当归 牡蛎 防风 麦冬 党参 黄连 生地黄 栀子 糯稻根 生石膏 鸡内金 姜半夏 浮小麦 广藿香 蜈蚣 红芪
0.851418 0.415146 0.560802 0.441244 0.412775 0.327771
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.136364, error: 0.500000
157. 
patient tongue id: 04121308064439_4_6_1
label yaofang:
茯苓 防风 郁金 钩藤 荆芥穗 白芷 北柴胡 香薷 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.321358 0.906701 0.327641 0.974689 0.553643 0.791937 0.401142 0.339354 0.321087 0.316177 0.910367 0.961012 0.881015 0.948572 0.975545 0.426799 0.550265 0.607319 0.835105
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.315789, recall: 0.428571, error: 0.684211
158. 
patient tongue id: 06082037178161_5
label yaofang:
甘草 枳壳 薏苡仁 蒲公英 白术 赤芍 浙贝母 牡丹皮 郁金 厚朴 茵陈 莪术 虎杖 北沙参 白鲜皮 蜈蚣 土鳖虫 姜黄 蛇舌草
0.412507 0.310698 0.401829 0.575377 0.53176 0.377901 0.30119 0.330901 0.419524
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.444444, recall: 0.210526, error: 0.555556
159. 
patient tongue id: 04121847359621_4_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 木贼
0.33122 0.63828 0.371385 0.802051 0.413897 0.546634 0.304852 0.683308 0.748088 0.649144 0.751509 0.353779 0.781484 0.344232 0.391259 0.435085 0.625825
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.705882, recall: 0.800000, error: 0.294118
160. 
patient tongue id: 04150844069313
label yaofang:
桂枝 白芍 羌活 独活 薏苡仁 鸡血藤 丹参 乳香 狗脊 海风藤 醋没药 青风藤
0.483448 0.333788 0.374248 0.532343 0.474542 0.37146 0.381898 0.307557 0.311264 0.346014 0.335876 0.317704 0.329473 0.326871
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.071429, recall: 0.083333, error: 0.928571
161. 
patient tongue id: 05022220273856_2_5
label yaofang:
甘草 山茱萸 天麻 菟丝子 益母草 鳖甲 桑螵蛸 益智 续断 蜈蚣 天山雪莲 半枝莲 广金钱草 红豆杉
0.984205 0.478434 0.653211 0.404269 0.326721 0.340873 0.6612 0.592422 0.558172 0.495009 0.518181 0.496454
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
162. 
patient tongue id: 01032215147825_2
label yaofang:
甘草 黄芩 桔梗 麦冬 玄参 生地黄 浙贝母 白茅根 鳖甲 苍耳子 白花蛇舌 天山雪莲 蜂房 四季青
0.948418 0.304243 0.481268 0.596891 0.405238 0.322812 0.339076 0.564017 0.514883 0.462858 0.432123 0.436381 0.407471
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
163. 
patient tongue id: 02110740088122_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.415728 0.337846 0.419785 0.462314 0.338145
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
164. 
patient tongue id: 02020929573123_1_2_6
label yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 杜仲 山茱萸 天麻 菟丝子 女贞子 合欢花 狗脊 墨旱莲
0.745175 0.375048 0.466138 0.463491 0.300633 0.309501
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
165. 
patient tongue id: 04202049347600_1_6
label yaofang:
当归 木香 桃仁 远志 党参 黄芪 鸡血藤 白术 柏子仁 虎杖 炙甘草 百合 紫苏叶
0.317724 0.321812 0.406721 0.304697 0.448714 0.455458 0.310232
predicted yaofang:
甘草 白芍 党参 黄芪 白术 炙甘草 紫苏叶

------Score: precision: 0.714286, recall: 0.384615, error: 0.285714
166. 
patient tongue id: 03040910180364_2_7_6
label yaofang:
甘草 茯苓 连翘 薏苡仁 桃仁 党参 郁金 山药 砂仁 鳖甲 莪术 麦芽 紫苏梗 白花蛇舌
0.893179 0.33802 0.445422 0.585762 0.437273 0.304574 0.323893 0.514722 0.437904 0.432295 0.354896 0.368733 0.343891
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
167. 
patient tongue id: 06070112274861_2_1_6
label yaofang:
甘草 茯苓 龙骨 牡蛎 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989325 0.482185 0.656092 0.389179 0.31581 0.324685 0.671876 0.597343 0.543969 0.492386 0.506486 0.472533
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
168. 
patient tongue id: 05222055463844_1_4_7
label yaofang:
黄芪 枸杞子 白术 延胡索 山药 车前子 砂仁 补骨脂 芡实 金樱子 北沙参
0.452005 0.348739 0.545459 0.581472 0.309397 0.360047 0.320607
predicted yaofang:
甘草 党参 黄芪 白术 海螵蛸 厚朴 砂仁

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
169. 
patient tongue id: 02191433487714_1_2_5
label yaofang:
粉葛 建曲
0.984872 0.491487 0.300173 0.656165 0.407134 0.356803 0.374046 0.699059 0.600591 0.574695 0.504135 0.529416 0.523146
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
170. 
patient tongue id: 06181834386447_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 红花 山药 天麻 鳖甲 佛手 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.983517 0.482681 0.642809 0.408006 0.311063 0.327461 0.649482 0.568052 0.541159 0.467101 0.489021 0.474786
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
171. 
patient tongue id: 04052122572847_5
label yaofang:
甘草 荆芥 金银花 连翘 薄荷 牛蒡子 淡豆豉 茵陈 淡竹叶 布渣叶
0.719901 0.319023 0.372892 0.467732 0.386873
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
172. 
patient tongue id: 05222120402021_7_4_1
label yaofang:
桃仁 黄芪 白术 海螵蛸 砂仁 桑寄生 鸡内金 北沙参 续断 紫苏梗 土鳖虫 红曲
0.452735 0.384685 0.304881 0.629831 0.617855 0.321762 0.315047 0.450307 0.376346 0.365775 0.379524 0.331136
predicted yaofang:
甘草 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.500000, recall: 0.500000, error: 0.500000
173. 
patient tongue id: 03021319044474_4_1
label yaofang:
陈皮 法半夏 茯苓 党参 海螵蛸 干姜 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 炙黄芪 甘松
0.346919 0.743356 0.392464 0.852246 0.482855 0.635482 0.371252 0.348927 0.356324 0.338097 0.739247 0.822686 0.690534 0.790874 0.872907 0.387833 0.304182 0.469337 0.53157 0.673501
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.461538, error: 0.700000
174. 
patient tongue id: 04020749080688_6_4
label yaofang:
甘草 川芎 羌活 独活 薏苡仁 远志 牛膝 细辛 天麻 全蝎 白芷 鳖甲 粉葛 白花蛇舌 红豆杉
0.773187 0.40732 0.502072 0.340454 0.437517 0.343585
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
175. 
patient tongue id: 01192152376587_2_5
label yaofang:
甘草 黄芩 桔梗 防风 芦根 麦冬 丹参 玄参 生地黄 浙贝母 白茅根 车前子 鳖甲 鹿角霜 白花蛇舌 四季青
0.991538 0.461358 0.673383 0.419761 0.338671 0.348714 0.737805 0.639876 0.660505 0.548995 0.582442 0.644329
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
176. 
patient tongue id: 06141831216599_1_7
label yaofang:
桃仁 黄芪 枸杞子 丹参 红花 杜仲 牛膝 续断 骨碎补 毛冬青
0.59974 0.351883 0.472462 0.514519 0.462499 0.302058
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
177. 
patient tongue id: 04261340269886_7_1
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 延胡索 赤芍 牛膝 附子 小茴香
0.377975 0.435105 0.42938 0.3054 0.508963 0.565262 0.335546
predicted yaofang:
白芍 党参 白术 柏子仁 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
178. 
patient tongue id: 01040652017321_2_6_4
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 山药 砂仁 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.807501 0.357448 0.449353 0.430903 0.302943
predicted yaofang:
甘草 法半夏 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
179. 
patient tongue id: 05140635035940_1_2_6
label yaofang:
甘草 白芍 太子参 生地黄 红花 赤芍 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤
0.967241 0.306526 0.435805 0.629768 0.415137 0.302843 0.602752 0.518125 0.524611 0.429241 0.453413 0.463527
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
180. 
patient tongue id: 04112315282386_1
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 郁金 鸡内金 炙甘草 百合 紫苏叶
0.327616 0.432476 0.356697 0.312495 0.360326 0.418101 0.406019 0.32146 0.381995 0.637482 0.742143 0.409374
predicted yaofang:
柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
181. 
patient tongue id: 01130636088314_5_2
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 牛蒡子 浙贝母 厚朴 天花粉 瓜蒌子 紫苏梗 木蝴蝶 合欢花
0.955841 0.474709 0.563862 0.376024 0.306254 0.52245 0.463595 0.41724 0.370007 0.371102 0.319177
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
182. 
patient tongue id: 01182139361636_2_6
label yaofang:
甘草 酸枣仁 浙贝母 杜仲 山药 白茅根 地黄 天麻 桑寄生 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.980228 0.482308 0.619975 0.38789 0.312045 0.320237 0.615075 0.54977 0.498746 0.44506 0.462056 0.414869
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
183. 
patient tongue id: 03171008294996_1_2
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 酸枣仁 丹参 郁金 鸡内金 首乌藤 百合 制远志
0.539082 0.333153 0.348166 0.511107 0.528247 0.386809 0.340462 0.414577 0.303523
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝 天麻

------Score: precision: 0.555556, recall: 0.416667, error: 0.444444
184. 
patient tongue id: 03062133338494_1_6
label yaofang:
甘草 当归 茯苓 远志 党参 生地黄 黄柏 肉桂 车前子 砂仁 菟丝子 巴戟天 金樱子 覆盆子
0.978137 0.482556 0.627667 0.385549 0.302513 0.316424 0.601473 0.539831 0.475565 0.440936 0.448557 0.399315
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
185. 
patient tongue id: 05132002275078_6
label yaofang:
甘草 茯苓 党参 白术 丹参 延胡索 青皮 川楝子 郁金 地黄 天花粉 瓜蒌皮 王不留行 浮小麦 猫爪草
0.931935 0.311992 0.423935 0.610431 0.43803 0.314528 0.545098 0.446683 0.469137 0.356003 0.385176 0.39629
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
186. 
patient tongue id: 03161314269919_1_4
label yaofang:
太子参 黄芪 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 炙甘草 制远志 酒女贞子 墨旱莲 煅龙骨 炒酸枣仁 干益母草
0.313076 0.909437 0.347416 0.972219 0.572882 0.782557 0.42481 0.375396 0.349502 0.338846 0.905377 0.958935 0.868851 0.940329 0.976531 0.423928 0.310669 0.554183 0.611254 0.822396
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.050000, recall: 0.066667, error: 0.950000
187. 
patient tongue id: 03022123009938_1_4
label yaofang:
茯苓 薏苡仁 黄芪 白术 海螵蛸 山药 生半夏 砂仁 鸡内金 紫苏梗 稻芽
0.395298 0.306434 0.320607 0.421585 0.55696 0.335426 0.380017
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
188. 
patient tongue id: 05032244345008_2_7
label yaofang:
甘草 党参 黄连 赤芍 郁金 苍术 山茱萸 天麻 鳖甲 王不留行 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.925138 0.38579 0.590396 0.452227 0.482016 0.344529 0.424001 0.310895
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.750000, recall: 0.428571, error: 0.250000
189. 
patient tongue id: 06082016147051_2_5
label yaofang:
柴胡 半夏 连翘 牛蒡子 党参 黄芪 枸杞子 白术 生地黄 牡丹皮 杜仲 牛膝 补骨脂 莪术 北沙参 赭石
0.804131 0.42686 0.463243 0.310468 0.45908 0.336976 0.35199
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.187500, error: 0.571429
190. 
patient tongue id: 06132005463900_2_6
label yaofang:
甘草 枳壳 半夏 太子参 枸杞子 杜仲 厚朴 茜草 僵蚕 麦芽 北沙参 佛手 合欢皮 预知子 蛇舌草
0.639658 0.341092 0.457422 0.506051 0.525364
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
191. 
patient tongue id: 04112326552142_6
label yaofang:
甘草 法半夏 龙齿 酸枣仁 柏子仁 栀子 肉桂 淡豆豉 天麻 百合 紫苏叶
0.371922 0.345771 0.462343 0.302184 0.309657 0.507371 0.369356
predicted yaofang:
党参 黄芪 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
192. 
patient tongue id: 02191231050687_1
label yaofang:
甘草 白芍 茯苓 党参 酸枣仁 山药 山茱萸 地黄 补骨脂 麦芽 首乌藤 牛大力
0.992514 0.49455 0.675714 0.401069 0.338093 0.3597 0.70852 0.629184 0.585438 0.520917 0.541085 0.516406
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
193. 
patient tongue id: 04271511564412_1_4_7
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 厚朴
0.380785 0.392414 0.519635
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 1.000000, recall: 0.230769, error: 0.000000
194. 
patient tongue id: 03151955537614_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.421498 0.311934 0.367386 0.490545 0.505568 0.300666 0.34633 0.404938 0.318753 0.364461 0.304888 0.308357 0.30287
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝 泽泻 车前子 莱菔子 决明子 制何首乌

------Score: precision: 0.615385, recall: 0.666667, error: 0.384615
195. 
patient tongue id: 01040656112790_5_1
label yaofang:
甘草 黄芩 茯苓 薄荷 芦根 牛蒡子 党参 丹参 黄连 山药 鳖甲 补骨脂 白花蛇舌 蜂房 广升麻
0.975824 0.46783 0.595929 0.38853 0.327875 0.583927 0.519739 0.482935 0.434914 0.416258 0.399934
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
196. 
patient tongue id: 03020716306095_1_4
label yaofang:
甘草 桔梗 薏苡仁 浙贝母 黄柏 牛膝 苍术 天麻 桑寄生 白花蛇舌草 忍冬藤 蜈蚣 半枝莲 醋鳖甲
0.959619 0.44247 0.592817 0.462445 0.300519 0.342498 0.594085 0.486858 0.546086 0.399712 0.424337 0.471318
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
197. 
patient tongue id: 04260648030842_1_7
label yaofang:
甘草 川芎 法半夏 茯苓 远志 枸杞子 杜仲 牛膝 天麻 益母草 桑螵蛸 麦芽 益智 蒺藜 沙苑子 天山雪莲
0.974525 0.302608 0.48606 0.628651 0.398856 0.318126 0.331031 0.605355 0.544135 0.483706 0.450939 0.460471 0.412098
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.250000, error: 0.692308
198. 
patient tongue id: 01132142541437_1_6
label yaofang:
甘草 党参 生地黄 杜仲 山药 山茱萸 天麻 鳖甲 续断 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.978809 0.306481 0.473987 0.633545 0.410154 0.316521 0.328618 0.620921 0.55473 0.527499 0.458577 0.487059 0.469342
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
199. 
patient tongue id: 02122230267996_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 牛蒡子 浙贝母 细辛 桑白皮 干姜 款冬花 苦杏仁 炙麻黄
0.975484 0.465062 0.628099 0.406603 0.305983 0.585142 0.51157 0.480042 0.407482 0.425679 0.382796
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
200. 
patient tongue id: 03012252296265_1_2_6
label yaofang:
甘草 法半夏 桔梗 芦根 桃仁 远志 党参 浙贝母 鳖甲 苦杏仁 辛夷 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986116 0.472242 0.661299 0.403036 0.317788 0.326233 0.65734 0.582383 0.545355 0.481197 0.503429 0.482314
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
201. 
patient tongue id: 02231839524609_4
label yaofang:
法半夏 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.353557 0.719633 0.363509 0.852185 0.47791 0.660787 0.349539 0.317446 0.346381 0.332427 0.738604 0.830827 0.715392 0.819085 0.864278 0.409889 0.493889 0.546487 0.675806
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
202. 
patient tongue id: 02191211041298_6_4
label yaofang:
甘草 白芍 党参 白术 丹参 玄参 厚朴 天麻 火麻仁 决明子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.968226 0.476996 0.619058 0.407359 0.318106 0.342841 0.592286 0.522183 0.487708 0.432842 0.44762 0.413147
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
203. 
patient tongue id: 02201307311005_4
label yaofang:
甘草 防风 丹参 生地黄 牡丹皮 乌梅 车前子 紫草 莪术 珍珠母 白鲜皮 紫苏叶 土茯苓 徐长卿
0.515234 0.364987 0.484857 0.475487 0.300564
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
204. 
patient tongue id: 03131248131953_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.340883 0.750133 0.368647 0.877059 0.453352 0.625569 0.362989 0.327272 0.304841 0.764778 0.845995 0.727827 0.835761 0.897371 0.372684 0.452998 0.551415 0.714653
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.928571, error: 0.277778
205. 
patient tongue id: 04112001397508_3_4
label yaofang:
甘草 白芍 薏苡仁 桃仁 党参 黄芪 白术 熟附子 山药 干姜 鳖甲 麦芽 佛手 土鳖虫
0.965362 0.476081 0.594172 0.400153 0.30199 0.327952 0.568543 0.514882 0.462675 0.427968 0.423311 0.373563
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
206. 
patient tongue id: 04252259438299_4_1
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 桃仁 远志 浙贝母 细辛 桑白皮 款冬花 苦杏仁 紫苏子 炙麻黄
0.985229 0.467954 0.65971 0.407327 0.306293 0.312949 0.648554 0.57246 0.540955 0.464817 0.493394 0.468969
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
207. 
patient tongue id: 03291444298441_7_6_4
label yaofang:
甘草 川芎 法半夏 茯苓 远志 党参 白术 酸枣仁 丹参 黄连 牛膝 天麻 全蝎 夜交藤 蒿苯
0.98671 0.487906 0.640083 0.390909 0.307544 0.321867 0.635558 0.564758 0.501976 0.461519 0.465088 0.404107
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
208. 
patient tongue id: 06022125460500_1_4
label yaofang:
当归 茯苓 薏苡仁 党参 黄芪 枸杞子 杜仲 三七 莲子 西洋参 续断 骨碎补
0.518336 0.349997 0.382929 0.46749 0.491498
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
209. 
patient tongue id: 02191638388173_6_4_7
label yaofang:
甘草 陈皮 黄芩 法半夏 大枣 薏苡仁 桃仁 葶苈子 郁金 桑白皮 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 红豆杉
0.982487 0.479569 0.641091 0.394772 0.307876 0.335431 0.637956 0.54489 0.510597 0.439192 0.447579 0.410239
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
210. 
patient tongue id: 01250702455333_1_6_2
label yaofang:
甘草 桔梗 太子参 酸枣仁 赤芍 浙贝母 郁金 地黄 天麻 诃子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.938276 0.31136 0.46203 0.567299 0.393184 0.496841 0.413452 0.395887 0.317478 0.324924
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
211. 
patient tongue id: 03222003292779_6_7
label yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 黄连 郁金 石菖蒲 桑螵蛸 益智 浮小麦 首乌藤 百合
0.986343 0.489426 0.644718 0.38325 0.317817 0.322859 0.647209 0.586506 0.522457 0.486595 0.498415 0.449535
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
212. 
patient tongue id: 05311943200818_3_1
label yaofang:
麻黄 茯苓 桔梗 半夏 芦根 牛蒡子 麦冬 桑白皮 白前 炙甘草 浮小麦 百合 紫苑 青果
0.393019 0.319316 0.437991 0.323475 0.388578 0.306008 0.417815 0.363766 0.435574 0.410729 0.572416
predicted yaofang:
法半夏 茯苓 前胡 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
213. 
patient tongue id: 03242143409914_1
label yaofang:
柴胡 黄芩 龙骨 党参 白术 泽泻 干姜 天麻 姜半夏 炙甘草 续断
0.401212 0.390949 0.420009 0.326843 0.452081 0.632788 0.327475
predicted yaofang:
白芍 党参 白术 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.714286, recall: 0.454545, error: 0.285714
214. 
patient tongue id: 04130625003047_1_2_5
label yaofang:
甘草 茯苓 党参 黄芪 黄连 赤芍 杜仲 石膏 山药 山茱萸 水蛭 天花粉 桑寄生 粉葛 合欢花
0.972392 0.472361 0.614497 0.389792 0.567967 0.499318 0.445542 0.393115 0.402066 0.343994
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
215. 
patient tongue id: 03240555090631_1
label yaofang:
甘草 防风 独活 连翘 黄芪 白术 丹参 五味子 天麻 鳖甲 皂角刺 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.968408 0.45093 0.640464 0.433369 0.304139 0.324922 0.604625 0.51118 0.511441 0.408113 0.434676 0.432188
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
216. 
patient tongue id: 06111122014228_4_6
label yaofang:
甘草 白芍 党参 青皮 浙贝母 郁金 天麻 鳖甲 王不留行 女贞子 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.973658 0.468931 0.616686 0.446963 0.308659 0.351548 0.622447 0.529098 0.536093 0.434927 0.452432 0.439793
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
217. 
patient tongue id: 04241853155437_1_6
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 海螵蛸 车前子 砂仁 升麻 炙甘草 山慈菇
0.399612 0.388715 0.460118 0.304153 0.495555 0.624035 0.378205
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
218. 
patient tongue id: 05131620525084_1_2_7
label yaofang:
甘草 桃仁 党参 白术 酸枣仁 柏子仁 天麻 肉苁蓉 鳖甲 火麻仁 补骨脂 蜈蚣 天山雪莲 半枝莲 红豆杉
0.990665 0.467653 0.692657 0.412897 0.334483 0.376517 0.380418 0.74846 0.665452 0.66811 0.578429 0.610726 0.656373
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
219. 
patient tongue id: 01061606253871_6_1_7
label yaofang:
甘草 柴胡 黄芩 大枣 茯苓 白术 赤芍 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.958421 0.304857 0.476092 0.59427 0.396255 0.319843 0.329042 0.586613 0.524106 0.49173 0.444804 0.457521 0.433649
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
220. 
patient tongue id: 03111742026944_5_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 牛蒡子 薏苡仁 浙贝母 细辛 天麻 鳖甲 白前 紫苏梗 蜈蚣 白花蛇舌
0.984929 0.471976 0.651423 0.406286 0.318766 0.324629 0.650213 0.56878 0.535632 0.462674 0.483548 0.455042
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
221. 
patient tongue id: 04102037040759_6
label yaofang:
甘草 枳壳 桔梗 黄芪 白术 枳实 槟榔 厚朴 肉苁蓉 火麻仁 紫菀 郁李仁
0.816155 0.40162 0.537695 0.451457 0.399977 0.33188
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
222. 
patient tongue id: 01062039045315_6_1
label yaofang:
甘草 法半夏 茯苓 桔梗 生地黄 浙贝母 牡丹皮 黄柏 知母 山药 山茱萸 厚朴 天花粉 紫苏梗
0.954496 0.300003 0.46575 0.590062 0.412759 0.312508 0.333894 0.554869 0.473346 0.452186 0.388904 0.394269 0.37593
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
223. 
patient tongue id: 05201513380066_2_7
label yaofang:
甘草 法半夏 茯苓 桃仁 党参 黄芪 白术 山茱萸 天麻 僵蚕 鳖甲 蒺藜 赭石 龟甲
0.949153 0.451376 0.585922 0.407767 0.506191 0.435206 0.405252 0.342007 0.33806 0.300246
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.428571, error: 0.400000
224. 
patient tongue id: 02240825529730_1_2_7
label yaofang:
当归 党参 黄芪 枸杞子 熟附子 乌药 肉桂 干姜 巴戟天 吴茱萸 炙甘草 黄精
0.463856 0.344859 0.374198 0.314735 0.485153 0.524393 0.312426 0.374023 0.307087 0.411683 0.30652 0.327905 0.338667 0.344651 0.330747 0.314036 0.327008
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 白术 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.117647, recall: 0.166667, error: 0.882353
225. 
patient tongue id: 02191239523367_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.31925 0.942051 0.314072 0.986634 0.587454 0.837928 0.405084 0.33471 0.330429 0.331332 0.941285 0.977748 0.912769 0.968766 0.98811 0.441341 0.588549 0.643238 0.859802
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
226. 
patient tongue id: 03192243063741_1_4_6
label yaofang:
甘草 法半夏 茯苓 党参 酸枣仁 黄连 生地黄 竹茹 黄柏 知母 砂仁 天麻 柿蒂 浮小麦 百合
0.959381 0.308721 0.478697 0.607996 0.389312 0.324437 0.333403 0.589908 0.531966 0.473245 0.444719 0.447911 0.407997
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
227. 
patient tongue id: 02122102390835_1_8
label yaofang:
甘草 白芍 茯苓 荆芥 党参 红花 赤芍 天麻 木瓜 白花蛇舌草 麦芽 白鲜皮 蜈蚣 半枝莲 醋鳖甲 宽筋藤
0.959541 0.48399 0.585615 0.387483 0.318907 0.330544 0.564143 0.50637 0.45987 0.415298 0.426496 0.385836
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
228. 
patient tongue id: 05241943410155_4_6_1
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 砂仁 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.99062 0.496434 0.647888 0.39342 0.325812 0.332692 0.677661 0.591814 0.543629 0.483824 0.502119 0.456677
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
229. 
patient tongue id: 01062037534192_6_2
label yaofang:
甘草 柴胡 白芍 川芎 当归 茯苓 蒲公英 党参 白术 酸枣仁 麦芽 合欢花 麸炒枳壳
0.930227 0.320353 0.456642 0.573319 0.414765 0.306544 0.512321 0.429365 0.426547 0.349915 0.357344 0.341614
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
230. 
patient tongue id: 04201428120019_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.491391 0.3921 0.531455 0.579209 0.381084 0.315114 0.457852 0.304429 0.339636 0.339852 0.392032 0.370064 0.344206 0.365708
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.785714, recall: 0.916667, error: 0.214286
231. 
patient tongue id: 02260650148678_1_6
label yaofang:
甘草 远志 党参 黄芪 白术 酸枣仁 生地黄 天麻 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.996324 0.472222 0.71546 0.375548 0.330054 0.326343 0.781944 0.667122 0.659402 0.55825 0.592682 0.631347
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
232. 
patient tongue id: 04112202009003_6
label yaofang:
甘草 白芍 羌活 独活 党参 白术 酸枣仁 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.984379 0.47469 0.640336 0.411058 0.316002 0.334098 0.646399 0.556658 0.535157 0.453711 0.474999 0.459798
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
233. 
patient tongue id: 04200641008400_2_5_6
label yaofang:
甘草 生地黄 石膏 山药 车前子 荆芥穗 天麻 胡黄连 鳖甲 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97097 0.479254 0.614142 0.39299 0.309303 0.573501 0.510074 0.458083 0.413508 0.421145 0.368903
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
234. 
patient tongue id: 02212009043627_4
label yaofang:
甘草 黄芩 桔梗 牛蒡子 浙贝母 天麻 款冬花 紫菀 白花蛇舌草 苦杏仁 蜈蚣 半枝莲 醋鳖甲
0.934649 0.460249 0.604001 0.403917 0.310818 0.533249 0.410046 0.39477 0.308591 0.319243
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.300000, recall: 0.230769, error: 0.700000
235. 
patient tongue id: 05201504259416_5_7_6
label yaofang:
甘草 蒲公英 党参 红花 浙贝母 郁金 厚朴 天麻 天花粉 瓜蒌皮 鳖甲 麦芽 蜈蚣 白花蛇舌 半枝莲 红豆杉 猫爪草
0.937697 0.310764 0.455818 0.583879 0.419082 0.304552 0.510363 0.440353 0.42196 0.357057 0.36307 0.333637
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.411765, error: 0.416667
236. 
patient tongue id: 03290710107847_6_1
label yaofang:
甘草 牡蛎 远志 党参 酸枣仁 丹参 知母 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97618 0.462805 0.637089 0.414764 0.322969 0.339776 0.632418 0.556793 0.528874 0.462432 0.479844 0.455498
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
237. 
patient tongue id: 01182117332708_5_1_7
label yaofang:
甘草 金银花 生地黄 红花 牡丹皮 水牛角 荆芥穗 天麻 鳖甲 火麻仁 白鲜皮 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.862342 0.467113 0.502805 0.369214 0.311768 0.449033 0.373693 0.364723
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
238. 
patient tongue id: 02190501591797_6_2_7
label yaofang:
甘草 茯苓 龙骨 党参 黄芪 白术 酸枣仁 黄连 栀子 知母 山药 山茱萸 地黄 首乌藤
0.9509 0.448214 0.568884 0.389556 0.302373 0.303592 0.544794 0.48504 0.453503 0.386712 0.389162 0.361875
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
239. 
patient tongue id: 03101835431221_1_6_5
label yaofang:
黄芪 白术 郁金 厚朴 火麻仁 鸡内金 珍珠母 夏枯草 麦芽 北沙参 橘核 首乌藤 红豆杉 墨旱莲
0.318249 0.309502 0.453631 0.397349 0.454298 0.342466 0.388584 0.351877 0.381641 0.42308 0.373636 0.405228 0.349884 0.517424
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.142857, recall: 0.142857, error: 0.857143
240. 
patient tongue id: 03022125311787_1
label yaofang:
甘草 柏子仁 肉桂 砂仁 附片
0.433725 0.342052 0.305356 0.454264 0.331525 0.471318 0.351592
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.142857, recall: 0.200000, error: 0.857143
241. 
patient tongue id: 02201826351081_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子
0.317158 0.736333 0.382102 0.854984 0.473752 0.653868 0.354831 0.321864 0.303632 0.7407 0.818291 0.706531 0.817369 0.843037 0.393713 0.481555 0.518473 0.665781
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.555556, recall: 0.833333, error: 0.444444
242. 
patient tongue id: 03291348014225_4_7
label yaofang:
甘草 川芎 法半夏 茯苓 酸枣仁 红花 杜仲 牛膝 天麻 桑螵蛸 益智 天山雪莲
0.964652 0.466607 0.633736 0.426983 0.307437 0.341418 0.599579 0.515597 0.478187 0.417047 0.430625 0.402484
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
243. 
patient tongue id: 05232047284319_7
label yaofang:
陈皮 桔梗 枳实 大腹皮 干姜 厚朴 白芷 莪术 姜半夏 紫苏叶 广藿香
0.64781 0.39029 0.334681 0.501055 0.441098 0.301008
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
244. 
patient tongue id: 01250655343895_5_6_1
label yaofang:
甘草 枳壳 木香 白及 党参 黄芪 生地黄 车前子 仙鹤草 茜草 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲
0.946653 0.470542 0.573964 0.411604 0.330916 0.536206 0.452322 0.43054 0.36555 0.361592 0.321534
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
245. 
patient tongue id: 05081759345828_5
label yaofang:
茯苓 木香 党参 太子参 黄芪 白术 熟地黄 砂仁 姜半夏 炙甘草 牛大力 五指毛桃 千斤拔 蒸陈皮
0.572855 0.364848 0.488178 0.390526 0.424078
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
246. 
patient tongue id: 04282218309687_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 酸枣仁 丹参 黄连 郁金 山茱萸 补骨脂 佛手 浮小麦
0.989598 0.483963 0.64974 0.39219 0.323395 0.333826 0.689132 0.613701 0.579861 0.512696 0.524859 0.490936
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
247. 
patient tongue id: 03271539162076_5_6_7
label yaofang:
桂枝 柴胡 白芍 黄芩 当归 白及 党参 黄连 熟地黄 乌梅 黄柏 细辛 干姜 三七 鸡内金 炙甘草 淡附片 半边莲
0.731583 0.381076 0.462418 0.406228
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.055556, error: 0.750000
248. 
patient tongue id: 05111930341593_5_6_7
label yaofang:
甘草 桃仁 黄芪 白术 丹参 赤芍 海螵蛸 浙贝母 杜仲 乌药 泽泻 厚朴 肉苁蓉 莪术 北沙参 蛇舌草 荔枝核
0.502486 0.334222 0.313032 0.335159 0.532661 0.520693 0.362968 0.330186
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.625000, recall: 0.294118, error: 0.375000
249. 
patient tongue id: 04260635535885_6_1
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 远志 党参 酸枣仁 黄连 桑螵蛸 益智 佛手 首乌藤
0.8575 0.323054 0.425998 0.541336 0.415313 0.394892 0.31202
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
250. 
patient tongue id: 04251957529247_4_1
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草 山慈菇
0.304621 0.379519 0.412728 0.461276 0.405095 0.565205 0.336646
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
251. 
patient tongue id: 06082011087953_1
label yaofang:
桂枝 白芍 川芎 当归 茯苓 防风 芦根 麦冬 党参 白术 五味子 延胡索 北沙参 炙甘草 女贞子
0.559423 0.342272 0.421061 0.445466 0.518446 0.305067
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 砂仁

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
252. 
patient tongue id: 02281827158001_1
label yaofang:
茯苓 党参 白术 乌药 肉桂 山药 益智仁 诃子 金樱子 桑螵蛸 益智 百合 覆盆子
0.362249 0.379159 0.397462 0.436975
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.500000, recall: 0.153846, error: 0.500000
253. 
patient tongue id: 04131901183042_2_5
label yaofang:
甘草 黄芩 太子参 黄芪 白术 海螵蛸 浙贝母 牡丹皮 杜仲 小蓟 厚朴 肉苁蓉 莪术 北沙参 赭石 三七粉 荔枝核 鸭脚艾
0.574778 0.36783 0.410186 0.447683 0.518614 0.314277 0.303638
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.571429, recall: 0.222222, error: 0.428571
254. 
patient tongue id: 02020844199682_6_5_2
label yaofang:
甘草 白芍 茯苓 金银花 党参 黄芪 白术 生地黄 牡丹皮 山药 山茱萸 白芷 淡竹叶 皂角刺 白花蛇舌
0.695014 0.310327 0.38675 0.489665 0.402678 0.304831
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
255. 
patient tongue id: 04200239248798_1_6
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 山药 莱菔子 天麻 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.974931 0.48752 0.612782 0.385446 0.316284 0.584491 0.522722 0.467367 0.431593 0.433224 0.382279
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
256. 
patient tongue id: 01312307506769_1_4
label yaofang:
甘草 陈皮 法半夏 薏苡仁 远志 浙贝母 厚朴 天麻 鳖甲 款冬花 莪术 百部 紫苏子 蜈蚣 白花蛇舌 天山雪莲
0.808628 0.431856 0.516234 0.421003 0.392348 0.317843
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
257. 
patient tongue id: 06031105419337_5_1_6
label yaofang:
甘草 薏苡仁 党参 白术 黄连 苍术 厚朴 天麻 鳖甲 鸡内金 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.623261 0.348026 0.421962 0.364926 0.312582 0.380822
predicted yaofang:
甘草 法半夏 茯苓 党参 黄芪 白术

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
258. 
patient tongue id: 03231105134033_4
label yaofang:
甘草 陈皮 茯苓 前胡 桔梗 半夏 防风 黄芪 白术 白前 百部 广藿香
0.314074 0.767413 0.368294 0.883558 0.475331 0.661762 0.346224 0.312903 0.778267 0.860166 0.726744 0.842644 0.899841 0.366279 0.471895 0.536055 0.686851
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.470588, recall: 0.666667, error: 0.529412
259. 
patient tongue id: 05222322306981_1
label yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.348091 0.761981 0.371011 0.880669 0.489217 0.64293 0.308451 0.381388 0.349503 0.354598 0.325304 0.77004 0.847364 0.741572 0.831909 0.328881 0.882917 0.404115 0.322848 0.464759 0.546029 0.724412
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.545455, recall: 1.000000, error: 0.454545
260. 
patient tongue id: 03200655201294_4
label yaofang:
甘草 白芍 蒲公英 白术 黄柏 细辛 天麻 白芷 地榆 槐花 火麻仁 麦芽 五倍子 土茯苓
0.942087 0.328412 0.444434 0.585018 0.434206 0.302175 0.510336 0.419919 0.430444 0.32787 0.346206 0.322809
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
261. 
patient tongue id: 04121937593956_1_4
label yaofang:
甘草 川芎 远志 党参 黄芪 白术 赤芍 天麻 全蝎 白芷 鳖甲 白花蛇舌 天山雪莲 半枝莲
0.97655 0.45335 0.630533 0.444815 0.322756 0.351852 0.666833 0.570061 0.610363 0.488534 0.518415 0.565145
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
262. 
patient tongue id: 02122219175729_1_6
label yaofang:
甘草 荆芥 金银花 黄芪 白术 红花 天麻 白花蛇舌草 麦芽 苦参 白鲜皮 地肤子 蜈蚣 半枝莲 醋鳖甲
0.986687 0.486611 0.645693 0.393751 0.325058 0.338689 0.650871 0.572731 0.535958 0.468476 0.486615 0.45174
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
263. 
patient tongue id: 05130658176079_6_2
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 连翘 党参 白术 酸枣仁 山药 益母草 麦芽 益智 白扁豆 浮小麦 建曲
0.962426 0.473341 0.607657 0.410986 0.313455 0.338594 0.594942 0.517484 0.506762 0.430665 0.442346 0.41677
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
264. 
patient tongue id: 05242121038315_6
label yaofang:
甘草 柴胡 白芍 黄芩 茯苓 党参 白术 牡丹皮 砂仁 菟丝子 益母草 醋香附 酒女贞子
0.941469 0.338586 0.42858 0.60105 0.426159 0.514313 0.437478 0.438113 0.341891 0.362937 0.33004
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
265. 
patient tongue id: 03261701182774_2
label yaofang:
甘草 茯苓 桔梗 龙骨 薏苡仁 白术 浙贝母 枇杷叶 苦杏仁 蝉蜕 浮小麦 百合 木蝴蝶 青果
0.568797 0.401355 0.476801 0.355662 0.439941
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
266. 
patient tongue id: 04181951396891_3
label yaofang:
甘草 白芍 薏苡仁 党参 白术 熟附子 山药 天麻 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 红豆杉
0.97834 0.474849 0.625053 0.392926 0.318235 0.59641 0.529437 0.472796 0.430951 0.433272 0.384346
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
267. 
patient tongue id: 02211842064776_4_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 白花蛇舌草 姜半夏 炙甘草 紫苏梗 半枝莲
0.405275 0.360204 0.303256 0.332158 0.395205
predicted yaofang:
甘草 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
268. 
patient tongue id: 03221701085913_1_5_6
label yaofang:
黄芪 白术 赤芍 砂仁 桑寄生 王不留行 北沙参 橘核 红豆杉 合欢皮 墨旱莲 山慈菇 蛇舌草
0.730981 0.37612 0.376192 0.381012 0.506212
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
269. 
patient tongue id: 04061407417923_4
label yaofang:
法半夏 茯苓 前胡 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 芡实 豆蔻 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.321235 0.713669 0.389812 0.8318 0.44821 0.628971 0.306851 0.70392 0.779544 0.67117 0.777276 0.833471 0.379142 0.430679 0.476561 0.635332
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.687500, recall: 0.687500, error: 0.312500
270. 
patient tongue id: 01132139334095_6_2
label yaofang:
甘草 茯苓 龙骨 远志 酸枣仁 丹参 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.8602 0.323692 0.412473 0.544323 0.426066 0.436168 0.320713 0.371828
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.384615, error: 0.375000
271. 
patient tongue id: 02170909247053_1_4_7
label yaofang:
桂枝 茯苓 党参 黄芪 丹参 山药 高良姜 肉苁蓉 淫羊藿 鸡内金 仙茅 花椒
0.404775 0.328485 0.301835 0.447657 0.469052 0.307149 0.322645
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
272. 
patient tongue id: 06080137327410_1_2
label yaofang:
甘草 香附 桃仁 酸枣仁 赤芍 天麻 地骨皮 瓜蒌皮 鳖甲 王不留行 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.983629 0.463272 0.666627 0.420199 0.324356 0.339454 0.662745 0.573589 0.563443 0.475618 0.508206 0.519254
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
273. 
patient tongue id: 06011954371170_1_7
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 知母 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.955576 0.315305 0.457047 0.604197 0.407989 0.310639 0.320474 0.573937 0.500857 0.489728 0.417999 0.437387 0.423776
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.625000, error: 0.230769
274. 
patient tongue id: 05232008254971_6
label yaofang:
当归 木香 党参 黄芪 鸡血藤 白术 丹参 柏子仁 海螵蛸 炙甘草 百合 紫苏叶
0.705135 0.33312 0.484543 0.340596 0.507106
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
275. 
patient tongue id: 03161848267142_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.346595 0.707255 0.385356 0.812066 0.472056 0.62137 0.30137 0.335344 0.31796 0.346022 0.337834 0.695454 0.770045 0.665031 0.756021 0.300542 0.824642 0.396561 0.450648 0.481569 0.610379
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
276. 
patient tongue id: 01192142010436_2_7_1
label yaofang:
甘草 桃仁 白术 生地黄 浙贝母 乌药 山药 山茱萸 天麻 鳖甲 桑螵蛸 蜈蚣 天山雪莲 半枝莲
0.664198 0.366893 0.482599 0.425627 0.506117
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
277. 
patient tongue id: 05232002187688_1
label yaofang:
桂枝 甘草 白芍 陈皮 茯苓 半夏 薏苡仁 黄芪 白术 杜仲 厚朴 僵蚕 肉苁蓉 巴戟天 补骨脂 续断 粉葛 紫苏叶 五指毛桃
0.575073 0.359535 0.405394 0.518117 0.530332 0.305352 0.359533 0.305877 0.321529 0.312098
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.600000, recall: 0.315789, error: 0.400000
278. 
patient tongue id: 03221635111112_1_2_7
label yaofang:
茯苓 黄芪 白术 砂仁 天麻 菟丝子 桑寄生 鸡内金 首乌藤 蜈蚣 稻芽 罗布麻
0.460982 0.401106 0.414213 0.460729 0.362956 0.334239
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
279. 
patient tongue id: 05022035337061_1_7_2
label yaofang:
甘草 茯苓 桃仁 党参 鸡血藤 白术 丹参 砂仁 鳖甲 豆蔻 麦芽 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.864198 0.410859 0.563436 0.461914 0.317552 0.444524 0.341462
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
280. 
patient tongue id: 02182255435587_1_6_4
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 厚朴 天麻 鳖甲 莪术 紫菀 百部 苦杏仁 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.938046 0.452676 0.572437 0.422727 0.338644 0.510099 0.407771 0.408135 0.312756 0.31638
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.700000, recall: 0.437500, error: 0.300000
281. 
patient tongue id: 02020855091092_6
label yaofang:
甘草 川芎 茯苓 牡蛎 白术 酸枣仁 生地黄 栀子 知母 天麻 全蝎 麦芽 浮小麦 首乌藤 百合
0.991883 0.455173 0.677578 0.417079 0.330927 0.327358 0.739004 0.629742 0.652478 0.538715 0.567926 0.629084
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
282. 
patient tongue id: 05231757432311_5
label yaofang:
甘草 前胡 薄荷 芦根 薏苡仁 桑白皮 滑石 瓜蒌皮 射干 地龙 蜜麻黄
0.437438 0.395424 0.330823 0.375894 0.325596 0.358999
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
283. 
patient tongue id: 01201314291366_1
label yaofang:
甘草 茯苓 党参 白术 山药 砂仁 天麻 白花蛇舌草 浮小麦 首乌藤 紫苏梗 蜈蚣 合欢花 半枝莲 醋鳖甲
0.973878 0.471688 0.63377 0.407071 0.313061 0.338217 0.621088 0.526244 0.479517 0.428058 0.424657 0.403851
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
284. 
patient tongue id: 03111204183204_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.47803 0.352368 0.359685 0.486494 0.500063 0.308486 0.362051 0.392461 0.303817 0.31317 0.313806 0.325541 0.316188 0.303247
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 制何首乌

------Score: precision: 0.285714, recall: 0.333333, error: 0.714286
285. 
patient tongue id: 04141321376769_1_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄 炒苍耳子
0.309775 0.889023 0.324522 0.96637 0.52876 0.753542 0.375919 0.325505 0.314073 0.891641 0.950065 0.855777 0.935109 0.9724 0.400888 0.514113 0.600302 0.824173
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.800000, error: 0.333333
286. 
patient tongue id: 03012128168976_7_2
label yaofang:
甘草 茯苓 薏苡仁 党参 酸枣仁 郁金 山药 天麻 菟丝子 益母草 鳖甲 莪术 蜈蚣 半枝莲
0.908868 0.451283 0.555865 0.393534 0.31636 0.498174 0.382408 0.394858 0.302335 0.300719
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
287. 
patient tongue id: 03020814555141_2_3
label yaofang:
甘草 茯苓 党参 酸枣仁 丹参 五味子 生地黄 山药 山茱萸 补骨脂 麦芽 鹿角霜 川加皮
0.926515 0.413934 0.610973 0.443188 0.306419 0.527483 0.388746 0.433918 0.312846 0.312021
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
288. 
patient tongue id: 01130643035378_1_2_6
label yaofang:
甘草 薏苡仁 远志 浙贝母 郁金 天麻 鳖甲 款冬花 莪术 紫菀 苦杏仁 蜈蚣 白花蛇舌 天山雪莲
0.873412 0.450671 0.508516 0.381644 0.396357 0.314432 0.304334
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
289. 
patient tongue id: 06182218295714_1_3
label yaofang:
甘草 陈皮 法半夏 茯苓 黄芪 白术 丹参 紫苏梗 广藿香 手参
0.931341 0.421937 0.576265 0.45626 0.330625 0.511961 0.303326 0.427619
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.300000, error: 0.625000
290. 
patient tongue id: 06071959301204_5_1
label yaofang:
柴胡 白芍 陈皮 法半夏 茯苓 白及 党参 白术 黄连 干姜 柿蒂 麦芽 炙甘草 紫苏梗 广藿香
0.947695 0.441723 0.590929 0.467756 0.339152 0.53414 0.430995 0.47394 0.335233 0.35562 0.348471
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
291. 
patient tongue id: 05022128325973_2_5_6
label yaofang:
甘草 薏苡仁 党参 赤芍 山药 天麻 鳖甲 莪术 虎杖 黄精 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.635239 0.365023 0.554501 0.359365 0.395296 0.336298
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
292. 
patient tongue id: 04260632138967_1_4
label yaofang:
甘草 法半夏 茯苓 党参 鸡血藤 山药 砂仁 天麻 鳖甲 麦芽 白扁豆 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.871788 0.423635 0.579172 0.442022 0.318863 0.495669 0.373885 0.407194 0.300631
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.888889, recall: 0.500000, error: 0.111111
293. 
patient tongue id: 04222131519793_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 蜜麻黄
0.321224 0.906969 0.335477 0.973467 0.553533 0.77727 0.409221 0.352354 0.333971 0.31898 0.909075 0.958948 0.87645 0.946194 0.974833 0.428637 0.533775 0.607475 0.83284
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 1.000000, error: 0.315789
294. 
patient tongue id: 01110301227138_5
label yaofang:
桂枝 白芍 茯苓 薏苡仁 桃仁 蒲公英 栀子 牡丹皮 淡豆豉 败酱草
0.375386 0.300256 0.419029 0.363576 0.362459 0.331794
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.166667, recall: 0.100000, error: 0.833333
295. 
patient tongue id: 03230712517889_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 蒲公英 党参 砂仁 莱菔子 五灵脂 仙茅 麦芽 紫苏梗 广藿香 鱼古
0.988193 0.481855 0.678409 0.381367 0.328663 0.331958 0.688297 0.615532 0.564464 0.51694 0.533372 0.50593
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
296. 
patient tongue id: 05032247476481_4_6
label yaofang:
甘草 柴胡 白芍 法半夏 黄连 赤芍 青皮 牡丹皮 郁金 山药 车前子 荆芥穗 瓜蒌皮 王不留行
0.925144 0.425606 0.312458 0.572707 0.482839 0.311098 0.341345 0.560192 0.459385 0.546829 0.389187 0.410364 0.456897
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.142857, error: 0.846154
297. 
patient tongue id: 03021333206458_1_4
label yaofang:
甘草 前胡 桔梗 半夏 防风 薄荷 钩藤 荆芥穗 白芷 蔓荆子 香薷 辛夷 紫苏梗 广藿香 苍耳子
0.354632 0.643376 0.408815 0.76853 0.436734 0.569853 0.349533 0.320327 0.327776 0.317052 0.658619 0.727229 0.619789 0.714938 0.308864 0.771128 0.381069 0.439905 0.489289 0.629017
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.466667, error: 0.650000
298. 
patient tongue id: 04020823449393_2_6
label yaofang:
甘草 茯苓 前胡 桔梗 芦根 党参 浙贝母 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.967648 0.46352 0.604385 0.406844 0.3121 0.569217 0.508822 0.468017 0.413098 0.422717 0.385714
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
299. 
patient tongue id: 01140822344814_2_5
label yaofang:
甘草 茯苓 白术 牡丹皮 黄柏 知母 山药 山茱萸 地黄 泽泻 车前子 猪苓
0.975028 0.480641 0.300626 0.613641 0.401194 0.338067 0.360938 0.637121 0.555617 0.537142 0.477072 0.484722 0.486473
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.333333, error: 0.692308
300. 
patient tongue id: 02020840424299_2_1_6
label yaofang:
甘草 龙骨 白术 酸枣仁 生地黄 山药 山茱萸 天麻 鳖甲 首乌藤 建曲 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.975925 0.303841 0.471832 0.63329 0.405393 0.334874 0.342373 0.654529 0.580681 0.559843 0.495705 0.516984 0.528245
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.625000, error: 0.230769
301. 
patient tongue id: 02241400456898_1_6_5
label yaofang:
甘草 枳壳 桔梗 牡蛎 薏苡仁 延胡索 浙贝母 川楝子 厚朴 莪术 王不留行 北沙参 广金钱草 猫爪草
0.378987 0.390022 0.39956 0.323788 0.320481 0.301587 0.331496 0.361639 0.496625
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 黄芪 紫菀 炙甘草

------Score: precision: 0.222222, recall: 0.142857, error: 0.777778
302. 
patient tongue id: 03020744024244_1_4_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.416745 0.35738 0.522674 0.50268 0.339933 0.390252 0.302055 0.390663 0.30402 0.306334 0.307111
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 泽泻 车前子 莱菔子 决明子 制何首乌

------Score: precision: 0.727273, recall: 0.666667, error: 0.272727
303. 
patient tongue id: 05260704573725_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 牛蒡子 桃仁 远志 浙贝母 细辛 款冬花 白前 苦杏仁 紫苏梗 蜜麻黄
0.946638 0.427048 0.591719 0.441103 0.313025 0.543143 0.408664 0.468132 0.312124 0.334214 0.35184
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
304. 
patient tongue id: 04282029420731_2
label yaofang:
甘草 法半夏 茯苓 芦根 薏苡仁 酸枣仁 竹茹 天麻 鳖甲 莪术 北沙参 蜈蚣 白花蛇舌 龙葵果
0.955559 0.315857 0.447908 0.622952 0.432427 0.307638 0.324795 0.58593 0.499343 0.496209 0.403208 0.430632 0.423203
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
305. 
patient tongue id: 01040009253578_7_5
label yaofang:
甘草 柴胡 枳壳 茯苓 远志 党参 白术 酸枣仁 赤芍 栀子 牡丹皮 郁金 淡豆豉 莪术 麦芽 首乌藤
0.93812 0.449266 0.57508 0.394359 0.309689 0.533301 0.374268 0.401736
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
306. 
patient tongue id: 05162132177385_2_6
label yaofang:
甘草 茯苓 党参 丹参 黄连 浙贝母 山药 山茱萸 天花粉 鳖甲 粉葛 浮小麦 白花蛇舌 天山雪莲 猫爪草
0.987256 0.48641 0.657036 0.394975 0.328008 0.335301 0.667112 0.60244 0.546492 0.504432 0.518474 0.485866
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
307. 
patient tongue id: 05312143408050_4
label yaofang:
甘草 羌活 独活 薏苡仁 党参 白术 杜仲 天麻 白花蛇舌草 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.868635 0.418834 0.554215 0.432739 0.42662 0.340159
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
308. 
patient tongue id: 03301341123103_1_4_2
label yaofang:
甘草 葛根 桔梗 防风 麦冬 玄参 生地黄 赤芍 细辛 白芷 北沙参 辛夷 广藿香 炒苍耳子 人参叶 炒六神曲
0.355568 0.793101 0.356862 0.908011 0.493914 0.678221 0.382164 0.340684 0.330426 0.33013 0.808506 0.882315 0.774052 0.865065 0.911893 0.40608 0.485337 0.561527 0.739455
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.315789, recall: 0.375000, error: 0.684211
309. 
patient tongue id: 06092009242841_1_4_7
label yaofang:
陈皮 当归 半夏 防风 党参 黄芪 枸杞子 白术 浙贝母 杜仲 牛膝 厚朴 僵蚕 菟丝子 莪术 鸡内金 麦芽 紫苏叶 红豆杉
0.833331 0.360585 0.498596 0.401056 0.563964 0.311481 0.352015
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.157895, error: 0.571429
310. 
patient tongue id: 03040739483479_1_4_7
label yaofang:
甘草 白芍 茯苓 麦冬 党参 白术 熟附子 干姜 肉苁蓉
0.44783 0.369976 0.424126 0.462801 0.342645
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.444444, error: 0.200000
311. 
patient tongue id: 01202008334044_4_1_7
label yaofang:
甘草 茯苓 橘红 太子参 生半夏 僵蚕 火麻仁 川贝母 鸡内金 枇杷叶 地龙 辛夷 紫苏叶 冬凌草
0.589283 0.409333 0.338235 0.339143 0.377848
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
312. 
patient tongue id: 05131431364375_5
label yaofang:
甘草 白芍 当归 金银花 连翘 薏苡仁 天麻 白芷 鳖甲 皂角刺 蜈蚣 白花蛇舌 半枝莲 红豆杉 广升麻
0.907361 0.45174 0.554064 0.438422 0.319085 0.466882 0.377102 0.39514
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
313. 
patient tongue id: 04192240395713_4_2
label yaofang:
甘草 黄芩 桔梗 芦根 浙贝母 乌梅 鳖甲 诃子 北沙参 苦杏仁 白花蛇舌 蜂房 岗梅根 四季青
0.985763 0.489393 0.638991 0.375907 0.306226 0.318156 0.634887 0.572154 0.504348 0.467175 0.477413 0.428656
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
314. 
patient tongue id: 02251111100095_4_1
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.338958 0.865739 0.342863 0.955446 0.519897 0.744384 0.376835 0.319378 0.325533 0.314803 0.874855 0.935948 0.837219 0.922117 0.958265 0.407717 0.522008 0.600226 0.790591
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
315. 
patient tongue id: 04252014472308_1_2
label yaofang:
甘草 白芍 枳壳 桔梗 黄芪 白术 槟榔 厚朴 肉苁蓉 火麻仁 紫菀
0.403944 0.33337 0.313207 0.405208 0.335174 0.447403 0.458606
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.571429, recall: 0.363636, error: 0.428571
316. 
patient tongue id: 02190543097042_5_7_6
label yaofang:
甘草 薏苡仁 党参 枸杞子 白术 山药 天麻 鳖甲 扁豆花 麦芽 蒺藜 蜈蚣 白花蛇舌 天山雪莲 半枝莲 龙葵果
0.986166 0.47151 0.637435 0.402287 0.309778 0.316011 0.642933 0.571132 0.541212 0.475254 0.496648 0.479587
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.625000, error: 0.166667
317. 
patient tongue id: 04241825008241_4_6
label yaofang:
桂枝 柴胡 白芍 黄芩 党参 五味子 郁金 桑寄生 虎杖 白花蛇舌草 姜半夏 炙甘草 土茯苓
0.33697 0.437622 0.376359 0.30175 0.407903 0.460465 0.386366 0.336059 0.336887 0.606707 0.663843 0.410853
predicted yaofang:
柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
318. 
patient tongue id: 05172106000479_2_1
label yaofang:
甘草 桔梗 芦根 麦冬 黄连 浙贝母 细辛 鳖甲 北沙参 白花蛇舌 蜂房 岗梅根 四季青 广升麻
0.976702 0.471951 0.629072 0.417388 0.30638 0.328444 0.609955 0.55025 0.514199 0.457041 0.467665 0.424301
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
319. 
patient tongue id: 05270623438583_1_7_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 郁金 山药 天麻 僵蚕 桑寄生 麦芽 首乌藤 合欢花
0.984414 0.479815 0.657695 0.404008 0.324988 0.347162 0.665641 0.588736 0.539829 0.48477 0.496025 0.478702
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.461538, error: 0.500000
320. 
patient tongue id: 01202015416381_1_4
label yaofang:
太子参 黄芪 白术 海螵蛸 浙贝母 山药 砂仁 石斛 鸡内金 紫苏梗 红豆杉 稻芽
0.750879 0.400076 0.503872 0.327769 0.463505 0.33076
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
321. 
patient tongue id: 02122115124088_2_6
label yaofang:
甘草 茯苓 党参 黄芪 酸枣仁 生地黄 牛膝 山药 地骨皮 蔓荆子 糯稻根 女贞子 浮小麦 首乌藤 合欢花
0.996544 0.495055 0.709655 0.35752 0.340552 0.350772 0.758002 0.676836 0.61553 0.569214 0.576541 0.580484
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
322. 
patient tongue id: 05092119226603_6
label yaofang:
甘草 柴胡 川芎 香附 当归 茯苓 连翘 党参 生地黄 赤芍 青皮 浙贝母 苍术 益母草 王不留行
0.741691 0.374628 0.360885 0.474496 0.393419
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
323. 
patient tongue id: 04222240029844_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.335684 0.846848 0.34015 0.948851 0.512934 0.723551 0.378262 0.32696 0.303649 0.307121 0.86342 0.925568 0.831313 0.914066 0.94979 0.407835 0.4964 0.58516 0.793166
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
324. 
patient tongue id: 03291341176175_6_7_1
label yaofang:
甘草 茯苓 桔梗 党参 黄芪 白术 酸枣仁 丹参 山药 蔓荆子 鳖甲 建曲 苍耳子 土茯苓 贯众
0.985411 0.464711 0.660576 0.386066 0.321472 0.337286 0.662196 0.568521 0.537031 0.467775 0.492676 0.480166
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
325. 
patient tongue id: 01312315485946_6_4
label yaofang:
甘草 川芎 当归 远志 枸杞子 赤芍 杜仲 牛膝 细辛 泽泻 天麻 全蝎 菟丝子 莪术 蛇床子 麦芽 荔枝核
0.685432 0.414121 0.435479 0.350892
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.058824, error: 0.750000
326. 
patient tongue id: 01042307517024_4
label yaofang:
甘草 白芍 当归 桔梗 麦冬 玄参 生地黄 熟地黄 浙贝母 通草 百合
0.560356 0.366509 0.489611 0.471149
predicted yaofang:
甘草 白芍 党参 白术

------Score: precision: 0.500000, recall: 0.181818, error: 0.500000
327. 
patient tongue id: 03240624395550_1_6_2
label yaofang:
枳壳 黄芪 白术 海螵蛸 厚朴 砂仁 磁石 鸡内金 麦芽 女贞子 首乌藤 合欢皮 墨旱莲
0.661998 0.39114 0.415725 0.39296 0.455773
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
328. 
patient tongue id: 01092053262728_5
label yaofang:
川芎 黄芩 牡蛎 麦冬 桑叶 菊花 白芷 北沙参 赭石 辛夷 桑枝 苍耳子 合欢皮
0.475973 0.355236 0.302802 0.421192 0.357915
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
329. 
patient tongue id: 02281153146165_1_4_7
label yaofang:
黄芩 桔梗 橘红 防风 金银花 薏苡仁 白前 鸡内金 苦杏仁 蜜百部 蜜枇杷叶 干鱼腥草
0.386758 0.368864 0.543173 0.450171 0.34327 0.413526 0.320398 0.441079 0.300178 0.336692
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 泽泻 车前子 莱菔子 制何首乌

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
330. 
patient tongue id: 01061612088942_6_5
label yaofang:
甘草 柴胡 白芍 法半夏 远志 白术 黄连 山药 车前子 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.925828 0.348388 0.430836 0.552795 0.406854 0.427123 0.342015 0.359468
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.375000, error: 0.250000
331. 
patient tongue id: 05262112222912_1_6_5
label yaofang:
甘草 白芍 薏苡仁 党参 白术 山药 山茱萸 泽泻 鳖甲 莪术 虎杖 蛇床子 麦芽 白花蛇舌 天山雪莲 红豆杉
0.674302 0.316933 0.367445 0.519176 0.442261 0.317143
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
332. 
patient tongue id: 03041110065629_1_4
label yaofang:
白芍 茯苓 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 炙甘草 制远志 木贼 酒女贞子 煅龙骨 炒酸枣仁 素馨花
0.319857 0.556038 0.375652 0.607901 0.382011 0.479302 0.489491 0.62059 0.50042 0.560119 0.319063 0.715819 0.334935 0.315505 0.424242
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.187500, error: 0.800000
333. 
patient tongue id: 04081601431148_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.652957 0.378459 0.471009 0.440265 0.461217
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
334. 
patient tongue id: 02211830317758_6_7
label yaofang:
白芍 香附 枳壳 柏子仁 海螵蛸 白芷 茵陈 豆蔻 姜半夏 炙甘草 紫苏梗
0.804438 0.432568 0.487098 0.330728 0.394004 0.307785 0.394597 0.311531
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 天麻 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
335. 
patient tongue id: 01121843508326_1
label yaofang:
甘草 党参 太子参 黄芪 柏子仁 生地黄 熟地黄 火麻仁 木瓜 冬瓜子 北沙参 炒白扁豆
0.331081 0.862629 0.360685 0.949674 0.500857 0.725634 0.360606 0.302967 0.311523 0.864575 0.926384 0.813331 0.911323 0.949335 0.382175 0.490015 0.567649 0.781654
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
336. 
patient tongue id: 04061954184075_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.975775 0.302538 0.497115 0.315897 0.628062 0.393344 0.301277 0.367673 0.371729 0.635206 0.598576 0.515787 0.515929 0.511306 0.448842
predicted yaofang:
甘草 白芍 茯苓 薏苡仁 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.066667, recall: 0.083333, error: 0.933333
337. 
patient tongue id: 05131442189046_2_5
label yaofang:
甘草 黄芩 桔梗 牛蒡子 太子参 玄参 浙贝母 天花粉 鳖甲 苍耳子 白花蛇舌 蜂房 岗梅根 四季青
0.931981 0.475732 0.577825 0.408759 0.307664 0.328524 0.527661 0.480325 0.422675 0.398941 0.395594 0.344162
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
338. 
patient tongue id: 04061348439195_4
label yaofang:
甘草 法半夏 葛根 前胡 桔梗 防风 荆芥穗 北柴胡 香薷 紫苏梗 广藿香 炒苍耳子
0.375083 0.767595 0.390413 0.87822 0.4911 0.65941 0.324788 0.384669 0.352657 0.387899 0.36196 0.764286 0.841601 0.732266 0.822565 0.324751 0.877568 0.428745 0.327386 0.49746 0.548456 0.706385
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.318182, recall: 0.583333, error: 0.681818
339. 
patient tongue id: 03022214309911_7_6_4
label yaofang:
甘草 川芎 薏苡仁 太子参 酸枣仁 生地黄 知母 天麻 鳖甲 莪术 浮小麦 首乌藤 蜈蚣 白花蛇舌 龙葵果
0.950939 0.328685 0.44375 0.615204 0.419512 0.300131 0.30693 0.564105 0.490637 0.48168 0.399175 0.421949 0.403811
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
340. 
patient tongue id: 04102040402642_4_6
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 蝉蜕 姜半夏 紫苏叶 广藿香 鹿衔草
0.32399 0.406309 0.34767 0.415584 0.438632 0.371505 0.335802 0.343193 0.577158 0.644314 0.301654 0.397838
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 百合 紫苏叶

------Score: precision: 0.250000, recall: 0.250000, error: 0.750000
341. 
patient tongue id: 03192237110114_4_1
label yaofang:
甘草 薏苡仁 党参 山药 砂仁 天麻 鳖甲 茵陈 扁豆花 麦芽 紫苏梗 蜈蚣 白花蛇舌 天山雪莲
0.779003 0.308442 0.39275 0.545291 0.455317 0.407076 0.343301
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
342. 
patient tongue id: 05131612082027_1_2_7
label yaofang:
甘草 茯苓 党参 生地黄 牡丹皮 杜仲 山药 山茱萸 泽泻 车前子 菟丝子 桑寄生 益母草 白花蛇舌
0.958937 0.442517 0.640135 0.425614 0.305802 0.313258 0.601292 0.514465 0.5103 0.41804 0.443449 0.456379
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
343. 
patient tongue id: 04102052035309_6_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.318101 0.417888 0.315051 0.412493 0.446259 0.306212 0.31247 0.492199 0.594922 0.347366
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
344. 
patient tongue id: 01250636099448_5_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 薏苡仁 桃仁 鱼腥草 远志 浙贝母 款冬花 苇茎 苦杏仁 紫苏子
0.978726 0.483993 0.6313 0.407621 0.3253 0.356794 0.635533 0.559907 0.520177 0.462062 0.474249 0.44017
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
345. 
patient tongue id: 02111327355363_1_2_7
label yaofang:
川芎 陈皮 法半夏 防风 乳香 胆南星 藿香 荆芥穗 白芷 辛夷 苍耳子 芥子 醋没药
0.631632 0.366504 0.460967 0.343211 0.468614
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
346. 
patient tongue id: 03272235332035_1_4_7
label yaofang:
人参 当归 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子
0.484551 0.329169 0.340345 0.500722 0.521281 0.384956 0.325511 0.401339 0.302395
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝 车前子

------Score: precision: 0.111111, recall: 0.090909, error: 0.888889
347. 
patient tongue id: 03242146453277_1_7_2
label yaofang:
甘草 枳壳 太子参 黄芪 白术 海螵蛸 厚朴 砂仁 火麻仁 鸡内金 北沙参 首乌藤 紫苏梗 合欢皮
0.455943 0.32991 0.38893 0.497166 0.487097 0.312466
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
348. 
patient tongue id: 05221902373110_3
label yaofang:
枳壳 桔梗 荆芥 防风 羌活 牛蒡子 细辛 淡竹叶 款冬花 紫菀 苦杏仁 蝉蜕 紫苏叶
0.371315 0.309583 0.367095 0.347633 0.418026 0.409856
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
349. 
patient tongue id: 01040642322133_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 木香 薏苡仁 浙贝母 细辛 大腹皮 莱菔子 地骨皮 款冬花 紫苏子
0.919261 0.303448 0.477441 0.529159 0.362738 0.466916 0.431526 0.375492 0.360374 0.346511 0.300131
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
350. 
patient tongue id: 04201955406507_6_1
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 山药 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.95573 0.429858 0.599215 0.45472 0.311792 0.575538 0.470897 0.522142 0.381634 0.412496 0.448935
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
351. 
patient tongue id: 04211801560608_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.892968 0.329155 0.968022 0.513568 0.790834 0.889455 0.950051 0.860392 0.944424 0.961613 0.378976 0.527947 0.593461 0.804843
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.785714, recall: 0.687500, error: 0.214286
352. 
patient tongue id: 03242129362043_4_6
label yaofang:
柴胡 白芍 香附 枳壳 黄芩 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.39974 0.403759 0.437202 0.433825 0.591373 0.334879
predicted yaofang:
白芍 党参 白术 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.500000, recall: 0.272727, error: 0.500000
353. 
patient tongue id: 04291605237998_1_7_2
label yaofang:
桂枝 甘草 川芎 葛根 白术 红花 赤芍 杜仲 地黄 桑寄生 续断 桑枝 骨碎补 乌梢蛇 络石藤
0.944521 0.414361 0.586769 0.469453 0.313625 0.505474 0.366561 0.435474 0.309234
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.222222, recall: 0.133333, error: 0.777778
354. 
patient tongue id: 04262141595130_4_1
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.333822 0.837178 0.355583 0.938777 0.534028 0.72716 0.393681 0.345645 0.353695 0.340895 0.847608 0.916649 0.81356 0.901928 0.93643 0.431596 0.309956 0.518964 0.573512 0.778307
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
355. 
patient tongue id: 04181949571742_5
label yaofang:
桂枝 柴胡 白芍 黄芩 党参 五味子 郁金 虎杖 白花蛇舌草 姜半夏 炙甘草 土茯苓 溪黄草
0.402441 0.369205 0.398554 0.408366 0.463303
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
356. 
patient tongue id: 02211845094978_1_4
label yaofang:
桂枝 白芍 当归 茯苓 龙骨 牡蛎 牛蒡子 党参 黄芪 白术 附子 紫菀 炙甘草
0.61548 0.370378 0.313012 0.505494 0.449437
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
357. 
patient tongue id: 01132131515835_1_6
label yaofang:
甘草 桔梗 独活 薏苡仁 浙贝母 天麻 桑寄生 瓜蒌皮 豆蔻 白花蛇舌草 苦杏仁 蜈蚣 半枝莲 醋鳖甲
0.892952 0.411283 0.54468 0.481349 0.311415 0.441886 0.39672
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
358. 
patient tongue id: 03121857518410_4
label yaofang:
甘草 葛根 桔梗 防风 麦冬 玄参 生地黄 赤芍 白芷 北沙参 辛夷 广藿香 炒苍耳子 人参叶 炒六神曲 醋香附
0.9509 0.98902 0.607725 0.846265 0.406493 0.337862 0.317839 0.331711 0.948952 0.981965 0.919582 0.971774 0.990992 0.426436 0.587737 0.631061 0.873834
predicted yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.294118, recall: 0.312500, error: 0.705882
359. 
patient tongue id: 01092332436156_4
label yaofang:
党参 白术 干姜 大黄 火麻仁 炙甘草
0.523546 0.387766 0.371044 0.350331 0.367801
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.333333, error: 0.600000
360. 
patient tongue id: 02161836320574_2
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.360923 0.69542 0.413489 0.806863 0.469809 0.616677 0.31147 0.387041 0.359304 0.365689 0.355003 0.701122 0.774111 0.657091 0.757133 0.300309 0.819213 0.412848 0.305168 0.477929 0.510921 0.639801
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.590909, recall: 0.812500, error: 0.409091
361. 
patient tongue id: 04071416038321_4
label yaofang:
陈皮 法半夏 生姜 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 广藿香 炒苍耳子
0.33078 0.915385 0.33318 0.976424 0.557008 0.782475 0.408779 0.349238 0.339868 0.327084 0.915327 0.963792 0.879372 0.948182 0.978822 0.42509 0.531679 0.608114 0.832632
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
362. 
patient tongue id: 02120822494191_1
label yaofang:
甘草 白芍 黄芩 连翘 黄芪 白术 丹参 生地黄 菟丝子 桑寄生 益母草 皂角刺
0.950476 0.313102 0.467166 0.597968 0.408497 0.304135 0.317616 0.550389 0.492984 0.453527 0.404963 0.413196 0.38114
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.333333, error: 0.692308
363. 
patient tongue id: 04061349559062_1_4
label yaofang:
甘草 法半夏 茯苓 前胡 防风 薄荷 荆芥穗 香薷 豆蔻 紫苏梗 广藿香 威灵仙 麸炒白术 炒六神曲
0.347623 0.829998 0.37131 0.92454 0.523814 0.696837 0.31046 0.416591 0.379544 0.370959 0.358063 0.824958 0.900644 0.790454 0.877695 0.935089 0.429062 0.334835 0.511518 0.571371 0.747149
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.333333, recall: 0.500000, error: 0.666667
364. 
patient tongue id: 03271921325280_2_4
label yaofang:
法半夏 茯苓 前胡 桔梗 麦冬 玉竹 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 人参叶
0.725665 0.857825 0.477207 0.636597 0.453199 0.423111 0.353457 0.711998 0.8955 0.669021 0.796072 0.957935 0.329426 0.514744 0.433918 0.635749
predicted yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.571429, error: 0.500000
365. 
patient tongue id: 05242113505067_7_1
label yaofang:
桂枝 甘草 川芎 法半夏 茯苓 白术 红花 杜仲 牛膝 天麻 桑螵蛸 益智 辛夷 首乌藤 天山雪莲
0.980108 0.482864 0.638039 0.395528 0.317415 0.333595 0.616925 0.55226 0.490735 0.456841 0.468105 0.420409
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
366. 
patient tongue id: 01050641319963_1_2_6
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 赤芍 天麻 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.979569 0.480315 0.629429 0.416466 0.33594 0.356062 0.661648 0.569906 0.559371 0.480248 0.501869 0.503226
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
367. 
patient tongue id: 01052209566290_4_1
label yaofang:
橘红 黄芪 白术 赤芍 海螵蛸 浙贝母 生半夏 砂仁 鸡内金 枇杷叶 蜈蚣 五指毛桃 山慈菇 稻芽 红景天
0.564602 0.325188 0.316729 0.360773 0.569211 0.576822 0.316917 0.412496 0.324102 0.317831 0.346043
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
368. 
patient tongue id: 04251822492547_4
label yaofang:
麻黄 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷
0.326768 0.84925 0.352213 0.947365 0.523746 0.728302 0.387487 0.340023 0.334 0.328656 0.857945 0.925402 0.824461 0.910654 0.949798 0.421424 0.51254 0.578256 0.791381
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.687500, error: 0.421053
369. 
patient tongue id: 06190708280816_6_7_1
label yaofang:
桂枝 甘草 法半夏 龙骨 党参 丹参 红花 薤白 水蛭 天麻 瓜蒌皮 三棱 莪术 麦芽
0.992516 0.484382 0.680011 0.386676 0.324634 0.327348 0.70304 0.629401 0.579378 0.520355 0.542373 0.525428
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
370. 
patient tongue id: 03231040313074_6_2
label yaofang:
甘草 白芍 党参 五味子 山药 山茱萸 天麻 赤石脂 鳖甲 补骨脂 豆蔻 五倍子 建曲 蜈蚣 天山雪莲 半枝莲 广升麻
0.982318 0.464515 0.645 0.398902 0.306499 0.316327 0.630826 0.552228 0.523648 0.45073 0.470024 0.44457
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.470588, error: 0.333333
371. 
patient tongue id: 02122121483945_1_6
label yaofang:
甘草 木香 党参 黄芪 鸡血藤 山药 干姜 天麻 鳖甲 白扁豆 建曲 蜈蚣 半枝莲
0.987507 0.488324 0.657592 0.398409 0.335182 0.340285 0.676501 0.596994 0.548786 0.495258 0.513421 0.488204
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.538462, error: 0.416667
372. 
patient tongue id: 05140634368137_1_2_6
label yaofang:
甘草 白芍 太子参 生地黄 红花 赤芍 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤
0.967241 0.306526 0.435805 0.629768 0.415137 0.302843 0.602752 0.518125 0.524611 0.429241 0.453413 0.463527
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
373. 
patient tongue id: 03312026599069_1_2
label yaofang:
甘草 独活 党参 白术 酸枣仁 生地黄 杜仲 天麻 桑寄生 鳖甲 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.984069 0.462357 0.676547 0.428172 0.32523 0.354976 0.686262 0.583916 0.567099 0.480321 0.509919 0.51709
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
374. 
patient tongue id: 04241841344343_4_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 白花蛇舌草 姜半夏 炙甘草 紫苏梗 山慈菇
0.356362 0.319361 0.425167 0.304463 0.452736 0.455421 0.449993 0.535459
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.416667, error: 0.375000
375. 
patient tongue id: 06031107428321_6_5
label yaofang:
甘草 陈皮 茯苓 木香 连翘 党参 黄连 槟榔 苍术 厚朴 莱菔子 扁豆花 麦芽
0.977889 0.302118 0.482158 0.629516 0.396377 0.300442 0.311471 0.603144 0.552862 0.497473 0.45936 0.469345 0.406337
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
376. 
patient tongue id: 01122232481532_1_2
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 山药 地黄 天麻 麦芽 广藿香 蜈蚣 半枝莲 醋鳖甲
0.935596 0.305745 0.443383 0.589542 0.42974 0.307568 0.502145 0.419212 0.421114 0.327222 0.345775 0.317856
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
377. 
patient tongue id: 02212131519143_2_5
label yaofang:
甘草 黄芩 法半夏 茯苓 薄荷 牛蒡子 党参 白术 黄连 鳖甲 白花蛇舌 蜂房 岗梅根 四季青 广升麻
0.960292 0.482815 0.590076 0.386088 0.325773 0.562034 0.47983 0.439718 0.385894 0.393379 0.356616
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
378. 
patient tongue id: 06132023412614_1_4_7
label yaofang:
甘草 枳壳 半夏 牛蒡子 黄芪 白术 赤芍 杜仲 厚朴 肉苁蓉 莪术 鸡内金 北沙参 紫苏梗 蜈蚣
0.903442 0.389666 0.494411 0.339219 0.556141 0.301527 0.341251 0.398219
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
379. 
patient tongue id: 06050915326782_1_3_7
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.617713 0.338991 0.517606 0.453534 0.362341
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
380. 
patient tongue id: 03261651213449_4
label yaofang:
甘草 前胡 荆芥 防风 牛蒡子 鱼腥草 浙贝母 桑白皮 紫菀 枇杷叶 紫苏叶 东风桔
0.382998 0.3963 0.486759 0.516924 0.301007
predicted yaofang:
甘草 党参 黄芪 白术 海螵蛸

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
381. 
patient tongue id: 03141605059502_1_2_7
label yaofang:
甘草 白芍 当归 山药 巴戟天 生山萸肉
0.620476 0.334021 0.37661 0.479951 0.387718
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.333333, error: 0.600000
382. 
patient tongue id: 01140810454226_6_7_5
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 大枣 茯苓 桃仁 党参 酸枣仁 丹参 黄连 红花 胆南星 莪术 首乌藤
0.806567 0.422554 0.474147 0.421275 0.355986 0.313814
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
383. 
patient tongue id: 01172342582375_1_2_6
label yaofang:
甘草 柴胡 白芍 香附 法半夏 茯苓 党参 酸枣仁 丹参 生地黄 牡丹皮 菟丝子 益母草 合欢花
0.96627 0.483488 0.590545 0.417637 0.309257 0.336689 0.566393 0.495181 0.467181 0.408773 0.413744 0.3804
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
384. 
patient tongue id: 01062338537439_1_4_6
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.686915 0.305901 0.452209 0.472166 0.302193 0.356142
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
385. 
patient tongue id: 05182159013014_2_1
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.312271 0.487803 0.371933 0.59003 0.365982 0.449564 0.33366 0.488369 0.574919 0.503291 0.578317 0.370927 0.639249 0.309627 0.336558 0.329068 0.472017
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.647059, recall: 0.785714, error: 0.352941
386. 
patient tongue id: 02182009588372_4_7
label yaofang:
甘草 白芍 川芎 羌活 黄芪 牛膝 细辛 天麻 全蝎 白芷 皂角刺 辛夷 苍耳子
0.988053 0.480513 0.655971 0.385651 0.322498 0.332794 0.670238 0.592783 0.5435 0.48502 0.504035 0.477498
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
387. 
patient tongue id: 01040034403992_1_6_4
label yaofang:
甘草 川芎 桃仁 枸杞子 红花 杜仲 天麻 桑寄生 益母草 鳖甲 粉葛 沙苑子 白花蛇舌 半枝莲
0.9837 0.482644 0.652543 0.385853 0.312096 0.325328 0.631517 0.555538 0.50238 0.453417 0.465457 0.420887
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
388. 
patient tongue id: 05312152047031_6_4_1
label yaofang:
甘草 枳壳 法半夏 党参 丹参 赤芍 薤白 天麻 瓜蒌皮 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜 宽筋藤
0.991273 0.46258 0.696634 0.400944 0.315601 0.354542 0.357802 0.742756 0.64697 0.649275 0.549909 0.586928 0.630928
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
389. 
patient tongue id: 04182032359196_9
label yaofang:
枳壳 牛蒡子 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶 独脚金
0.55833 0.36531 0.306741 0.44745 0.437653
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
390. 
patient tongue id: 03272250374718_4_3
label yaofang:
桂枝 茯苓 桔梗 半夏 党参 黄芪 白术 砂仁 莱菔子 鸡内金 麦芽 炙甘草
0.77786 0.427422 0.453172 0.345506 0.339086
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
391. 
patient tongue id: 05171900213570_1
label yaofang:
陈皮 茯苓 前胡 防风 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.338586 0.762102 0.371544 0.884543 0.472642 0.64227 0.358717 0.333362 0.323839 0.30771 0.768592 0.849308 0.739611 0.837795 0.308694 0.887671 0.395929 0.461686 0.544506 0.728693
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
392. 
patient tongue id: 03291624470070_1_2_6
label yaofang:
甘草 桔梗 薏苡仁 浙贝母 天麻 鳖甲 紫菀 百部 苦杏仁 炙麻黄 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.980061 0.469661 0.629133 0.405511 0.324061 0.320783 0.637401 0.57931 0.555384 0.487062 0.509025 0.491801
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
393. 
patient tongue id: 04130636245448_1_6
label yaofang:
甘草 法半夏 茯苓 前胡 薏苡仁 党参 郁金 砂仁 莱菔子 天麻 鳖甲 款冬花 莪术 蜈蚣 白花蛇舌 天山雪莲
0.886851 0.445359 0.594422 0.391003 0.309763 0.504892 0.346792 0.369823
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.375000, error: 0.250000
394. 
patient tongue id: 04142237189321_2
label yaofang:
甘草 前胡 桔梗 金银花 连翘 薄荷 芦根 牛蒡子 桑叶 菊花 白前 苦杏仁 紫苏叶 木蝴蝶
0.457818 0.322442 0.384813 0.388169 0.494357
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
395. 
patient tongue id: 06071205262413_1_3
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.374981 0.300267 0.373785 0.480971
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.750000, recall: 0.250000, error: 0.250000
396. 
patient tongue id: 01062343401491_3_5_8
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.917244 0.456063 0.482713 0.362047 0.319811 0.405774 0.320496 0.333753
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 党参 天麻 款冬花

------Score: precision: 0.125000, recall: 0.083333, error: 0.875000
397. 
patient tongue id: 04122045022755_3_4
label yaofang:
甘草 薏苡仁 党参 熟附子 赤芍 杜仲 天麻 桑寄生 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.84985 0.309694 0.404293 0.576547 0.440604 0.442856 0.35215
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
398. 
patient tongue id: 01122231511043_5_6
label yaofang:
甘草 蒲公英 党参 黄芪 白术 黄连 郁金 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 红豆杉 广升麻
0.939095 0.469779 0.565048 0.410008 0.317235 0.338683 0.525358 0.463068 0.452916 0.383882 0.386098 0.349558
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
399. 
patient tongue id: 03061805430610_1_5
label yaofang:
甘草 茯苓 远志 牡丹皮 黄柏 山药 巴戟天 金樱子 蛇床子 麦芽 苦参 白扁豆 土茯苓
0.839908 0.30295 0.461203 0.51077 0.378895 0.415246 0.337676 0.334207
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
400. 
patient tongue id: 02190438125539_1_2_4
label yaofang:
甘草 远志 党参 生地黄 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲 宽筋藤
0.925766 0.456894 0.521441 0.339217 0.450431 0.363038 0.350743
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
401. 
patient tongue id: 02142003339952_4
label yaofang:
桂枝 柴胡 黄芩 党参 虎杖 白花蛇舌草 姜半夏 炙甘草 土茯苓
0.446104 0.516711 0.353071 0.330175
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.250000, recall: 0.111111, error: 0.750000
402. 
patient tongue id: 04061835397566_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.328426 0.891938 0.345141 0.963932 0.541478 0.759727 0.399767 0.347291 0.340576 0.322894 0.890078 0.947598 0.847686 0.927835 0.966562 0.407049 0.510131 0.586188 0.807549
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.875000, error: 0.263158
403. 
patient tongue id: 02211359023524_1_2_7
label yaofang:
甘草 麦冬 太子参 枸杞子 玄参 生地黄 牡丹皮 知母 山药 天麻 天花粉 北沙参 黄精
0.504584 0.336657 0.374103 0.520287 0.502783 0.314513 0.358905 0.302335 0.415959 0.315365 0.340563 0.328832 0.301017 0.315603 0.30868 0.320391
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.125000, recall: 0.153846, error: 0.875000
404. 
patient tongue id: 04132037495241_5_2
label yaofang:
甘草 茯苓 桔梗 橘红 党参 丹参 僵蚕 枇杷叶 北沙参 咸竹蜂
0.460187 0.30445 0.4451 0.619855 0.390297 0.308605 0.366471 0.31617
predicted yaofang:
甘草 桃仁 党参 黄芪 白术 丹参 牛膝 厚朴

------Score: precision: 0.375000, recall: 0.300000, error: 0.625000
405. 
patient tongue id: 04130630379678_1_6
label yaofang:
甘草 法半夏 茯苓 枸杞子 白术 天麻 鳖甲 麦芽 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.982051 0.484086 0.633845 0.38811 0.306511 0.319577 0.615795 0.554622 0.484796 0.454988 0.458347 0.399503
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
406. 
patient tongue id: 03091844112760_2_4
label yaofang:
麻黄 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.343366 0.846398 0.365754 0.93784 0.512347 0.717503 0.400401 0.353573 0.345131 0.340881 0.845361 0.913594 0.805783 0.895663 0.943927 0.421029 0.300027 0.513505 0.568179 0.768966
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
407. 
patient tongue id: 05250737519819_2_6_7
label yaofang:
甘草 法半夏 茯苓 丹参 青皮 浙贝母 牡丹皮 郁金 灯心草 白芷 天花粉 瓜蒌皮 皂角刺
0.937499 0.433053 0.606072 0.422146 0.329425 0.539552 0.339029 0.397621
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
408. 
patient tongue id: 02020839283105_6_4
label yaofang:
甘草 茯苓 远志 党参 白术 天麻 鳖甲 扁豆花 麦芽 佛手 蜈蚣 白花蛇舌 天山雪莲 半枝莲 木棉花
0.879862 0.343539 0.408747 0.546161 0.407385 0.403557 0.315254 0.35031
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.875000, recall: 0.466667, error: 0.125000
409. 
patient tongue id: 06022243164161_1_4_7
label yaofang:
枳壳 茯苓 半夏 党参 太子参 枸杞子 白术 杜仲 牛膝 郁金 厚朴 菟丝子 鸡内金 莲子 北沙参 紫苏梗 红豆杉 土茯苓 预知子
0.46964 0.302689 0.397184 0.305896 0.636027 0.608954 0.331888 0.466642 0.358162 0.423097 0.408945 0.32808
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.666667, recall: 0.421053, error: 0.333333
410. 
patient tongue id: 03151855349633_1_7
label yaofang:
桂枝 当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.374462 0.300303 0.408724 0.357412 0.397635 0.353152
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
411. 
patient tongue id: 04192251436734_6
label yaofang:
甘草 白芍 川芎 茯苓 橘红 防风 黄芪 白术 酸枣仁 五味子 浙贝母 山茱萸 仙茅 麦芽 辛夷 苍耳子 蜂房
0.985435 0.489189 0.639316 0.378353 0.30311 0.31169 0.622779 0.562658 0.490906 0.459192 0.466298 0.403325
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.176471, error: 0.750000
412. 
patient tongue id: 05270618578477_1_2_6
label yaofang:
甘草 白芍 枳壳 当归 木香 仙鹤草 茜草 天麻 地榆 赤石脂 鳖甲 补骨脂 豆蔻 蜈蚣 半枝莲 红豆杉
0.955811 0.470068 0.59356 0.403029 0.316303 0.53907 0.469659 0.433945 0.375896 0.383446 0.33666
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
413. 
patient tongue id: 02181626041591_2_1
label yaofang:
甘草 枳壳 防风 生地黄 茜草 天麻 地榆 槐花 鳖甲 火麻仁 五倍子 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.980647 0.466805 0.631744 0.408749 0.3159 0.30655 0.631846 0.577456 0.546147 0.481411 0.50205 0.496596
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
414. 
patient tongue id: 04171811296364_1
label yaofang:
陈皮 桔梗 海螵蛸 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.310193 0.408807 0.334331 0.39011 0.434055 0.373837 0.330301 0.346702 0.581429 0.666208 0.403073
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.363636, recall: 0.363636, error: 0.636364
415. 
patient tongue id: 05232001453630_2_7
label yaofang:
甘草 半夏 黄芪 枸杞子 白术 牡丹皮 郁金 山茱萸 厚朴 淡豆豉 砂仁 莪术 麦芽 预知子
0.708816 0.379292 0.494633 0.397011 0.430286 0.330773
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
416. 
patient tongue id: 02211402073496_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 淡竹叶 北沙参
0.441535 0.314682 0.435326 0.637766 0.3629 0.300633 0.386161 0.316813
predicted yaofang:
甘草 桃仁 党参 黄芪 白术 丹参 牛膝 鸡内金

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
417. 
patient tongue id: 03231120386377_5_1
label yaofang:
甘草 柴胡 白芍 薏苡仁 白术 黄柏 郁金 苍术 山药 车前子 荆芥穗 鳖甲 白花蛇舌草 蜈蚣 天山雪莲 红豆杉
0.984809 0.462876 0.624876 0.416514 0.307462 0.621763 0.521631 0.523721 0.42124 0.42992 0.399234
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
418. 
patient tongue id: 05180832586570_6_7_2
label yaofang:
桂枝 甘草 柴胡 白芍 枳壳 茯苓 党参 白术 黄连 红花 肉桂 山茱萸 干姜 王不留行 浮小麦 艾叶
0.903445 0.311284 0.358276 0.576867 0.441575 0.395353 0.337118
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
419. 
patient tongue id: 03081811438533_6
label yaofang:
龙骨 丹参 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.314467 0.406052 0.37571 0.437332 0.577186
predicted yaofang:
白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
420. 
patient tongue id: 06140811569035_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.481009 0.352681 0.380139 0.315601 0.499312 0.49599 0.379586 0.304414 0.401982 0.319235 0.326526 0.34843 0.348623 0.332236 0.320925 0.329414
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.250000, recall: 0.333333, error: 0.750000
421. 
patient tongue id: 04102057235415_3
label yaofang:
茯苓 桔梗 薏苡仁 麦冬 党参 白术 附子 山药 干姜 砂仁 鸡内金 麦芽 北沙参 炙甘草 稻芽
0.397522 0.392643 0.388651 0.436671
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.500000, recall: 0.133333, error: 0.500000
422. 
patient tongue id: 05290758413287_1_2
label yaofang:
甘草 茯苓 桔梗 玉竹 太子参 浙贝母 天麻 白花蛇舌草 北沙参 苦杏仁 蜈蚣 半枝莲 醋鳖甲 化橘红
0.946762 0.450969 0.582619 0.41448 0.517894 0.446949 0.433763 0.363149 0.377011 0.340924
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
423. 
patient tongue id: 01052107241455_1_2
label yaofang:
陈皮 当归 熟地 茯苓 五味子 细辛 干姜 生地 炙甘草 法夏
0.861354 0.336517 0.39001 0.520559 0.392813 0.324957
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.100000, error: 0.833333
424. 
patient tongue id: 02190545136525_5_1
label yaofang:
甘草 防风 金银花 连翘 黄芪 白术 玄参 五味子 生地黄 牡丹皮 仙鹤草 茜草 水牛角 淡竹叶 麦芽 白鲜皮
0.730276 0.330743 0.397221 0.531487 0.452046 0.302362 0.386216 0.314173
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 蜈蚣

------Score: precision: 0.250000, recall: 0.125000, error: 0.750000
425. 
patient tongue id: 02122101348965_6_5_1
label yaofang:
柴胡 白芍 黄芩 法半夏 大枣 茯苓 龙骨 牡蛎 党参 竹茹 郁金 石菖蒲 大黄 炙甘草 浮小麦 合欢花
0.935422 0.328635 0.449953 0.583832 0.423707 0.492656 0.414948 0.414149 0.317856 0.341075 0.300022
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
426. 
patient tongue id: 05261933056225_1_4_7
label yaofang:
陈皮 半夏 党参 黄芪 枸杞子 白术 杜仲 牛膝 郁金 山药 厚朴 僵蚕 菟丝子 鸡内金 紫苏梗 红豆杉
0.546935 0.358179 0.471776 0.461544 0.384762
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
427. 
patient tongue id: 04112028460285_1_2
label yaofang:
甘草 茯苓 党参 白术 丹参 郁金 山药 天麻 鳖甲 王不留行 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.941667 0.302894 0.445361 0.608743 0.43217 0.316084 0.547668 0.457126 0.453398 0.35663 0.376341 0.356305
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
428. 
patient tongue id: 05022224296344_2_6
label yaofang:
甘草 柴胡 白芍 黄芩 茯苓 桃仁 党参 白术 生地黄 菟丝子 益母草 淫羊藿 仙茅 合欢花
0.985875 0.487777 0.656738 0.396962 0.323629 0.337806 0.668253 0.594842 0.545628 0.497724 0.508703 0.47045
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
429. 
patient tongue id: 02182149310238_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 干姜 款冬花 苦杏仁 紫苏子 炙麻黄
0.982242 0.474209 0.64247 0.410824 0.31635 0.328214 0.635825 0.557638 0.527228 0.457634 0.481457 0.466358
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
430. 
patient tongue id: 05022215346235_2_6
label yaofang:
甘草 党参 玄参 赤芍 浙贝母 郁金 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲 猫爪草
0.961261 0.464124 0.611557 0.415044 0.319528 0.551196 0.466555 0.436056 0.366033 0.374975 0.351177
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
431. 
patient tongue id: 05260646327673_4_7
label yaofang:
甘草 陈皮 法半夏 茯苓 牛蒡子 桃仁 白术 红花 赤芍 浙贝母 细辛 紫苏梗 威灵仙 田七末
0.972605 0.437507 0.619854 0.451097 0.331997 0.591298 0.472223 0.51169 0.369731 0.401759 0.411942
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
432. 
patient tongue id: 05290759440515_2_5
label yaofang:
甘草 法半夏 茯苓 麦冬 太子参 生地黄 栀子 石膏 山药 青蒿 淡竹叶 北沙参
0.993304 0.478401 0.686283 0.387969 0.318876 0.325782 0.730817 0.638066 0.609947 0.531629 0.559887 0.560022
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
433. 
patient tongue id: 03091905364448_6
label yaofang:
甘草 川芎 栀子 牡丹皮 杜仲 牛膝 天麻 桑寄生 鳖甲 麦芽 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.994877 0.4711 0.711996 0.396033 0.31926 0.357488 0.352158 0.767724 0.669665 0.670741 0.56882 0.615559 0.651363
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
434. 
patient tongue id: 06190139080832_1_7
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 党参 白术 郁金 厚朴 砂仁 麦芽 紫苏梗 广藿香 木棉花 火炭母 救必应
0.885392 0.439844 0.585078 0.417038 0.351538 0.512454 0.309864 0.350914
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.235294, error: 0.500000
435. 
patient tongue id: 03081847078615_4
label yaofang:
麻黄 陈皮 前胡 半夏 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香
0.332384 0.906895 0.322213 0.974195 0.561759 0.796925 0.402256 0.336135 0.3172 0.332058 0.912614 0.962056 0.87843 0.950405 0.978487 0.436463 0.568208 0.614552 0.825733
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
436. 
patient tongue id: 04201942212243_1_2_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.891753 0.415749 0.575183 0.32901 0.450112 0.328243 0.497013 0.383947
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 天麻 蜈蚣

------Score: precision: 0.750000, recall: 0.428571, error: 0.250000
437. 
patient tongue id: 06181659305358_5
label yaofang:
甘草 连翘 牛蒡子 蒲公英 黄芪 赤芍 浙贝母 牡丹皮 桑叶 桑白皮 白鲜皮 辛夷 蜈蚣 姜黄 土牛膝
0.671854 0.384581 0.426451 0.341445 0.300804 0.350288 0.308933 0.309245
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 党参 白术 款冬花

------Score: precision: 0.125000, recall: 0.066667, error: 0.875000
438. 
patient tongue id: 04131848339695_1
label yaofang:
甘草 茯苓 半夏 黄芪 白术 丹参 海螵蛸 浙贝母 杜仲 厚朴 砂仁 僵蚕 莪术 北沙参 紫苏叶 蛇舌草
0.530361 0.348234 0.388483 0.507443 0.504542 0.342365 0.311711
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.857143, recall: 0.375000, error: 0.142857
439. 
patient tongue id: 03312044594120_4_7
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 独活 浙贝母 杜仲 细辛 桑寄生 款冬花 白前 牛大力
0.990071 0.483814 0.669807 0.388453 0.317045 0.322924 0.688337 0.61509 0.55696 0.509467 0.523244 0.501759
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
440. 
patient tongue id: 03040850557983_6_4
label yaofang:
甘草 川芎 陈皮 法半夏 茯苓 远志 党参 白术 酸枣仁 生地黄 竹茹 胆南星 浮小麦 首乌藤
0.808309 0.322572 0.411529 0.503934 0.44314 0.356615 0.325885
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
441. 
patient tongue id: 03222038102778_1_2
label yaofang:
玉竹 黄芪 白术 五味子 熟地黄 牡丹皮 山药 山茱萸 当归尾 北沙参 辛夷 蜈蚣 猫爪草 冬凌草
0.509998 0.3352 0.359204 0.615515 0.598584 0.330255 0.439201 0.356948 0.393986 0.352363 0.307803
predicted yaofang:
甘草 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
442. 
patient tongue id: 04142235021638_1_2_6
label yaofang:
甘草 白芍 陈皮 茯苓 党参 白术 黄连 延胡索 熟地黄 槟榔 乌梅 山药 茜草 砂仁 鸡内金 麦芽
0.958127 0.316188 0.460533 0.595847 0.410187 0.53862 0.473722 0.444582 0.375554 0.393096 0.339666
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
443. 
patient tongue id: 03032017312703_2
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 麦冬 太子参 款冬花 紫菀 百部 北沙参 炙甘草 炒紫苏子 人参叶
0.361251 0.587777 0.407821 0.677567 0.433236 0.51739 0.333962 0.337311 0.334295 0.32426 0.313567 0.583603 0.642095 0.562035 0.629508 0.357583 0.707951 0.370089 0.327656 0.395563 0.436029 0.548185
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.545455, recall: 0.857143, error: 0.454545
444. 
patient tongue id: 04181940077963_6_1
label yaofang:
甘草 柴胡 党参 赤芍 郁金 山药 天麻 鳖甲 佛手 蜈蚣 白花蛇舌 天山雪莲 红豆杉 猫爪草
0.971912 0.301524 0.47388 0.624761 0.400218 0.300567 0.308497 0.581454 0.522648 0.473522 0.426756 0.43993 0.395663
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
445. 
patient tongue id: 05270620515603_1_6
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 浙贝母 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.98038 0.471358 0.636347 0.402621 0.312434 0.324042 0.634065 0.564719 0.52234 0.465588 0.479317 0.462095
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
446. 
patient tongue id: 01031815255285_1
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.349057 0.788042 0.378184 0.905934 0.487086 0.678889 0.3792 0.33408 0.335515 0.321688 0.801658 0.876103 0.762833 0.860893 0.907684 0.405183 0.49912 0.552796 0.718589
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
447. 
patient tongue id: 01121859066674_4_1
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 钩藤 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子
0.351247 0.821609 0.368783 0.923924 0.513194 0.716037 0.373592 0.329248 0.34884 0.338425 0.826201 0.897313 0.788137 0.883326 0.925114 0.420197 0.521771 0.572588 0.748038
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
448. 
patient tongue id: 03272238467098_1_2
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.570191 0.353518 0.508149 0.401673 0.367161
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
449. 
patient tongue id: 06171154037668_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.489793 0.304018 0.40137 0.34335 0.372612 0.336858 0.31353
predicted yaofang:
甘草 法半夏 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
450. 
patient tongue id: 01042300325775_7
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 莪术 豆蔻 姜半夏 炙甘草 紫苏梗 瓦楞子
0.404433 0.378311 0.438885 0.410755 0.435704
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
451. 
patient tongue id: 03041138019642_1_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.35816 0.662666 0.400142 0.75922 0.444665 0.569294 0.324799 0.339258 0.320424 0.333922 0.314036 0.646178 0.721197 0.627039 0.71281 0.342313 0.77528 0.378298 0.311484 0.417453 0.483337 0.60289
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.681818, recall: 0.937500, error: 0.318182
452. 
patient tongue id: 04182158400875_2_6_1
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 党参 延胡索 乌梅 山药 益母草 鳖甲 莪术 白花蛇舌 红豆杉
0.977335 0.477113 0.617684 0.402283 0.327694 0.606956 0.539494 0.486371 0.444156 0.442048 0.406706
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
453. 
patient tongue id: 02182016022334_7_2_6
label yaofang:
甘草 柴胡 香附 枳壳 茯苓 桃仁 丹参 生地黄 赤芍 乌药 山药 菟丝子 益母草 合欢花
0.991836 0.494383 0.662032 0.397309 0.339996 0.355801 0.698811 0.626424 0.582462 0.528928 0.539329 0.528673
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
454. 
patient tongue id: 04130303523550_6_7_2
label yaofang:
桂枝 甘草 柴胡 白芍 香附 茯苓 桃仁 党参 黄连 红花 菟丝子 益母草
0.983462 0.43002 0.620162 0.485704 0.339542 0.613411 0.496087 0.5801 0.384337 0.432946 0.472406
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
455. 
patient tongue id: 03282217422837_5
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 金银花 连翘 芦根 浙贝母 淡竹叶 诃子 苦杏仁
0.80361 0.333491 0.397516 0.555637 0.437633 0.400272 0.324555
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
456. 
patient tongue id: 01130637185885_1_2_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 鱼腥草 浙贝母 鳖甲 款冬花 紫菀 诃子 白花蛇舌 蜂房 四季青
0.909667 0.45961 0.558802 0.385627 0.316438 0.492966 0.397552 0.375378 0.30893 0.308509
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
457. 
patient tongue id: 05251940285221_2_4_7
label yaofang:
甘草 茯苓 葶苈子 黄芪 枸杞子 赤芍 胆南星 浙贝母 附子 郁金 山茱萸 生半夏 全蝎 僵蚕 柿蒂 天竺黄 赭石 黑枣 土鳖虫 姜黄
0.760467 0.391071 0.455483 0.349725 0.499855
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.150000, error: 0.400000
458. 
patient tongue id: 05092237048121_6_2
label yaofang:
甘草 柴胡 香附 枳壳 茯苓 半夏 党参 白术 浙贝母 厚朴 僵蚕 夏枯草 合欢皮 预知子
0.778857 0.388165 0.442239 0.365996 0.512836 0.332846
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
459. 
patient tongue id: 03221616552594_1_2
label yaofang:
甘草 白芍 川芎 香附 枳壳 黄芩 当归 党参 白术 丹参 生地黄 砂仁 菟丝子 桑寄生 莪术
0.986582 0.49037 0.643517 0.390185 0.321859 0.34264 0.653354 0.575796 0.515725 0.468531 0.475645 0.430698
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
460. 
patient tongue id: 03221307369672_5_6_1
label yaofang:
甘草 陈皮 党参 黄连 红花 牛膝 石膏 苍术 天麻 天花粉 鳖甲 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.974247 0.454696 0.642428 0.382109 0.308213 0.336739 0.643703 0.502587 0.500851 0.389939 0.412201 0.403088
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
461. 
patient tongue id: 04131808275500_4_6
label yaofang:
甘草 柴胡 白芍 枳壳 党参 延胡索 川楝子 山药 天麻 猪苓 鳖甲 蜈蚣 天山雪莲 半枝莲
0.928783 0.466813 0.584338 0.418265 0.336091 0.528129 0.457052 0.431344 0.368895 0.373896 0.335809
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
462. 
patient tongue id: 03261555596938_2
label yaofang:
桔梗 荆芥 防风 羌活 芦根 牛蒡子 细辛 苦杏仁 炙甘草 紫苑 野马追
0.452955 0.347339 0.436376 0.471092 0.371247 0.304376
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
463. 
patient tongue id: 06072255368046_1_7
label yaofang:
甘草 茯苓 太子参 鸡血藤 酸枣仁 丹参 生地黄 赤芍 砂仁 天麻 鳖甲 白花蛇舌草 蜈蚣 天山雪莲 半枝莲
0.990468 0.463318 0.672109 0.429523 0.30153 0.340404 0.359458 0.737741 0.630512 0.655912 0.537012 0.578822 0.640399
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
464. 
patient tongue id: 04282303197895_3_6
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 知母 山药 山茱萸 补骨脂 鹿角霜 浮小麦 百合 川加皮
0.982631 0.483738 0.639733 0.40154 0.316786 0.338145 0.635538 0.551655 0.501105 0.44421 0.461231 0.414627
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
465. 
patient tongue id: 04020825417695_1_2
label yaofang:
甘草 白芍 陈皮 防风 桃仁 党参 枸杞子 白术 生地黄 车前子 菟丝子 桑寄生 益母草 女贞子 建曲 覆盆子
0.882043 0.322974 0.453034 0.557621 0.38458 0.460533 0.390421 0.361273 0.311717 0.322842
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
466. 
patient tongue id: 05231942379915_2_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄 麸炒白术 醋五味子
0.325535 0.869811 0.342165 0.953425 0.529338 0.733745 0.396847 0.354861 0.341559 0.325948 0.867886 0.934041 0.834964 0.916896 0.96312 0.41227 0.51529 0.596023 0.802451
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.562500, error: 0.526316
467. 
patient tongue id: 02222334070377_6_5
label yaofang:
茯苓 薏苡仁 玉竹 党参 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 山药 当归尾 砂仁 菟丝子 巴戟天 桑寄生 芡实 鸡内金 莲子 北沙参 百合 红豆杉 合欢皮 山慈菇
0.311399 0.37161 0.516221 0.320976
predicted yaofang:
甘草 党参 黄芪 牛膝

------Score: precision: 0.500000, recall: 0.083333, error: 0.500000
468. 
patient tongue id: 04200640061959_6_1
label yaofang:
甘草 白芍 川芎 牡蛎 麦冬 枸杞子 天冬 牛膝 菊花 泽泻 天麻 女贞子 墨旱莲 龟甲
0.874292 0.333371 0.46693 0.486343 0.341084 0.425573 0.321974
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
469. 
patient tongue id: 06072355512978_1_7_4
label yaofang:
甘草 川芎 党参 何首乌 黄连 赤芍 牛膝 郁金 山药 天麻 天花粉 益母草 决明子 红曲 谷精子
0.905944 0.410229 0.566372 0.456962 0.458068 0.339991 0.396845
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
470. 
patient tongue id: 05092139598441_4_1_6
label yaofang:
甘草 黄芩 法半夏 桔梗 浙贝母 细辛 桑白皮 鳖甲 款冬花 紫菀 苦杏仁 白花蛇舌 蜂房 四季青
0.983303 0.488704 0.635929 0.402857 0.321925 0.331894 0.636946 0.570908 0.517998 0.470904 0.486556 0.435206
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
471. 
patient tongue id: 04271529206511_1_2_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 赤芍 牛膝 郁金 六神曲
0.445706 0.41617 0.327684 0.511062 0.600819 0.410101 0.351153 0.494759 0.334832 0.388438 0.400504 0.418211 0.399433 0.375259 0.405293
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.266667, recall: 0.307692, error: 0.733333
472. 
patient tongue id: 02272158459546_6_4
label yaofang:
桂枝 甘草 白芍 川芎 陈皮 枳壳 当归 茯苓 龙骨 牡蛎 牛蒡子 远志 麦冬 党参 酸枣仁 柏子仁 竹茹 牡丹皮 吴茱萸 姜半夏
0.318944 0.43158 0.370331 0.394263 0.454351 0.372331 0.319333 0.312445 0.656423 0.705238 0.413599
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.363636, recall: 0.200000, error: 0.636364
473. 
patient tongue id: 06031049385633_1_2_6
label yaofang:
桂枝 甘草 白芍 茯苓 党参 黄芪 白术 生地黄 赤芍 山药 山茱萸 粉葛 牛大力 千斤拔 络石藤
0.796541 0.370001 0.363011 0.512519 0.424945
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.333333, error: 0.000000
474. 
patient tongue id: 02120757349998_2
label yaofang:
橘红 麦冬 五味子 海螵蛸 桑叶 僵蚕 天花粉 枇杷叶 地龙 北沙参 蝉蜕 辛夷
0.370338 0.616883 0.389826 0.759297 0.438781 0.565596 0.303359 0.333273 0.303397 0.303741 0.3055 0.647242 0.711878 0.626935 0.732008 0.338413 0.748271 0.39888 0.43402 0.473178 0.607392
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.095238, recall: 0.166667, error: 0.904762
475. 
patient tongue id: 02211207014904_1_4_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.479056 0.329938 0.335135 0.508204 0.501808 0.3372 0.337457 0.374823 0.326086
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝 车前子

------Score: precision: 0.444444, recall: 0.333333, error: 0.555556
476. 
patient tongue id: 04131810034539_2
label yaofang:
甘草 黄芩 法半夏 桔梗 浙贝母 鳖甲 款冬花 紫菀 苦杏仁 白花蛇舌 蜂房 四季青 红豆杉
0.877089 0.322596 0.448678 0.54964 0.412933 0.446163 0.390284 0.374851 0.319337 0.319497
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.300000, recall: 0.230769, error: 0.700000
477. 
patient tongue id: 05262058549635_6_4
label yaofang:
甘草 柴胡 白芍 薏苡仁 浙贝母 郁金 天麻 白花蛇舌草 苦杏仁 浮小麦 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.954748 0.439813 0.593045 0.461278 0.335689 0.565953 0.432007 0.511612 0.341602 0.368644 0.397624
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
478. 
patient tongue id: 04272307073135_4_6
label yaofang:
甘草 柴胡 白芍 枳壳 桔梗 黄芪 白术 生地黄 槟榔 厚朴 肉苁蓉 火麻仁 柿蒂 紫菀 石上柏
0.344076 0.398448 0.401323 0.433143 0.364939 0.556412
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
479. 
patient tongue id: 05092144585401_4_1_6
label yaofang:
甘草 白芍 陈皮 防风 羌活 薏苡仁 白术 浙贝母 天麻 鳖甲 补骨脂 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.985605 0.488853 0.633445 0.380803 0.317435 0.619717 0.551048 0.478417 0.442076 0.445962 0.385268
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
480. 
patient tongue id: 02141954002349_1
label yaofang:
甘草 海螵蛸 枳实 肉桂 干姜 附片
0.333937 0.314332 0.419575 0.30063 0.439792 0.471904 0.307914 0.300032 0.452915 0.551638 0.347858
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 柏子仁 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.181818, recall: 0.333333, error: 0.818182
481. 
patient tongue id: 03090757578761_1_5
label yaofang:
甘草 前胡 桔梗 金银花 芦根 牛蒡子 浙贝母 天麻 鳖甲 苦杏仁 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.83983 0.405337 0.526859 0.434384 0.388009 0.316889
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
482. 
patient tongue id: 01042332284833_7_6
label yaofang:
甘草 羌活 远志 党参 鸡血藤 白术 地黄 天麻 白花蛇舌草 威灵仙 蜈蚣 半枝莲 醋鳖甲 乌梢蛇
0.942449 0.456572 0.591562 0.437671 0.317637 0.340813 0.570513 0.492064 0.492502 0.409489 0.421738 0.426964
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
483. 
patient tongue id: 02190642028124_2_6_1
label yaofang:
甘草 党参 酸枣仁 丹参 生地黄 山药 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.980442 0.457624 0.636996 0.411303 0.300246 0.31876 0.639561 0.547876 0.541314 0.4487 0.474975 0.485046
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
484. 
patient tongue id: 05232118075663_1_4_7
label yaofang:
甘草 茯苓 党参 枸杞子 白术 海螵蛸 杜仲 牛膝 郁金 山药 菟丝子 鸡内金 紫苏叶 骨碎补 合欢皮 蛇舌草
0.584898 0.358231 0.400147 0.434855 0.471849
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.250000, error: 0.200000
485. 
patient tongue id: 06190627350227_2_7
label yaofang:
甘草 川芎 龙骨 桃仁 党参 枸杞子 酸枣仁 红花 杜仲 山药 钩藤 天麻 桑寄生 女贞子 浮小麦 墨旱莲
0.987202 0.477862 0.670443 0.404671 0.321344 0.346577 0.683926 0.58893 0.55573 0.485481 0.508098 0.487575
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
486. 
patient tongue id: 04181950027741_6_1
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 杜仲 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲 红豆杉
0.952672 0.312189 0.459377 0.618046 0.419681 0.323379 0.348188 0.589572 0.505046 0.489881 0.416914 0.433134 0.425852
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.666667, error: 0.230769
487. 
patient tongue id: 04121945400239_1_4
label yaofang:
甘草 木香 党参 白术 酸枣仁 山药 天麻 鳖甲 白扁豆 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.986422 0.467026 0.639137 0.40605 0.307637 0.324504 0.663673 0.573666 0.581835 0.479508 0.511025 0.532554
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
488. 
patient tongue id: 04061347093230_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.359062 0.761163 0.382566 0.863139 0.49233 0.656224 0.311949 0.371523 0.340941 0.371342 0.352173 0.753394 0.828143 0.722391 0.815569 0.304989 0.874043 0.418343 0.316897 0.480298 0.53639 0.690148
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.681818, recall: 1.000000, error: 0.318182
489. 
patient tongue id: 03171016103782_1_3_7
label yaofang:
黄芩 桔梗 金银花 牛蒡子 薏苡仁 蒲公英 太子参 蔓荆子 鸡内金 辛夷 苍耳子 炒六神曲
0.454488 0.322942 0.320505 0.465803 0.537889 0.330204 0.351656
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
490. 
patient tongue id: 06121758067022_1
label yaofang:
甘草 川芎 当归 龙骨 牡蛎 桃仁 党参 黄芪 酸枣仁 红花 泽泻 磁石 糯稻根 浮小麦
0.59025 0.349263 0.458832 0.357608 0.466105
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
491. 
patient tongue id: 03280626222610_6
label yaofang:
甘草 柴胡 香附 龙骨 牡蛎 薏苡仁 酸枣仁 黄柏 苍术 砂仁 磁石 珍珠母
0.704105 0.343635 0.438981 0.48836 0.574108 0.309258 0.316576
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
492. 
patient tongue id: 04142216117817_3_1_4
label yaofang:
桂枝 龙齿 黄芪 白术 浙贝母 牛膝 厚朴 当归尾 生半夏 砂仁 首乌藤 五指毛桃 山慈菇 鲜龙葵果
0.494898 0.320651 0.324832 0.515595 0.579755 0.360332 0.320247 0.305715
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
493. 
patient tongue id: 02122123513123_2
label yaofang:
甘草 党参 白术 酸枣仁 地黄 天麻 菟丝子 益母草 浮小麦 百合 蜈蚣 合欢花 半枝莲 醋鳖甲
0.941258 0.458263 0.597553 0.39951 0.321653 0.53662 0.452865 0.424357 0.361627 0.370864 0.348602
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
494. 
patient tongue id: 02020827264910_2_6
label yaofang:
甘草 川芎 太子参 鸡血藤 山药 山茱萸 地黄 天麻 补骨脂 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 乌梢蛇
0.935353 0.43678 0.585244 0.421393 0.522692 0.426481 0.450629 0.342767 0.351973 0.351578
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
495. 
patient tongue id: 04211800462177_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄
0.335925 0.727539 0.349994 0.8639 0.472016 0.619668 0.344543 0.317513 0.312177 0.745406 0.83115 0.72698 0.823534 0.334686 0.867803 0.388339 0.441839 0.52967 0.705062
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
496. 
patient tongue id: 06162302142383_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 紫菀 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.352414 0.781656 0.376702 0.899783 0.480641 0.659787 0.392743 0.347825 0.33116 0.320549 0.795954 0.867364 0.759976 0.853306 0.903097 0.399388 0.469998 0.553807 0.732958
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.600000, error: 0.526316
497. 
patient tongue id: 04131854052878_7_6_5
label yaofang:
麻黄 甘草 桔梗 薏苡仁 鱼腥草 太子参 海螵蛸 浙贝母 水蛭 厚朴 僵蚕 射干 莪术 石韦 北沙参 苦杏仁 苇根 蝉蜕 冬凌草 守宫
0.370173 0.330756 0.475322 0.400168 0.321339
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.400000, recall: 0.100000, error: 0.600000
498. 
patient tongue id: 03231437076546_4
label yaofang:
陈皮 法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.331273 0.598764 0.373666 0.686226 0.412361 0.54256 0.557674 0.664552 0.562753 0.645647 0.308111 0.717521 0.326182 0.387512 0.348307 0.469628
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.800000, error: 0.250000
499. 
patient tongue id: 03101846119948_4_1
label yaofang:
玉竹 丹参 海螵蛸 浙贝母 川牛膝 土茯苓 山慈菇 粉萆薢
0.335908 0.444489 0.36875 0.417234 0.437813 0.37788 0.309777 0.3515 0.597126 0.671717 0.382253
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.090909, recall: 0.125000, error: 0.909091
------Average Score: average precision: 0.456594, average recall: 0.348441, error: 0.543406
