8512/8539 [============================>.] - ETA: 0s - loss: 0.1608Epoch 00000: val_loss improved from inf to 0.08288, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 70s - loss: 0.1606 - val_loss: 0.0829
Epoch 2/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0984Epoch 00001: val_loss improved from 0.08288 to 0.08279, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 67s - loss: 0.0984 - val_loss: 0.0828
Epoch 3/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0910Epoch 00002: val_loss improved from 0.08279 to 0.08164, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0910 - val_loss: 0.0816
Epoch 4/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0881Epoch 00003: val_loss improved from 0.08164 to 0.07841, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0881 - val_loss: 0.0784
Epoch 5/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0858Epoch 00004: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0858 - val_loss: 0.0809
Epoch 6/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0843Epoch 00005: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0843 - val_loss: 0.0791
Epoch 7/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0833Epoch 00006: val_loss improved from 0.07841 to 0.07677, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0833 - val_loss: 0.0768
Epoch 8/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0822Epoch 00007: val_loss improved from 0.07677 to 0.07530, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0822 - val_loss: 0.0753
Epoch 9/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0810Epoch 00008: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0810 - val_loss: 0.0754
Epoch 10/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0806Epoch 00009: val_loss improved from 0.07530 to 0.07457, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0806 - val_loss: 0.0746
Epoch 11/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0798Epoch 00010: val_loss improved from 0.07457 to 0.07438, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0798 - val_loss: 0.0744
Epoch 12/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0794Epoch 00011: val_loss improved from 0.07438 to 0.07433, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0795 - val_loss: 0.0743
Epoch 13/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0786Epoch 00012: val_loss improved from 0.07433 to 0.07379, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0786 - val_loss: 0.0738
Epoch 14/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0782Epoch 00013: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0782 - val_loss: 0.0759
Epoch 15/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0779Epoch 00014: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0779 - val_loss: 0.0747
Epoch 16/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0774Epoch 00015: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0774 - val_loss: 0.0749
Epoch 17/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0771Epoch 00016: val_loss improved from 0.07379 to 0.07349, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0771 - val_loss: 0.0735
Epoch 18/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0766Epoch 00017: val_loss improved from 0.07349 to 0.07320, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0766 - val_loss: 0.0732
Epoch 19/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0763Epoch 00018: val_loss improved from 0.07320 to 0.07286, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0763 - val_loss: 0.0729
Epoch 20/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0760Epoch 00019: val_loss improved from 0.07286 to 0.07286, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0760 - val_loss: 0.0729
Epoch 21/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0756Epoch 00020: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0755 - val_loss: 0.0731
Epoch 22/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0750Epoch 00021: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0750 - val_loss: 0.0733
Epoch 23/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0749Epoch 00022: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0749 - val_loss: 0.0731
Epoch 24/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0745Epoch 00023: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0745 - val_loss: 0.0732
Epoch 25/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0744Epoch 00024: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0744 - val_loss: 0.0733
Epoch 26/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0739Epoch 00025: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0739 - val_loss: 0.0734
Epoch 27/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0737Epoch 00026: val_loss improved from 0.07286 to 0.07258, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 67s - loss: 0.0737 - val_loss: 0.0726
Epoch 28/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0735Epoch 00027: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0734 - val_loss: 0.0733
Epoch 29/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0731Epoch 00028: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0731 - val_loss: 0.0729
Epoch 30/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0730Epoch 00029: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0730 - val_loss: 0.0730
Epoch 31/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0724Epoch 00030: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0724 - val_loss: 0.0738
Epoch 32/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0724Epoch 00031: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0724 - val_loss: 0.0727
Epoch 33/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0723Epoch 00032: val_loss improved from 0.07258 to 0.07249, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0723 - val_loss: 0.0725
Epoch 34/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0718Epoch 00033: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0718 - val_loss: 0.0728
Epoch 35/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0716Epoch 00034: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0716 - val_loss: 0.0730
Epoch 36/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0714Epoch 00035: val_loss improved from 0.07249 to 0.07229, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0714 - val_loss: 0.0723
Epoch 37/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0710Epoch 00036: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0710 - val_loss: 0.0732
Epoch 38/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0708Epoch 00037: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0709 - val_loss: 0.0731
Epoch 39/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0707Epoch 00038: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0707 - val_loss: 0.0730
Epoch 40/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0704Epoch 00039: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0704 - val_loss: 0.0728
Epoch 41/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0703Epoch 00040: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0703 - val_loss: 0.0726
Epoch 42/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0699Epoch 00041: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0700 - val_loss: 0.0729
Epoch 43/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0698Epoch 00042: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0698 - val_loss: 0.0731
Epoch 44/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0695Epoch 00043: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0695 - val_loss: 0.0727
Epoch 45/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0693Epoch 00044: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0693 - val_loss: 0.0736
Epoch 46/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0690Epoch 00045: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0690 - val_loss: 0.0733
Epoch 47/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0687Epoch 00046: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0687 - val_loss: 0.0735
Epoch 48/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0686Epoch 00047: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0686 - val_loss: 0.0737
Epoch 49/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0683Epoch 00048: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0683 - val_loss: 0.0733
Epoch 50/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0680Epoch 00049: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0681 - val_loss: 0.0741
Epoch 51/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0678Epoch 00050: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0678 - val_loss: 0.0738
Epoch 52/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0676Epoch 00051: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0676 - val_loss: 0.0735
Epoch 53/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0674Epoch 00052: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0674 - val_loss: 0.0737
Epoch 54/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0672Epoch 00053: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0672 - val_loss: 0.0733
Epoch 55/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0669Epoch 00054: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0668 - val_loss: 0.0740
Epoch 56/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0665Epoch 00055: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0665 - val_loss: 0.0739
Epoch 57/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0664Epoch 00056: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0664 - val_loss: 0.0737
Epoch 58/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00057: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0660 - val_loss: 0.0736
Epoch 59/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0658Epoch 00058: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0658 - val_loss: 0.0743
Epoch 60/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0657Epoch 00059: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0657 - val_loss: 0.0742
Epoch 61/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0654Epoch 00060: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0654 - val_loss: 0.0740
Epoch 62/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0651Epoch 00061: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0651 - val_loss: 0.0742
Epoch 63/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0647Epoch 00062: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0647 - val_loss: 0.0747
Epoch 64/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0645Epoch 00063: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0646 - val_loss: 0.0744
Epoch 65/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0645Epoch 00064: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0645 - val_loss: 0.0750
Epoch 66/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0640Epoch 00065: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0640 - val_loss: 0.0748
Epoch 67/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0638Epoch 00066: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0639 - val_loss: 0.0748
Epoch 68/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0636Epoch 00067: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0636 - val_loss: 0.0746
Epoch 69/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0634Epoch 00068: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0634 - val_loss: 0.0747
Epoch 70/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0633Epoch 00069: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0632 - val_loss: 0.0747
Epoch 71/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0630Epoch 00070: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0630 - val_loss: 0.0753
Epoch 72/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0627Epoch 00071: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0627 - val_loss: 0.0752
Epoch 73/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0625Epoch 00072: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0625 - val_loss: 0.0759
Epoch 74/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0623Epoch 00073: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0623 - val_loss: 0.0751
Epoch 75/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0622Epoch 00074: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0621 - val_loss: 0.0755
Epoch 76/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0618Epoch 00075: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0618 - val_loss: 0.0755
Epoch 77/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0616Epoch 00076: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0616 - val_loss: 0.0759
Epoch 78/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0614Epoch 00077: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0614 - val_loss: 0.0756
Epoch 79/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0612Epoch 00078: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0612 - val_loss: 0.0763
Epoch 80/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0611Epoch 00079: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0611 - val_loss: 0.0763
history: [(0.16064350684621126, None, 0.082877245550845566, None), (0.098423077206042597, None, 0.08279132774788818, None), (0.091027912785108148, None, 0.0816424113217291, None), (0.088057154126658155, None, 0.078410634409376984, None), (0.085831709144154264, None, 0.080871763956415779, None), (0.084302815748176857, None, 0.079111604381611939, None), (0.083278795471932995, None, 0.076770894802533657, None), (0.082188265986451778, None, 0.075297560774799668, None), (0.081003861362425392, None, 0.075406056456950116, None), (0.080569696689548304, None, 0.074570545264871127, None), (0.079770093174488313, None, 0.074380182357498145, None), (0.07945717737516679, None, 0.074326658805648052, None), (0.078612247250065867, None, 0.073790650064255295, None), (0.078169097735411613, None, 0.075914142114338862, None), (0.077866102988385727, None, 0.074740563829739884, None), (0.077389783460992831, None, 0.074946106380813726, None), (0.077072625932446098, None, 0.073494529112791404, None), (0.076629653093141667, None, 0.073204490509662004, None), (0.076250536092230356, None, 0.0728636567682137, None), (0.076048076332543832, None, 0.072857598600151771, None), (0.075541847380776225, None, 0.073080006918627705, None), (0.075016318216949568, None, 0.073293080805858848, None), (0.074932163933538298, None, 0.073135234551988684, None), (0.074458746477527024, None, 0.073217567261103747, None), (0.074354897547150703, None, 0.073277685395527231, None), (0.073867249176811867, None, 0.073350705997847807, None), (0.073725956642965565, None, 0.072584065079907362, None), (0.073437678803812911, None, 0.073323067427773184, None), (0.073129042027628752, None, 0.072918055913387195, None), (0.073019915657923526, None, 0.072985651346790054, None), (0.072433455420861076, None, 0.073752941775234629, None), (0.072437638785314437, None, 0.07273459218906396, None), (0.072284788127134805, None, 0.072489988072451217, None), (0.071778364631362959, None, 0.072829549101901148, None), (0.071581295745854964, None, 0.072959972170246384, None), (0.071416600730690269, None, 0.07229048420330543, None), (0.070974011707534868, None, 0.073171178690898106, None), (0.07086066818531174, None, 0.073082148319198972, None), (0.070701713134434421, None, 0.073043363489510807, None), (0.070415956419411077, None, 0.072753324340551331, None), (0.070277989723878137, None, 0.072615890275864375, None), (0.069952402163101932, None, 0.072870928916957359, None), (0.069765237943672967, None, 0.073060335912110599, None), (0.06954370132356355, None, 0.072722123273999698, None), (0.069320000742132071, None, 0.073598212265706328, None), (0.06896117985307898, None, 0.073259195729053067, None), (0.068720752135353683, None, 0.073450900204889064, None), (0.06856249143339066, None, 0.073734729936271365, None), (0.068319026356782636, None, 0.07326192618944706, None), (0.068051544690051174, None, 0.074070201333844177, None), (0.067814762572212459, None, 0.073755287370838959, None), (0.067620620590446281, None, 0.073487683148174499, None), (0.067382618848163309, None, 0.07368655961293441, None), (0.067161425993514851, None, 0.073275990347504177, None), (0.066839052824710768, None, 0.073986864570296296, None), (0.066520354440360516, None, 0.073931180732154142, None), (0.066390001132695151, None, 0.073676713002033725, None), (0.065996413038100554, None, 0.073576366917772612, None), (0.065792088375142929, None, 0.074294619780757049, None), (0.065711088234255283, None, 0.074179529434158689, None), (0.065418521476540217, None, 0.074021737544964522, None), (0.065080272585907456, None, 0.074193876332197428, None), (0.064706046374617007, None, 0.074666943769533561, None), (0.064550630378316889, None, 0.074384054094007168, None), (0.06450469354748907, None, 0.07495246284501457, None), (0.064004425459383993, None, 0.074815444893889374, None), (0.063862313539232995, None, 0.074838020889968659, None), (0.063570181878323098, None, 0.07458640304786382, None), (0.063413692408583036, None, 0.074711141077590082, None), (0.063224149024804846, None, 0.074728871521713966, None), (0.062985232487078338, None, 0.075267142919830346, None), (0.062724853164174685, None, 0.075184315934286011, None), (0.062490762477178517, None, 0.075938690440122025, None), (0.062321125295757895, None, 0.075077227838746791, None), (0.062149654952598714, None, 0.0755354466237428, None), (0.061764354279105788, None, 0.075537313717407184, None), (0.061645830013682457, None, 0.075929048242586436, None), (0.061420301349105262, None, 0.075558446866252044, None), (0.06117996472932092, None, 0.076254102036411503, None), (0.061075873527248761, None, 0.076269566494248292, None)]
0. 
patient tongue id: 03211936112753_4
label yaofang:
黄芩 茯苓 栀子 杜仲 牛膝 钩藤 天麻 石决明 桑寄生 益母草 首乌藤
0.418059 0.327268 0.35486 0.513987
predicted yaofang:
白芍 党参 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
1. 
patient tongue id: 06092004526441_1_4_6
label yaofang:
甘草 川芎 当归 防风 独活 党参 白术 海螵蛸 杜仲 牛膝 厚朴 巴戟天 桑寄生 秦艽 紫苏叶 蜈蚣 骨碎补
0.59142 0.354453 0.396266 0.489385 0.550674 0.332678 0.390843 0.391814 0.304835 0.328093
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.500000, recall: 0.294118, error: 0.500000
2. 
patient tongue id: 04252016476939_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 海螵蛸 车前子 白花蛇舌草 紫苏梗 瓦楞子 猫爪草 山慈菇
0.368804 0.498991 0.302449 0.328988 0.330014 0.507893 0.634078
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
3. 
patient tongue id: 03151854573311_3_6
label yaofang:
党参 白术 柏子仁 附子 车前子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.308142 0.387567 0.333151 0.302722 0.460116
predicted yaofang:
甘草 白芍 党参 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
4. 
patient tongue id: 02122104594538_4_6
label yaofang:
甘草 薏苡仁 蒲公英 党参 厚朴 天麻 五灵脂 鳖甲 三棱 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 鱼古
0.996289 0.488996 0.693147 0.383462 0.30998 0.336913 0.737427 0.635007 0.635215 0.496167 0.547602 0.57795
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
5. 
patient tongue id: 05270138084657_1_2_4
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 党参 浙贝母 细辛 砂仁 天麻 鳖甲 补骨脂 莪术 蜈蚣 白花蛇舌 天山雪莲
0.975622 0.454897 0.630931 0.398358 0.310609 0.59652 0.505313 0.509157 0.401082 0.436729 0.451721
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
6. 
patient tongue id: 06190148379154_7_6
label yaofang:
甘草 川芎 茯苓 龙骨 桃仁 远志 党参 酸枣仁 丹参 红花 赤芍 知母 地黄 淡竹叶 浮小麦 百合 合欢花
0.969619 0.305632 0.448823 0.603932 0.359785 0.300134 0.603019 0.451989 0.452551 0.349646 0.372779 0.38099
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.176471, error: 0.750000
7. 
patient tongue id: 05090815286121_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.426088 0.592055 0.457288 0.385875 0.606065 0.575548 0.553787 0.565552 0.587173 0.547816 0.640323 0.521067 0.605427 0.616886 0.644005
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
8. 
patient tongue id: 04141835473752_1_4_3
label yaofang:
陈皮 枳壳 当归 木香 黄芪 枸杞子 白术 杜仲 厚朴 砂仁 菟丝子 鸡内金 北沙参 紫苏叶 预知子 稻芽
0.386149 0.366126 0.377045 0.317909 0.3012
predicted yaofang:
甘草 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
9. 
patient tongue id: 05182041306526_1_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 金樱子 桑螵蛸 炙甘草 百合 紫苏叶 覆盆子
0.388716 0.54383 0.338887 0.342176 0.316487 0.353487 0.550318 0.690845
predicted yaofang:
柴胡 白芍 香附 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.066667, error: 0.875000
10. 
patient tongue id: 06130757280187_1_2_4
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.461496 0.599046 0.47026 0.39505 0.600402 0.587802 0.543514 0.546467 0.585452 0.542992 0.640714 0.545638 0.598936 0.62086 0.635774
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
11. 
patient tongue id: 02150746046672_1_3_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.400379 0.456002 0.384253 0.434955 0.487708 0.371 0.437646 0.410882 0.406184 0.350327 0.433296 0.31904 0.368812 0.408141 0.368556
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
12. 
patient tongue id: 04300900263194_5
label yaofang:
甘草 荆芥 金银花 蒲公英 紫花地丁 白术 丹参 浙贝母 地黄 紫草 麦芽 皂角刺 白鲜皮 地肤子
0.98458 0.430228 0.654248 0.37027 0.321726 0.304325 0.675879 0.495223 0.529787 0.375954 0.447371 0.530882
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
13. 
patient tongue id: 01201410528158_1_4
label yaofang:
甘草 白芍 枳壳 薏苡仁 党参 白术 熟附子 天麻 鳖甲 莪术 败酱草 佛手 蜈蚣 天山雪莲 半枝莲 红豆杉
0.928668 0.312166 0.425166 0.574985 0.374743 0.514408 0.357432 0.381964
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.875000, recall: 0.437500, error: 0.125000
14. 
patient tongue id: 03081838101446_4
label yaofang:
麻黄 陈皮 前胡 半夏 防风 细辛 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.470457 0.802795 0.347134 0.947491 0.548255 0.742665 0.437322 0.335033 0.467545 0.911706 0.931226 0.891433 0.927578 0.308458 0.970993 0.500376 0.473726 0.543778 0.778493
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
15. 
patient tongue id: 04112055520868_1_2_7
label yaofang:
桂枝 白芍 牡蛎 薏苡仁 黄芪 白术 熟地黄 浙贝母 山茱萸 砂仁 糯稻根 北沙参 炙甘草 麻黄根 黑枣 鲜龙葵果
0.614388 0.335502 0.389566 0.430011 0.535069 0.314476 0.321809
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.428571, recall: 0.187500, error: 0.571429
16. 
patient tongue id: 02182202209567_2_1
label yaofang:
甘草 白芍 茯苓 龙骨 远志 玉竹 党参 赤芍 紫河车 天麻 僵蚕 益智仁 北沙参 沙苑子
0.96994 0.314904 0.461112 0.587564 0.335576 0.574317 0.43805 0.417835 0.328537 0.347097 0.344866
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
17. 
patient tongue id: 05022129253218_1_6
label yaofang:
甘草 法半夏 茯苓 龙骨 牡蛎 远志 党参 太子参 酸枣仁 丹参 黄连 生地黄 浮小麦 合欢花
0.941052 0.322302 0.418209 0.577108 0.327921 0.537614 0.34113 0.344849
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
18. 
patient tongue id: 03232025522366_6_4
label yaofang:
甘草 法半夏 茯苓 桔梗 柏子仁 浙贝母 鳖甲 首乌藤 白花蛇舌 天山雪莲
0.955854 0.436653 0.591265 0.434393 0.313956 0.513013 0.416805 0.477234 0.330627 0.350072
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.400000, error: 0.600000
19. 
patient tongue id: 06190943139925_2_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 石菖蒲 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.967149 0.330081 0.441892 0.590833 0.368055 0.590921 0.47304 0.481922 0.371037 0.413934 0.449617
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
20. 
patient tongue id: 04291510105716_1_6
label yaofang:
甘草 薏苡仁 党参 黄芪 熟附子 泽泻 天麻 赤石脂 鳖甲 补骨脂 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.974297 0.452753 0.628335 0.358142 0.314829 0.326556 0.651593 0.478978 0.487212 0.369952 0.412629 0.452086
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
21. 
patient tongue id: 03291941162140_1_2
label yaofang:
甘草 桃仁 党参 太子参 枸杞子 浙贝母 乌药 莪术 北沙参 赭石 蜈蚣 荔枝核 鸭脚艾
0.372128 0.313191 0.370029 0.503784
predicted yaofang:
甘草 白芍 茯苓 炙甘草

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
22. 
patient tongue id: 05192002495832_6_7_2
label yaofang:
甘草 川芎 茯苓 薏苡仁 党参 赤芍 杜仲 牛膝 山药 天麻 僵蚕 桑寄生 川木瓜 宽筋藤
0.858438 0.398833 0.511356 0.313615 0.441925
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
23. 
patient tongue id: 04282239073444_1_2_7
label yaofang:
甘草 柴胡 当归 黄芪 白术 赤芍 海螵蛸 砂仁 柿蒂 鸡内金 北沙参 土鳖虫 预知子 稻芽
0.652884 0.303768 0.434098 0.500007 0.45241
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
24. 
patient tongue id: 04282213242322_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 桔梗 芦根 浙贝母 白茅根 细辛 诃子 板蓝根 紫苏子 木蝴蝶
0.946715 0.302 0.408171 0.565589 0.35627 0.515962 0.325287 0.358927
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
25. 
patient tongue id: 02221317287831_1_4_7
label yaofang:
甘草 法半夏 桔梗 橘红 防风 金银花 太子参 藿香 白前 鸡内金 蜜百部 干鱼腥草
0.326965 0.384142 0.337714 0.313146 0.310035 0.302489
predicted yaofang:
甘草 党参 黄芪 丹参 牛膝 车前子

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
26. 
patient tongue id: 06072249163764_1_4
label yaofang:
甘草 桔梗 独活 芦根 薏苡仁 白术 浙贝母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.98847 0.303885 0.464438 0.647138 0.365929 0.36685 0.324758 0.340242 0.71841 0.605452 0.601592 0.498184 0.548455 0.614766
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.571429, recall: 0.571429, error: 0.428571
27. 
patient tongue id: 03231441188626_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.449056 0.694145 0.392536 0.865699 0.498701 0.651842 0.310815 0.395966 0.332446 0.439071 0.830871 0.852475 0.809542 0.854921 0.353885 0.906569 0.448199 0.435929 0.507088 0.703128
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
28. 
patient tongue id: 04171837100610_6
label yaofang:
川芎 陈皮 法半夏 茯苓 木香 茯神 党参 白术 五味子 杜仲 郁金 砂仁 炙甘草 合欢皮 牛大力 五指毛桃
0.97542 0.328714 0.446237 0.598286 0.376768 0.610432 0.502056 0.514662 0.396697 0.433436 0.456808
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
29. 
patient tongue id: 05232044202054_1_4_7
label yaofang:
甘草 茯苓 半夏 党参 黄芪 枸杞子 白术 杜仲 牛膝 厚朴 菟丝子 芡实 鸡内金 莲子 紫苏子 百合 紫苏叶 骨碎补 红豆杉 土茯苓 预知子 素馨花
0.556872 0.336154 0.40833 0.397799 0.376976
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 1.000000, recall: 0.227273, error: 0.000000
30. 
patient tongue id: 02212026241597_4_6
label yaofang:
甘草 前胡 酸枣仁 生地黄 牡丹皮 杜仲 天麻 鳖甲 苦杏仁 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989912 0.472992 0.656068 0.403825 0.304958 0.330924 0.669492 0.570431 0.576636 0.447704 0.493057 0.519464
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
31. 
patient tongue id: 04072028513350_4_5_1
label yaofang:
黄芪 白术 丹参 厚朴 砂仁 菟丝子 桑寄生 莪术 王不留行 橘核 首乌藤 合欢皮
0.488715 0.33261 0.398323 0.477385 0.344476 0.309331
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
32. 
patient tongue id: 04130619356062_4
label yaofang:
甘草 川芎 当归 茯苓 桔梗 黄芪 郁金 山药 山茱萸 石菖蒲 天麻 桑螵蛸 地龙 辛夷 首乌藤
0.975344 0.457686 0.612465 0.329011 0.304909 0.623963 0.490822 0.455008 0.37814 0.394704 0.387792
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
33. 
patient tongue id: 02251112247374_4
label yaofang:
白芍 川芎 茯苓 木香 防风 丹参 钩藤 天麻 白芷 石决明 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.43747 0.626486 0.415644 0.763504 0.463768 0.576519 0.349318 0.398962 0.347945 0.323036 0.400229 0.713379 0.730955 0.693023 0.73485 0.371986 0.826611 0.420146 0.304813 0.433055 0.476671 0.610268
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.227273, recall: 0.312500, error: 0.772727
34. 
patient tongue id: 05161912268370_4
label yaofang:
麻黄 陈皮 前胡 桔梗 半夏 防风 细辛 白芷 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.483547 0.883411 0.318033 0.981256 0.607683 0.80851 0.47571 0.357857 0.515618 0.963087 0.973612 0.948916 0.971521 0.990131 0.526666 0.491446 0.587749 0.861136
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.785714, error: 0.388889
35. 
patient tongue id: 02281228362087_1_7
label yaofang:
黄芩 金银花 牛蒡子 蒲公英 麦冬 细辛 荷叶 蔓荆子 百部 白鲜皮 苍耳子 炒六神曲
0.467695 0.325703 0.440057 0.332492 0.352676 0.326235 0.314928 0.331568
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 车前子 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
36. 
patient tongue id: 01132305570528_1
label yaofang:
柴胡 黄芩 大枣 龙骨 牡蛎 党参 栀子 淡豆豉 姜半夏 炙甘草
0.345738 0.42605 0.340808 0.307245 0.483925
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
37. 
patient tongue id: 01051854006500_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.330334 0.53441 0.385043 0.57243 0.374908 0.517256 0.516348 0.553066 0.574456 0.559638 0.30506 0.723823 0.336554 0.310024 0.320015 0.393888
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.800000, error: 0.250000
38. 
patient tongue id: 04291449031355_7_1
label yaofang:
甘草 柴胡 白芍 薏苡仁 桃仁 远志 天麻 白花蛇舌草 佛手 浮小麦 蜈蚣 合欢花 半枝莲 醋鳖甲
0.971947 0.451749 0.594935 0.369635 0.577922 0.466199 0.492934 0.348732 0.391551 0.432723
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
39. 
patient tongue id: 03231854140386_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.453812 0.732201 0.374501 0.892468 0.502069 0.675357 0.300269 0.408084 0.335585 0.427724 0.847572 0.86984 0.826483 0.870079 0.341657 0.934737 0.457784 0.449441 0.518596 0.711825
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
40. 
patient tongue id: 04131756056735_1_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.964877 0.31292 0.475081 0.572662 0.401404 0.31415 0.528852 0.482571 0.479855 0.381163 0.396429 0.368486
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
41. 
patient tongue id: 03090802565431_6
label yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.956412 0.322142 0.449817 0.572197 0.395671 0.52942 0.434201 0.475783 0.324905 0.373558 0.40674
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
42. 
patient tongue id: 02272226177792_4_1
label yaofang:
白芍 当归 木香 党参 白术 肉桂 补骨脂 肉豆蔻 诃子 炙甘草
0.461793 0.359764 0.473953 0.383988 0.346239 0.302342 0.380185
predicted yaofang:
甘草 柴胡 白芍 党参 白术 浙贝母 炙甘草

------Score: precision: 0.571429, recall: 0.400000, error: 0.428571
43. 
patient tongue id: 03141606320774_1_2_7
label yaofang:
桔梗 防风 金银花 薏苡仁 党参 乳香 胆南星 藿香 白芷 辛夷 干鱼腥草 苍耳子
0.877992 0.375721 0.547478 0.566671
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
44. 
patient tongue id: 03280627487411_4
label yaofang:
陈皮 前胡 桔梗 荆芥 防风 牛蒡子 薏苡仁 浙贝母 桑白皮 紫菀 苦杏仁 紫苏叶
0.549238 0.347135 0.433484 0.380968
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
45. 
patient tongue id: 06190936485518_6_1
label yaofang:
甘草 党参 黄芪 酸枣仁 生地黄 山药 菟丝子 桑寄生 益母草 鳖甲 麦芽 续断 天山雪莲 半枝莲 红豆杉
0.996088 0.462304 0.69962 0.390553 0.373054 0.311372 0.349366 0.783203 0.660736 0.688259 0.535466 0.611486 0.710931
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.533333, error: 0.384615
46. 
patient tongue id: 03271537585114_2_5
label yaofang:
桂枝 柴胡 白芍 黄芩 当归 牡蛎 桃仁 党参 黄芪 枸杞子 白术 黄连 生地黄 胆南星 黄柏 干姜 水蛭 天花粉 糯稻根 姜半夏 炙甘草 浮小麦 半枝莲 淡附片 半边莲 蒸陈皮
0.986063 0.48108 0.635018 0.436587 0.329671 0.632038 0.587471 0.602277 0.465205 0.514954 0.522905
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.115385, error: 0.727273
47. 
patient tongue id: 05092124506730_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒六神曲
0.4037 0.610472 0.392998 0.764071 0.450754 0.598749 0.342273 0.381563 0.719996 0.732308 0.701115 0.741126 0.31111 0.827241 0.416171 0.405561 0.429481 0.578571
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
48. 
patient tongue id: 02201802258727_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.477911 0.828372 0.348556 0.960107 0.561608 0.745922 0.448441 0.35062 0.468773 0.933745 0.948321 0.914012 0.945575 0.321159 0.977638 0.490953 0.466648 0.560977 0.816136
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
49. 
patient tongue id: 03301352465122_4
label yaofang:
法半夏 前胡 防风 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.425937 0.607611 0.39506 0.768417 0.449601 0.554714 0.319455 0.355731 0.368306 0.725232 0.735651 0.71192 0.763304 0.384812 0.825059 0.396218 0.39156 0.454499 0.606807
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
50. 
patient tongue id: 02142152203344_6_1_2
label yaofang:
甘草 党参 白术 山药 天麻 鳖甲 扁豆花 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 木棉花
0.978586 0.316845 0.468956 0.630388 0.405889 0.338435 0.340415 0.671541 0.571168 0.577931 0.467619 0.518588 0.554968
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
51. 
patient tongue id: 06132207194330_4_1_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.346628 0.327527 0.303232 0.306815 0.414773 0.350526 0.313612
predicted yaofang:
甘草 白芍 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
52. 
patient tongue id: 03021201155190_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.386704 0.367271 0.407185 0.376272 0.393506 0.37622 0.335965 0.353765
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 泽泻 车前子

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
53. 
patient tongue id: 03021953406490_4_1
label yaofang:
白芍 川芎 大枣 当归 党参 太子参 枸杞子 熟地黄 山萸肉 炙甘草 续断 制何首乌 炙黄芪 盐菟丝子 酒女贞子 盐巴戟天
0.496547 0.439577 0.392232 0.381324 0.337051 0.32676 0.354992 0.38609 0.406463
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 炙甘草

------Score: precision: 0.111111, recall: 0.062500, error: 0.888889
54. 
patient tongue id: 04222116002959_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.455332 0.716741 0.394702 0.8779 0.499602 0.682591 0.319705 0.413412 0.354571 0.327733 0.432988 0.829991 0.854158 0.809667 0.851363 0.359748 0.92874 0.455078 0.462939 0.517515 0.714688
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
55. 
patient tongue id: 04200637018914_2_6
label yaofang:
甘草 白芍 茯苓 龙骨 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986019 0.328388 0.458094 0.617732 0.3674 0.642076 0.556257 0.549796 0.434388 0.478434 0.491045
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.785714, error: 0.000000
56. 
patient tongue id: 04062010158057_1_4_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.992631 0.47857 0.662756 0.370272 0.358985 0.317943 0.346003 0.74601 0.633884 0.625221 0.513943 0.566969 0.617853
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.166667, error: 0.846154
57. 
patient tongue id: 06111022092460_1_6
label yaofang:
甘草 白芍 党参 白术 山药 白茅根 茜草 天麻 赤石脂 鳖甲 补骨脂 蜈蚣 天山雪莲 半枝莲 广金钱草
0.994898 0.30239 0.48984 0.663772 0.36346 0.314214 0.722129 0.64713 0.616303 0.525453 0.562332 0.562284
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
58. 
patient tongue id: 05222124222250_7_2_1
label yaofang:
牡蛎 蒲公英 黄芪 白术 浙贝母 砂仁 莪术 王不留行 麦芽 橘络 墨旱莲
0.475101 0.303747 0.33954 0.468684 0.514191 0.339774 0.326276
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
59. 
patient tongue id: 03111203178808_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.488424 0.311207 0.320982 0.40188 0.310311 0.341604
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
60. 
patient tongue id: 05021440330750_1_4_7
label yaofang:
人参 当归 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.456845 0.48095 0.439944 0.520061 0.51501 0.414631 0.474886 0.323704 0.421702 0.332715 0.410386 0.354453 0.367329 0.401585 0.328765
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.066667, recall: 0.083333, error: 0.933333
61. 
patient tongue id: 04191714594400_3_1
label yaofang:
牡蛎 黄芪 白术 熟地黄 杜仲 附子 山药 山茱萸 厚朴 当归尾 砂仁 三七 桑枝
0.513443 0.377719 0.363141 0.301825 0.387683 0.502256 0.516047 0.320976 0.301145 0.341509 0.420374 0.394324 0.30096 0.361631 0.397578 0.318565
predicted yaofang:
甘草 茯苓 半夏 薏苡仁 党参 黄芪 白术 海螵蛸 浙贝母 杜仲 厚朴 砂仁 莪术 鸡内金 北沙参 合欢皮

------Score: precision: 0.312500, recall: 0.384615, error: 0.687500
62. 
patient tongue id: 05182102403420_4
label yaofang:
陈皮 桔梗 牛蒡子 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 天山雪莲
0.569576 0.398253 0.375472 0.364195
predicted yaofang:
甘草 白芍 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
63. 
patient tongue id: 02231821438489_4
label yaofang:
麻黄 甘草 法半夏 前胡 桔梗 防风 荆芥穗 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子
0.433694 0.664609 0.399303 0.814894 0.480196 0.617034 0.326273 0.397982 0.346166 0.316822 0.421584 0.773209 0.790774 0.753335 0.799267 0.365094 0.866322 0.443991 0.432524 0.503735 0.65915
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.380952, recall: 0.666667, error: 0.619048
64. 
patient tongue id: 03240608491750_2_7_4
label yaofang:
甘草 白芍 川芎 茯苓 党参 枸杞子 白术 牛膝 山药 泽泻 天麻 磁石 桑寄生 麦芽 蒺藜 首乌藤
0.964097 0.319962 0.454617 0.589228 0.384553 0.309714 0.566879 0.480212 0.475113 0.378947 0.402859 0.401602
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
65. 
patient tongue id: 01042344242554_1_7
label yaofang:
甘草 独活 党参 白术 生地黄 杜仲 天麻 鳖甲 续断 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.976248 0.314882 0.446208 0.601254 0.399365 0.59991 0.490695 0.521922 0.385033 0.433705 0.473138
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.615385, error: 0.272727
66. 
patient tongue id: 02272220562979_1
label yaofang:
陈皮 当归 党参 黄芪 白术 海螵蛸 白芷 升麻 北柴胡 炙甘草
0.361646 0.345397 0.466489 0.349049 0.311902 0.31138 0.309705 0.358496 0.531382
predicted yaofang:
甘草 柴胡 白芍 党参 白术 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.300000, error: 0.666667
67. 
patient tongue id: 03151901022924_1
label yaofang:
桂枝 白芍 当归 茯苓 龙骨 牡蛎 党参 黄芪 白术 海螵蛸 砂仁 炙甘草
0.337433 0.357275 0.466553 0.333403 0.319756 0.33642 0.399443 0.536518
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.416667, error: 0.375000
68. 
patient tongue id: 02212127132845_4
label yaofang:
防风 薄荷 钩藤 荆芥穗 白芷 北柴胡 炙甘草 首乌藤 紫苏梗 广藿香 威灵仙 炒蔓荆子
0.47053 0.765092 0.374668 0.922627 0.523293 0.684401 0.317391 0.422913 0.336371 0.435835 0.88052 0.900624 0.853197 0.903102 0.364676 0.949483 0.458454 0.457214 0.556625 0.753721
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.333333, error: 0.800000
69. 
patient tongue id: 01040647112282_6_2_1
label yaofang:
甘草 白芍 川芎 麦冬 党参 白术 玄参 柏子仁 生地黄 牛膝 厚朴 天麻 全蝎 火麻仁
0.987369 0.300651 0.474215 0.629912 0.369688 0.311401 0.316057 0.676981 0.599201 0.574836 0.480234 0.520769 0.552801
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
70. 
patient tongue id: 06041126505886_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.375273 0.319967 0.447399 0.436467 0.455393 0.355914 0.35258 0.447646 0.410959 0.358169 0.36229 0.301839 0.51792
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
71. 
patient tongue id: 02241442382479_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.349232 0.300482
predicted yaofang:
党参 炙甘草

------Score: precision: 0.500000, recall: 0.100000, error: 0.500000
72. 
patient tongue id: 03101921026061_6_2_7
label yaofang:
黄芪 白术 黄柏 郁金 泽泻 天麻 全蝎 桑寄生 芡实 金樱子 玉米须 合欢皮
0.439483 0.332634 0.390495 0.305532 0.537452 0.498866 0.412289 0.372936 0.359787 0.423766 0.306681
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
73. 
patient tongue id: 02141849046928_4
label yaofang:
陈皮 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.395133 0.638189 0.409052 0.747743 0.453259 0.571644 0.320126 0.373341 0.332026 0.383227 0.706273 0.73492 0.702169 0.730262 0.351597 0.831696 0.386338 0.395108 0.466246 0.612541
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
74. 
patient tongue id: 02191256242879_6_2
label yaofang:
甘草 柴胡 白芍 枳壳 木香 延胡索 郁金 天麻 鳖甲 鸡内金 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.897588 0.398246 0.519551 0.30999 0.426039
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
75. 
patient tongue id: 04202014554214_7_5_1
label yaofang:
甘草 陈皮 茯苓 黄芪 枸杞子 白术 生地黄 海螵蛸 胆南星 车前子 厚朴 生半夏 砂仁 天麻 蜈蚣 鲜龙葵果
0.306861 0.312983 0.386517 0.36551 0.357995 0.36329 0.304522 0.373155
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 泽泻 车前子

------Score: precision: 0.375000, recall: 0.187500, error: 0.625000
76. 
patient tongue id: 02261921450466_1_5
label yaofang:
甘草 黄芩 橘红 牛蒡子 桃仁 远志 细辛 桑白皮 鳖甲 款冬花 川贝母 紫菀 苦杏仁 白花蛇舌
0.942753 0.473015 0.556944 0.387835 0.312624 0.487851 0.423973 0.422125 0.324446 0.334393 0.308682
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
77. 
patient tongue id: 06022237143554_1_4_6
label yaofang:
陈皮 半夏 牡蛎 远志 黄芪 枸杞子 白术 杜仲 郁金 菟丝子 北沙参 炙甘草 首乌藤 紫苏梗 骨碎补 红豆杉 合欢皮 预知子
0.54511 0.336375 0.308933 0.368038 0.525962 0.531624 0.31171 0.393321 0.347742 0.328671 0.364155
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.454545, recall: 0.277778, error: 0.545455
78. 
patient tongue id: 06111030183679_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 生地黄 浙贝母 山楂 莱菔子 麦芽 建曲
0.98327 0.470855 0.643957 0.370061 0.32964 0.310199 0.339284 0.676785 0.533357 0.52946 0.431823 0.456407 0.480612
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.384615, error: 0.615385
79. 
patient tongue id: 04271549503123_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.410085 0.328707 0.33393 0.396813
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.750000, recall: 0.250000, error: 0.250000
80. 
patient tongue id: 04142236233858_6_4_7
label yaofang:
甘草 枳壳 法半夏 茯苓 龙骨 党参 酸枣仁 丹参 黄连 山茱萸 薤白 天麻 全蝎 瓜蒌皮 麦芽
0.990931 0.317387 0.465924 0.645741 0.360008 0.302734 0.309722 0.695226 0.589427 0.565529 0.473989 0.516477 0.528632
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
81. 
patient tongue id: 01070838157796_1_4_7
label yaofang:
当归 党参 黄芪 熟附子 乌药 山药 干姜 淫羊藿 吴茱萸 仙茅 益智 鹿角霜 煨诃子
0.496002 0.360145 0.353815 0.442411 0.438473 0.306568 0.326826
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
82. 
patient tongue id: 05182214120526_1_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.411155 0.572955 0.386251 0.704681 0.414504 0.543658 0.329296 0.333933 0.356145 0.663876 0.693748 0.676763 0.708667 0.397148 0.798324 0.391344 0.391919 0.422584 0.555268
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
83. 
patient tongue id: 04142240130644_6
label yaofang:
甘草 柴胡 茯苓 桃仁 黄芪 白术 酸枣仁 生地黄 桑螵蛸 益智 浮小麦 广升麻
0.987468 0.311295 0.473861 0.627665 0.360948 0.305363 0.648075 0.561834 0.544917 0.446169 0.480778 0.48338
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.250000, error: 0.750000
84. 
patient tongue id: 02021017140721_1_4
label yaofang:
甘草 茯苓 黄芪 白术 胆南星 杜仲 白茅根 石菖蒲 大黄 厚朴 生半夏 火麻仁 鸡内金 稻芽
0.350107 0.306087 0.392835 0.331523 0.307174 0.47881
predicted yaofang:
甘草 法半夏 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
85. 
patient tongue id: 01192136512410_7_1_6
label yaofang:
甘草 法半夏 前胡 浙贝母 郁金 天麻 款冬花 紫菀 诃子 白花蛇舌草 丝瓜络 蜈蚣 半枝莲 醋鳖甲
0.678628 0.42004 0.43698 0.349774 0.461356
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
86. 
patient tongue id: 05191952205989_6_2_1
label yaofang:
甘草 川芎 茯苓 羌活 桃仁 党参 浙贝母 山药 天麻 全蝎 粉葛 首乌藤 紫苏梗 猫爪草
0.983542 0.305201 0.47082 0.615477 0.364398 0.306954 0.621626 0.540441 0.510774 0.432743 0.45261 0.433659
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
87. 
patient tongue id: 04171840023037_7
label yaofang:
柴胡 川芎 茯苓 桔梗 薏苡仁 桃仁 党参 黄芪 白术 红花 乳香 熟地黄 黄柏 白茅根 干姜 地骨皮 天花粉 没药 败酱草 皂角刺 山萸肉 炙甘草 醋香附 大血藤
0.944602 0.441899 0.546323 0.357009 0.471346 0.339307 0.382187
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.125000, error: 0.571429
88. 
patient tongue id: 05191926128325_6_1
label yaofang:
甘草 茯苓 龙骨 牡蛎 远志 党参 酸枣仁 生地黄 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.981267 0.448838 0.627785 0.397981 0.322105 0.635681 0.52577 0.536393 0.409838 0.452578 0.475725
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
89. 
patient tongue id: 01200648408446_1_7_5
label yaofang:
甘草 柴胡 蒲公英 黄芪 生地黄 天麻 白芷 天花粉 鳖甲 百部 王不留行 麦芽 皂角刺 蜈蚣 白花蛇舌 天山雪莲 半枝莲 广升麻
0.496534 0.311914 0.436045 0.447194 0.333176 0.322116
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.333333, recall: 0.111111, error: 0.666667
90. 
patient tongue id: 03091958120659_5
label yaofang:
甘草 黄芩 前胡 桔梗 芦根 牛蒡子 浙贝母 天麻 鳖甲 款冬花 苦杏仁 板蓝根 蜈蚣 天山雪莲 半枝莲
0.94995 0.454133 0.582488 0.454928 0.331753 0.49983 0.468959 0.523482 0.363568 0.399538 0.418094
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
91. 
patient tongue id: 04201415481479_1_2
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.407239 0.605666 0.441207 0.407303 0.629735 0.582927 0.563072 0.573805 0.607613 0.551138 0.673526 0.503051 0.612646 0.641155 0.648563
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
92. 
patient tongue id: 01100248200851_1_2
label yaofang:
白芍 牛膝 全蝎 苏木 炙甘草 紫苏梗 蜈蚣 醋延胡索
0.471812 0.302709 0.310915 0.376127 0.325631 0.356355
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.166667, recall: 0.125000, error: 0.833333
93. 
patient tongue id: 03240614548861_6_2
label yaofang:
茯苓 龙骨 党参 丹参 生地黄 山茱萸 天麻 鳖甲 火麻仁 炙甘草 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991235 0.300743 0.478047 0.654971 0.376433 0.314106 0.325425 0.70483 0.616356 0.597585 0.50249 0.53945 0.555133
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
94. 
patient tongue id: 04261934159961_4
label yaofang:
桂枝 茯苓 酸枣仁 神曲 泽泻 山楂 莱菔子 磁石 赤小豆 茯苓皮 猪苓 鸡内金 珍珠母 广藿香
0.799607 0.380319 0.477938 0.387318
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
95. 
patient tongue id: 02252059002883_1_4
label yaofang:
甘草 枸杞子 丹参 栀子 牡丹皮 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 木贼 有瓜石斛
0.936474 0.409832 0.538317 0.504576 0.351769 0.425293
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
96. 
patient tongue id: 03012052108424_5_6
label yaofang:
甘草 法半夏 大枣 茯苓 桔梗 薏苡仁 葶苈子 浙贝母 款冬花 苇茎 苦杏仁
0.955469 0.469619 0.30115 0.56214 0.467019 0.328291 0.451623 0.441115 0.501805 0.327996 0.34895 0.330071
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.272727, error: 0.750000
97. 
patient tongue id: 03221335488711_2_4
label yaofang:
法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.420987 0.642554 0.397316 0.775659 0.458434 0.589331 0.323422 0.393606 0.340359 0.416312 0.724474 0.765276 0.725923 0.750781 0.356349 0.862466 0.401544 0.407554 0.465578 0.619913
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
98. 
patient tongue id: 03301359441832_1_4
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 麦冬 款冬花 紫菀 白前 百部 北沙参 广藿香 蜜麻黄
0.351555 0.37284 0.391474 0.356771 0.300093 0.339605 0.339997 0.329993 0.383541 0.3539 0.386641 0.42921 0.634728
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.692308, recall: 0.692308, error: 0.307692
99. 
patient tongue id: 02182259505353_1_2_6
label yaofang:
甘草 柴胡 白芍 香附 茯苓 党参 酸枣仁 丹参 郁金 山药 砂仁 菟丝子 益母草 麦芽 白扁豆
0.994498 0.4896 0.67755 0.387289 0.315362 0.33226 0.729752 0.643171 0.631118 0.518932 0.566702 0.582837
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
100. 
patient tongue id: 04221848579766_2
label yaofang:
法半夏 葛根 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 威灵仙 人参叶
0.380143 0.514988 0.413227 0.571574 0.396823 0.454012 0.312171 0.31453 0.535262 0.560256 0.520292 0.545375 0.386052 0.731467 0.324427 0.327901 0.418467
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.588235, recall: 0.714286, error: 0.411765
101. 
patient tongue id: 06011956469720_5_7
label yaofang:
甘草 薏苡仁 鸡血藤 枸杞子 赤芍 杜仲 郁金 苍术 天麻 菟丝子 金樱子 桑螵蛸 决明子 沙苑子 覆盆子
0.989501 0.306292 0.473313 0.648744 0.372483 0.35882 0.321372 0.35387 0.720431 0.609208 0.606975 0.499449 0.550161 0.609745
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.142857, recall: 0.133333, error: 0.857143
102. 
patient tongue id: 04172229427925_1
label yaofang:
柴胡 白芍 香附 陈皮 延胡索 川楝子 干姜 炙甘草 预知子
0.386513 0.323845 0.428871 0.329768 0.332143 0.452649
predicted yaofang:
甘草 柴胡 白芍 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
103. 
patient tongue id: 06031046424397_1_4
label yaofang:
甘草 柴胡 黄芩 金银花 连翘 蒲公英 浙贝母 牡丹皮 郁金 天花粉 瓜蒌皮 王不留行 皂角刺 路路通
0.956659 0.315821 0.461539 0.557413 0.358248 0.502501 0.421436 0.409958 0.326212 0.327009
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.100000, recall: 0.071429, error: 0.900000
104. 
patient tongue id: 03152021467591_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.411413 0.528083 0.42545 0.47348 0.576698 0.489576 0.531148 0.491907 0.52052 0.437592 0.549632 0.398051 0.503322 0.533679 0.508793
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
105. 
patient tongue id: 05162041043829_7_1
label yaofang:
柴胡 白芍 香附 枳壳 桃仁 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗 土茯苓
0.433567 0.56406 0.444369 0.360198 0.329228 0.438669 0.32642 0.399938 0.665927 0.72767 0.307132 0.310961
predicted yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 干姜 姜半夏 炙甘草 紫苏叶 紫苏梗

------Score: precision: 0.750000, recall: 0.692308, error: 0.250000
106. 
patient tongue id: 02191623352769_6_4
label yaofang:
甘草 薏苡仁 远志 党参 赤芍 郁金 山药 天麻 鳖甲 莪术 虎杖 蜈蚣 天山雪莲 红豆杉
0.965569 0.465816 0.585028 0.370626 0.309216 0.533859 0.404817 0.41783 0.310422
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.777778, recall: 0.500000, error: 0.222222
107. 
patient tongue id: 02202228066799_1_6
label yaofang:
甘草 茯苓 远志 党参 白术 五味子 杜仲 山茱萸 车前子 菟丝子 巴戟天 金樱子 蛇床子 覆盆子
0.964267 0.307073 0.433762 0.582932 0.392995 0.50759 0.400151 0.430909 0.315623 0.32244
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
108. 
patient tongue id: 02020821107179_5
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 鱼腥草 浙贝母 桑白皮 款冬花 紫菀 苇茎 苦杏仁 紫苏子 蜜麻黄
0.978918 0.447278 0.614561 0.428072 0.306691 0.594024 0.521181 0.561438 0.406296 0.457834 0.507872
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
109. 
patient tongue id: 02272214146195_6_4
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.311751 0.33664 0.375307
predicted yaofang:
甘草 党参 炙甘草

------Score: precision: 0.333333, recall: 0.090909, error: 0.666667
110. 
patient tongue id: 05130652110081_2_6
label yaofang:
甘草 白芍 龙骨 党参 黄芪 白术 酸枣仁 山茱萸 地黄 天麻 糯稻根 蜈蚣 半枝莲 醋鳖甲
0.960659 0.312811 0.440045 0.589605 0.369571 0.551987 0.439008 0.436223 0.337234 0.359693 0.359604
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
111. 
patient tongue id: 02182227538034_2_1
label yaofang:
甘草 白芍 酸枣仁 丹参 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 木贼 谷精子
0.989111 0.32527 0.441817 0.639777 0.376409 0.642982 0.511761 0.543484 0.374667 0.439488 0.476673
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
112. 
patient tongue id: 02202244307088_5
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 鱼腥草 白术 桑白皮 款冬花 苦杏仁 紫苏梗
0.953551 0.447662 0.577197 0.391355 0.313903 0.52861 0.424551 0.436781 0.32221 0.344032 0.342432
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.272727, error: 0.727273
113. 
patient tongue id: 05221904306881_4
label yaofang:
陈皮 半夏 薏苡仁 厚朴 蝉蜕 白鲜皮 土茯苓 木棉花
0.626269 0.3248 0.407537 0.506168 0.564493 0.312839 0.353744 0.349564
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁

------Score: precision: 0.125000, recall: 0.125000, error: 0.875000
114. 
patient tongue id: 03081821577831_1_7_4
label yaofang:
甘草 枳壳 太子参 黄芪 白术 海螵蛸 郁金 厚朴 山楂 砂仁 鸡内金 北沙参 紫苏梗
0.476886 0.319776 0.393156 0.507955 0.365835 0.320255 0.303689
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.714286, recall: 0.384615, error: 0.285714
115. 
patient tongue id: 02272203463482_6
label yaofang:
甘草 川芎 陈皮 枳壳 茯苓 龙骨 牡蛎 远志 柏子仁 竹茹 肉桂 姜半夏 附片
0.326281 0.367988 0.493899 0.322217 0.334817 0.313378 0.304743 0.307932 0.429581 0.562712
predicted yaofang:
甘草 柴胡 白芍 香附 党参 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.153846, error: 0.800000
116. 
patient tongue id: 02182217015039_2_6
label yaofang:
甘草 白芍 麦冬 太子参 浙贝母 山药 白茅根 鳖甲 北沙参 辛夷 苍耳子 白花蛇舌 天山雪莲 蜂房 四季青
0.997414 0.50451 0.699616 0.395422 0.325404 0.34606 0.750345 0.663788 0.664741 0.520564 0.5791 0.609893
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
117. 
patient tongue id: 02171855235107_4
label yaofang:
甘草 防风 黄芪 细辛 荆芥穗 白芷 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术
0.442259 0.720324 0.397589 0.873733 0.513702 0.671241 0.303131 0.400885 0.33673 0.312789 0.445413 0.835025 0.854703 0.80167 0.854992 0.335319 0.914451 0.460879 0.447899 0.518514 0.710935
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.285714, recall: 0.545455, error: 0.714286
118. 
patient tongue id: 06170923445741_5_1_6
label yaofang:
甘草 桔梗 牛蒡子 海螵蛸 浙贝母 郁金 厚朴 砂仁 北沙参 木蝴蝶 猫爪草 稻芽
0.462581 0.389182 0.491606
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.333333, recall: 0.083333, error: 0.666667
119. 
patient tongue id: 06181855225779_1_2
label yaofang:
甘草 川芎 龙骨 党参 牛膝 山药 天麻 鳖甲 麦芽 女贞子 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.986275 0.325044 0.453164 0.639284 0.359283 0.665813 0.551164 0.53883 0.434038 0.475134 0.485465
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
120. 
patient tongue id: 06031125422178_5_1_7
label yaofang:
甘草 柴胡 白芍 连翘 薏苡仁 党参 白术 黄连 延胡索 浙贝母 乌梅 郁金 山药 仙鹤草 麦芽 白花蛇舌
0.970794 0.334585 0.446619 0.562149 0.334903 0.505248 0.419092 0.401295 0.310666 0.322549
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.500000, recall: 0.312500, error: 0.500000
121. 
patient tongue id: 02241826013553_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.454186 0.761232 0.381237 0.916318 0.529079 0.676975 0.312117 0.432476 0.349472 0.447469 0.878579 0.898483 0.853358 0.894505 0.352071 0.948104 0.457948 0.440014 0.539331 0.759327
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
122. 
patient tongue id: 02120817007164_1_7
label yaofang:
甘草 法半夏 茯苓 远志 党参 白术 杜仲 石菖蒲 天麻 菟丝子 补骨脂 桑螵蛸 益智 辛夷
0.937879 0.310541 0.438628 0.554568 0.40465 0.464502 0.366398 0.416073
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
123. 
patient tongue id: 03151812056427_1_3_7
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 薤白 厚朴
0.375668 0.550364 0.435566 0.455295 0.587757 0.521612 0.539846 0.537338 0.564136 0.50766 0.61196 0.437315 0.566099 0.592395 0.604398
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.333333, recall: 0.384615, error: 0.666667
124. 
patient tongue id: 04282232113156_5_6_1
label yaofang:
甘草 法半夏 茯苓 龙骨 党参 酸枣仁 地黄 天麻 白花蛇舌草 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.985639 0.30191 0.464021 0.630168 0.388031 0.310258 0.647873 0.567993 0.562397 0.456137 0.492948 0.506329
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
125. 
patient tongue id: 02202220357633_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 栀子 桑白皮 莱菔子 茵陈 款冬花 麦芽 苦杏仁 紫苏子
0.975779 0.315787 0.448886 0.639563 0.391634 0.323725 0.321472 0.638816 0.508839 0.510218 0.399365 0.440115 0.475442
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.142857, error: 0.846154
126. 
patient tongue id: 02260214108926_1_6
label yaofang:
甘草 茯苓 党参 栀子 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 木贼 有瓜石斛
0.885942 0.432003 0.527871 0.437521 0.303641 0.40139 0.302139 0.403059
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.875000, recall: 0.500000, error: 0.125000
127. 
patient tongue id: 02142151149145_6
label yaofang:
甘草 柴胡 白芍 木香 酸枣仁 山药 砂仁 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.919643 0.423675 0.537798 0.365095 0.452511 0.315096
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
128. 
patient tongue id: 01201946387318_2_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 酸枣仁 生地黄 砂仁 菟丝子 麦芽 女贞子 紫苏梗
0.635217 0.305676 0.442219 0.306792 0.413375 0.31975 0.305861
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.857143, recall: 0.428571, error: 0.142857
129. 
patient tongue id: 05090816486962_1_4_7
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 阿胶 五味子 熟地黄 火麻仁 炙甘草 牡荆子 黑枣
0.432772 0.391901 0.408511 0.497548 0.437444 0.304915 0.389452 0.3347 0.324165
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 莱菔子

------Score: precision: 0.111111, recall: 0.083333, error: 0.888889
130. 
patient tongue id: 02142001548586_4
label yaofang:
甘草 黄连 肉桂 干姜 附片
0.784558 0.398796 0.394306 0.465937 0.33813
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.200000, error: 0.800000
131. 
patient tongue id: 02272233112543_3
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 砂仁 菟丝子 巴戟天 桑寄生 鹿角霜 续断 制何首乌 艾叶
0.508666 0.404424 0.309481 0.390766 0.330335
predicted yaofang:
甘草 白芍 茯苓 党参 炙甘草

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
132. 
patient tongue id: 03312043271548_1_6_4
label yaofang:
甘草 茯苓 羌活 独活 薏苡仁 白术 延胡索 郁金 山药 厚朴 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲
0.753375 0.305228 0.440531 0.427036 0.322296
predicted yaofang:
甘草 法半夏 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
133. 
patient tongue id: 04182208380615_1_3_7
label yaofang:
甘草 当归 茯苓 党参 黄芪 白术 浙贝母 杜仲 厚朴 砂仁 款冬花 鸡内金 地龙 紫苏子 蜈蚣 鲜龙葵果
0.604178 0.328312 0.447948 0.449482 0.329869
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 1.000000, recall: 0.312500, error: 0.000000
134. 
patient tongue id: 03151835363889_6_1
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.481336 0.388747 0.377337 0.389958
predicted yaofang:
甘草 白芍 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
135. 
patient tongue id: 02182148324994_2_6
label yaofang:
甘草 党参 生地黄 郁金 山药 山茱萸 泽泻 车前子 海金沙 鸡内金 王不留行 川木瓜 广金钱草 土茯苓 石苇
0.985598 0.484967 0.640912 0.387265 0.325901 0.63802 0.540948 0.521866 0.421294 0.454178 0.450823
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
136. 
patient tongue id: 02020947100958_6_1
label yaofang:
甘草 柴胡 法半夏 茯苓 木香 蒲公英 白及 党参 白术 黄连 延胡索 五灵脂 旋覆花 鱼古 煅瓦楞子
0.760438 0.42083 0.4815 0.382494
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.750000, recall: 0.200000, error: 0.250000
137. 
patient tongue id: 03111516539803_7_6
label yaofang:
甘草 柴胡 白芍 川芎 羌活 桃仁 红花 赤芍 栀子 牡丹皮 牛膝 细辛 天麻 全蝎 白芷
0.946223 0.303824 0.440387 0.576849 0.385815 0.526752 0.417414 0.428318 0.320619 0.347541 0.350452
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
138. 
patient tongue id: 06010208339212_6_4_7
label yaofang:
甘草 法半夏 茯苓 党参 白术 砂仁 天麻 鳖甲 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.984789 0.470035 0.639729 0.411787 0.345122 0.304554 0.357926 0.675145 0.569807 0.588902 0.46507 0.514815 0.567837
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
139. 
patient tongue id: 04232016402822_4
label yaofang:
麻黄 桂枝 荆芥 防风 独活 延胡索 乳香 没药 炙甘草 豨莶草 海风藤 海桐皮 鹿衔草 走马胎
0.44702 0.31317 0.389257 0.464801 0.301589
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
140. 
patient tongue id: 01061842504754_2_4
label yaofang:
甘草 茯苓 葛根 麦冬 玄参 牡丹皮 北沙参 百合 人参叶 干石斛
0.434713 0.6397 0.408943 0.771196 0.452887 0.584394 0.351656 0.384006 0.335384 0.308034 0.39941 0.728636 0.744623 0.716088 0.761048 0.409746 0.833564 0.421411 0.424729 0.501161 0.628371
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.095238, recall: 0.200000, error: 0.904762
141. 
patient tongue id: 05312141258570_1_2_7
label yaofang:
甘草 桃仁 党参 酸枣仁 生地黄 天麻 鳖甲 女贞子 紫苏叶 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众 龟甲
0.998674 0.471996 0.744603 0.39885 0.359762 0.340535 0.824352 0.716503 0.752769 0.581811 0.669007 0.76067
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
142. 
patient tongue id: 02271231581169_1_7
label yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 薏苡仁 白术 大腹皮 厚朴 藿香 白芷 六神曲
0.447676 0.360703 0.308235 0.380034
predicted yaofang:
甘草 茯苓 党参 炙甘草

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
143. 
patient tongue id: 01111919051363_1
label yaofang:
白芍 川芎 大枣 当归 党参 太子参 黄芪 枸杞子 熟地黄 郁金 干姜 北柴胡 炙甘草 续断 盐菟丝子 酒女贞子
0.442263 0.720187 0.396288 0.881263 0.521715 0.65942 0.39911 0.332903 0.300588 0.416595 0.842035 0.859446 0.802321 0.853776 0.3037 0.923361 0.43959 0.429099 0.479123 0.705269
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.125000, error: 0.900000
144. 
patient tongue id: 05232039238010_1
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 车前子 砂仁 升麻 炙甘草
0.36682 0.350452 0.463722 0.354726 0.377812 0.488353
predicted yaofang:
甘草 柴胡 白芍 党参 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.300000, error: 0.500000
145. 
patient tongue id: 04291454424177_6_5
label yaofang:
甘草 柴胡 白芍 木香 蒲公英 党参 黄连 槟榔 山药 砂仁 柿蒂 麦芽 麸炒枳壳
0.996118 0.470568 0.706817 0.40777 0.359355 0.307226 0.343474 0.778063 0.673842 0.702563 0.543006 0.624933 0.707227
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
146. 
patient tongue id: 02212216574632_1_6
label yaofang:
甘草 白芍 枳壳 木香 白术 砂仁 莱菔子 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.885737 0.411661 0.487105 0.386287 0.319634
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
147. 
patient tongue id: 05262213296794_1_2_6
label yaofang:
甘草 枳壳 茯苓 桔梗 太子参 浙贝母 郁金 山药 鳖甲 鸡内金 夏枯草 麦芽 皂角刺 白花蛇舌 天山雪莲 猫爪草
0.876885 0.40258 0.388579 0.500563 0.346761 0.305922 0.373612
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻

------Score: precision: 0.428571, recall: 0.187500, error: 0.571429
148. 
patient tongue id: 06141845556710_6_7
label yaofang:
川芎 茯苓 半夏 薏苡仁 白术 海螵蛸 牡丹皮 杜仲 桑寄生 莪术 续断 蜈蚣
0.738999 0.433058 0.460863 0.326167 0.333415
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
149. 
patient tongue id: 03242124052755_4_6
label yaofang:
桂枝 牛蒡子 玉竹 海螵蛸 牛膝 大黄 砂仁 萆薢 土茯苓
0.333621 0.367698 0.355568 0.423072
predicted yaofang:
甘草 白芍 党参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
150. 
patient tongue id: 03171206353723_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.374689 0.565084 0.443015 0.413844 0.600355 0.545802 0.54398 0.560173 0.578771 0.536238 0.636417 0.473182 0.589297 0.616133 0.63061
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
151. 
patient tongue id: 05161938550890_2
label yaofang:
甘草 茯苓 葛根 麦冬 玉竹 玄参 生地黄 赤芍 牡丹皮 木瓜 北沙参 百合 干石斛
0.455071 0.727694 0.386916 0.890453 0.527059 0.683362 0.30223 0.415566 0.343439 0.305936 0.467647 0.854507 0.874757 0.825058 0.867184 0.335996 0.937845 0.470335 0.444176 0.507304 0.718115
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.095238, recall: 0.153846, error: 0.904762
152. 
patient tongue id: 02010218494145_6_2
label yaofang:
甘草 酸枣仁 赤芍 山药 山茱萸 地黄 天麻 菟丝子 桑寄生 益母草 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.969846 0.317799 0.46644 0.597018 0.362978 0.583952 0.481989 0.469272 0.371326 0.397746 0.388667
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
153. 
patient tongue id: 02110749410392_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.587755 0.345132 0.42721 0.409843 0.418673
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
154. 
patient tongue id: 04291512242065_4_1
label yaofang:
甘草 党参 黄芪 白术 红花 天麻 鳖甲 威灵仙 地肤子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土茯苓
0.987617 0.467376 0.635976 0.381022 0.31537 0.345239 0.667584 0.56942 0.574686 0.452241 0.49758 0.545177
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
155. 
patient tongue id: 05242250369845_1_6
label yaofang:
甘草 薏苡仁 党参 延胡索 赤芍 郁金 山药 天麻 鳖甲 莪术 虎杖 蜈蚣 白花蛇舌 红豆杉
0.993028 0.304546 0.491711 0.644148 0.35822 0.308964 0.695224 0.625167 0.586566 0.499552 0.5291 0.514115
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
156. 
patient tongue id: 02122215112909_1_4
label yaofang:
甘草 独活 薏苡仁 远志 杜仲 牛膝 天麻 桑寄生 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲 牛大力
0.963147 0.414719 0.614875 0.62048
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
157. 
patient tongue id: 03021258034638_4
label yaofang:
法半夏 前胡 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.445107 0.730381 0.354021 0.895436 0.500772 0.696332 0.398499 0.339096 0.453342 0.853184 0.87665 0.840319 0.875726 0.312077 0.937785 0.48179 0.450039 0.507365 0.706002
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.769231, error: 0.473684
158. 
patient tongue id: 01211216530312_2
label yaofang:
茯苓 龙骨 牡蛎 麦冬 党参 酸枣仁 柏子仁 附子 干姜 炙甘草
0.458969 0.330035 0.309657 0.377272 0.337653
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
159. 
patient tongue id: 06031132104638_1_7
label yaofang:
桂枝 甘草 白芍 川芎 桃仁 黄芪 鸡血藤 生地黄 红花 赤芍 牛膝 天麻 威灵仙 木蝴蝶
0.994245 0.488556 0.666026 0.378055 0.304541 0.326243 0.723559 0.635105 0.62481 0.513047 0.553131 0.569049
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
160. 
patient tongue id: 03012006403838_4
label yaofang:
陈皮 法半夏 茯苓 党参 黄芪 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 炒六神曲 甘松
0.452875 0.739933 0.385775 0.887426 0.516304 0.659656 0.311988 0.415769 0.34381 0.433008 0.8515 0.872043 0.825042 0.869696 0.350526 0.926413 0.450175 0.451222 0.530833 0.726484
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.416667, error: 0.750000
161. 
patient tongue id: 04112318500054_4
label yaofang:
麻黄 桂枝 白芍 法半夏 前胡 五味子 浙贝母 细辛 干姜 厚朴 款冬花 苦杏仁 炙甘草
0.463712 0.343584 0.372521 0.39783
predicted yaofang:
甘草 白芍 党参 白术

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
162. 
patient tongue id: 01312301217045_6_2
label yaofang:
甘草 法半夏 桔梗 党参 酸枣仁 丹参 浙贝母 牡丹皮 薤白 水蛭 瓜蒌皮 浮小麦 合欢花 麸炒枳壳
0.981645 0.484201 0.614502 0.395974 0.327012 0.626451 0.575633 0.573881 0.460795 0.487858 0.489317
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
163. 
patient tongue id: 02272218279158_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 补骨脂 麦芽 百合 紫苏叶
0.431049 0.593449 0.434818 0.318306 0.368228 0.324535 0.381275 0.663377 0.723404
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.111111, recall: 0.090909, error: 0.888889
164. 
patient tongue id: 06132154043375_1_4
label yaofang:
柴胡 大枣 茯苓 防风 连翘 太子参 昆布 海藻 乌梅 桑叶 石斛 白花蛇舌草 浮小麦 猫爪草 山慈菇
0.393605 0.535328 0.349644 0.334537 0.300444 0.550103 0.626215
predicted yaofang:
柴胡 白芍 香附 海螵蛸 浙贝母 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.066667, error: 0.857143
165. 
patient tongue id: 02201755030112_1_4
label yaofang:
陈皮 法半夏 茯苓 党参 海螵蛸 干姜 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 炙黄芪 炒六神曲 甘松
0.430403 0.678057 0.402822 0.817606 0.465353 0.62758 0.320961 0.388283 0.33206 0.30322 0.404894 0.768537 0.785436 0.747745 0.796686 0.3653 0.876481 0.429083 0.434371 0.506514 0.65532
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.285714, recall: 0.428571, error: 0.714286
166. 
patient tongue id: 06062305528235_5_7
label yaofang:
甘草 金银花 丹参 玄参 红花 延胡索 牡丹皮 细辛 天麻 鳖甲 忍冬藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.993139 0.300524 0.480806 0.671133 0.359406 0.315329 0.32216 0.715226 0.611746 0.579319 0.496766 0.52937 0.535905
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
167. 
patient tongue id: 05201925429684_5_1
label yaofang:
桂枝 甘草 大枣 竹茹 生牡蛎 石膏 浙贝
0.509637 0.307094 0.362468 0.356357 0.575944 0.581955 0.337603 0.424754 0.388331 0.350977 0.349039 0.32073
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.083333, recall: 0.142857, error: 0.916667
168. 
patient tongue id: 02182257533049_1_2_7
label yaofang:
甘草 桃仁 党参 鸡血藤 白术 酸枣仁 生地黄 天麻 菟丝子 糯稻根 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.989145 0.471219 0.636371 0.370142 0.665528 0.571158 0.548471 0.454417 0.48856 0.483242
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.529412, error: 0.100000
169. 
patient tongue id: 06031047394681_1_2_7
label yaofang:
甘草 白芍 木香 薏苡仁 党参 牡丹皮 郁金 山药 鳖甲 莪术 虎杖 蜈蚣 白花蛇舌 天山雪莲 龙葵果
0.979991 0.324241 0.470771 0.614492 0.354742 0.303131 0.628251 0.522497 0.486153 0.417898 0.440147 0.425162
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
170. 
patient tongue id: 05152106551307_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草 山慈菇
0.352913 0.361304 0.459246 0.330003 0.329536 0.319983 0.333309 0.370095 0.526958
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 浙贝母 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
171. 
patient tongue id: 05261952114880_1_4_7
label yaofang:
陈皮 当归 茯苓 半夏 黄芪 枸杞子 白术 山药 菟丝子 鸡内金 紫苏子 炙甘草 首乌藤 紫苏叶 黑枣
0.516939 0.335848 0.378711 0.341663 0.528129 0.557371 0.332022 0.423912 0.383752 0.363791 0.390075 0.307503
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
172. 
patient tongue id: 03231036155787_6_7
label yaofang:
甘草 白芍 川芎 香附 白术 丹参 牛膝 郁金 薤白 厚朴 砂仁 天麻 全蝎 瓜蒌皮 降香
0.990264 0.301224 0.471174 0.640576 0.375087 0.305209 0.68737 0.587976 0.593234 0.469969 0.51643 0.550029
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
173. 
patient tongue id: 02151818584876_1_4_7
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 酸枣仁 五味子 熟地黄 火麻仁 苦参 炙甘草 黑枣
0.46385 0.348373 0.414622 0.410413 0.370972 0.342437 0.31427
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
174. 
patient tongue id: 02271253152246_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.509765 0.409398 0.45081 0.345522 0.433313 0.378785 0.397867 0.318174 0.37642 0.360033 0.368867 0.417606 0.322774 0.336759 0.308513
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
175. 
patient tongue id: 01190643310777_2_6
label yaofang:
甘草 柴胡 白芍 川芎 茯苓 酸枣仁 生地黄 牛膝 山药 山茱萸 细辛 天麻 全蝎 菟丝子 桑寄生 益母草
0.898961 0.366851 0.406042 0.504713 0.350944 0.341706
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
176. 
patient tongue id: 01140817402376_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 桔梗 浙贝母 细辛 莱菔子 瓜蒌皮 款冬花 紫菀 枇杷叶 苦杏仁
0.975663 0.302176 0.478358 0.612763 0.401289 0.314659 0.357423 0.621072 0.551084 0.540822 0.448195 0.479015 0.499461
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.142857, error: 0.846154
177. 
patient tongue id: 04201918516149_2_1
label yaofang:
白芍 川芎 当归 茯苓 太子参 黄芪 枸杞子 柏子仁 熟地黄 煅牡蛎 炙甘草 续断 盐菟丝子 酒女贞子 煅龙骨 炒酸枣仁
0.462652 0.791522 0.374068 0.93869 0.539722 0.719503 0.406921 0.320739 0.432411 0.897335 0.914497 0.865705 0.915087 0.301025 0.961169 0.47424 0.45911 0.537684 0.771593
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.105263, recall: 0.125000, error: 0.894737
178. 
patient tongue id: 05241954463133_2_6
label yaofang:
甘草 党参 酸枣仁 生地黄 黄柏 山药 山茱萸 桑叶 荆芥穗 地骨皮 菟丝子 糯稻根 银柴胡 淫羊藿 女贞子 龟甲
0.991215 0.478895 0.652584 0.380708 0.302177 0.317847 0.687146 0.599252 0.586354 0.485219 0.522335 0.537169
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
179. 
patient tongue id: 03022129573516_2_6
label yaofang:
甘草 白芍 牡蛎 玄参 天冬 柏子仁 川楝子 牛膝 茵陈 麦芽 赭石 浮小麦 龟甲
0.432849 0.582353 0.430139 0.33911 0.395826 0.335888 0.373612 0.622001 0.692693
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.111111, recall: 0.076923, error: 0.888889
180. 
patient tongue id: 01032112407541_6_7
label yaofang:
甘草 独活 白术 酸枣仁 天麻 益母草 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 骨碎补 乌梢蛇
0.975538 0.452022 0.60865 0.386332 0.305454 0.593079 0.427435 0.468745 0.316823 0.352425 0.374996
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
181. 
patient tongue id: 01130654133756_2_1_6
label yaofang:
甘草 桔梗 龙骨 桃仁 党参 酸枣仁 浙贝母 山茱萸 天麻 糯稻根 鳖甲 白花蛇舌 天山雪莲 半枝莲
0.991097 0.306455 0.493611 0.646058 0.369081 0.31868 0.339926 0.706427 0.619148 0.599747 0.500754 0.536361 0.545579
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
182. 
patient tongue id: 03081816411947_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 柏子仁 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.456387 0.381349 0.374641 0.390775 0.323443
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
183. 
patient tongue id: 04121836206568_1
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.456449 0.794958 0.372833 0.941377 0.534884 0.710756 0.300896 0.419406 0.331335 0.43674 0.909994 0.92556 0.882733 0.927369 0.346587 0.962131 0.460289 0.456306 0.564741 0.795232
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
184. 
patient tongue id: 05061437512906_6_5
label yaofang:
甘草 陈皮 茯苓 半夏 瓜蒌皮 川贝母 枇杷叶 夏枯草 北沙参 龙脷叶
0.434884 0.487927 0.437881 0.508504 0.514604 0.433847 0.479899 0.408857 0.457523 0.365977 0.46163 0.399732 0.423031 0.450433 0.42872
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.133333, recall: 0.200000, error: 0.866667
185. 
patient tongue id: 03092002052317_4
label yaofang:
甘草 茯苓 葛根 麦冬 太子参 北沙参 百合 木贼 干石斛
0.419855 0.648218 0.403915 0.803905 0.484683 0.581448 0.382191 0.320093 0.381538 0.756859 0.773845 0.72319 0.778041 0.331358 0.854609 0.405987 0.402164 0.448488 0.626256
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.105263, recall: 0.222222, error: 0.894737
186. 
patient tongue id: 05112017269712_1_4_6
label yaofang:
党参 黄芪 枸杞子 熟地黄 杜仲 山药 山茱萸 当归尾 砂仁 炙甘草 茺蔚子 路路通
0.654698 0.359646 0.446334 0.383534 0.362491
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
187. 
patient tongue id: 06080123471129_4_1
label yaofang:
甘草 川芎 法半夏 茯苓 党参 白术 厚朴 天麻 鳖甲 蒺藜 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.998488 0.473942 0.724244 0.406813 0.384703 0.310954 0.354634 0.830498 0.716745 0.756615 0.588171 0.672115 0.770734
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.625000, error: 0.230769
188. 
patient tongue id: 03151848008043_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.409233 0.540755 0.376056 0.311124 0.354423 0.3395 0.323668 0.534398 0.629286
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
189. 
patient tongue id: 02231827583142_4_2
label yaofang:
麻黄 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 香薷 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子
0.35356 0.344109 0.382359 0.340753 0.30786 0.300451 0.358115 0.31794 0.363869 0.341654 0.372846 0.421804 0.550307
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
190. 
patient tongue id: 02151916068464_2_1
label yaofang:
法半夏 前胡 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.42751 0.579857 0.427049 0.688884 0.448529 0.538633 0.344017 0.376927 0.334519 0.31606 0.389916 0.657029 0.664604 0.642428 0.678848 0.395208 0.765036 0.407917 0.408834 0.452496 0.567114
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
191. 
patient tongue id: 01201940535619_1_2_6
label yaofang:
甘草 党参 山药 山茱萸 地黄 天麻 菟丝子 益智仁 益母草 金樱子 白花蛇舌草 蜈蚣 棉萆薢 醋鳖甲
0.996926 0.471607 0.689001 0.369065 0.306706 0.31359 0.759128 0.64546 0.63288 0.509379 0.565126 0.593373
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
192. 
patient tongue id: 03151940332754_5_7
label yaofang:
桃仁 太子参 黄芪 白术 浙贝母 杜仲 白茅根 生半夏 砂仁 土鳖虫 合欢皮 山慈菇 蛇舌草 鲜龙葵果
0.593127 0.364542 0.419342 0.433039 0.415186
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
193. 
patient tongue id: 02272224553829_1
label yaofang:
陈皮 当归 党参 黄芪 鸡血藤 白术 升麻 北柴胡 炙甘草 山慈菇
0.387163 0.383113 0.509786 0.315897 0.358382 0.31058 0.323196 0.391383 0.502141
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 浙贝母 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.300000, error: 0.666667
194. 
patient tongue id: 02181635236970_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 黄连 乌梅 山药 干姜 麦芽 建曲 合欢花
0.968852 0.357123 0.433227 0.588464 0.364947 0.537729 0.425253 0.437098 0.311276 0.343714 0.330733
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
195. 
patient tongue id: 03020759122561_1_7
label yaofang:
甘草 白芍 茯苓 党参 生地黄 山药 山茱萸 厚朴 肉苁蓉 火麻仁 制川乌 天山雪莲 牛大力
0.918629 0.332646 0.39843 0.525408 0.38151 0.407133 0.343551
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
196. 
patient tongue id: 05261929472402_5
label yaofang:
甘草 白芍 陈皮 桃仁 麦冬 党参 黄芪 丹参 红花 延胡索 牛膝 苏木 珍珠母 北沙参 浮小麦 威灵仙 宽筋藤
0.724148 0.34192 0.482227 0.30877
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.500000, recall: 0.117647, error: 0.500000
197. 
patient tongue id: 03311652130497_6
label yaofang:
甘草 法半夏 龙齿 酸枣仁 柏子仁 栀子 淡豆豉 天麻 糯稻根 百合 紫苏叶 蜈蚣
0.318873 0.378931 0.508301 0.328656 0.321808 0.328323 0.307997 0.30087 0.456295 0.577267
predicted yaofang:
甘草 柴胡 白芍 香附 党参 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.100000, recall: 0.083333, error: 0.900000
198. 
patient tongue id: 04222212283838_1_4
label yaofang:
陈皮 茯苓 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.471315 0.81123 0.363861 0.949862 0.54499 0.739341 0.435463 0.339677 0.462483 0.916176 0.932855 0.891356 0.932349 0.327933 0.968325 0.485049 0.470283 0.567762 0.799917
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
199. 
patient tongue id: 01062333312019_1_4_7
label yaofang:
丹参 牛膝 钩藤 泽泻 莱菔子 决明子 夏枯草 制何首乌 盐车前子 燀桃仁天麻颗粒
0.426316 0.344189 0.309734 0.349156 0.328028 0.322413 0.323017 0.50862 0.715305
predicted yaofang:
法半夏 茯苓 前胡 桔梗 细辛 干姜 款冬花 紫菀 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
200. 
patient tongue id: 06130946493457_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 红曲
0.589913 0.460584 0.378793 0.318004 0.306253
predicted yaofang:
甘草 党参 黄芪 丹参 天麻

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
201. 
patient tongue id: 03011832383913_1_4
label yaofang:
甘草 茯苓 葛根 桔梗 防风 麦冬 玄参 赤芍 白芷 北沙参 辛夷 广藿香 人参叶 炒六神曲 醋香附
0.410406 0.572731 0.420357 0.665717 0.432141 0.522246 0.342415 0.372124 0.341536 0.306161 0.377373 0.623513 0.639343 0.600641 0.625959 0.367041 0.76745 0.372625 0.390349 0.400913 0.516652
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.333333, recall: 0.466667, error: 0.666667
202. 
patient tongue id: 02161849330929_1_6
label yaofang:
茯苓 前胡 麦冬 太子参 黄芪 郁金 北柴胡 款冬花 紫菀 百部 豆蔻 北沙参 炙甘草 人参叶
0.433249 0.686387 0.424412 0.819166 0.498724 0.583262 0.345128 0.408456 0.35109 0.30482 0.395464 0.781354 0.792081 0.741845 0.788032 0.372866 0.866154 0.406501 0.413484 0.475888 0.663958
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.380952, recall: 0.571429, error: 0.619048
203. 
patient tongue id: 01042346471467_1_7
label yaofang:
桂枝 甘草 川芎 法半夏 党参 黄芪 丹参 红花 薤白 水蛭 莪术 地龙 麸炒枳壳
0.990834 0.478148 0.651482 0.401567 0.305424 0.325571 0.676498 0.596546 0.596787 0.473487 0.517758 0.539311
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
204. 
patient tongue id: 04251815414383_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.439911 0.689146 0.407963 0.831331 0.492828 0.595088 0.336703 0.420197 0.353636 0.402848 0.793506 0.814969 0.765372 0.808954 0.377559 0.887914 0.402554 0.412737 0.488674 0.683783
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
205. 
patient tongue id: 05221938550126_6
label yaofang:
甘草 柴胡 川芎 香附 防风 牛蒡子 赤芍 海螵蛸 荆芥穗 白芷 郁李仁 芥子
0.372352 0.528063 0.346613 0.319536 0.387711 0.559457 0.711928
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
206. 
patient tongue id: 01250628409091_1_6
label yaofang:
甘草 柴胡 白芍 法半夏 龙骨 远志 党参 酸枣仁 天麻 白花蛇舌草 麦芽 首乌藤 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.979443 0.471631 0.623086 0.39517 0.323836 0.609516 0.501629 0.491705 0.373278 0.414085 0.427687
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
207. 
patient tongue id: 04210755347441_1_3
label yaofang:
白芍 金银花 薏苡仁 桃仁 蒲公英 生地黄 苍术 百部 苦参 白鲜皮 关黄柏 地肤子
0.486483 0.468876 0.446258 0.403817 0.495824 0.438662 0.45277 0.392626 0.436159 0.394622 0.447031 0.411231 0.403394 0.425694 0.396196
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.066667, recall: 0.083333, error: 0.933333
208. 
patient tongue id: 01312134327639_5_1
label yaofang:
麻黄 甘草 黄芩 法半夏 茯苓 前胡 薏苡仁 鱼腥草 天麻 鳖甲 款冬花 莪术 苦杏仁 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.978934 0.468656 0.612902 0.408732 0.317624 0.571798 0.509455 0.522903 0.387415 0.418625 0.413037
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.352941, error: 0.454545
209. 
patient tongue id: 04122112302799_2_8_5
label yaofang:
甘草 黄芩 麦冬 玄参 生地黄 没药 鳖甲 火麻仁 淡竹叶 百合 蜈蚣 白花蛇舌 四季青 川木通
0.992704 0.458324 0.667115 0.396662 0.343983 0.322911 0.722387 0.590012 0.630375 0.462905 0.543831 0.628659
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
210. 
patient tongue id: 04141810307623_1_4_3
label yaofang:
甘草 茯苓 半夏 党参 白术 海螵蛸 杜仲 黄柏 郁金 山药 干姜 厚朴 砂仁 鸡内金 紫苏叶 黑枣
0.631776 0.355534 0.42097 0.3357
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.250000, error: 0.000000
211. 
patient tongue id: 03192303369214_4_6_1
label yaofang:
甘草 白芍 川芎 法半夏 茯苓 独活 党参 白术 赤芍 山药 砂仁 天麻 忍冬藤 粉葛 威灵仙 白花蛇舌
0.988134 0.472478 0.628437 0.360268 0.310155 0.654361 0.57823 0.55925 0.459107 0.496869 0.511703
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
212. 
patient tongue id: 02171942336723_2_5
label yaofang:
甘草 柴胡 茯苓 桔梗 半夏 玄参 赤芍 海螵蛸 浙贝母 北沙参 木蝴蝶 猫爪草
0.638674 0.394404 0.501772 0.378237 0.427178 0.36891 0.370335 0.331483 0.302562 0.473856
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 莱菔子 天麻

------Score: precision: 0.100000, recall: 0.083333, error: 0.900000
213. 
patient tongue id: 04120804559897_1_3
label yaofang:
白芍 金银花 薏苡仁 桃仁 蒲公英 生地黄 苍术 百部 苦参 白鲜皮 关黄柏 地肤子
0.448974 0.41023 0.430238 0.38113 0.419097 0.35406 0.386838 0.335555 0.376115 0.38396 0.368149 0.340659 0.319931 0.342801 0.352931
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.066667, recall: 0.083333, error: 0.933333
214. 
patient tongue id: 05162026118169_4
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 豆蔻 蝉蜕 姜半夏 百合 紫苏叶 广藿香 合欢皮
0.302816 0.36724 0.483329 0.302102 0.323147 0.349429 0.439366 0.628704
predicted yaofang:
甘草 柴胡 白芍 党参 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
215. 
patient tongue id: 04071930080627_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 黄芪 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香
0.41578 0.550765 0.422183 0.627342 0.414666 0.524876 0.36577 0.33878 0.325543 0.353472 0.589863 0.623524 0.624932 0.626913 0.421237 0.746992 0.373299 0.378824 0.432736 0.540944
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
216. 
patient tongue id: 05081759003586_1
label yaofang:
柴胡 白芍 川芎 陈皮 枳壳 麦冬 郁金 瓜蒌皮 炙甘草 醋香附 合欢皮
0.862301 0.372137 0.357568 0.496475 0.320355 0.368744
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
217. 
patient tongue id: 03152041314373_4_1_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.390076 0.344068 0.383496 0.445286 0.375744 0.354689 0.312752 0.31222
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 钩藤 泽泻

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
218. 
patient tongue id: 02211436357130_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.420002 0.374445 0.416579 0.419589 0.404333 0.324296 0.365836 0.323197 0.341324 0.325172 0.337229 0.303627 0.321836 0.302617
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 夏枯草 制何首乌

------Score: precision: 0.785714, recall: 0.916667, error: 0.214286
219. 
patient tongue id: 05222058310121_1_4_7
label yaofang:
陈皮 麦冬 鸡内金 莲子 布渣叶 莲房
0.512277 0.329746 0.385461 0.473263 0.403534 0.312517
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
220. 
patient tongue id: 02281303117022_1_2_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.447336 0.317204 0.374485 0.397594
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
221. 
patient tongue id: 05260702508917_2_5
label yaofang:
甘草 柴胡 白芍 茯苓 党参 酸枣仁 生地黄 栀子 牡丹皮 天麻 鳖甲 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.948396 0.317868 0.434783 0.574208 0.381531 0.536058 0.412477 0.452121 0.323003 0.366014 0.411657
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
222. 
patient tongue id: 03012125599670_6_1
label yaofang:
甘草 党参 酸枣仁 生地黄 杜仲 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.767022 0.43625 0.322229 0.46892 0.339351
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
223. 
patient tongue id: 05191947292297_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 熟地黄 栀子 牡丹皮 山药 菟丝子 桑寄生 女贞子 首乌藤 合欢花 艾叶
0.983747 0.319265 0.475022 0.626325 0.400063 0.320172 0.629446 0.55947 0.554455 0.450134 0.48465 0.486766
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
224. 
patient tongue id: 05050746292112_5
label yaofang:
甘草 黄芩 前胡 桔梗 浙贝母 细辛 桑白皮 干姜 鳖甲 款冬花 白前 苦杏仁 白花蛇舌 天山雪莲
0.959419 0.334404 0.443283 0.590117 0.39338 0.563244 0.471063 0.482608 0.370392 0.406631 0.409721
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
225. 
patient tongue id: 05221854083618_4
label yaofang:
当归 熟地黄 杜仲 山茱萸 钩藤 厚朴 天麻 巴戟天 茵陈 土茯苓
0.616445 0.342546 0.416885
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
226. 
patient tongue id: 02150747509106_1_4_7
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 五味子 熟地黄 火麻仁 苦参 炙甘草 黑枣
0.358476 0.359869 0.341489
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.333333, recall: 0.090909, error: 0.666667
227. 
patient tongue id: 05261941409920_4_1_7
label yaofang:
甘草 党参 白术 浙贝母 乌梅 牛膝 郁金 山药 厚朴 菟丝子 天花粉 莪术 北沙参 桑椹 紫苏梗 红豆杉 预知子 鹿衔草
0.677659 0.365967 0.417331 0.380147 0.489609
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.166667, error: 0.400000
228. 
patient tongue id: 01012058558372_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.443929 0.452374 0.432658 0.4268 0.486276 0.40797 0.452492 0.426785 0.44343 0.397144 0.466345 0.377625 0.414235 0.448586 0.414587
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
229. 
patient tongue id: 05290839556812_7_4_6
label yaofang:
甘草 柴胡 白芍 茯苓 远志 党参 丹参 胆南星 栀子 牡丹皮 川楝子 地黄 厚朴 麦芽 合欢花
0.610316 0.307368 0.365106 0.397124 0.369284
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
230. 
patient tongue id: 03022218484889_1_6
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 浙贝母 桑叶 菊花 天麻 莪术 白花蛇舌草 蜈蚣 醋鳖甲
0.99065 0.308336 0.495252 0.645152 0.379144 0.307961 0.338128 0.699429 0.63968 0.62612 0.524461 0.555188 0.565707
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
231. 
patient tongue id: 01081920390190_9_6
label yaofang:
柴胡 白芍 黄芩 当归 枳实 干姜 大黄 生地 法夏 旋复花冲剂
0.977716 0.325905 0.474696 0.61419 0.400341 0.347144 0.316703 0.363844 0.672017 0.590051 0.585851 0.487612 0.535015 0.568226
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.071429, recall: 0.100000, error: 0.928571
232. 
patient tongue id: 01012100505502_1_3_7
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 丹参 枳实 竹茹 胆南星 薤白 厚朴 瓜蒌皮
0.557118 0.380647 0.432146 0.430878 0.374166
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
233. 
patient tongue id: 04200259240825_5
label yaofang:
甘草 法半夏 茯苓 桔梗 金银花 牛蒡子 浙贝母 山药 桑白皮 莱菔子 款冬花 紫菀 苦杏仁 紫苏子
0.992738 0.488673 0.658159 0.410707 0.318547 0.348378 0.700402 0.629392 0.63101 0.506245 0.556031 0.584145
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
234. 
patient tongue id: 04111958516106_2_1
label yaofang:
桂枝 甘草 白芍 防风 薏苡仁 白术 天麻 桑寄生 鳖甲 补骨脂 麦芽 威灵仙 蜈蚣 白花蛇舌 天山雪莲
0.992587 0.478528 0.660155 0.371879 0.308515 0.321243 0.704244 0.608155 0.599526 0.484825 0.530246 0.556262
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
235. 
patient tongue id: 05152107314539_6
label yaofang:
大枣 当归 茯苓 木香 远志 党参 黄芪 白术 酸枣仁 柏子仁 车前子 炙甘草 制白附子
0.768007 0.364622 0.332025 0.451985 0.319489
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
236. 
patient tongue id: 03101948109701_4
label yaofang:
茯苓 防风 薄荷 钩藤 荆芥穗 白芷 香薷 炙甘草 首乌藤 紫苏梗 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.470957 0.753605 0.392205 0.893477 0.521998 0.649511 0.328351 0.417879 0.346787 0.422633 0.856899 0.872955 0.83182 0.862589 0.377722 0.937556 0.431625 0.434942 0.541525 0.735516
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.357143, error: 0.750000
237. 
patient tongue id: 01061909494818_4_1
label yaofang:
陈皮 法半夏 前胡 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 炒蔓荆子
0.398154 0.504718 0.378929 0.596947 0.384949 0.483458 0.334966 0.303582 0.322513 0.536905 0.600765 0.594373 0.626601 0.415409 0.746552 0.361604 0.347604 0.384393 0.462772
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.875000, error: 0.263158
238. 
patient tongue id: 03151732024557_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.386891 0.423407 0.411641 0.471074 0.455499 0.363578 0.433014 0.375632 0.412945 0.372405 0.408354 0.316759 0.36478 0.394204 0.374681
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
239. 
patient tongue id: 02161927452714_5
label yaofang:
橘红 荆芥 防风 桑叶 菊花 桑白皮 白芷 鸡内金 枇杷叶 辛夷 紫苏叶 苍耳子
0.69738 0.424731 0.453274 0.335082 0.384356
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
240. 
patient tongue id: 06171335241967_6
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 紫苏叶 山慈菇
0.651089 0.345473 0.480929 0.411484 0.309643 0.332649
predicted yaofang:
甘草 柴胡 白芍 党参 白术 浙贝母

------Score: precision: 0.166667, recall: 0.100000, error: 0.833333
241. 
patient tongue id: 04112035114460_2_6
label yaofang:
甘草 白芍 党参 白术 酸枣仁 柏子仁 厚朴 天麻 鳖甲 火麻仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.99175 0.308071 0.472683 0.661261 0.383585 0.321845 0.316724 0.716855 0.61396 0.612043 0.494402 0.544072 0.573887
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
242. 
patient tongue id: 05290831535119_6_7_4
label yaofang:
甘草 法半夏 茯苓 木香 薏苡仁 党参 白术 山药 灯心草 砂仁 茵陈 扁豆花 三棱 莪术 麦芽
0.978307 0.324311 0.479725 0.630404 0.403423 0.339313 0.323991 0.352323 0.667509 0.577756 0.567507 0.480092 0.510451 0.515828
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.333333, error: 0.642857
243. 
patient tongue id: 01312136500427_4_7
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 白术 山药 厚朴 砂仁 三棱 莪术 豆蔻 麦芽 紫苏梗 广藿香
0.695 0.394985 0.346686 0.372176
predicted yaofang:
甘草 白芍 茯苓 党参

------Score: precision: 0.750000, recall: 0.200000, error: 0.250000
244. 
patient tongue id: 01201928567500_1_2_6
label yaofang:
甘草 党参 山药 山茱萸 地黄 天麻 菟丝子 益智仁 益母草 金樱子 白花蛇舌草 蜈蚣 棉萆薢 醋鳖甲
0.996926 0.471607 0.689001 0.369065 0.306706 0.31359 0.759128 0.64546 0.63288 0.509379 0.565126 0.593373
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
245. 
patient tongue id: 04211351094743_9
label yaofang:
法半夏 前胡 桔梗 防风 白芷 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 百合 广藿香 蜜麻黄 炒苍耳子
0.452611 0.748708 0.379847 0.902465 0.512038 0.6952 0.412712 0.338545 0.307783 0.443266 0.858871 0.879627 0.834084 0.879948 0.339088 0.938418 0.46873 0.456944 0.537367 0.735455
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.812500, error: 0.350000
246. 
patient tongue id: 04141954078167_6_1
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 党参 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989548 0.446581 0.672384 0.375179 0.311024 0.687377 0.52387 0.537387 0.392249 0.446602 0.4735
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
247. 
patient tongue id: 02181633186933_5_7
label yaofang:
甘草 白芍 茯苓 葛根 羌活 连翘 党参 黄芪 白术 丹参 红花 赤芍 皂角刺 白鲜皮
0.942008 0.31707 0.470081 0.549939 0.379643 0.308532 0.499825 0.417018 0.422344 0.3235 0.330294 0.310775
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
248. 
patient tongue id: 03291640164304_6
label yaofang:
甘草 白术 酸枣仁 生地黄 郁金 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.956679 0.339793 0.434545 0.578695 0.355283 0.554608 0.443972 0.439658 0.344166 0.37016 0.368225
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
249. 
patient tongue id: 03231605061969_1_4
label yaofang:
法半夏 前胡 桔梗 防风 黄芪 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 麸炒白术
0.470316 0.799023 0.356606 0.945835 0.550981 0.735913 0.450783 0.362608 0.480937 0.913029 0.931368 0.890139 0.929049 0.322672 0.969852 0.494894 0.480163 0.552094 0.785972
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
250. 
patient tongue id: 01172228557270_1_4_7
label yaofang:
甘草 连翘 党参 丹参 玄参 赤芍 浙贝母 天麻 鳖甲 皂角刺 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.964562 0.350374 0.428936 0.607687 0.324742 0.618369 0.431125 0.426066 0.326341 0.374512 0.41239
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
251. 
patient tongue id: 03151837180467_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 猫爪草
0.305101 0.305448 0.443312 0.327842 0.309738 0.323116 0.563961
predicted yaofang:
甘草 柴胡 白芍 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.714286, recall: 0.454545, error: 0.285714
252. 
patient tongue id: 03090811520496_1_4
label yaofang:
甘草 茯苓 桔梗 荆芥 阿胶 白术 浙贝母 天麻 诃子 白花蛇舌草 麦芽 白鲜皮 半枝莲 醋鳖甲
0.992026 0.473923 0.673986 0.401886 0.352138 0.359063 0.724497 0.622926 0.641568 0.503498 0.567034 0.637869
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
253. 
patient tongue id: 04301133054923_4_7_1
label yaofang:
甘草 法半夏 茯苓 龙骨 党参 酸枣仁 丹参 黄连 山茱萸 天麻 全蝎 补骨脂 麦芽 川加皮
0.986289 0.481439 0.630733 0.346197 0.317621 0.666797 0.565995 0.529859 0.455253 0.473414 0.465225
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
254. 
patient tongue id: 05290841544761_6_2_4
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 丹参 生地黄 牡丹皮 杜仲 菟丝子 桑寄生 益母草 补骨脂 女贞子
0.955783 0.324738 0.424909 0.573226 0.350887 0.518632 0.387877 0.39576 0.302528
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.555556, recall: 0.333333, error: 0.444444
255. 
patient tongue id: 03062127052330_6
label yaofang:
甘草 白芍 酸枣仁 丹参 生地黄 山药 山茱萸 砂仁 天麻 桑寄生 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 半枝莲
0.990248 0.482659 0.637458 0.388893 0.314313 0.660046 0.588104 0.574248 0.464481 0.497362 0.493814
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
256. 
patient tongue id: 06082027497652_2
label yaofang:
甘草 枳壳 薏苡仁 桃仁 蒲公英 太子参 黄芪 白术 生地黄 牡丹皮 乌药 郁金 厚朴 僵蚕 莪术 蜈蚣 姜黄
0.419256 0.302192 0.416134 0.583825 0.527607 0.423969 0.380207 0.355599 0.42212 0.312588
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.400000, recall: 0.235294, error: 0.600000
257. 
patient tongue id: 04202031084984_2_7
label yaofang:
甘草 柴胡 白芍 茯苓 白术 全蝎 猪苓 莪术 半枝莲 蜂房 瓦楞子 山豆根 半边莲
0.341882 0.486456 0.339779 0.478317 0.632671
predicted yaofang:
柴胡 白芍 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
258. 
patient tongue id: 01041648186326_6_1
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.637805 0.344538 0.446645 0.412945 0.443669
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
259. 
patient tongue id: 03221629545678_1_4_6
label yaofang:
枳壳 半夏 黄芪 白术 赤芍 海螵蛸 砂仁 菟丝子 桑寄生 鸡内金 莲子 北沙参 红豆杉 合欢皮
0.511451 0.373179 0.620317 0.531279 0.315059 0.405619 0.339759 0.3531 0.330465
predicted yaofang:
甘草 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
260. 
patient tongue id: 02202242230635_5
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 牛蒡子 浙贝母 桑白皮 莱菔子 款冬花 枇杷叶 苦杏仁 紫苏子
0.986624 0.487455 0.6051 0.359023 0.304647 0.584343 0.537724 0.494668 0.408863 0.422804 0.381838
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
261. 
patient tongue id: 06022133210397_5
label yaofang:
芦根 牛蒡子 薏苡仁 麦冬 黄连 佩兰 三七 茵陈 淡竹叶 扁豆花 百合 土茯苓 木棉花
0.485963 0.308243 0.340247 0.331761 0.545189 0.536145 0.387528 0.353552 0.317208 0.355449
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
262. 
patient tongue id: 03111439448754_6_2_1
label yaofang:
甘草 白芍 木香 薏苡仁 玉竹 党参 延胡索 砂仁 天麻 五灵脂 鳖甲 三棱 莪术 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.983957 0.454483 0.638612 0.402192 0.313559 0.318416 0.657411 0.550507 0.566524 0.439305 0.493681 0.537725
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.411765, error: 0.416667
263. 
patient tongue id: 05160609128726_1_4_6
label yaofang:
桂枝 桃仁 黄芪 白术 海螵蛸 牛膝 砂仁 桑寄生 续断 桑椹 首乌藤 土鳖虫 红豆杉 合欢皮
0.51423 0.337773 0.346706 0.355121 0.527479 0.515106 0.300963 0.402542 0.360909 0.342507 0.395147
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
264. 
patient tongue id: 05201455401943_3_2
label yaofang:
柴胡 白芍 当归 茯苓 木香 远志 党参 黄芪 白术 熟附子 熟地黄 细辛 干姜 炙甘草 女贞子 广升麻 墨旱莲
0.932947 0.434896 0.572419 0.421283 0.322065 0.503066 0.392011 0.440781 0.314442 0.322777
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.176471, error: 0.700000
265. 
patient tongue id: 05222104225178_4_1
label yaofang:
陈皮 当归 黄芪 白术 杜仲 苍术 厚朴 生半夏 僵蚕 鸡内金 枇杷叶 红豆杉 山慈菇 稻芽
0.457092 0.469155 0.621364 0.597116 0.325554 0.354293 0.489313 0.454227 0.429649 0.493402 0.371226 0.312901
predicted yaofang:
甘草 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮 蛇舌草

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
266. 
patient tongue id: 02020950137737_6_5
label yaofang:
甘草 柴胡 白芍 黄芩 当归 茯苓 党参 白术 酸枣仁 生地黄 栀子 牡丹皮 合欢花
0.948206 0.45107 0.570671 0.356847 0.526854 0.431981 0.446144 0.319104 0.360798 0.375047
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
267. 
patient tongue id: 03240601247005_2_5
label yaofang:
甘草 茯苓 木香 黄连 生地黄 山茱萸 灯心草 山楂 莱菔子 莪术 海金沙 鸡内金 王不留行 广金钱草
0.910792 0.429843 0.518299 0.388446 0.371129 0.324735
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
268. 
patient tongue id: 03180134191340_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮
0.308146 0.432037 0.315036 0.364914 0.370396 0.595168
predicted yaofang:
柴胡 白芍 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
269. 
patient tongue id: 05260716182232_1_2_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 天麻 鳖甲 款冬花 蜈蚣 天山雪莲 半枝莲 红豆杉
0.998378 0.477641 0.732691 0.38406 0.368921 0.35289 0.812108 0.681909 0.709825 0.545838 0.624513 0.71419
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
270. 
patient tongue id: 04112235254672_4_6_7
label yaofang:
甘草 香附 茯苓 牛蒡子 白及 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 半枝莲 瓦楞子 猫爪草 半边莲
0.577484 0.304449 0.422898 0.395683 0.416756
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
271. 
patient tongue id: 05221956139677_2_1
label yaofang:
党参 黄芪 白术 附子 车前子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.312621 0.377074 0.528769 0.316513 0.321437 0.313993 0.301927 0.4778 0.593772
predicted yaofang:
甘草 柴胡 白芍 香附 党参 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.300000, error: 0.666667
272. 
patient tongue id: 01172237281672_1_5
label yaofang:
甘草 枳壳 茯苓 木香 蒲公英 白及 党参 白术 黄连 赤芍 砂仁 五灵脂 麦芽 白扁豆 稻芽
0.989189 0.480581 0.655754 0.408024 0.329848 0.303646 0.361818 0.691276 0.613472 0.627423 0.492521 0.54251 0.584706
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
273. 
patient tongue id: 04122141045729_6_2
label yaofang:
甘草 白芍 当归 党参 生地黄 山药 山茱萸 天麻 糯稻根 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲 龟甲
0.636551 0.360063 0.41731 0.37738 0.456373
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
274. 
patient tongue id: 06190648385281_6_7_4
label yaofang:
甘草 茯苓 木香 党参 白术 酸枣仁 牡丹皮 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红曲
0.986285 0.472601 0.638939 0.428598 0.341708 0.35354 0.690785 0.611692 0.639844 0.503284 0.561706 0.624712
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.733333, error: 0.083333
275. 
patient tongue id: 06070653154686_2_4_6
label yaofang:
甘草 法半夏 茯苓 桔梗 橘红 薏苡仁 太子参 酸枣仁 浙贝母 砂仁 鳖甲 火麻仁 莪术 麦芽 苦杏仁 白花蛇舌 天山雪莲
0.97356 0.326367 0.466988 0.590678 0.368182 0.542246 0.492908 0.465142 0.38477 0.394611 0.35946
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.294118, error: 0.545455
276. 
patient tongue id: 03151954284682_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.485636 0.513569 0.449434 0.346203 0.515361 0.483659 0.454178 0.456334 0.476196 0.456022 0.525758 0.494402 0.468689 0.502875 0.497464
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
277. 
patient tongue id: 02201815225007_1_6
label yaofang:
甘草 陈皮 茯苓 葛根 郁金 佩兰 北柴胡 茵陈 广藿香 干鱼腥草 炒白扁豆 麸炒白术 炒六神曲 布渣叶 木棉花
0.413665 0.500131 0.420659 0.519111 0.362248 0.415003 0.496723 0.457193 0.439701 0.421868 0.468802
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
278. 
patient tongue id: 02260652202101_5
label yaofang:
甘草 陈皮 枳壳 黄芩 法半夏 茯苓 桔梗 党参 浙贝母 桑白皮 款冬花 苦杏仁 广藿香
0.919542 0.356493 0.432243 0.556027 0.362729 0.516506 0.397063 0.419013 0.3099 0.346056 0.380877
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
279. 
patient tongue id: 05251957539151_1_4_6
label yaofang:
当归 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 石斛 鸡内金 紫苏梗 稻芽
0.430654 0.323197 0.47409 0.461307 0.314571
predicted yaofang:
甘草 党参 黄芪 白术 厚朴

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
280. 
patient tongue id: 05181033112886_6
label yaofang:
甘草 柴胡 香附 黄芩 法半夏 茯苓 党参 白术 砂仁 枇杷叶 麦芽 紫苏梗 广藿香
0.980267 0.323671 0.44553 0.613216 0.36254 0.301689 0.623846 0.508452 0.504108 0.393852 0.434769 0.457991
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
281. 
patient tongue id: 03232205582219_2_7
label yaofang:
甘草 白芍 川芎 独活 党参 白术 延胡索 山茱萸 桑寄生 秦艽 浮小麦 威灵仙 合欢花 骨碎补
0.970106 0.305419 0.458392 0.600826 0.371751 0.309143 0.587623 0.477801 0.467454 0.367228 0.396535 0.401859
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
282. 
patient tongue id: 03312022058407_6
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 法半夏 大枣 茯苓 牡蛎 白术 酸枣仁 竹茹 干姜 青蒿 浮小麦 首乌藤
0.985507 0.484309 0.628621 0.373497 0.300511 0.326341 0.648655 0.561883 0.543117 0.447575 0.471908 0.471875
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
283. 
patient tongue id: 05102150507876_1
label yaofang:
法半夏 前胡 防风 白芷 款冬花 紫菀 白前 百部 豆蔻 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.36733 0.320348 0.37411 0.306542 0.309827 0.371889 0.318935 0.302248 0.340839 0.469059 0.566367
predicted yaofang:
陈皮 法半夏 茯苓 半夏 防风 黄芪 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
284. 
patient tongue id: 04201512393195_1_3
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.450129 0.320752 0.381158 0.488329
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
285. 
patient tongue id: 03311649368516_4
label yaofang:
柴胡 黄芩 龙骨 党参 白术 泽泻 天麻 姜半夏 炙甘草 续断
0.469735 0.667155 0.521931 0.360251 0.323632 0.448482 0.325863 0.424437 0.786538 0.836767 0.303503
predicted yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.272727, recall: 0.300000, error: 0.727273
286. 
patient tongue id: 05312144431637_7_4_6
label yaofang:
甘草 川芎 龙骨 桃仁 红花 牛膝 薤白 水蛭 天麻 瓜蒌皮 莪术 蒺藜 沙苑子 酒女贞子 墨旱莲
0.972767 0.404241 0.64745 0.337238 0.331845 0.670486 0.327478 0.413356 0.340768
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.222222, recall: 0.133333, error: 0.777778
287. 
patient tongue id: 02181602098808_6_4_7
label yaofang:
甘草 香附 枳壳 法半夏 丹参 黄连 延胡索 牛膝 薤白 砂仁 天麻 五灵脂 桑寄生 瓜蒌皮 柿蒂 蒺藜
0.985627 0.446833 0.655643 0.389936 0.32048 0.309823 0.673688 0.521276 0.54552 0.398172 0.458415 0.513985
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.125000, error: 0.833333
288. 
patient tongue id: 04121934187163_2_1
label yaofang:
甘草 白芍 薏苡仁 党参 赤芍 杜仲 天麻 鳖甲 佛手 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤
0.995957 0.469615 0.695909 0.353669 0.359351 0.317145 0.335189 0.778829 0.643617 0.649831 0.522337 0.58756 0.667714
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
289. 
patient tongue id: 01092039473165_1_6
label yaofang:
甘草 柴胡 白芍 当归 茯苓 党参 白术 丹参 熟地黄 益母草 淫羊藿 仙茅 合欢花
0.990179 0.304633 0.477878 0.642299 0.381079 0.304969 0.331438 0.678069 0.584269 0.573324 0.463459 0.510626 0.528207
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.384615, error: 0.615385
290. 
patient tongue id: 06162245121306_1_4
label yaofang:
甘草 陈皮 茯苓 佩兰 砂仁 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶 炒稻芽 炒麦芽
0.420105 0.683262 0.396211 0.844551 0.489736 0.601275 0.315658 0.381263 0.313657 0.390324 0.802254 0.819084 0.7782 0.833852 0.368659 0.888686 0.404326 0.407795 0.48954 0.685911
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.230769, error: 0.850000
291. 
patient tongue id: 04122128100320_1_6
label yaofang:
甘草 薏苡仁 党参 黄芪 熟附子 山药 砂仁 天麻 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.566311 0.330969 0.418146 0.469708 0.413697
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
292. 
patient tongue id: 03302018324992_1_7
label yaofang:
甘草 当归 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 紫苏叶 蜈蚣 合欢皮 稻芽
0.445005 0.400105 0.400444 0.397987
predicted yaofang:
甘草 法半夏 茯苓 炙甘草

------Score: precision: 0.500000, recall: 0.117647, error: 0.500000
293. 
patient tongue id: 05251941547536_1
label yaofang:
甘草 白芍 陈皮 茯苓 半夏 薏苡仁 党参 黄芪 白术 海螵蛸 车前子 砂仁 白芷 莪术 鸭脚艾
0.573962 0.303803 0.355368 0.460323 0.413547 0.388838 0.307104 0.350696 0.363804
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 天麻

------Score: precision: 0.444444, recall: 0.266667, error: 0.555556
294. 
patient tongue id: 02182222408105_2_1_5
label yaofang:
甘草 黄芩 桔梗 牛蒡子 浙贝母 郁金 白茅根 茜草 鳖甲 鸡内金 白花蛇舌 蜂房 岗梅根 四季青
0.992129 0.484583 0.658593 0.367815 0.3235 0.330763 0.719502 0.618917 0.599142 0.50495 0.543132 0.560252
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
295. 
patient tongue id: 05092043228184_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.439486 0.585529 0.458098 0.338711 0.41554 0.346705 0.413016 0.696653 0.769735 0.318842
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
296. 
patient tongue id: 03231306169107_6_1_5
label yaofang:
甘草 川芎 党参 生地黄 赤芍 牡丹皮 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.996709 0.465065 0.702502 0.420594 0.355247 0.302785 0.347614 0.790985 0.699627 0.733789 0.574966 0.655467 0.744294
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.692308, error: 0.307692
297. 
patient tongue id: 05160627084077_3_1_6
label yaofang:
茯苓 龙骨 熟地黄 牡丹皮 附子 肉桂 山药 山茱萸 干姜 补骨脂 金樱子 益智 黄精
0.563437 0.327762 0.382462 0.507414 0.469959 0.342863 0.324859
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
298. 
patient tongue id: 03240604426244_6_2
label yaofang:
甘草 茯苓 薏苡仁 党参 玄参 生地黄 赤芍 浙贝母 郁金 厚朴 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲
0.982827 0.46813 0.619833 0.379558 0.31057 0.604464 0.540637 0.525407 0.414055 0.445126 0.431848
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
299. 
patient tongue id: 03061502200607_1
label yaofang:
甘草 柴胡 白芍 枳壳 桔梗 黄芪 白术 生地黄 槟榔 厚朴 肉苁蓉 火麻仁 柿蒂 紫菀
0.320027 0.31637 0.411101 0.318007 0.380675 0.385617 0.463927
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
300. 
patient tongue id: 05232016470375_1_7
label yaofang:
甘草 枳壳 茯苓 薏苡仁 蒲公英 白术 黄连 海螵蛸 郁金 厚朴 莪术 北沙参 紫苏叶 蜈蚣 红豆杉 合欢皮 姜黄 蛇舌草
0.513223 0.31423 0.315447 0.357162 0.533974 0.511471 0.38069 0.328297 0.309044 0.336205
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.500000, recall: 0.277778, error: 0.500000
301. 
patient tongue id: 01070841443443_1_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 赤芍 牛膝 郁金 六神曲
0.597419 0.349292 0.449771 0.332563 0.313082
predicted yaofang:
甘草 茯苓 党参 黄芪 天麻

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
302. 
patient tongue id: 05231931246053_1
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.464071 0.803354 0.379132 0.931478 0.553141 0.684929 0.333043 0.452519 0.367049 0.452643 0.901028 0.918322 0.882033 0.908179 0.370084 0.960624 0.447874 0.448532 0.564921 0.793071
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
303. 
patient tongue id: 02211427346053_4_1_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 干姜 鸡内金
0.569777 0.332427 0.462764 0.406979 0.311155
predicted yaofang:
甘草 茯苓 党参 黄芪 天麻

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
304. 
patient tongue id: 04101907167307_1_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.351392 0.354012 0.372497 0.340263 0.350099 0.337798 0.301007 0.378339 0.365207 0.388881 0.423581 0.650396
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
305. 
patient tongue id: 05140657474380_1
label yaofang:
甘草 川芎 当归 茯苓 党参 黄芪 鸡血藤 白术 山药 山茱萸 砂仁 天麻 桑螵蛸 麦芽 地龙
0.471886 0.303113 0.325333 0.333174 0.516882 0.543494 0.367039 0.350896 0.300506
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.666667, recall: 0.400000, error: 0.333333
306. 
patient tongue id: 03021234054976_1_3
label yaofang:
川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.36606 0.362336 0.372167
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.666667, recall: 0.166667, error: 0.333333
307. 
patient tongue id: 05242000125657_5_2
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 茯苓 连翘 红花 牡丹皮 地黄 菟丝子 益母草 皂角刺 醋香附
0.993242 0.309848 0.467529 0.664746 0.391803 0.304851 0.30663 0.716353 0.613671 0.625228 0.4875 0.544225 0.581758
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
308. 
patient tongue id: 01042308513562_4
label yaofang:
甘草 香附 茯苓 薏苡仁 党参 白术 海螵蛸 干姜 紫菀 白花蛇舌草 续断 瓦楞子
0.6928 0.395667 0.459011 0.377274 0.488175 0.305313
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
309. 
patient tongue id: 02182240354089_6_3_1
label yaofang:
当归 桃仁 黄芪 白术 熟地黄 杜仲 附子 肉桂 山茱萸 厚朴 火麻仁 北沙参 首乌藤 地肤子 土鳖虫
0.550002 0.382384 0.385989 0.40516 0.410775
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
310. 
patient tongue id: 04301140576662_1_2
label yaofang:
甘草 香附 枳壳 茯苓 龙骨 党参 酸枣仁 丹参 生地黄 郁金 浮小麦 首乌藤 合欢花
0.979598 0.454695 0.636049 0.381245 0.307145 0.327896 0.64107 0.511745 0.510276 0.403061 0.441615 0.464132
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
311. 
patient tongue id: 02171848405438_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.466002 0.833982 0.364635 0.95703 0.558565 0.731508 0.452316 0.355899 0.46223 0.930362 0.945235 0.905078 0.942561 0.336788 0.97412 0.476433 0.461236 0.582193 0.825076
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
312. 
patient tongue id: 03261647030758_2_1
label yaofang:
甘草 白芍 香附 当归 茯苓 党参 黄芪 白术 郁金 山楂 蛇舌草
0.421355 0.378884 0.545912 0.301939 0.306247
predicted yaofang:
甘草 党参 黄芪 丹参 厚朴

------Score: precision: 0.600000, recall: 0.272727, error: 0.400000
313. 
patient tongue id: 01121848479995_2
label yaofang:
陈皮 前胡 防风 细辛 干姜 款冬花 白前 百部 炙甘草 炒紫苏子 蜜麻黄
0.463524 0.770261 0.360412 0.924814 0.513375 0.708999 0.308962 0.420611 0.333246 0.442989 0.883205 0.90474 0.866549 0.910345 0.36207 0.952667 0.480869 0.470657 0.557744 0.751529
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 1.000000, error: 0.450000
314. 
patient tongue id: 01121852311327_2
label yaofang:
法半夏 前胡 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.56757 0.413031 0.397607 0.35328 0.315827
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
315. 
patient tongue id: 05222011393645_4
label yaofang:
枳壳 太子参 白术 海螵蛸 神曲 山楂 砂仁 石斛 紫菀 麦芽 百合 紫苏叶 独脚金
0.370286 0.309474 0.479205
predicted yaofang:
白芍 党参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
316. 
patient tongue id: 04272315058824_7
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 猪苓 鳖甲 虎杖 白花蛇舌草 瓦楞子
0.354399 0.360299 0.49967 0.323697 0.323192 0.350289 0.386677 0.594971
predicted yaofang:
甘草 柴胡 白芍 党参 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.090909, error: 0.875000
317. 
patient tongue id: 06141843553587_6_2_5
label yaofang:
茯苓 牡蛎 熟地黄 牡丹皮 郁金 山药 山茱萸 泽泻 莪术 蜈蚣 土茯苓 合欢皮 姜黄
0.353652 0.340416 0.330162 0.34937 0.344427
predicted yaofang:
甘草 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
318. 
patient tongue id: 03302126207508_1_4
label yaofang:
甘草 薏苡仁 牡丹皮 牛膝 郁金 山药 山茱萸 石菖蒲 天麻 白花蛇舌草 麦芽 蜈蚣 醋鳖甲 麸炒枳壳
0.604549 0.316564 0.432658 0.316347
predicted yaofang:
甘草 法半夏 茯苓 党参

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
319. 
patient tongue id: 03181800512206_6_4
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 酸枣仁 浙贝母 郁金 天麻 鳖甲 莪术 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲
0.703282 0.536589 0.45082 0.509305 0.385815 0.510027 0.410702
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 款冬花 紫菀

------Score: precision: 0.285714, recall: 0.125000, error: 0.714286
320. 
patient tongue id: 01050635298145_6_4
label yaofang:
甘草 川芎 法半夏 茯苓 桔梗 赤芍 浙贝母 天麻 僵蚕 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989297 0.464512 0.647194 0.360628 0.310685 0.317977 0.684263 0.549057 0.542293 0.430123 0.479072 0.518933
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
321. 
patient tongue id: 06132244037705_4_1
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 山慈菇
0.325066 0.391036 0.514992 0.337335 0.300572 0.308754 0.307083 0.320559 0.354099 0.337688 0.456649 0.613622
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.666667, recall: 0.666667, error: 0.333333
322. 
patient tongue id: 02142133158258_1_2
label yaofang:
麻黄 陈皮 茯苓 前胡 半夏 防风 钩藤 款冬花 紫菀 百部 紫苏子 蝉蜕 炙甘草
0.453485 0.724703 0.36695 0.900886 0.496509 0.66357 0.368896 0.397426 0.850762 0.872534 0.828652 0.877124 0.325617 0.933373 0.438941 0.428896 0.501147 0.691079
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.444444, recall: 0.615385, error: 0.555556
323. 
patient tongue id: 04192231237159_6_2
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 杜仲 天麻 桑寄生 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.971603 0.322489 0.442993 0.597332 0.348509 0.578515 0.448824 0.420047 0.346956 0.363606 0.353771
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
324. 
patient tongue id: 03020735556122_1_4
label yaofang:
甘草 茯苓 党参 酸枣仁 山药 天麻 益母草 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.982097 0.461856 0.633091 0.403213 0.300167 0.327413 0.63001 0.547188 0.560647 0.443406 0.485891 0.525088
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
325. 
patient tongue id: 03152012263126_2_1_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.372933 0.376829 0.390188 0.476867 0.401383 0.391478 0.327743 0.350035 0.310804 0.324583 0.30954
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 钩藤 泽泻 车前子 莱菔子 夏枯草

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
326. 
patient tongue id: 05181045176169_2_5
label yaofang:
甘草 桔梗 金银花 芦根 牛蒡子 浙贝母 乌梅 白茅根 天麻 鳖甲 诃子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.990859 0.313434 0.453097 0.651914 0.355871 0.333172 0.310408 0.718423 0.576009 0.577342 0.455258 0.519593 0.582564
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
327. 
patient tongue id: 02252313550042_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 连翘 党参 栀子 牡丹皮 山药 莱菔子 麦芽 合欢花
0.955809 0.329165 0.43188 0.5735 0.398275 0.303662 0.545284 0.451157 0.470593 0.354705 0.392837 0.413984
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
328. 
patient tongue id: 03170933073125_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.425518 0.560483 0.427756 0.449012 0.585666 0.533389 0.520143 0.524249 0.556671 0.49832 0.606322 0.441721 0.57135 0.595414 0.604427
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
329. 
patient tongue id: 03191010531123_1_7_2
label yaofang:
蒲公英 黄芪 何首乌 白术 杜仲 砂仁 桑寄生 莪术 北沙参 橘核 桑椹 蜈蚣 红豆杉
0.509869 0.314656 0.362715 0.512363 0.507473 0.379691 0.340088 0.318334 0.32158
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
330. 
patient tongue id: 05051927181768_5
label yaofang:
茯苓 蒲公英 赤芍 青皮 熟地黄 牡丹皮 郁金 山药 泽泻 莪术 山萸肉 醋香附 穿破石 醋三棱
0.772785 0.354235 0.385 0.46593 0.309237 0.343037
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
331. 
patient tongue id: 04112000388796_1_2_7
label yaofang:
甘草 柴胡 黄芩 半夏 荆芥 丹参 杜仲 牛膝 郁金 厚朴 砂仁 菟丝子 火麻仁 紫苏叶 合欢皮 预知子
0.599078 0.347075 0.393605 0.459885 0.511834 0.345381 0.322124
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.428571, recall: 0.187500, error: 0.571429
332. 
patient tongue id: 01061852563886_1
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.378649 0.579529 0.431929 0.659626 0.412833 0.491329 0.321676 0.335277 0.333107 0.61054 0.608372 0.584311 0.617234 0.354058 0.676262 0.357715 0.38674 0.342498 0.493961
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
333. 
patient tongue id: 02141935440123_5
label yaofang:
麻黄 甘草 防风 金银花 连翘 薄荷 芦根 桑叶 菊花 荆芥穗 干鱼腥草 炒苍耳子 炒牛蒡子 燀苦杏仁
0.46902 0.825945 0.351963 0.957683 0.56344 0.755461 0.442745 0.342578 0.479605 0.930692 0.94516 0.906846 0.939531 0.978185 0.490146 0.46984 0.549916 0.808621
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.055556, recall: 0.071429, error: 0.944444
334. 
patient tongue id: 03141931116081_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.442717 0.679521 0.417712 0.818512 0.4992 0.626975 0.335235 0.413392 0.35482 0.324258 0.440406 0.777784 0.798963 0.748053 0.79171 0.364644 0.875925 0.44729 0.447314 0.504411 0.665682
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
335. 
patient tongue id: 02191444523221_4_6
label yaofang:
麻黄 甘草 法半夏 当归 茯苓 前胡 橘红 桃仁 远志 厚朴 射干 地龙 苦杏仁 紫苏子
0.992025 0.491205 0.645666 0.375345 0.323202 0.67375 0.6099 0.584576 0.482771 0.518171 0.507814
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
336. 
patient tongue id: 02120942350280_1_5
label yaofang:
甘草 防风 金银花 薏苡仁 党参 黄芪 白术 生地黄 山药 荆芥穗 苦参 白鲜皮 浮小麦 地肤子
0.986643 0.478394 0.654222 0.380785 0.330329 0.33887 0.673733 0.555651 0.531411 0.433564 0.475504 0.497032
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
337. 
patient tongue id: 02181953024383_4_1_6
label yaofang:
甘草 白芍 陈皮 法半夏 茯苓 前胡 桔梗 桃仁 党参 白术 莱菔子 款冬花 紫菀 白芥子 紫苏子
0.744053 0.336971 0.418224 0.445171 0.316704
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.333333, error: 0.000000
338. 
patient tongue id: 04250813486406_1_3_7
label yaofang:
甘草 陈皮 茯苓 桔梗 金银花 党参 白术 大腹皮 厚朴 藿香 白芷 六神曲 紫苏叶
0.53212 0.404869 0.459416 0.417991 0.413036 0.342981 0.375972 0.339027 0.301623 0.326882 0.368783 0.306814
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 夏枯草

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
339. 
patient tongue id: 04102047531677_1_2
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 牛膝 茵陈 麦芽 赭石 浮小麦 龟甲
0.398377 0.554235 0.384962 0.352127 0.324605 0.384404 0.594392 0.72846
predicted yaofang:
柴胡 白芍 香附 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
340. 
patient tongue id: 02191235503344_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.46443 0.787761 0.354577 0.93858 0.54428 0.739813 0.393136 0.302658 0.463082 0.904415 0.926654 0.879886 0.920126 0.964716 0.491115 0.455304 0.520773 0.754349
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.833333, recall: 0.937500, error: 0.166667
341. 
patient tongue id: 06191209312987_4
label yaofang:
甘草 川芎 法半夏 茯苓 酸枣仁 延胡索 竹茹 川楝子 杜仲 牛膝 天麻 桑寄生 茵陈 豆蔻
0.969735 0.466997 0.562442 0.370507 0.492274 0.458536 0.437864 0.345894 0.349597 0.307977
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
342. 
patient tongue id: 03061509474924_6_7_1
label yaofang:
桂枝 甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 党参 枸杞子 白术 生地黄 红花 赤芍 熟地黄 杜仲 牛膝 附子 砂仁 菟丝子 巴戟天 桑寄生 鹿角霜 续断 制何首乌 徐长卿 艾叶
0.691474 0.3836 0.349342 0.446518 0.359645
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.111111, error: 0.400000
343. 
patient tongue id: 04250802507505_1_2_4
label yaofang:
甘草 法半夏 前胡 桔梗 橘红 金银花 薏苡仁 藿香 白前 枇杷叶 苦杏仁 干鱼腥草
0.443127 0.302107 0.407383 0.423837
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
344. 
patient tongue id: 05222106103753_1_2_5
label yaofang:
甘草 茯苓 龙骨 牡蛎 党参 黄芪 白术 五味子 砂仁 糯稻根 北沙参
0.68955 0.319292 0.383955 0.39322 0.478505
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 1.000000, recall: 0.454545, error: 0.000000
345. 
patient tongue id: 05102204108050_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.469802 0.825012 0.369473 0.952196 0.577972 0.718647 0.441918 0.347149 0.452399 0.926331 0.940306 0.901429 0.932029 0.334658 0.974964 0.451691 0.438599 0.559814 0.817001
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
346. 
patient tongue id: 04112032569927_1_2
label yaofang:
甘草 白芍 茯苓 桔梗 薏苡仁 党参 白术 浙贝母 山药 砂仁 鳖甲 白扁豆 佛手 白花蛇舌
0.986863 0.304021 0.468375 0.643258 0.372354 0.307419 0.323807 0.675809 0.587092 0.562107 0.471588 0.501755 0.509002
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
347. 
patient tongue id: 01070834571715_1_4_6
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.653264 0.411371 0.329564 0.442799 0.37297
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
348. 
patient tongue id: 04291517035192_3_5
label yaofang:
桂枝 甘草 党参 丹参 赤芍 黄柏 郁金 山茱萸 淫羊藿 补骨脂 仙茅 鹿角霜 佛手 醋香附
0.994336 0.476397 0.687242 0.391091 0.344864 0.347189 0.743169 0.627914 0.645572 0.506903 0.565227 0.630096
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
349. 
patient tongue id: 03012312250329_4_1
label yaofang:
桂枝 甘草 白芍 法半夏 茯苓 桃仁 鸡血藤 白术 酸枣仁 红花 赤芍 吴茱萸 麦芽 地龙
0.917039 0.395248 0.394074 0.538635 0.360361 0.447019 0.357965
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
350. 
patient tongue id: 03171401451683_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.391345 0.587986 0.412641 0.696982 0.417145 0.539156 0.30661 0.331446 0.348386 0.646795 0.647188 0.62979 0.66517 0.357769 0.750587 0.372222 0.385247 0.385452 0.507971
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
351. 
patient tongue id: 02212003017639_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗
0.343493 0.474229 0.35453 0.448035 0.62585
predicted yaofang:
柴胡 白芍 海螵蛸 姜半夏 炙甘草

------Score: precision: 1.000000, recall: 0.555556, error: 0.000000
352. 
patient tongue id: 03090807222395_1_7
label yaofang:
甘草 当归 茯苓 党参 鸡血藤 酸枣仁 浙贝母 郁金 山药 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.938198 0.414339 0.585744 0.391956 0.300999 0.302364 0.546533 0.338462 0.421219 0.338825
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.900000, recall: 0.562500, error: 0.100000
353. 
patient tongue id: 03311842452266_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.465019 0.840437 0.339482 0.967393 0.581037 0.77063 0.442256 0.337955 0.490971 0.945458 0.958948 0.927611 0.956097 0.300948 0.984128 0.506291 0.45578 0.550149 0.832391
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
354. 
patient tongue id: 04271917216591_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 麦冬 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.36766 0.550137 0.429514 0.602224 0.430963 0.456755 0.341841 0.337275 0.313674 0.329216 0.578885 0.602203 0.52493 0.572139 0.384493 0.728618 0.342703 0.35682 0.313709 0.468368
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
355. 
patient tongue id: 03291618097049_6_4
label yaofang:
甘草 香附 枳壳 法半夏 茯苓 党参 丹参 郁金 薤白 水蛭 瓜蒌皮 莪术 紫苏梗
0.976105 0.303002 0.441652 0.618807 0.381886 0.557546 0.462865 0.475795 0.343782 0.373557 0.378642
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
356. 
patient tongue id: 03312021024146_1_6
label yaofang:
甘草 法半夏 茯苓 远志 党参 厚朴 天麻 鳖甲 紫苏梗 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.912781 0.435395 0.541853 0.413715 0.434746 0.330263 0.398115
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.857143, recall: 0.428571, error: 0.142857
357. 
patient tongue id: 01032052192556_1_5_6
label yaofang:
甘草 白芍 薏苡仁 党参 黄芪 白术 熟附子 山药 天麻 鳖甲 败酱草 蜈蚣 天山雪莲 半枝莲
0.894075 0.301131 0.334266 0.45449 0.464456 0.320521 0.351744
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
358. 
patient tongue id: 01312251127996_1_2_6
label yaofang:
甘草 白芍 川芎 大枣 茯苓 党参 枸杞子 酸枣仁 熟地黄 黄柏 地黄 泽泻 菟丝子 益母草
0.977414 0.303858 0.473032 0.608658 0.398962 0.329752 0.60122 0.517894 0.525072 0.40479 0.438651 0.451753
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
359. 
patient tongue id: 03062153101403_1_2_7
label yaofang:
半夏 黄芪 白术 海螵蛸 浙贝母 砂仁 鸡内金 紫苏梗 合欢皮 山慈菇 蛇舌草 稻芽
0.569093 0.357146 0.366154 0.431659 0.484627 0.307524 0.311883
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
360. 
patient tongue id: 02142335506976_5
label yaofang:
甘草 茯苓 木香 党参 白术 丹参 山药 车前子 菟丝子 猪苓 茵陈 金樱子 虎杖 黄精
0.934455 0.432756 0.558428 0.360024 0.533663 0.365331 0.388462 0.315954
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
361. 
patient tongue id: 02141956369706_1
label yaofang:
柴胡 黄芩 党参 白术 丹参 柏子仁 泽泻 天麻 白芷 姜半夏 炙甘草 续断
0.439054 0.362 0.35838 0.352775 0.330794
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
362. 
patient tongue id: 06072250294527_1_2
label yaofang:
甘草 白芍 陈皮 薏苡仁 党参 白术 山药 天麻 鳖甲 白扁豆 建曲 蜈蚣 天山雪莲 半枝莲
0.995518 0.463527 0.691822 0.372332 0.350781 0.302973 0.327953 0.760557 0.644768 0.669381 0.514592 0.596226 0.685586
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
363. 
patient tongue id: 04282314345354_1_5_7
label yaofang:
甘草 白芍 当归 连翘 薏苡仁 桃仁 党参 黄芪 熟地黄 牡丹皮 大黄 败酱草 皂角刺 女贞子 广升麻 墨旱莲
0.96179 0.45077 0.550991 0.334545 0.512429 0.410518 0.387863 0.308618 0.322733 0.304255
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.125000, error: 0.800000
364. 
patient tongue id: 05242350543862_2_6
label yaofang:
甘草 黄芩 薏苡仁 远志 生地黄 延胡索 细辛 茜草 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉 龙葵果 制天南星
0.97974 0.463818 0.64148 0.397429 0.352817 0.333083 0.365519 0.676842 0.574743 0.571447 0.472241 0.511114 0.554956
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.375000, error: 0.538462
365. 
patient tongue id: 05131617382938_4_6_2
label yaofang:
甘草 法半夏 大枣 茯苓 前胡 龙骨 桃仁 葶苈子 远志 薤白 水蛭 瓜蒌皮 款冬花 莪术 白前
0.984094 0.466221 0.635062 0.407817 0.314016 0.336816 0.658739 0.577682 0.606028 0.463569 0.512433 0.575908
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
366. 
patient tongue id: 05032301365799_5_6
label yaofang:
甘草 法半夏 茯苓 薏苡仁 远志 党参 酸枣仁 浙贝母 山药 淡豆豉 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.940114 0.420824 0.585706 0.433629 0.518696 0.389278 0.476562 0.333011 0.388862
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.888889, recall: 0.500000, error: 0.111111
367. 
patient tongue id: 03221622080727_6
label yaofang:
甘草 香附 茯苓 党参 白术 酸枣仁 生地黄 黄柏 郁金 山茱萸 菟丝子 益母草 王不留行 浮小麦 合欢花
0.985396 0.463342 0.625619 0.389836 0.315346 0.645248 0.566298 0.565104 0.449922 0.486358 0.503192
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
368. 
patient tongue id: 05091912102957_4_1
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.314698 0.364189 0.425675 0.413981 0.42758 0.356772 0.380442 0.416627 0.454351 0.370762 0.40136 0.341368 0.621027
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
369. 
patient tongue id: 06182229164094_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 砂仁 白扁豆 紫苏梗 广藿香 稻芽 火炭母 手参
0.761245 0.396368 0.448451 0.408449
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.307692, error: 0.000000
370. 
patient tongue id: 05262059584070_4_6
label yaofang:
甘草 白芍 法半夏 茯苓 牡蛎 白术 昆布 浙贝母 栀子 郁金 天花粉 瓜蒌皮 紫苏梗 猫爪草
0.976731 0.30684 0.452838 0.618583 0.403366 0.323586 0.626946 0.537555 0.544105 0.433204 0.477211 0.511007
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
371. 
patient tongue id: 03142007111945_1_2
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.345737 0.33532 0.466364 0.313764 0.345397 0.311625 0.304764 0.32561 0.508079
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 浙贝母 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.266667, error: 0.555556
372. 
patient tongue id: 06012058410151_1_7_5
label yaofang:
甘草 半夏 黄芪 黄连 杜仲 僵蚕 补骨脂 北沙参 赭石 辛夷 紫苏叶 蜈蚣 木蝴蝶
0.822055 0.418268 0.498329 0.422213
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
373. 
patient tongue id: 03291952445184_7
label yaofang:
甘草 半夏 桃仁 蒲公英 黄芪 白术 浙贝母 厚朴 莪术 柿蒂 赭石 紫苏叶 蛇舌草
0.665616 0.315378 0.488772 0.342321
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
374. 
patient tongue id: 05092231174107_6_1_5
label yaofang:
甘草 柴胡 陈皮 茯苓 薏苡仁 党参 赤芍 山药 砂仁 鳖甲 莪术 麦芽 白扁豆 白花蛇舌 红豆杉
0.945633 0.338248 0.419458 0.568659 0.378275 0.539007 0.40433 0.433763 0.305399 0.335966 0.339608
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
375. 
patient tongue id: 03111159067124_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.38225 0.408503 0.395415 0.422407 0.435787 0.339351 0.410502 0.368522 0.391723 0.378651 0.39434 0.340819 0.37158 0.366242
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.785714, recall: 0.916667, error: 0.214286
376. 
patient tongue id: 05232038297382_1
label yaofang:
甘草 白芍 桃仁 党参 枸杞子 白术 熟地黄 杜仲 砂仁 菟丝子 巴戟天 桑寄生 鳖甲 鹿角霜 续断
0.40768 0.349894 0.489221 0.348984 0.301075 0.331867 0.317469 0.51452
predicted yaofang:
甘草 柴胡 白芍 党参 白术 浙贝母 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
377. 
patient tongue id: 03131245506352_1_2
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.405691 0.578588 0.394653 0.671793 0.421732 0.541317 0.314686 0.388369 0.355354 0.402693 0.623055 0.702025 0.609376 0.645997 0.315805 0.831777 0.361023 0.302575 0.413073 0.393157 0.516263
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.523810, recall: 0.733333, error: 0.476190
378. 
patient tongue id: 01122319400083_4_6
label yaofang:
甘草 川芎 法半夏 茯苓 党参 白术 赤芍 牛膝 石菖蒲 泽泻 仙鹤草 天麻 磁石 地龙
0.978608 0.332808 0.464432 0.611315 0.36794 0.312884 0.611268 0.49244 0.46536 0.389202 0.417735 0.418464
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
379. 
patient tongue id: 02182237155530_6_2
label yaofang:
甘草 柴胡 黄芩 法半夏 茯苓 桔梗 橘红 浙贝母 栀子 牡丹皮 款冬花 扁豆花 紫菀 贯众
0.935067 0.352361 0.418882 0.544193 0.347776 0.451741 0.332526 0.35778
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
380. 
patient tongue id: 03311650265971_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.365306 0.354412 0.466531 0.345547 0.305927 0.375315 0.529711
predicted yaofang:
甘草 柴胡 白芍 党参 干姜 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.400000, error: 0.428571
381. 
patient tongue id: 04201443287889_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.440978 0.397747 0.420421
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
382. 
patient tongue id: 04141247053435_1_4_3
label yaofang:
法半夏 防风 钩藤 白芷 石决明 豆蔻 炙甘草 首乌藤 广藿香 威灵仙 麸炒白术 甘松 炒蔓荆子 棉萆薢
0.398823 0.507631 0.414902 0.563747 0.415017 0.470859 0.345329 0.347701 0.328159 0.356182 0.534553 0.596777 0.51545 0.559983 0.374085 0.744419 0.336486 0.306791 0.373102 0.345484 0.456963
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.238095, recall: 0.357143, error: 0.761905
383. 
patient tongue id: 04012014026840_6_3
label yaofang:
柴胡 白芍 香附 黄芪 枸杞子 五味子 郁金 厚朴 佩兰 菟丝子 糯稻根 桑寄生 女贞子 浮小麦 麻黄根 墨旱莲
0.38825 0.352999 0.31053 0.371715
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.062500, error: 0.750000
384. 
patient tongue id: 02141834106990_2
label yaofang:
陈皮 法半夏 前胡 防风 麦冬 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.472927 0.82502 0.36054 0.954567 0.561978 0.73888 0.435538 0.344365 0.442853 0.924324 0.93997 0.897219 0.936169 0.308641 0.976608 0.473144 0.456824 0.563962 0.808087
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 0.937500, error: 0.210526
385. 
patient tongue id: 03012134200393_1_2
label yaofang:
甘草 柴胡 白芍 远志 党参 白术 酸枣仁 山药 车前子 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.83499 0.3997 0.384658 0.472809 0.349271 0.327536 0.319551
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
386. 
patient tongue id: 03272242098637_1_3_7
label yaofang:
桃仁 何首乌 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 夏枯草
0.380385 0.388483
predicted yaofang:
甘草 党参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
387. 
patient tongue id: 06082053373204_5
label yaofang:
半夏 枸杞子 赤芍 牡丹皮 杜仲 白茅根 荷叶 砂仁 麦芽 赭石 合欢皮 稻芽
0.441252 0.317902 0.323882 0.545036 0.561896 0.355397 0.400477 0.376655 0.315738 0.313338
predicted yaofang:
甘草 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 合欢皮

------Score: precision: 0.300000, recall: 0.250000, error: 0.700000
388. 
patient tongue id: 03141250569552_1_3
label yaofang:
人参 当归 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.524725 0.322366 0.41437 0.428338
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
389. 
patient tongue id: 03062151385994_1_4
label yaofang:
当归 半夏 太子参 黄芪 鸡血藤 白术 海螵蛸 厚朴 砂仁 石斛 火麻仁 莪术 柿蒂 鸡内金 北沙参 紫苏梗 红豆杉 蛇舌草 稻芽
0.641784 0.367939 0.454936 0.447934 0.426683 0.30439
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.157895, error: 0.500000
390. 
patient tongue id: 01041832131333_1_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 薄荷 荆芥穗 款冬花 紫菀 百部 蝉蜕 炙甘草 辛夷 紫苏梗 苍耳子
0.450086 0.771511 0.381583 0.923788 0.538071 0.710749 0.414044 0.332363 0.443151 0.888497 0.906919 0.858597 0.901719 0.316189 0.957799 0.467009 0.452207 0.531133 0.763826
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.421053, recall: 0.533333, error: 0.578947
391. 
patient tongue id: 03232313160518_2_5_6
label yaofang:
甘草 茯苓 党参 枸杞子 酸枣仁 丹参 黄连 生地黄 栀子 山茱萸 砂仁 女贞子 粉葛
0.944654 0.305892 0.450619 0.577451 0.378179 0.310635 0.523278 0.415028 0.413959 0.316728 0.34087 0.329764
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
392. 
patient tongue id: 05092142378900_2
label yaofang:
法半夏 茯苓 前胡 太子参 柏子仁 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 制远志 炒紫苏子 蜜麻黄
0.480022 0.829307 0.381011 0.955381 0.570984 0.72026 0.30812 0.446912 0.353098 0.454399 0.934593 0.947665 0.905365 0.940145 0.34777 0.975389 0.454677 0.45311 0.570845 0.829671
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.875000, error: 0.300000
393. 
patient tongue id: 05102146051069_2_1
label yaofang:
白芍 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 山萸肉 炙甘草 沙苑子 制远志 盐菟丝子 酒女贞子 煅龙骨 炒酸枣仁
0.404837 0.570734 0.425028 0.658947 0.437575 0.501984 0.32147 0.34364 0.303014 0.346036 0.62449 0.629604 0.594662 0.620705 0.371659 0.759832 0.358112 0.373118 0.378067 0.502201
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.187500, error: 0.850000
394. 
patient tongue id: 03061458189619_2_1
label yaofang:
甘草 防风 鸡血藤 熟地黄 牡丹皮 乌梅 木瓜 莪术 珍珠母 蝉蜕 地肤子 土茯苓 徐长卿
0.379762 0.52561 0.352949 0.379915 0.349791 0.389513 0.494633 0.734537 0.315277
predicted yaofang:
柴胡 白芍 香附 海螵蛸 浙贝母 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
395. 
patient tongue id: 02111353379767_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌
0.549302 0.351561 0.425506 0.412849
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
396. 
patient tongue id: 03290700340959_2_6
label yaofang:
甘草 枳壳 法半夏 茯苓 连翘 党参 白术 黄连 槟榔 砂仁 莱菔子 天花粉 麦芽 紫苏梗 合欢花
0.939423 0.366519 0.423346 0.560298 0.359706 0.494573 0.365354 0.393437
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
397. 
patient tongue id: 04062008003574_7_4
label yaofang:
黄芩 茯苓 羌活 栀子 杜仲 牛膝 钩藤 天麻 石决明 桑寄生 益母草 首乌藤 鹿衔草
0.405347 0.544154 0.369061 0.315823 0.310206 0.385311 0.343249 0.329594 0.536267 0.650255
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
398. 
patient tongue id: 04171835521873_3_1
label yaofang:
白芍 川芎 当归 茯苓 党参 白术 玄参 熟地黄 杜仲 山药 地骨皮 菟丝子 桑寄生 山萸肉 炙甘草
0.654769 0.312892 0.435007 0.40844 0.341648
predicted yaofang:
甘草 柴胡 白芍 党参 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
399. 
patient tongue id: 03101740290818_2_4
label yaofang:
法半夏 茯苓 前胡 太子参 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 广藿香 麸炒白术 炒六神曲
0.38355 0.471875 0.413507 0.523356 0.383643 0.412271 0.32214 0.301801 0.50274 0.519105 0.495721 0.515523 0.390688 0.637019 0.322126 0.309074 0.393397
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.647059, recall: 0.785714, error: 0.352941
400. 
patient tongue id: 03022141039631_4
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草
0.32166 0.388509 0.520535 0.343475 0.304885 0.331714 0.323267 0.326835 0.352029 0.485441 0.599154
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.363636, recall: 0.333333, error: 0.636364
401. 
patient tongue id: 02222338291741_6_2_1
label yaofang:
黄芪 白术 砂仁 珍珠母 夏枯草 北沙参 橘核 赭石 首乌藤 紫苏梗 红豆杉 合欢皮 墨旱莲
0.322676 0.332254 0.389769
predicted yaofang:
甘草 茯苓 黄芪

------Score: precision: 0.333333, recall: 0.076923, error: 0.666667
402. 
patient tongue id: 06191148483905_5
label yaofang:
甘草 法半夏 茯苓 前胡 浙贝母 细辛 桑白皮 天麻 鳖甲 款冬花 麦芽 苦杏仁 紫苏子 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.983095 0.306111 0.459161 0.632026 0.372269 0.310383 0.638935 0.549398 0.521693 0.438562 0.469164 0.4684
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.444444, error: 0.333333
403. 
patient tongue id: 03271408358225_1_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄
0.451351 0.761264 0.394231 0.89661 0.527577 0.674554 0.416772 0.345453 0.422506 0.857986 0.878019 0.821301 0.866205 0.331389 0.941913 0.429254 0.436363 0.527703 0.730614
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
404. 
patient tongue id: 06031133028843_4_6
label yaofang:
甘草 枳壳 法半夏 茯苓 桔梗 党参 浙贝母 郁金 厚朴 鳖甲 火麻仁 款冬花 苦杏仁 白花蛇舌 天山雪莲
0.990675 0.484076 0.649367 0.376492 0.325827 0.681134 0.599371 0.583504 0.480073 0.515595 0.523865
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
405. 
patient tongue id: 01132115243283_2_7_1
label yaofang:
甘草 薏苡仁 丹参 浙贝母 薤白 瓜蒌皮 鳖甲 款冬花 莪术 紫菀 苦杏仁 降香 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.982598 0.467722 0.639287 0.341667 0.314154 0.632507 0.436738 0.429095 0.315371 0.338346 0.347402
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
406. 
patient tongue id: 03272002583273_4_1
label yaofang:
前胡 桔梗 防风 钩藤 荆芥穗 白芷 香薷 百部 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.382244 0.399909 0.388046 0.427986 0.314756 0.386815 0.309488 0.320201 0.372722 0.425262 0.421215 0.465738 0.449824 0.645194 0.300673
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.333333, recall: 0.357143, error: 0.666667
407. 
patient tongue id: 04181159203581_1_2_7
label yaofang:
甘草 茯苓 木香 牡蛎 麦冬 党参 黄芪 酸枣仁 丹参 草豆蔻 浮小麦 首乌藤 制远志
0.525629 0.407867 0.472737 0.374313 0.428395 0.376112 0.393935 0.307638 0.364504 0.331253 0.35876 0.436865 0.3073 0.314991
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草

------Score: precision: 0.285714, recall: 0.307692, error: 0.714286
408. 
patient tongue id: 06051108214309_1_7_4
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子
0.404255 0.521567 0.441291 0.418233 0.5538 0.490549 0.498637 0.492262 0.522447 0.481594 0.568489 0.425273 0.516482 0.542717 0.549675
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.133333, recall: 0.181818, error: 0.866667
409. 
patient tongue id: 02171959301394_2
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.314989 0.462719 0.391254 0.457718 0.313525 0.442956 0.411775 0.434151 0.474434 0.461847 0.319626 0.653396
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
410. 
patient tongue id: 02151816080847_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.660886 0.361471 0.429021 0.687788 0.620228 0.634728 0.725495 0.682757 0.641201 0.771147 0.439765 0.714536 0.757674 0.770569
predicted yaofang:
桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.142857, recall: 0.153846, error: 0.857143
411. 
patient tongue id: 05042121273771_1_4
label yaofang:
甘草 当归 茯苓 牛蒡子 党参 白术 海螵蛸 干姜 补骨脂 浮小麦 瓦楞子
0.351886 0.451873 0.303257 0.361136 0.470801 0.584205
predicted yaofang:
柴胡 白芍 党参 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
412. 
patient tongue id: 05140652280503_4_1
label yaofang:
甘草 茯苓 独活 党参 鸡血藤 白术 红花 山药 天麻 鳖甲 扁豆花 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.973361 0.304534 0.460715 0.590627 0.360193 0.303992 0.573906 0.466803 0.453997 0.361068 0.382346 0.37997
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.733333, error: 0.083333
413. 
patient tongue id: 02231751486195_1_6
label yaofang:
白芍 川芎 法半夏 当归 茯苓 木香 丹参 川楝子 郁金 北柴胡 炙甘草 麸炒白术 醋香附 麸炒枳壳
0.441958 0.652306 0.419632 0.796242 0.486771 0.606773 0.331089 0.398442 0.343039 0.318025 0.421727 0.758064 0.774018 0.72793 0.768008 0.369134 0.861027 0.434841 0.429352 0.483047 0.644417
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.142857, recall: 0.214286, error: 0.857143
414. 
patient tongue id: 02231911171128_4
label yaofang:
陈皮 法半夏 葛根 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子
0.40915 0.663276 0.413501 0.796043 0.470552 0.58216 0.309927 0.366543 0.309314 0.362443 0.752256 0.765259 0.723131 0.760273 0.338615 0.85563 0.384267 0.388838 0.463435 0.632133
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
415. 
patient tongue id: 03111744118922_1_6_7
label yaofang:
甘草 桔梗 桃仁 远志 党参 浙贝母 山药 旋覆花 莪术 紫菀 白花蛇舌草 地龙 丝瓜络 醋鳖甲
0.963851 0.302703 0.452191 0.590134 0.385005 0.310288 0.555677 0.455675 0.46045 0.349704 0.374608 0.380248
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
416. 
patient tongue id: 05140849462443_5
label yaofang:
甘草 柴胡 黄芩 前胡 桔梗 金银花 连翘 牛蒡子 浙贝母 桑叶 款冬花 苦杏仁 炙麻黄 大青叶 青天葵
0.972338 0.307641 0.452656 0.589184 0.367691 0.568404 0.464686 0.449758 0.353261 0.373174 0.352419
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.066667, error: 0.909091
417. 
patient tongue id: 06171319062069_6_1_4
label yaofang:
甘草 炮山甲
0.882792 0.32985 0.339449 0.522053 0.350838 0.374501
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.500000, error: 0.833333
418. 
patient tongue id: 04071920526043_1_4
label yaofang:
甘草 陈皮 茯苓 薏苡仁 佩兰 赤小豆 芡实 豆蔻 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶
0.321106 0.320621 0.353555 0.384076 0.430401 0.445417 0.387753
predicted yaofang:
甘草 陈皮 茯苓 半夏 黄芪 北沙参 炙甘草

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
419. 
patient tongue id: 04071426139150_4_2
label yaofang:
法半夏 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.370107 0.369265 0.339099 0.302222 0.314997 0.303633 0.550198
predicted yaofang:
法半夏 茯苓 防风 黄芪 白前 北沙参 炙甘草

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
420. 
patient tongue id: 04062017143715_4_6
label yaofang:
白芍 当归 木香 党参 白术 海螵蛸 肉桂 肉豆蔻 诃子 炙甘草
0.445811 0.377645 0.409267 0.345522
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
421. 
patient tongue id: 01211233218159_4
label yaofang:
黄芩 前胡 桔梗 牛蒡子 桑白皮 天花粉 淡竹叶 旋覆花 枇杷叶 赭石 紫苏叶 化橘红
0.530029 0.34908 0.327374 0.395947 0.304461
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
422. 
patient tongue id: 01172349445113_1
label yaofang:
甘草 半夏 黄芪 白术 海螵蛸 浙贝母 杜仲 厚朴 石斛 鸡内金 紫苏梗 合欢皮 蛇舌草 云芝
0.859003 0.429582 0.50938 0.424918 0.375469 0.337335
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
423. 
patient tongue id: 04282300052667_7_1_6
label yaofang:
甘草 川芎 枸杞子 酸枣仁 生地黄 赤芍 杜仲 牛膝 天麻 全蝎 桑寄生 麦芽 蒺藜 女贞子 粉葛
0.991079 0.470402 0.662803 0.377073 0.318123 0.319367 0.699185 0.576351 0.567442 0.458659 0.500152 0.525603
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
424. 
patient tongue id: 05140847204491_5_6
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 青皮 浙贝母 郁金 天花粉 瓜蒌皮 款冬花 苦杏仁 紫苏梗
0.975569 0.351794 0.433347 0.606712 0.364219 0.595179 0.474847 0.477517 0.360536 0.402925 0.402789
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
425. 
patient tongue id: 03012032234830_6_5
label yaofang:
甘草 茯苓 木香 党参 白术 黄连 砂仁 天麻 鳖甲 柿蒂 粉葛 建曲 蜈蚣 白花蛇舌 天山雪莲 瓦楞子
0.609537 0.318749 0.421546 0.366274
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.250000, error: 0.000000
426. 
patient tongue id: 05131640337311_5_6
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 白术 厚朴 莱菔子 天麻 扁豆花 豆蔻 苦杏仁 紫苏子
0.967629 0.320232 0.4491 0.59375 0.331435 0.616671 0.428915 0.4556 0.321464 0.360226 0.408705
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
427. 
patient tongue id: 03222002224981_1_4
label yaofang:
甘草 白芍 川芎 独活 杜仲 牛膝 细辛 车前子 干姜 广藿香 蜈蚣 姜黄 海桐皮 鹿衔草
0.578855 0.355902 0.490483 0.379821 0.32011 0.333674 0.321647
predicted yaofang:
甘草 柴胡 白芍 党参 白术 浙贝母 炙甘草

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
428. 
patient tongue id: 05180837279222_2_7_6
label yaofang:
甘草 党参 酸枣仁 丹参 浙贝母 郁金 山药 天麻 鳖甲 白花蛇舌草 蜈蚣 天山雪莲 合欢花 半枝莲
0.9947 0.468085 0.679062 0.385005 0.35959 0.328673 0.765667 0.636922 0.664059 0.513225 0.589436 0.675565
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
429. 
patient tongue id: 05140841095315_1_2_6
label yaofang:
甘草 茯苓 独活 党参 酸枣仁 生地黄 红花 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.981752 0.466103 0.623878 0.375603 0.317311 0.639381 0.537123 0.525865 0.426846 0.456533 0.466852
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
430. 
patient tongue id: 04291507408301_2_6
label yaofang:
甘草 远志 山茱萸 厚朴 荷叶 天麻 磁石 肉苁蓉 火麻仁 补骨脂 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲
0.989322 0.457509 0.65949 0.389492 0.34238 0.339294 0.702842 0.581056 0.601158 0.466219 0.526632 0.601285
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
431. 
patient tongue id: 04132048179517_1_4
label yaofang:
甘草 枳壳 茯苓 木香 独活 党参 白术 砂仁 天麻 鳖甲 补骨脂 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲
0.751264 0.374976 0.360864 0.484047 0.320094 0.333593
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.833333, recall: 0.312500, error: 0.166667
432. 
patient tongue id: 04131804334165_2_7
label yaofang:
甘草 党参 黄芪 酸枣仁 生地黄 牡丹皮 山茱萸 天麻 金樱子 桑螵蛸 地龙 浮小麦 首乌藤
0.978797 0.302711 0.472048 0.610652 0.391806 0.309457 0.593698 0.519785 0.51804 0.412671 0.436169 0.429815
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
433. 
patient tongue id: 06082052056015_1_6
label yaofang:
桂枝 枳壳 桃仁 太子参 白术 丹参 郁金 厚朴 僵蚕 莪术 柿蒂 北沙参 赭石 蜈蚣 合欢皮 预知子
0.430789 0.59503 0.423048 0.713065 0.444986 0.536442 0.353298 0.360242 0.314535 0.362426 0.676608 0.692964 0.670588 0.712885 0.418959 0.774905 0.384841 0.397113 0.460697 0.588576
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.125000, error: 0.900000
434. 
patient tongue id: 01090020278958_1
label yaofang:
桂枝 白芍 大枣 茯苓 白术 附子 大黄 天麻 天山雪莲
0.488208 0.404395 0.31455
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
435. 
patient tongue id: 03041405102724_1_6_8
label yaofang:
甘草 白芍 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 白术 款冬花 白前 枇杷叶 紫苏梗 广藿香 浙贝母粉
0.985005 0.326253 0.452328 0.637428 0.376202 0.633526 0.541636 0.525622 0.431655 0.466877 0.467566
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
436. 
patient tongue id: 01211258129104_7_1
label yaofang:
白芍 川芎 香附 当归 白术 丹参 熟地黄 益母草 茺蔚子 艾叶
0.341862 0.33521 0.456168 0.342973 0.307127 0.369383 0.541054
predicted yaofang:
甘草 柴胡 白芍 党参 干姜 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.100000, error: 0.857143
437. 
patient tongue id: 02191442503443_1_7
label yaofang:
甘草 茯苓 桃仁 熟地黄 牡丹皮 杜仲 郁金 山药 山茱萸 泽泻 桑寄生 三棱 莪术 王不留行
0.986991 0.477086 0.614623 0.370449 0.324922 0.631882 0.559975 0.542996 0.437823 0.470483 0.48074
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
438. 
patient tongue id: 02142145154899_1_2
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.990666 0.464175 0.670429 0.378564 0.373916 0.31987 0.359861 0.744955 0.615177 0.632817 0.496317 0.564312 0.646483
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.923077, recall: 0.857143, error: 0.076923
439. 
patient tongue id: 04111956262245_2_4
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 车前子 麦芽 茺蔚子 赭石 泽兰 龟甲
0.989112 0.475638 0.64879 0.38713 0.30384 0.334353 0.687156 0.599692 0.590819 0.482396 0.520301 0.538522
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.076923, error: 0.916667
440. 
patient tongue id: 05182038500290_4
label yaofang:
枳壳 桔梗 牛蒡子 党参 白术 旋覆花 紫菀 百部 北沙参 紫苏子 炙甘草 紫苏梗 化橘红
0.387984 0.522607 0.335602 0.348603 0.363832 0.493269 0.660056
predicted yaofang:
柴胡 白芍 香附 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
441. 
patient tongue id: 03291647313649_1_2_6
label yaofang:
甘草 党参 酸枣仁 生地黄 山药 山茱萸 天麻 桑寄生 鳖甲 补骨脂 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.882456 0.411587 0.531571 0.352428 0.423873
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
442. 
patient tongue id: 03012051032875_6_7
label yaofang:
甘草 柴胡 白芍 香附 党参 酸枣仁 生地黄 桑寄生 女贞子 续断 合欢花 鱼古
0.949029 0.387644 0.387212 0.53688 0.356344 0.300741 0.389791 0.355006
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 蜈蚣

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
443. 
patient tongue id: 03181802505956_1_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 郁金 山药 天麻 鳖甲 莪术 续断 蜈蚣 天山雪莲 半枝莲 骨碎补
0.934427 0.302888 0.46141 0.540316 0.385937 0.303993 0.473941 0.418114 0.425879 0.325951 0.329878 0.308002
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
444. 
patient tongue id: 02191440325559_6_4
label yaofang:
甘草 川芎 茯苓 党参 白术 酸枣仁 栀子 杜仲 钩藤 天麻 桑寄生 补骨脂 麦芽 红景天
0.993069 0.488778 0.673072 0.410271 0.314819 0.339864 0.693872 0.613383 0.611341 0.486615 0.533725 0.552919
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
445. 
patient tongue id: 05222207555699_4
label yaofang:
防风 钩藤 荆芥穗 白芷 香薷 炙甘草 辛夷 首乌藤 紫苏梗 广藿香 威灵仙 炒苍耳子 炒蔓荆子 棉萆薢
0.305657 0.442807 0.404977 0.327855 0.340169 0.321813 0.31111 0.419932 0.306204 0.629911
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 炙甘草

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
446. 
patient tongue id: 04132049296799_7_5
label yaofang:
桂枝 甘草 川芎 当归 金银花 蒲公英 紫花地丁 黄芪 生地黄 红花 赤芍 吴茱萸 白鲜皮 地肤子
0.862949 0.379355 0.39151 0.534571 0.337031 0.422366
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
447. 
patient tongue id: 05140851543837_6_2_7
label yaofang:
甘草 茯苓 龙骨 麦冬 太子参 酸枣仁 丹参 五味子 红花 山茱萸 补骨脂 女贞子 鹿角霜 浮小麦 墨旱莲
0.993524 0.474209 0.654615 0.368458 0.689316 0.603893 0.578774 0.480933 0.514719 0.512638
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.133333, error: 0.800000
448. 
patient tongue id: 03211940081317_3_6
label yaofang:
桂枝 甘草 海螵蛸 肉桂 干姜 砂仁 吴茱萸 附片 徐长卿
0.373179 0.524283 0.333773 0.345773 0.396395 0.594638 0.762574
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.222222, error: 0.714286
449. 
patient tongue id: 04181146080517_1_4_7
label yaofang:
甘草 枳壳 法半夏 当归 茯苓 木香 党参 黄芪 丹参 厚朴 鸡内金 草豆蔻 麦芽
0.454932 0.31102 0.411592 0.383502 0.344843 0.31468
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
450. 
patient tongue id: 03020723417286_1_2
label yaofang:
甘草 茯苓 太子参 酸枣仁 山药 天麻 鳖甲 北沙参 白扁豆 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.993381 0.461849 0.683723 0.416051 0.342921 0.355514 0.73782 0.608415 0.650063 0.483281 0.555022 0.635011
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
451. 
patient tongue id: 02212022235456_2_7
label yaofang:
甘草 白芍 生地黄 红花 延胡索 赤芍 杜仲 牛膝 山茱萸 蒺藜 续断 浮小麦 骨碎补 宽筋藤 牛大力
0.98966 0.305399 0.473826 0.651317 0.369384 0.307954 0.313332 0.687441 0.579505 0.56676 0.460562 0.501239 0.519281
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.133333, error: 0.846154
452. 
patient tongue id: 04062022569165_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.308395 0.357005 0.446659 0.419626 0.441252 0.363748 0.434085 0.300533 0.311965 0.419704 0.47728 0.412997 0.42224 0.324616 0.643422 0.321344 0.332359
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.705882, recall: 0.857143, error: 0.294118
453. 
patient tongue id: 05032242183271_6_1_2
label yaofang:
甘草 陈皮 茯苓 党参 白术 酸枣仁 山药 天麻 菟丝子 益母草 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.995197 0.455839 0.694509 0.337735 0.333541 0.309846 0.769657 0.638324 0.617106 0.512748 0.573039 0.62699
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
454. 
patient tongue id: 03020849497259_6_4
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 法半夏 茯苓 龙骨 党参 白术 酸枣仁 干姜 扁豆花 浮小麦
0.931598 0.388207 0.530464 0.538658 0.300977 0.330958 0.439255
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
455. 
patient tongue id: 01250640459767_4_6
label yaofang:
甘草 前胡 橘红 薏苡仁 桃仁 远志 浙贝母 细辛 桑白皮 紫菀 苇茎 北沙参 苦杏仁 瓜蒌子 炙麻黄
0.981662 0.452941 0.643741 0.382958 0.318627 0.333901 0.649245 0.455697 0.491208 0.336966 0.37914 0.414995
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.066667, error: 0.916667
456. 
patient tongue id: 06140824471832_1_3_5
label yaofang:
甘草 桔梗 防风 金银花 太子参 藿香 白前 白鲜皮 六神曲 蜜百部 干鱼腥草 地肤子
0.359653 0.423207 0.408439 0.343965 0.464277 0.357631 0.417512 0.398545 0.436818 0.359963 0.304937 0.318497 0.33643 0.362153
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.071429, recall: 0.083333, error: 0.928571
457. 
patient tongue id: 01111850402783_1
label yaofang:
甘草 陈皮 茯苓 佩兰 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶 炒稻芽 炒鸡内金 木棉花 炒麦芽
0.475461 0.864027 0.338229 0.974536 0.594713 0.790375 0.44324 0.325348 0.490193 0.955112 0.967838 0.935544 0.962671 0.986507 0.505717 0.485377 0.571793 0.845512
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.166667, recall: 0.214286, error: 0.833333
458. 
patient tongue id: 02212036343235_1_2
label yaofang:
甘草 茯苓 党参 黄芪 鸡血藤 丹参 生地黄 延胡索 杜仲 山药 桑寄生 补骨脂 地龙 续断 牛大力
0.643923 0.375637 0.395279 0.416783 0.548201 0.316401 0.319207
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
459. 
patient tongue id: 05181043267137_6_2_7
label yaofang:
桂枝 甘草 党参 黄芪 白术 红花 赤芍 地黄 天麻 白花蛇舌草 忍冬藤 蜈蚣 半枝莲 醋鳖甲
0.991946 0.306728 0.458342 0.648542 0.366465 0.351504 0.312685 0.337846 0.726112 0.606988 0.609349 0.49023 0.554057 0.621718
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.428571, recall: 0.428571, error: 0.571429
460. 
patient tongue id: 01110351380577_1
label yaofang:
茯苓 麦冬 阿胶 酸枣仁 五味子 泽泻 滑石 猪苓
0.307683 0.362906 0.570234
predicted yaofang:
甘草 白芍 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
461. 
patient tongue id: 03022140224422_6
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 鳖甲 姜半夏 紫苏叶 广藿香
0.598012 0.31092 0.383224 0.385955
predicted yaofang:
甘草 白芍 茯苓 党参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
462. 
patient tongue id: 04131822166239_6_2_1
label yaofang:
甘草 桔梗 薏苡仁 白及 太子参 仙鹤草 茜草 天麻 鳖甲 补骨脂 蜈蚣 白花蛇舌 天山雪莲 红豆杉 龙葵果
0.966826 0.44966 0.609195 0.428164 0.329404 0.573731 0.459206 0.510097 0.351418 0.384095 0.411728
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
463. 
patient tongue id: 05272345494049_4_1_6
label yaofang:
黄芪 白术 砂仁 桑寄生 莲子 白鲜皮 续断 橘络 首乌藤 土鳖虫 红豆杉 合欢皮 山慈菇
0.463965 0.313196 0.376121 0.40833
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
464. 
patient tongue id: 03292132476263_4
label yaofang:
麻黄 陈皮 荆芥 防风 石菖蒲 僵蚕 紫菀 白前 百部 炙甘草 辛夷 苍耳子 芥子 青果 咸竹蜂
0.494567 0.377058 0.434802 0.395231 0.400686 0.316541 0.36846 0.321055 0.303202 0.322639
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
465. 
patient tongue id: 06111111314336_7_5
label yaofang:
甘草 当归 金银花 紫花地丁 党参 黄芪 鸡血藤 白术 生地黄 红花 赤芍 细辛 白芷 吴茱萸 麦芽 忍冬藤 白花蛇舌
0.888467 0.404771 0.478037 0.34409
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.500000, recall: 0.117647, error: 0.500000
466. 
patient tongue id: 01121854577887_2
label yaofang:
陈皮 法半夏 前胡 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子
0.414522 0.642153 0.405742 0.776384 0.453024 0.611753 0.356694 0.304551 0.391581 0.733147 0.752523 0.713886 0.757303 0.337867 0.85063 0.414826 0.41199 0.468605 0.613665
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
467. 
patient tongue id: 03062146371053_3_1_4
label yaofang:
桂枝 甘草 枳壳 当归 茯苓 黄芪 白术 干姜 厚朴 僵蚕 磁石 肉苁蓉 鸡内金 辛夷
0.621161 0.39899 0.423388 0.37396 0.372171
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
468. 
patient tongue id: 01052205228854_6_1_7
label yaofang:
甘草 茯苓 半夏 橘红 黄芪 白术 厚朴 砂仁 桑寄生 女贞子 桑枝 土鳖虫 墨旱莲 素馨花
0.776607 0.305687 0.409815 0.417807 0.318564
predicted yaofang:
甘草 法半夏 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
469. 
patient tongue id: 04261349477632_5_1_7
label yaofang:
当归 牡蛎 党参 黄芪 白术 丹参 延胡索 赤芍 山药 仙鹤草 砂仁 补骨脂 红豆杉 三七粉
0.355881 0.300182 0.319465 0.360692
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
470. 
patient tongue id: 01180623249871_2_6_4
label yaofang:
甘草 法半夏 当归 茯苓 桃仁 远志 天麻 鳖甲 款冬花 川贝母 苦杏仁 紫苏子 炙麻黄 蜈蚣 白花蛇舌 半枝莲
0.892842 0.432442 0.496433 0.421944 0.31461 0.333529
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
471. 
patient tongue id: 06132017147509_2_5
label yaofang:
甘草 半夏 蒲公英 赤芍 牡丹皮 郁金 僵蚕 没药 莪术 柿蒂 北沙参 蜈蚣 冬凌草
0.56693 0.333259 0.30791 0.37993 0.506026 0.568154 0.301124 0.333123 0.401158 0.401124 0.324248 0.330651 0.30652
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
472. 
patient tongue id: 01312129035283_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 白术 厚朴 豆蔻 麦芽 丝瓜络 紫苏梗 广藿香 麸炒枳壳
0.96595 0.307652 0.475074 0.572614 0.385821 0.315223 0.515664 0.456975 0.442172 0.353919 0.358263 0.323941
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
473. 
patient tongue id: 03012206012293_2_6
label yaofang:
甘草 白芍 党参 酸枣仁 生地黄 乌药 山药 山茱萸 泽泻 鳖甲 芡实 桑螵蛸 益智 五倍子 路路通
0.992629 0.301235 0.475697 0.672166 0.38727 0.319983 0.307734 0.340674 0.722835 0.622438 0.611668 0.504209 0.549763 0.565305
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.466667, error: 0.500000
474. 
patient tongue id: 06111033158055_4_1
label yaofang:
甘草 独活 党参 黄芪 丹参 生地黄 杜仲 牛膝 山茱萸 水蛭 桑寄生 补骨脂 鹿角霜 续断 川加皮 牛大力
0.984486 0.4754 0.625335 0.390615 0.320566 0.61424 0.537697 0.535766 0.421895 0.446199 0.44465
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
475. 
patient tongue id: 04271515340045_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.366159 0.382721 0.40353 0.446344 0.436002 0.322784 0.399613 0.372103 0.368437 0.334686 0.368338 0.315679 0.361042 0.344994
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.785714, recall: 0.916667, error: 0.214286
476. 
patient tongue id: 02281201118459_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 郁金 山药 天花粉 北沙参
0.567402 0.315781 0.435514 0.529811 0.388167 0.327209
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
477. 
patient tongue id: 02212027220836_2_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 苍术 山药 厚朴 扁豆花 三棱 豆蔻 麦芽 苦杏仁
0.983027 0.441832 0.626829 0.359113 0.626939 0.485189 0.483975 0.363945 0.402243 0.418132
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
478. 
patient tongue id: 04202207212477_2_4_5
label yaofang:
甘草 白芍 前胡 橘红 太子参 丹参 五味子 赤芍 浙贝母 山药 桑白皮 茵陈 紫菀 虎杖 黄精 白花蛇舌
0.84674 0.389199 0.50137 0.379659 0.366478
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
479. 
patient tongue id: 06181657246058_5
label yaofang:
甘草 薏苡仁 蒲公英 黄芪 白术 丹参 赤芍 牡丹皮 郁金 厚朴 僵蚕 莪术 虎杖 北沙参 蒺藜 郁李仁 紫苏叶 预知子 蛇舌草
0.3981 0.336671 0.382898 0.491232 0.408278 0.395895
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.210526, error: 0.333333
480. 
patient tongue id: 04210741513835_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.753313 0.387201 0.424328 0.313961 0.470857
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
481. 
patient tongue id: 04211339438450_2_4
label yaofang:
白芍 川芎 法半夏 当归 茯苓 木香 丹参 川楝子 郁金 北柴胡 豆蔻 炙甘草 广藿香 麸炒白术 醋香附 麸炒枳壳
0.430208 0.650784 0.415472 0.759753 0.466064 0.573476 0.354416 0.399752 0.359927 0.407161 0.724467 0.756516 0.701898 0.738754 0.386857 0.85616 0.411477 0.418117 0.480006 0.633789
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
482. 
patient tongue id: 05232121505972_1_4_7
label yaofang:
甘草 陈皮 薏苡仁 党参 白术 海螵蛸 浙贝母 牡丹皮 厚朴 紫草 夏枯草 白鲜皮 紫苏叶 土茯苓
0.41084 0.330942 0.316709 0.320765 0.511372 0.363239 0.331019 0.383454
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
483. 
patient tongue id: 02020824487538_2_7_6
label yaofang:
甘草 木香 党参 酸枣仁 熟地黄 砂仁 天麻 鳖甲 三棱 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.988388 0.4589 0.635604 0.447871 0.30013 0.33102 0.648543 0.582534 0.6332 0.454662 0.522551 0.585936
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
484. 
patient tongue id: 01172250080546_2_7
label yaofang:
甘草 桃仁 党参 丹参 生地黄 红花 赤芍 牡丹皮 车前子 益母草 决明子 麦芽 木贼 有瓜石斛
0.826779 0.326064 0.408363 0.472726 0.331483
predicted yaofang:
甘草 白芍 茯苓 党参 天麻

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
485. 
patient tongue id: 03282205087340_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 珍珠母 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.330751 0.367178 0.513304 0.308409 0.304636 0.432764 0.566536
predicted yaofang:
甘草 柴胡 白芍 党参 浙贝母 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
486. 
patient tongue id: 04271825429299_5
label yaofang:
麻黄 甘草 柴胡 黄芩 牛蒡子 厚朴 川贝母 枇杷叶 地龙 苦杏仁 蝉蜕 岗梅
0.451759 0.305371 0.329988 0.484161 0.507687 0.305562 0.360357 0.33098
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁

------Score: precision: 0.250000, recall: 0.166667, error: 0.750000
487. 
patient tongue id: 06132027237493_1_4_6
label yaofang:
陈皮 前胡 半夏 荆芥 浙贝母 僵蚕 百部 苦杏仁 紫苏子 蝉蜕 紫苏叶 人参叶 紫苑
0.431966 0.34431 0.312778 0.559468 0.494957 0.398603 0.332357 0.357623 0.370007
predicted yaofang:
甘草 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.111111, recall: 0.076923, error: 0.888889
488. 
patient tongue id: 04181954003347_6_4
label yaofang:
甘草 柴胡 白芍 香附 当归 茯苓 薄荷 枸杞子 白术 车前子 菟丝子 麦芽 续断 广藿香
0.626733 0.334326 0.456529 0.400161 0.358127 0.319832
predicted yaofang:
甘草 柴胡 白芍 党参 白术 浙贝母

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
489. 
patient tongue id: 05090825133960_1_2
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 泽泻 干姜
0.549258 0.314917 0.310342 0.451645
predicted yaofang:
甘草 白芍 茯苓 党参

------Score: precision: 1.000000, recall: 0.333333, error: 0.000000
490. 
patient tongue id: 04201421035590_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.465451 0.421965 0.4631 0.393327 0.450405 0.387045 0.403514 0.346305 0.400154 0.365948 0.407446 0.418462 0.358996 0.383259 0.360754
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
491. 
patient tongue id: 04141811589020_1_4_6
label yaofang:
半夏 党参 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 牛膝 山药 厚朴 砂仁 僵蚕 莪术 鸡内金 麦芽 紫苏梗 鲜龙葵果
0.507027 0.383449 0.337831 0.390729 0.339584
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.166667, error: 0.400000
492. 
patient tongue id: 04202057308588_6
label yaofang:
柴胡 大枣 茯苓 防风 连翘 牛蒡子 太子参 昆布 海藻 乌梅 石斛 白花蛇舌草 猫爪草 山慈菇 黄药子
0.300668 0.345068 0.302477
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
493. 
patient tongue id: 04241859190325_1_4
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.399344 0.36017 0.47389 0.330055 0.318166 0.335511 0.338644 0.504184
predicted yaofang:
甘草 柴胡 白芍 党参 白术 浙贝母 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
494. 
patient tongue id: 03211847446186_4_1
label yaofang:
法半夏 茯苓 前胡 防风 钩藤 白芷 款冬花 百部 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子
0.375734 0.575837 0.423693 0.639666 0.419708 0.512411 0.307011 0.32294 0.303589 0.338507 0.60013 0.610376 0.593282 0.601285 0.363291 0.759594 0.344761 0.360408 0.357792 0.484104
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.692308, error: 0.550000
495. 
patient tongue id: 04200629521828_1
label yaofang:
甘草 白芍 独活 党参 白术 生地黄 红花 延胡索 桑寄生 补骨脂 锁阳 续断 牛大力 千斤拔
0.940972 0.342547 0.427658 0.558244 0.38512 0.478052 0.380341 0.400705
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
496. 
patient tongue id: 04291457028674_4_1
label yaofang:
甘草 党参 杜仲 郁金 地黄 天麻 桑寄生 莪术 白花蛇舌草 续断 蜈蚣 半枝莲 醋鳖甲 炒鸡内金
0.993377 0.464303 0.6714 0.406681 0.326031 0.338431 0.725464 0.616297 0.644062 0.490112 0.556738 0.633012
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
497. 
patient tongue id: 04271908230481_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香
0.43658 0.347027 0.353881 0.367049 0.343343 0.3149
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
498. 
patient tongue id: 04102102518658_7_6
label yaofang:
桂枝 龙骨 麦冬 党参 丹参 生地黄 海螵蛸 车前子 仙鹤草 砂仁 淫羊藿 火麻仁 炙甘草
0.404371 0.359213 0.501888 0.34056 0.30362
predicted yaofang:
甘草 黄芪 白术 海螵蛸 浙贝母

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
499. 
patient tongue id: 03020659163910_5_6
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桃仁 远志 五味子 细辛 干姜 款冬花 白前 炙麻黄 苍耳子
0.965436 0.327085 0.468896 0.57503 0.380878 0.525817 0.48035 0.466368 0.380718 0.398628 0.376041
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
------Average Score: average precision: 0.438274, average recall: 0.337112, error: 0.561726
