20544/20571 [============================>.] - ETA: 0s - loss: 0.1214Epoch 00000: val_loss improved from inf to 0.08148, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 116s - loss: 0.1213 - val_loss: 0.0815
Epoch 2/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0893Epoch 00001: val_loss improved from 0.08148 to 0.07890, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 113s - loss: 0.0893 - val_loss: 0.0789
Epoch 3/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0854Epoch 00002: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0854 - val_loss: 0.0796
Epoch 4/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0834Epoch 00003: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0834 - val_loss: 0.0822
Epoch 5/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0822Epoch 00004: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0822 - val_loss: 0.0792
Epoch 6/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0812Epoch 00005: val_loss improved from 0.07890 to 0.07589, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 113s - loss: 0.0812 - val_loss: 0.0759
Epoch 7/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0802Epoch 00006: val_loss improved from 0.07589 to 0.07448, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0801 - val_loss: 0.0745
Epoch 8/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0794Epoch 00007: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0794 - val_loss: 0.0770
Epoch 9/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0790Epoch 00008: val_loss improved from 0.07448 to 0.07399, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 113s - loss: 0.0790 - val_loss: 0.0740
Epoch 10/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0782Epoch 00009: val_loss improved from 0.07399 to 0.07345, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0782 - val_loss: 0.0734
Epoch 11/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0776Epoch 00010: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0776 - val_loss: 0.0745
Epoch 12/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0772Epoch 00011: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0772 - val_loss: 0.0738
Epoch 13/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0767Epoch 00012: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0767 - val_loss: 0.0738
Epoch 14/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0763Epoch 00013: val_loss improved from 0.07345 to 0.07269, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0763 - val_loss: 0.0727
Epoch 15/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0760Epoch 00014: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0760 - val_loss: 0.0737
Epoch 16/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0754Epoch 00015: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0754 - val_loss: 0.0731
Epoch 17/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0750Epoch 00016: val_loss improved from 0.07269 to 0.07268, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0750 - val_loss: 0.0727
Epoch 18/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0748Epoch 00017: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0748 - val_loss: 0.0730
Epoch 19/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0743Epoch 00018: val_loss improved from 0.07268 to 0.07227, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0743 - val_loss: 0.0723
Epoch 20/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0740Epoch 00019: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0740 - val_loss: 0.0726
Epoch 21/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0737Epoch 00020: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0737 - val_loss: 0.0726
Epoch 22/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0733Epoch 00021: val_loss improved from 0.07227 to 0.07221, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0733 - val_loss: 0.0722
Epoch 23/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0729Epoch 00022: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0730 - val_loss: 0.0733
Epoch 24/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0727Epoch 00023: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0727 - val_loss: 0.0728
Epoch 25/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0723Epoch 00024: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0723 - val_loss: 0.0733
Epoch 26/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0720Epoch 00025: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0720 - val_loss: 0.0728
Epoch 27/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0717Epoch 00026: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0717 - val_loss: 0.0724
Epoch 28/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0714Epoch 00027: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0714 - val_loss: 0.0725
Epoch 29/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0710Epoch 00028: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0710 - val_loss: 0.0726
Epoch 30/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0707Epoch 00029: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0707 - val_loss: 0.0730
Epoch 31/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0704Epoch 00030: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0704 - val_loss: 0.0726
Epoch 32/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0700Epoch 00031: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0701 - val_loss: 0.0734
Epoch 33/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0698Epoch 00032: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0698 - val_loss: 0.0728
Epoch 34/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0695Epoch 00033: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0695 - val_loss: 0.0728
Epoch 35/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0690Epoch 00034: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0690 - val_loss: 0.0727
Epoch 36/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0688Epoch 00035: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0688 - val_loss: 0.0737
Epoch 37/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0683Epoch 00036: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0683 - val_loss: 0.0737
Epoch 38/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0681Epoch 00037: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0681 - val_loss: 0.0735
Epoch 39/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0678Epoch 00038: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0678 - val_loss: 0.0734
Epoch 40/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0674Epoch 00039: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0674 - val_loss: 0.0737
Epoch 41/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0670Epoch 00040: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0670 - val_loss: 0.0739
Epoch 42/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0666Epoch 00041: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0666 - val_loss: 0.0746
Epoch 43/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0663Epoch 00042: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0663 - val_loss: 0.0742
Epoch 44/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00043: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0660 - val_loss: 0.0746
Epoch 45/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0656Epoch 00044: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0656 - val_loss: 0.0800
Epoch 46/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0651Epoch 00045: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0651 - val_loss: 0.0741
Epoch 47/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0649Epoch 00046: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0649 - val_loss: 0.0742
Epoch 48/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0645Epoch 00047: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0645 - val_loss: 0.0742
Epoch 49/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0641Epoch 00048: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0641 - val_loss: 0.0740
Epoch 50/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0638Epoch 00049: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0637 - val_loss: 0.0750
Epoch 51/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0635Epoch 00050: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0635 - val_loss: 0.0758
Epoch 52/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0631Epoch 00051: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0631 - val_loss: 0.0751
Epoch 53/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0628Epoch 00052: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0628 - val_loss: 0.0766
Epoch 54/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0625Epoch 00053: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0625 - val_loss: 0.0750
Epoch 55/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0621Epoch 00054: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0621 - val_loss: 0.0766
Epoch 56/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0620Epoch 00055: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0620 - val_loss: 0.0758
Epoch 57/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0617Epoch 00056: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0617 - val_loss: 0.0759
Epoch 58/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0614Epoch 00057: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0614 - val_loss: 0.0763
Epoch 59/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0612Epoch 00058: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0612 - val_loss: 0.0768
Epoch 60/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0608Epoch 00059: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0608 - val_loss: 0.0755
Epoch 61/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0605Epoch 00060: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0605 - val_loss: 0.0763
Epoch 62/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0603Epoch 00061: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0603 - val_loss: 0.0772
Epoch 63/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0600Epoch 00062: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0600 - val_loss: 0.0758
Epoch 64/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0597Epoch 00063: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0597 - val_loss: 0.0765
Epoch 65/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0594Epoch 00064: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0594 - val_loss: 0.0767
Epoch 66/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0592Epoch 00065: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0592 - val_loss: 0.0763
Epoch 67/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0589Epoch 00066: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0589 - val_loss: 0.0772
Epoch 68/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0588Epoch 00067: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0588 - val_loss: 0.0767
Epoch 69/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0584Epoch 00068: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0584 - val_loss: 0.0772
Epoch 70/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0582Epoch 00069: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0582 - val_loss: 0.0763
Epoch 71/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0579Epoch 00070: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0579 - val_loss: 0.0772
Epoch 72/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0576Epoch 00071: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0576 - val_loss: 0.0777
Epoch 73/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0575Epoch 00072: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0575 - val_loss: 0.0777
Epoch 74/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0573Epoch 00073: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0573 - val_loss: 0.0781
Epoch 75/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0569Epoch 00074: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0570 - val_loss: 0.0782
Epoch 76/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0568Epoch 00075: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0568 - val_loss: 0.0771
Epoch 77/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0565Epoch 00076: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0565 - val_loss: 0.0770
Epoch 78/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0564Epoch 00077: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0564 - val_loss: 0.0781
Epoch 79/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0561Epoch 00078: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0561 - val_loss: 0.0775
Epoch 80/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0560Epoch 00079: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0560 - val_loss: 0.0773
history: [(0.12132377957305043, None, 0.08148286946378705, None), (0.089296422488047561, None, 0.07890168564958297, None), (0.085370308018514196, None, 0.079591480484926896, None), (0.08339382834295371, None, 0.08222599785712574, None), (0.082164021166596823, None, 0.079233037531829503, None), (0.081227260061482343, None, 0.07588502561710378, None), (0.080145564422306192, None, 0.07447935894834759, None), (0.079430569566876469, None, 0.076965745793629997, None), (0.078958380371397366, None, 0.073986421505065819, None), (0.078171208566056055, None, 0.073449434925159901, None), (0.077606194008872115, None, 0.074497455580775238, None), (0.077176519601365109, None, 0.07378304497972471, None), (0.076703289293821558, None, 0.073811513704887088, None), (0.076297440021255131, None, 0.072688541841470666, None), (0.075999717315900051, None, 0.073688256005718281, None), (0.075419068605230719, None, 0.07313865166911615, None), (0.075048549647208612, None, 0.072684977470104731, None), (0.074836892552159875, None, 0.072975471729194372, None), (0.074303812846584147, None, 0.072270403770642005, None), (0.07397656860641777, None, 0.07261302897102756, None), (0.073676561754826911, None, 0.072571120033525435, None), (0.073342666984659119, None, 0.072206464679727453, None), (0.072960181503214538, None, 0.073337727213559079, None), (0.072659636668346239, None, 0.07276858911031639, None), (0.072320923994777325, None, 0.07332252544355175, None), (0.072041055395750841, None, 0.072796945022121418, None), (0.071734616278755978, None, 0.072416871173741071, None), (0.071444422430367652, None, 0.072521349497400286, None), (0.071014814208833515, None, 0.072640752320601701, None), (0.070715205480507262, None, 0.072956342698050777, None), (0.070422611175188554, None, 0.072613177472325763, None), (0.07005278389660248, None, 0.073447713546194074, None), (0.069792866983198004, None, 0.072817484481058889, None), (0.06945688924605263, None, 0.072775706886973004, None), (0.069045365438756959, None, 0.072731876357414585, None), (0.068804274766204432, None, 0.073706004025820004, None), (0.06833657610059149, None, 0.073685184313917088, None), (0.068115266013256126, None, 0.073530203290000179, None), (0.067776575768575167, None, 0.073394410323516054, None), (0.067446101145579515, None, 0.073738326175390681, None), (0.06703909923114286, None, 0.073907322875440939, None), (0.066592432835610768, None, 0.074627357666895267, None), (0.066282484974692399, None, 0.074158129207166176, None), (0.065988783472930274, None, 0.074555571765115819, None), (0.065610697161826242, None, 0.080011048420832759, None), (0.065130904000349377, None, 0.074089972588660333, None), (0.064897064036092952, None, 0.074194854763272686, None), (0.064487228659082352, None, 0.07419686744066134, None), (0.064112762960716108, None, 0.073994830976519599, None), (0.063745977212245036, None, 0.0750144872151009, None), (0.063480289810586177, None, 0.07584865123623219, None), (0.063087147454875633, None, 0.075076926425893198, None), (0.062812472482420917, None, 0.076594174645353494, None), (0.062499001850740983, None, 0.074952770347736744, None), (0.062129781561767426, None, 0.07657785104698242, None), (0.061972276130758626, None, 0.075834228545200513, None), (0.061673462096621466, None, 0.07588283885468812, None), (0.06135482726057527, None, 0.076311686879967991, None), (0.061177665709719047, None, 0.076830760778538898, None), (0.060772559497742476, None, 0.075494806561477293, None), (0.060486113511967234, None, 0.076293290648014031, None), (0.060271770822889439, None, 0.077216447567740168, None), (0.059970485567785795, None, 0.075779833682051531, None), (0.059749018661502173, None, 0.076543229106172936, None), (0.05942441310397989, None, 0.076719596233542103, None), (0.059164896170599598, None, 0.07626329047131937, None), (0.05890357491963804, None, 0.077219358771540444, None), (0.058788130149027222, None, 0.076671057651485658, None), (0.058408790525746365, None, 0.077203303598196354, None), (0.058212707515212514, None, 0.076315229852177785, None), (0.057928626048028002, None, 0.077235280458150576, None), (0.057578918302472359, None, 0.077741308435457485, None), (0.057472799290961267, None, 0.07767504569330172, None), (0.057280559819491407, None, 0.07805819522527073, None), (0.056955070006520545, None, 0.078232676210378035, None), (0.056813956467096749, None, 0.077146328690843133, None), (0.056534164278625801, None, 0.077021388362531792, None), (0.056380402537455826, None, 0.078131260993908894, None), (0.056077246299079321, None, 0.07749883773845806, None), (0.055963162331505549, None, 0.077283529113961136, None)]
0. 
patient tongue id: 02191625343230_4_6
label yaofang:
甘草 枳壳 法半夏 茯苓 前胡 桔梗 连翘 薏苡仁 浙贝母 莱菔子 款冬花 豆蔻 苦杏仁 紫苏子 贯众
0.960904 0.524354 0.566176 0.376938 0.341111 0.545157 0.47354 0.468537 0.3917 0.392177 0.384773
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
1. 
patient tongue id: 02231912360908_4
label yaofang:
法半夏 前胡 木香 麦冬 太子参 郁金 北柴胡 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子
0.406025 0.715751 0.443716 0.807199 0.52522 0.558059 0.383246 0.318756 0.309592 0.334529 0.757933 0.771863 0.71002 0.768346 0.393086 0.854775 0.417971 0.530699 0.45157 0.58107
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.733333, error: 0.450000
2. 
patient tongue id: 06082044196021_7_4
label yaofang:
甘草 茯苓 太子参 枸杞子 白术 生地黄 赤芍 胆南星 浙贝母 杜仲 郁金 泽泻 生半夏 僵蚕 莪术 地龙 北沙参 赭石 蜈蚣 姜黄
0.493541 0.381152 0.427162 0.303863 0.631717 0.621684 0.354466 0.392094 0.572476 0.403292 0.35676 0.32763 0.37955 0.452748 0.470754 0.357111
predicted yaofang:
甘草 茯苓 半夏 薏苡仁 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 鸡内金 北沙参 合欢皮 蛇舌草

------Score: precision: 0.437500, recall: 0.350000, error: 0.562500
3. 
patient tongue id: 04251820144130_4
label yaofang:
麻黄 柴胡 茯苓 前胡 桔梗 半夏 防风 薄荷 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 苍耳子
0.329696 0.527252 0.425009 0.645219 0.420466 0.453272 0.3435 0.579153 0.594483 0.567712 0.636672 0.424717 0.692 0.324141 0.419762 0.33544 0.456843
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.588235, recall: 0.625000, error: 0.411765
4. 
patient tongue id: 03312115247718_6_5_1
label yaofang:
甘草 柴胡 白芍 茯苓 木香 党参 白术 酸枣仁 黄连 延胡索 乌梅 山药 砂仁 建曲 合欢花
0.804563 0.449418 0.518016 0.362345 0.416424
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
5. 
patient tongue id: 02182313170546_1
label yaofang:
甘草 龙骨 牡蛎 党参 太子参 酸枣仁 丹参 黄连 牡丹皮 山药 山茱萸 地黄 补骨脂 麦芽 五加皮
0.974096 0.528351 0.582642 0.368819 0.330447 0.566992 0.46437 0.47125 0.372499 0.379608 0.376371
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
6. 
patient tongue id: 01041642503947_4
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 升麻 炙甘草 覆盆子 广金钱草 徐长卿
0.441751 0.366122 0.357744 0.47714 0.473088 0.305967 0.323793
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
7. 
patient tongue id: 03291332067563_6_4
label yaofang:
柴胡 白芍 法半夏 大枣 茯苓 牡蛎 党参 栀子 牡丹皮 乌梅 黄柏 大黄 淫羊藿 补骨脂 仙茅 炙甘草 浮小麦
0.972157 0.540856 0.594045 0.357227 0.37773 0.331611 0.61143 0.536981 0.504717 0.456602 0.460341 0.46015
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.117647, error: 0.833333
8. 
patient tongue id: 04112000388796_1_2_7
label yaofang:
甘草 柴胡 黄芩 半夏 荆芥 丹参 杜仲 牛膝 郁金 厚朴 砂仁 菟丝子 火麻仁 紫苏叶 合欢皮 预知子
0.455687 0.391099 0.314647 0.569317 0.491405 0.419409 0.388769
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.125000, error: 0.714286
9. 
patient tongue id: 01141830514473_6_4
label yaofang:
甘草 白芍 香附 生地黄 赤芍 山药 天麻 全蝎 菟丝子 益母草 佛手 浮小麦 百合 合欢花
0.866021 0.478388 0.472345 0.430874 0.352435 0.362698
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
10. 
patient tongue id: 04291612151459_3_4
label yaofang:
甘草 薏苡仁 党参 郁金 山药 砂仁 天麻 菟丝子 益母草 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 红豆杉
0.909113 0.30648 0.478573 0.518845 0.365447 0.453113 0.351022 0.367031
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.333333, error: 0.375000
11. 
patient tongue id: 06071932454762_2_5
label yaofang:
半夏 牡蛎 薏苡仁 党参 黄芪 白术 赤芍 海螵蛸 杜仲 郁金 茵陈 炙甘草 白鲜皮 合欢皮 预知子 蛇舌草 鸡骨草
0.566593 0.373519 0.308341 0.306147 0.606012 0.651749 0.338574 0.518136 0.360711 0.353372 0.377475
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.545455, recall: 0.352941, error: 0.454545
12. 
patient tongue id: 05032238237956_2_7
label yaofang:
甘草 茯苓 党参 郁金 山药 天麻 鳖甲 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 有瓜石斛
0.916236 0.496368 0.51949 0.418539 0.328871 0.488147 0.422088 0.464475 0.355293 0.357774 0.354836
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
13. 
patient tongue id: 05092139064183_6_7_1
label yaofang:
甘草 白芍 川芎 茯苓 党参 酸枣仁 生地黄 地龙 女贞子 首乌藤 合欢花 墨旱莲
0.480893 0.339625 0.369028 0.424416 0.34309 0.321272
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
14. 
patient tongue id: 04062018066663_6_1
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗 猫爪草
0.450749 0.359708 0.381457 0.422071 0.422842
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
15. 
patient tongue id: 05112029187964_2_5
label yaofang:
甘草 茯苓 桔梗 黄芪 白术 五味子 郁金 生半夏 砂仁 天花粉 川贝母 北沙参 蛤壳 冬凌草
0.500354 0.367813 0.328419 0.56799 0.550162 0.424089
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
16. 
patient tongue id: 04282310548770_3_4
label yaofang:
甘草 白芍 茯苓 党参 白术 黄连 乌梅 山药 车前子 干姜 白扁豆 建曲
0.871981 0.486945 0.458657 0.379127 0.360614 0.332634
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
17. 
patient tongue id: 04140835111389_1_2
label yaofang:
甘草 法半夏 桔梗 橘红 防风 金银花 薏苡仁 太子参 藿香 白前 鸡内金 蜜百部 干鱼腥草
0.354209 0.336113 0.38928 0.305167 0.403472 0.592977 0.436645 0.319474 0.441586 0.342602 0.386545 0.323601 0.431972 0.393356 0.446474 0.441254
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.062500, recall: 0.076923, error: 0.937500
18. 
patient tongue id: 06162214557781_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 香薷 辛夷 紫苏梗 广藿香 炒苍耳子
0.355426 0.609382 0.453947 0.706423 0.456508 0.468843 0.36958 0.641813 0.654772 0.61499 0.649929 0.402916 0.724649 0.347997 0.452968 0.386559 0.500219
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.411765, recall: 0.500000, error: 0.588235
19. 
patient tongue id: 03232324378343_2_7
label yaofang:
桂枝 甘草 白芍 川芎 丹参 生地黄 红花 赤芍 牛膝 山药 山茱萸 天麻 补骨脂 吴茱萸 宽筋藤
0.977968 0.548041 0.608043 0.358494 0.372752 0.316239 0.614861 0.534848 0.501737 0.447102 0.451283 0.448708
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
20. 
patient tongue id: 01061925031433_1
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.374229 0.569756 0.435189 0.637587 0.430799 0.481061 0.365735 0.301479 0.589194 0.602718 0.570131 0.613038 0.402009 0.70864 0.370069 0.440941 0.405976 0.48916
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.812500, error: 0.277778
21. 
patient tongue id: 02182002082546_2_6
label yaofang:
甘草 茯苓 桔梗 麦冬 浙贝母 郁金 地黄 天麻 诃子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 猫爪草
0.963855 0.52732 0.554554 0.395366 0.325231 0.538666 0.471583 0.500184 0.385881 0.383127 0.384511
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
22. 
patient tongue id: 01211250428855_4_3
label yaofang:
麻黄 桂枝 白芍 大枣 生石膏 蝉蜕 炙甘草 地肤子
0.482769 0.322206 0.37709 0.388788 0.317501 0.316981
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
23. 
patient tongue id: 04071400063437_1_2_7
label yaofang:
甘草 法半夏 前胡 桔梗 橘红 金银花 薏苡仁 藿香 白前 枇杷叶 苦杏仁 干鱼腥草
0.353203 0.368959 0.336462 0.39229 0.308781
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
24. 
patient tongue id: 03091831215493_1_4_5
label yaofang:
甘草 法半夏 葛根 前胡 桔梗 防风 薄荷 荷叶 荆芥穗 香薷 紫苏梗 广藿香
0.433868 0.857444 0.406164 0.941414 0.609345 0.688228 0.362821 0.326686 0.903779 0.920292 0.869156 0.916948 0.370264 0.959943 0.452622 0.642533 0.481925 0.702208
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.277778, recall: 0.416667, error: 0.722222
25. 
patient tongue id: 03020829112646_6_4
label yaofang:
甘草 茯苓 龙骨 牡蛎 酸枣仁 丹参 生地黄 红花 山茱萸 天麻 鳖甲 白花蛇舌草 浮小麦 蜈蚣 天山雪莲 半枝莲
0.951218 0.307841 0.495803 0.569304 0.351235 0.318941 0.548931 0.426314 0.426401 0.34933 0.353175 0.355092
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
26. 
patient tongue id: 05092144585401_4_1_6
label yaofang:
甘草 白芍 陈皮 防风 羌活 薏苡仁 白术 浙贝母 天麻 鳖甲 补骨脂 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97864 0.540046 0.613046 0.360013 0.38672 0.321975 0.629457 0.548992 0.513898 0.460248 0.471354 0.465788
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
27. 
patient tongue id: 03081755377384_1_4
label yaofang:
麻黄 桂枝 白芍 牛蒡子 太子参 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.33296 0.339347 0.354293 0.346032 0.300615 0.324612
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.166667, recall: 0.066667, error: 0.833333
28. 
patient tongue id: 04222116002959_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.416542 0.77395 0.425889 0.875137 0.553979 0.598909 0.384563 0.331978 0.82273 0.84293 0.780197 0.84235 0.398347 0.907439 0.417136 0.568999 0.463952 0.638698
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.866667, error: 0.277778
29. 
patient tongue id: 05222127091348_1_4_6
label yaofang:
甘草 茯苓 半夏 橘红 黄芪 白术 厚朴 磁石 芡实 金樱子 枇杷叶 北沙参 木蝴蝶
0.473569 0.391102 0.314998 0.547068 0.52989 0.41607 0.319563 0.360151 0.321172
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.666667, recall: 0.461538, error: 0.333333
30. 
patient tongue id: 03020729136700_6_4
label yaofang:
甘草 白芍 法半夏 葛根 木香 黄连 山药 大腹皮 天麻 白花蛇舌草 建曲 紫苏梗 广藿香 蜈蚣 半枝莲 醋鳖甲
0.985734 0.539263 0.627034 0.378003 0.408738 0.32141 0.300424 0.671409 0.585541 0.569772 0.491443 0.506773 0.533323
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
31. 
patient tongue id: 02171859232680_4
label yaofang:
陈皮 法半夏 前胡 防风 太子参 钩藤 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子
0.442834 0.822646 0.430916 0.899437 0.586214 0.637957 0.389772 0.315447 0.343281 0.859206 0.882749 0.812024 0.869138 0.372037 0.949329 0.44997 0.610921 0.470695 0.661104
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
32. 
patient tongue id: 01180619216835_1_7
label yaofang:
桂枝 甘草 川芎 茯苓 鸡血藤 白术 酸枣仁 生地黄 赤芍 牛膝 天麻 桑寄生 桑枝 乌梢蛇
0.955522 0.512629 0.549735 0.377264 0.317282 0.542509 0.463859 0.463812 0.365767 0.373024 0.361472
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
33. 
patient tongue id: 05182041306526_1_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 金樱子 桑螵蛸 炙甘草 百合 紫苏叶 覆盆子
0.307758 0.403818 0.300669 0.314528 0.30027 0.484388 0.66035
predicted yaofang:
柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
34. 
patient tongue id: 03231209552995_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.396653 0.777673 0.436997 0.860468 0.550087 0.591463 0.362587 0.308921 0.810424 0.836469 0.762409 0.825581 0.368251 0.916194 0.413736 0.556491 0.44818 0.61546
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
35. 
patient tongue id: 03061449580324_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 紫菀 豆蔻 姜半夏 炙甘草 紫苏梗
0.605357 0.40552 0.486999 0.318575 0.330487 0.375883
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
36. 
patient tongue id: 04181954003347_6_4
label yaofang:
甘草 柴胡 白芍 香附 当归 茯苓 薄荷 枸杞子 白术 车前子 菟丝子 麦芽 续断 广藿香
0.363712 0.32 0.355682 0.331203 0.311675 0.475701
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
37. 
patient tongue id: 01201319592474_5_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 天麻 鳖甲 诃子 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989505 0.551707 0.62155 0.369558 0.370735 0.313117 0.64025 0.560382 0.546793 0.457719 0.471553 0.474356
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
38. 
patient tongue id: 02181631561609_2_5_7
label yaofang:
甘草 柴胡 黄芩 茯苓 浙贝母 乌梅 牛膝 鳖甲 夏枯草 白花蛇舌 蜂房 岗梅根 四季青 有瓜石斛
0.983222 0.541467 0.618867 0.360087 0.398096 0.333021 0.304323 0.648508 0.552655 0.53273 0.464801 0.47533 0.482771
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
39. 
patient tongue id: 01201316433765_1_5_6
label yaofang:
甘草 白芍 当归 蒲公英 党参 黄芪 白术 仙鹤草 茜草 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲 红豆杉 艾叶
0.983704 0.542238 0.625476 0.379585 0.414858 0.343903 0.315951 0.667528 0.588464 0.565525 0.492466 0.51465 0.525074
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
40. 
patient tongue id: 04051840156048_1_2
label yaofang:
茯苓 半夏 薏苡仁 黄芪 枸杞子 白术 黄连 海螵蛸 杜仲 山茱萸 僵蚕 肉苁蓉 莲子 麦芽 白扁豆 赭石 紫苏叶 骨碎补 蛇舌草 谷精子
0.508036 0.39107 0.375666 0.383292 0.417408
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.150000, error: 0.400000
41. 
patient tongue id: 05242058091549_1_2
label yaofang:
甘草 白芍 陈皮 防风 白术 杜仲 天麻 桑寄生 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.976916 0.5406 0.60803 0.364313 0.387467 0.325497 0.621603 0.537756 0.516642 0.456326 0.458873 0.460369
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
42. 
patient tongue id: 02170944284366_1_4_7
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.561582 0.406439 0.438572 0.49782 0.335475 0.338796 0.310315
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
43. 
patient tongue id: 02251115261307_4
label yaofang:
法半夏 前胡 防风 白芷 木瓜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.41703 0.425272 0.423944 0.353252 0.38378
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
44. 
patient tongue id: 05232115170385_1_4
label yaofang:
陈皮 茯苓 半夏 黄芪 浙贝母 杜仲 牛膝 厚朴 僵蚕 菟丝子 百部 鸡内金 枇杷叶 北沙参 紫苏子 紫苏叶 紫苑
0.619675 0.429405 0.381512 0.422229 0.432116
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.117647, error: 0.600000
45. 
patient tongue id: 06082027497652_2
label yaofang:
甘草 枳壳 薏苡仁 桃仁 蒲公英 太子参 黄芪 白术 生地黄 牡丹皮 乌药 郁金 厚朴 僵蚕 莪术 蜈蚣 姜黄
0.515397 0.375946 0.386822 0.300927 0.311912 0.618389 0.633996 0.349162 0.375986 0.547934 0.392833 0.329783 0.325171 0.350204 0.410144 0.442944 0.32482
predicted yaofang:
甘草 茯苓 半夏 薏苡仁 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 鸡内金 北沙参 合欢皮 蛇舌草

------Score: precision: 0.411765, recall: 0.411765, error: 0.588235
46. 
patient tongue id: 01200655104444_6_2_4
label yaofang:
甘草 蒲公英 黄连 牛膝 石膏 山茱萸 细辛 天麻 白芷 鳖甲 白花蛇舌草 麦芽 蜈蚣 天山雪莲 半枝莲 广升麻
0.96346 0.50246 0.58966 0.363329 0.35686 0.306743 0.589887 0.480026 0.474511 0.396555 0.408753 0.418766
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
47. 
patient tongue id: 05132049598774_1_4_7
label yaofang:
甘草 羌活 独活 党参 鸡血藤 白术 生地黄 延胡索 天麻 桑寄生 鳖甲 桑枝 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.937404 0.513221 0.570804 0.367279 0.357013 0.304069 0.554531 0.441584 0.428622 0.369722 0.371762 0.369791
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.625000, error: 0.166667
48. 
patient tongue id: 03142043243269_1_7
label yaofang:
甘草 香附 茯苓 桃仁 党参 白术 海螵蛸 干姜 紫苏梗 瓦楞子 猫爪草
0.347063 0.429327 0.363718 0.305182 0.337484 0.342207 0.332013 0.337554 0.550359 0.601908 0.314997
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 柏子仁 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.363636, recall: 0.363636, error: 0.636364
49. 
patient tongue id: 02271851216516_4
label yaofang:
陈皮 前胡 防风 荆芥穗 百部 炙甘草 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术 炒六神曲 醋香附 姜厚朴
0.420024 0.80586 0.423523 0.897293 0.57214 0.63145 0.371689 0.326879 0.849936 0.872355 0.810812 0.868566 0.376779 0.934912 0.432101 0.588113 0.461799 0.661957
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.388889, recall: 0.500000, error: 0.611111
50. 
patient tongue id: 01312056249169_1_6_4
label yaofang:
茯苓 半夏 黄芪 鸡血藤 白术 厚朴 磁石 火麻仁 橘核 丝瓜络 首乌藤 桑枝 合欢皮
0.676183 0.446298 0.400694 0.37549 0.442939
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
51. 
patient tongue id: 03011107530990_6_4
label yaofang:
甘草 法半夏 浙贝母 牡丹皮 石膏 苍术 青蒿 升麻 银柴胡 淡竹叶 百合 紫苏叶 醋鳖甲 川木通
0.318007 0.419379 0.316307 0.31608 0.310294 0.521834 0.639378
predicted yaofang:
柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
52. 
patient tongue id: 03151930082023_7
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.349205 0.358774 0.332135
predicted yaofang:
党参 黄芪 炙甘草

------Score: precision: 0.666667, recall: 0.166667, error: 0.333333
53. 
patient tongue id: 05191921572080_3_4
label yaofang:
甘草 法半夏 薏苡仁 桃仁 远志 党参 细辛 干姜 天麻 鳖甲 款冬花 地龙 苦杏仁 紫苏子 炙麻黄 蜈蚣 白花蛇舌 天山雪莲
0.959071 0.527197 0.550774 0.374408 0.32124 0.529613 0.452864 0.463225 0.371974 0.367387 0.359418
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.388889, error: 0.363636
54. 
patient tongue id: 04181954055243_7
label yaofang:
桂枝 甘草 川芎 茯苓 桃仁 鸡血藤 白术 红花 赤芍 车前子 桑寄生 益母草 吴茱萸
0.932529 0.51315 0.57348 0.379842 0.388787 0.566432 0.453494 0.447041 0.383715 0.387192 0.382963
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
55. 
patient tongue id: 04062233349153_1_2_7
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 延胡索 枳实 竹茹 胆南星 厚朴
0.866156 0.46657 0.450449 0.351565 0.514201 0.319767 0.408652
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
56. 
patient tongue id: 02171945208672_5_7_6
label yaofang:
半夏 橘红 牡蛎 薏苡仁 党参 黄芪 枸杞子 白术 杜仲 山药 肉苁蓉 巴戟天 吴茱萸 芡实 莲子 北沙参 首乌藤 红豆杉 合欢皮 墨旱莲
0.385505 0.379615 0.509126 0.434746 0.369098 0.408418
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 北沙参

------Score: precision: 0.500000, recall: 0.150000, error: 0.500000
57. 
patient tongue id: 02171934369190_1_2_3
label yaofang:
玉竹 黄芪 白术 乌梅 附子 肉桂 山茱萸 厚朴 肉苁蓉 火麻仁 北沙参 辛夷 猫爪草 冬凌草
0.520715 0.434092 0.38456 0.386332 0.338089
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
58. 
patient tongue id: 03312109382609_4_6
label yaofang:
甘草 茯苓 木香 龙骨 牡蛎 党参 枸杞子 白术 荷叶 砂仁 天麻 磁石 蜈蚣 半枝莲 醋鳖甲
0.989233 0.551435 0.620674 0.339768 0.364821 0.304251 0.649618 0.551146 0.526873 0.451642 0.461508 0.45454
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
59. 
patient tongue id: 04252327050633_6_7_1
label yaofang:
甘草 白芍 川芎 茯苓 葛根 党参 白术 地黄 天麻 桑寄生 首乌藤 蜈蚣 酒女贞子 墨旱莲
0.973816 0.534742 0.589626 0.340618 0.354668 0.300726 0.609288 0.521686 0.492097 0.437162 0.442022 0.434135
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
60. 
patient tongue id: 03312110476682_5
label yaofang:
甘草 茯苓 连翘 丹参 牡丹皮 黄柏 知母 山药 山茱萸 地黄 泽泻 白芷 麦芽 皂角刺
0.992284 0.558665 0.647359 0.341593 0.397043 0.323304 0.690356 0.590873 0.559965 0.486068 0.504611 0.508626
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
61. 
patient tongue id: 03231215527335_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄 炒六神曲
0.360151 0.609612 0.442521 0.710403 0.460534 0.504983 0.382865 0.652247 0.667127 0.631122 0.686938 0.426741 0.755886 0.369939 0.472061 0.42272 0.533737
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.647059, recall: 0.785714, error: 0.352941
62. 
patient tongue id: 03111710314464_1_4_6
label yaofang:
甘草 茯苓 独活 薏苡仁 党参 酸枣仁 山药 天麻 鳖甲 莪术 白扁豆 浮小麦 蜈蚣 半枝莲 骨碎补
0.970996 0.534507 0.59634 0.365493 0.357558 0.314547 0.585622 0.498264 0.474293 0.415251 0.418092 0.4095
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
63. 
patient tongue id: 05231946058412_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 蜜麻黄 麸炒白术
0.332036 0.542639 0.451075 0.610744 0.426269 0.439884 0.356326 0.565894 0.565495 0.53946 0.589969 0.415381 0.638339 0.326569 0.417063 0.36122 0.460142
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.812500, error: 0.235294
64. 
patient tongue id: 03242142357082_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 鹿衔草
0.498798 0.391907 0.330876 0.412017 0.331875 0.358666
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
65. 
patient tongue id: 01092047464157_6_1
label yaofang:
甘草 当归 茯苓 远志 党参 黄芪 白术 酸枣仁 龙眼肉 珍珠母 首乌藤 合欢皮
0.547572 0.404909 0.342183 0.509428 0.541578 0.392724 0.309 0.319736
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.625000, recall: 0.416667, error: 0.375000
66. 
patient tongue id: 03040904109658_2_4
label yaofang:
甘草 法半夏 茯苓 白术 五味子 生地黄 杜仲 山药 山茱萸 泽泻 天麻 款冬花 补骨脂 紫菀 桑螵蛸 益智
0.663125 0.447532 0.376191 0.354515 0.435143
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
67. 
patient tongue id: 03231432414359_4_2
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄 炒六神曲
0.335518 0.387897 0.416392 0.3745 0.362598
predicted yaofang:
甘草 茯苓 黄芪 白术 炙甘草

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
68. 
patient tongue id: 05290813099031_1_2_6
label yaofang:
甘草 法半夏 茯苓 连翘 太子参 白术 浙贝母 砂仁 天麻 鳖甲 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991172 0.557447 0.640976 0.362473 0.39457 0.313888 0.674426 0.586502 0.557314 0.47994 0.495831 0.496839
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
69. 
patient tongue id: 05111935313752_1_4
label yaofang:
桂枝 甘草 茯苓 半夏 薏苡仁 太子参 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 泽泻 厚朴 淡豆豉 麦芽 紫苏叶 蜈蚣 稻芽
0.484591 0.376528 0.35997 0.601488 0.595353 0.302469 0.333329 0.514692 0.367303 0.331935 0.415432 0.395839
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.666667, recall: 0.421053, error: 0.333333
70. 
patient tongue id: 03090818154829_6_1
label yaofang:
甘草 茯苓 党参 白术 蒲黄 砂仁 天麻 全蝎 五灵脂 白花蛇舌草 麦芽 佛手 半枝莲 醋鳖甲
0.97434 0.538577 0.605864 0.376844 0.406583 0.341615 0.320142 0.629552 0.554883 0.535365 0.475704 0.485123 0.493351
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
71. 
patient tongue id: 04282309325809_6_5_1
label yaofang:
甘草 柴胡 白芍 薏苡仁 黄芪 山茱萸 天麻 鳖甲 莪术 虎杖 佛手 蜈蚣 白花蛇舌 合欢花 红豆杉 龙葵果
0.977786 0.535527 0.602737 0.350407 0.365966 0.325136 0.607214 0.519477 0.4874 0.435914 0.441096 0.433263
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
72. 
patient tongue id: 04112111457761_1_4_7
label yaofang:
甘草 茯苓 党参 白术 浙贝母 杜仲 厚朴 砂仁 火麻仁 金樱子 北沙参 合欢皮 蛇舌草
0.532094 0.41521 0.332449 0.492372 0.512658 0.385512 0.309253 0.355461
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.875000, recall: 0.538462, error: 0.125000
73. 
patient tongue id: 05162146341754_9
label yaofang:
陈皮 前胡 桔梗 半夏 防风 黄芪 白术 款冬花 紫菀 白前 百部 炙甘草 广藿香
0.328482 0.418609 0.421812 0.528649 0.350342 0.366895 0.350913 0.363412 0.447179 0.46763 0.462615 0.528257 0.463197 0.583561 0.340492 0.36715
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.687500, recall: 0.846154, error: 0.312500
74. 
patient tongue id: 05221850202611_1
label yaofang:
甘草 柴胡 陈皮 党参 黄芪 鸡血藤 白术 知母 山药 升麻 虎杖 紫苏梗
0.423947 0.348527 0.344403 0.4557 0.459023
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
75. 
patient tongue id: 01061844362179_4
label yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.405359 0.670511 0.432587 0.77178 0.500277 0.541752 0.377596 0.32425 0.313979 0.33543 0.719927 0.7354 0.684421 0.732277 0.394843 0.805517 0.415619 0.516635 0.457376 0.568462
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
76. 
patient tongue id: 05261939019545_1_4_6
label yaofang:
陈皮 半夏 党参 黄芪 枸杞子 白术 杜仲 牛膝 郁金 厚朴 砂仁 巴戟天 鸡内金 紫苏叶 骨碎补 红豆杉 素馨花
0.461818 0.416145 0.307142 0.307497 0.510253 0.464258 0.383789 0.414932
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.625000, recall: 0.294118, error: 0.375000
77. 
patient tongue id: 04112352228436_6
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 砂仁 川牛膝 浮小麦 醋龟甲
0.360265 0.332461 0.366957 0.338791 0.363026 0.319484
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
78. 
patient tongue id: 03282202306064_1_4_7
label yaofang:
甘草 党参 白术 丹参 黄连 郁金 山药 砂仁 天麻 鳖甲 茵陈 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.932998 0.510815 0.474814 0.38073 0.418001 0.367468 0.425991
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.857143, recall: 0.352941, error: 0.142857
79. 
patient tongue id: 04252016476939_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 海螵蛸 车前子 白花蛇舌草 紫苏梗 瓦楞子 猫爪草 山慈菇
0.313599 0.410741 0.326663 0.361697 0.342784 0.304163 0.315425 0.495458 0.550928
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
80. 
patient tongue id: 04202229299390_2_5
label yaofang:
甘草 茯苓 桔梗 芦根 太子参 浙贝母 白茅根 天花粉 鳖甲 淡竹叶 北沙参 紫苏梗 白花蛇舌 蜂房
0.904769 0.475048 0.513293 0.451566 0.300283 0.42627 0.328687 0.428702
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
81. 
patient tongue id: 02272234369788_1
label yaofang:
甘草 白芍 川芎 羌活 独活 牛膝 细辛 干姜 仙茅 蜈蚣 姜黄 海桐皮 鹿衔草
0.305762 0.389712 0.305128 0.381845 0.316144 0.460452 0.506601
predicted yaofang:
甘草 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
82. 
patient tongue id: 04291627449856_1_2_5
label yaofang:
甘草 远志 党参 酸枣仁 生地黄 山药 天麻 鳖甲 豆蔻 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.956647 0.514219 0.581073 0.426665 0.370617 0.571722 0.506528 0.52005 0.420769 0.435717 0.449867
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
83. 
patient tongue id: 03231754488545_5_6
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桃仁 鱼腥草 远志 细辛 桑白皮 莱菔子 款冬花 诃子 苇茎 紫苏子 炙麻黄
0.876184 0.466388 0.475914 0.475895 0.357736 0.408348
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
84. 
patient tongue id: 03171339313393_1_4
label yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.356672 0.622341 0.444208 0.688592 0.485314 0.487291 0.344531 0.30677 0.645443 0.660416 0.607511 0.652896 0.347773 0.764539 0.345068 0.472249 0.374467 0.513359
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.928571, error: 0.277778
85. 
patient tongue id: 02212013505031_6_4
label yaofang:
甘草 柴胡 白芍 陈皮 茯苓 鱼腥草 白术 酸枣仁 苍术 山药 荆芥穗 桑寄生 浮小麦 合欢花
0.966178 0.519108 0.592565 0.36783 0.362312 0.309983 0.586518 0.48743 0.470363 0.405341 0.414544 0.407143
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
86. 
patient tongue id: 04171957447292_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.426057 0.855792 0.431605 0.924552 0.615235 0.648047 0.380401 0.323279 0.888568 0.907105 0.844516 0.896643 0.358764 0.960727 0.425497 0.629537 0.44651 0.685188
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.866667, error: 0.277778
87. 
patient tongue id: 05181100161499_5
label yaofang:
甘草 柴胡 黄芩 法半夏 茯苓 葛根 前胡 鱼腥草 石膏 淡竹叶 款冬花 苦杏仁 紫苏子 蜜麻黄 大青叶
0.989772 0.542317 0.646346 0.395697 0.400773 0.300344 0.670735 0.59221 0.581297 0.479601 0.507129 0.53191
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
88. 
patient tongue id: 03152113188369_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.417459 0.375296 0.336097 0.595381 0.329443 0.307432
predicted yaofang:
甘草 茯苓 党参 黄芪 厚朴 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
89. 
patient tongue id: 02281252446124_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.411111 0.385046 0.303745 0.393456 0.491234 0.367086 0.341666 0.31316 0.310228
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤 莱菔子

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
90. 
patient tongue id: 04112250457998_6_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.332231 0.32853 0.410281 0.304787 0.303627 0.35481 0.360694 0.432003 0.538925
predicted yaofang:
甘草 柴胡 白芍 香附 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.555556, recall: 0.454545, error: 0.444444
91. 
patient tongue id: 04251812331682_1_3
label yaofang:
白芍 川芎 茯苓 防风 太子参 丹参 钩藤 荆芥穗 天麻 白芷 石决明 炙甘草 首乌藤 炒蔓荆子 棉萆薢
0.40503 0.706233 0.414685 0.795018 0.509326 0.564166 0.361407 0.302663 0.311079 0.324942 0.745148 0.782052 0.720564 0.770907 0.36615 0.865935 0.420581 0.540283 0.444025 0.590006
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.333333, error: 0.750000
92. 
patient tongue id: 02202310125396_1_2
label yaofang:
甘草 当归 茯苓 党参 黄芪 鸡血藤 白术 砂仁 赤石脂 鳖甲 北沙参 黄精 蜈蚣 白花蛇舌 天山雪莲
0.934096 0.516762 0.525679 0.37364 0.483398 0.4025 0.41996 0.331304 0.32492 0.303754
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
93. 
patient tongue id: 03151732024557_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.400554 0.349684 0.484865 0.355394 0.44825 0.528608 0.530035 0.449785 0.505531 0.469939 0.503802 0.44051 0.58147 0.394443 0.534949 0.569203 0.582441
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.705882, recall: 1.000000, error: 0.294118
94. 
patient tongue id: 03141606320774_1_2_7
label yaofang:
桔梗 防风 金银花 薏苡仁 党参 乳香 胆南星 藿香 白芷 辛夷 干鱼腥草 苍耳子
0.698573 0.416785 0.515386 0.312635 0.409338
predicted yaofang:
甘草 茯苓 党参 丹参 天麻

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
95. 
patient tongue id: 03271931277035_4
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 黄芪 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.365146 0.632855 0.443461 0.682333 0.470124 0.485864 0.351942 0.308864 0.304868 0.309479 0.644767 0.660651 0.590763 0.639007 0.354282 0.774186 0.363394 0.462044 0.380892 0.503818
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
96. 
patient tongue id: 03061500542067_1_4
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.300854 0.409686 0.335373 0.301229 0.451733 0.596489
predicted yaofang:
柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
97. 
patient tongue id: 03291341176175_6_7_1
label yaofang:
甘草 茯苓 桔梗 党参 黄芪 白术 酸枣仁 丹参 山药 蔓荆子 鳖甲 建曲 苍耳子 土茯苓 贯众
0.97185 0.529478 0.599256 0.36046 0.368218 0.310643 0.603633 0.509032 0.487398 0.425064 0.431512 0.427184
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
98. 
patient tongue id: 04061337141686_2_6
label yaofang:
甘草 柴胡 白芍 延胡索 杜仲 地黄 天麻 桑寄生 佛手 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳 牛大力
0.966462 0.53506 0.593008 0.356987 0.373546 0.301224 0.598608 0.513081 0.482624 0.433274 0.430737 0.427634
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
99. 
patient tongue id: 03020802469357_2_6
label yaofang:
甘草 白芍 茯苓 龙骨 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.981634 0.537389 0.628517 0.384327 0.411788 0.317464 0.64741 0.56201 0.548369 0.47113 0.487705 0.499343
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.750000, error: 0.000000
100. 
patient tongue id: 04260131295065_6_4_7
label yaofang:
甘草 川芎 枳壳 法半夏 茯苓 连翘 白术 牛膝 厚朴 莱菔子 天麻 白芷 蔓荆子 火麻仁 决明子 广藿香
0.970821 0.532932 0.596216 0.36504 0.370105 0.310931 0.604222 0.506257 0.48276 0.421469 0.427422 0.42138
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
101. 
patient tongue id: 06012040069832_3_2
label yaofang:
独活 麦冬 党参 黄芪 枸杞子 熟地黄 杜仲 巴戟天 石斛 桑寄生 淫羊藿 五加皮 千年健
0.485381 0.414872 0.32822 0.525799 0.520927 0.41773 0.302349 0.450777 0.302218
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.111111, recall: 0.076923, error: 0.888889
102. 
patient tongue id: 02191621119676_2_6_4
label yaofang:
甘草 柴胡 法半夏 牡蛎 连翘 麦冬 丹参 玄参 赤芍 浙贝母 郁金 麦芽 皂角刺 重楼
0.92994 0.502799 0.559433 0.362326 0.363729 0.300373 0.538159 0.357311 0.373959
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.111111, recall: 0.071429, error: 0.888889
103. 
patient tongue id: 01201324248086_1_8
label yaofang:
甘草 金银花 麦冬 何首乌 白术 生地黄 石膏 水牛角 荆芥穗 火麻仁 枇杷叶 麦芽 苦杏仁 白鲜皮
0.941089 0.517295 0.564944 0.388738 0.383207 0.322852 0.311199 0.566723 0.471121 0.470004 0.40105 0.406827 0.402313
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
104. 
patient tongue id: 03021147481124_1_2
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.338891 0.366087 0.41633 0.512179
predicted yaofang:
白芍 党参 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
105. 
patient tongue id: 03021241035610_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.35459 0.313773 0.330076 0.419683 0.415287 0.398799 0.370608 0.339405 0.329087 0.331 0.313815 0.331071
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻 车前子 莱菔子 夏枯草 制何首乌

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
106. 
patient tongue id: 01100430173800_4
label yaofang:
桂枝 川芎 防风 羌活 桃仁 红花 胆南星 黄柏 苍术 神曲 白芷 防己 威灵仙 海风藤 龙胆
0.501331 0.370595 0.456862 0.305824 0.341619 0.309538 0.335999
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
107. 
patient tongue id: 04112021572770_2_5
label yaofang:
甘草 川芎 生地黄 赤芍 牡丹皮 杜仲 黄柏 山药 山茱萸 灯心草 天麻 全蝎 白芷 菟丝子 麦芽 皂角刺
0.976428 0.535503 0.609968 0.350073 0.36965 0.313065 0.617787 0.517249 0.487872 0.431852 0.434505 0.428123
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
108. 
patient tongue id: 02281844235521_4
label yaofang:
麻黄 陈皮 法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子
0.356634 0.559719 0.435042 0.623348 0.444891 0.470385 0.357731 0.302267 0.32357 0.306375 0.575275 0.611108 0.560179 0.602483 0.372013 0.738217 0.352882 0.448969 0.382181 0.483967
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
109. 
patient tongue id: 06132233274576_7_1
label yaofang:
甘草 茯苓 龙骨 牡蛎 牛蒡子 枸杞子 熟地黄 乌药 车前子 紫菀 蝉蜕 益智 蒺藜
0.42255 0.394904 0.330591 0.407228 0.355911 0.335121 0.425175
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
110. 
patient tongue id: 04180847010682_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.728687 0.425064 0.32777 0.515463 0.363693 0.335895 0.391055 0.322626 0.349695 0.483814
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 酸枣仁 丹参 红花 牛膝 天麻

------Score: precision: 0.500000, recall: 0.416667, error: 0.500000
111. 
patient tongue id: 04271416102812_1_3_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.350098 0.315331 0.508458 0.327889 0.436404 0.530511 0.565114 0.461554 0.517752 0.497198 0.533122 0.477659 0.611162 0.350608 0.566501 0.608643 0.624978
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.705882, recall: 1.000000, error: 0.294118
112. 
patient tongue id: 05160614196457_7_4_1
label yaofang:
茯苓 黄芪 枸杞子 白术 海螵蛸 浙贝母 牡丹皮 车前子 厚朴 生半夏 砂仁 地榆 槐花 地龙 北沙参 蜈蚣 鲜龙葵果
0.418769 0.358324 0.428402 0.670505 0.605559 0.354377 0.371551 0.582045 0.405284 0.318858 0.405784 0.491842 0.464929 0.330812
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 鸡内金 北沙参 合欢皮 蛇舌草

------Score: precision: 0.500000, recall: 0.411765, error: 0.500000
113. 
patient tongue id: 04141836279104_4_1_3
label yaofang:
茯苓 半夏 远志 黄芪 枸杞子 白术 海螵蛸 郁金 厚朴 鸡内金 北沙参 炙甘草 桑椹 首乌藤 紫苏梗 合欢皮
0.647938 0.437675 0.431207 0.401437 0.436051
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
114. 
patient tongue id: 02122100201809_1_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 茯苓 木香 生地黄 杜仲 山药 山茱萸 五灵脂 桑寄生
0.958543 0.518449 0.526905 0.394166 0.302571 0.509677 0.46059 0.494729 0.377286 0.375329 0.370816
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
115. 
patient tongue id: 03012203260906_1_2
label yaofang:
甘草 茯苓 党参 白术 生地黄 栀子 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.987867 0.549381 0.627847 0.359023 0.398812 0.328028 0.662551 0.570387 0.552998 0.476355 0.485016 0.493891
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
116. 
patient tongue id: 06132000382495_1_2_5
label yaofang:
甘草 白术 海螵蛸 牡丹皮 杜仲 小蓟 茜草 桑寄生 北沙参 蜈蚣 冬凌草 鸭脚艾
0.468683 0.360595 0.332182 0.664856 0.569536 0.300894 0.309948 0.548431 0.341989 0.388675 0.40845 0.38417
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.416667, recall: 0.416667, error: 0.583333
117. 
patient tongue id: 05311931330271_4
label yaofang:
甘草 桔梗 荆芥 防风 鱼腥草 山楂 瓜蒌皮 射干 白前 百部 鸡内金 枇杷叶 苦杏仁 紫苏叶 木蝴蝶 紫苑 东风桔
0.807532 0.452592 0.459869 0.328077 0.453392 0.320739 0.318423
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.058824, error: 0.857143
118. 
patient tongue id: 03111714098381_6_5
label yaofang:
甘草 独活 酸枣仁 生地黄 延胡索 杜仲 山药 山茱萸 桑寄生 麦芽 威灵仙 川木瓜 土茯苓 牛大力 千斤拔
0.641962 0.415878 0.379073 0.397186 0.483819
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
119. 
patient tongue id: 05131739482701_6_7
label yaofang:
甘草 柴胡 白芍 丹参 生地黄 红花 青皮 浙贝母 郁金 天花粉 瓜蒌皮 王不留行 皂角刺 浮小麦 合欢花
0.527936 0.380243 0.418655 0.379202
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.066667, error: 0.750000
120. 
patient tongue id: 04121929217384_6_7
label yaofang:
桂枝 甘草 法半夏 党参 丹参 薤白 水蛭 赤石脂 瓜蒌皮 补骨脂 莪术 鹿角霜 醋香附 合欢花 淡附片
0.979077 0.542654 0.617533 0.360593 0.395387 0.324293 0.639471 0.544157 0.515648 0.457746 0.465722 0.468717
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
121. 
patient tongue id: 03231520316137_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄
0.380226 0.612262 0.444775 0.714813 0.46212 0.496198 0.382517 0.653147 0.672265 0.625526 0.684892 0.423156 0.769562 0.36697 0.47178 0.411398 0.524732
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.823529, recall: 1.000000, error: 0.176471
122. 
patient tongue id: 02020852428763_6_4
label yaofang:
甘草 法半夏 当归 茯苓 黄连 杜仲 牛膝 石膏 肉桂 细辛 地黄 砂仁 白芷 升麻 没药 麦芽
0.861903 0.47526 0.483747 0.376232 0.40661 0.336514
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
123. 
patient tongue id: 03221301248881_1_2_6
label yaofang:
甘草 玉竹 太子参 山药 天麻 天花粉 鳖甲 北沙参 白扁豆 蜈蚣 白花蛇舌 天山雪莲 合欢花 红豆杉 猫爪草
0.970258 0.534995 0.569187 0.361296 0.344246 0.576932 0.500238 0.491716 0.415308 0.416286 0.406682
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
124. 
patient tongue id: 03171053199903_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.386655 0.342718 0.387171 0.453315 0.314149 0.303875
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
125. 
patient tongue id: 03041136401604_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.429994 0.800065 0.412919 0.889607 0.577888 0.629657 0.37263 0.304227 0.312808 0.3319 0.846741 0.872182 0.800141 0.858572 0.362417 0.940435 0.447129 0.588559 0.448883 0.652732
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
126. 
patient tongue id: 02120928504219_5_6
label yaofang:
甘草 白芍 防风 独活 薏苡仁 白及 党参 白术 黄连 苍术 山药 干姜 桑寄生 豆蔻 建曲
0.973962 0.520006 0.596357 0.354673 0.336917 0.58177 0.461469 0.444734 0.363324 0.370182 0.364944
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
127. 
patient tongue id: 01192245599008_6_7_2
label yaofang:
甘草 柴胡 白芍 薏苡仁 党参 黄芪 白术 延胡索 川楝子 山药 砂仁 鳖甲 莪术 建曲 白花蛇舌 红豆杉
0.987624 0.553653 0.622464 0.35124 0.380562 0.328684 0.651707 0.553063 0.531193 0.458698 0.471872 0.474023
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
128. 
patient tongue id: 05182058150915_7_1
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 丹参 车前子 升麻 炙甘草
0.506831 0.400976 0.349849 0.438024 0.340928 0.360652
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.300000, error: 0.500000
129. 
patient tongue id: 03012333417967_5_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 桃仁 白术 浙贝母 厚朴 天花粉 火麻仁 决明子 苦杏仁 威灵仙
0.965682 0.539726 0.568989 0.35104 0.330585 0.557667 0.476776 0.449567 0.390627 0.387834 0.375378
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
130. 
patient tongue id: 04221953084479_1_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 白前 百部 豆蔻 北沙参 炙甘草 广藿香 炒白扁豆 炒紫苏子 蜜麻黄 麸炒白术 炒六神曲
0.418284 0.832969 0.425295 0.899388 0.597641 0.632042 0.365546 0.301468 0.319485 0.862539 0.889041 0.811561 0.867213 0.334591 0.960046 0.43312 0.60393 0.430805 0.651753
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.750000, error: 0.368421
131. 
patient tongue id: 01070843418731_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌
0.606425 0.420588 0.428221 0.418522 0.369983
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
132. 
patient tongue id: 06071955501722_4_7
label yaofang:
甘草 独活 党参 鸡血藤 生地黄 牛膝 细辛 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.946221 0.525445 0.55475 0.36388 0.332087 0.533823 0.456182 0.439209 0.38031 0.379042 0.361707
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
133. 
patient tongue id: 06031649134171_1_2
label yaofang:
茯苓 防风 钩藤 荆芥穗 白芷 香薷 炙甘草 首乌藤 紫苏梗 广藿香 威灵仙 炒蔓荆子
0.388601 0.662609 0.441178 0.758366 0.503394 0.544803 0.385463 0.311476 0.312022 0.333867 0.707558 0.731955 0.679526 0.730372 0.400173 0.824822 0.405992 0.517923 0.438176 0.570761
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.416667, error: 0.750000
134. 
patient tongue id: 05260627200696_1_7_6
label yaofang:
甘草 柴胡 党参 丹参 红花 赤芍 川楝子 乌药 益母草 淫羊藿 仙茅 鹿角霜 醋香附 合欢花 艾叶
0.961453 0.530174 0.577733 0.368043 0.359318 0.308919 0.568778 0.503756 0.481445 0.425668 0.425571 0.416542
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
135. 
patient tongue id: 02231834456994_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 薄荷 荆芥穗 款冬花 紫菀 百部 炙甘草 广藿香 蜜麻黄
0.45873 0.822106 0.402464 0.911769 0.585225 0.661174 0.375357 0.302811 0.320465 0.350628 0.868034 0.902075 0.827489 0.883819 0.357553 0.959163 0.466757 0.62686 0.467019 0.672911
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
136. 
patient tongue id: 06012000288041_6_1_4
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 远志 枸杞子 白术 泽泻 天麻 蔓荆子 麦芽 首乌藤 沙苑子
0.979385 0.53553 0.613386 0.376082 0.390246 0.316931 0.634548 0.557315 0.534998 0.467307 0.48189 0.494788
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
137. 
patient tongue id: 03231226456183_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.389418 0.723352 0.439191 0.80586 0.529199 0.564202 0.36619 0.305217 0.308312 0.334194 0.754573 0.781567 0.7086 0.770419 0.373734 0.870452 0.41679 0.536202 0.43272 0.587985
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
138. 
patient tongue id: 04121326355197_1_4
label yaofang:
茯苓 前胡 桔梗 防风 钩藤 白芷 款冬花 紫菀 百部 炙甘草 辛夷 广藿香 蜜麻黄 炒苍耳子 炒蔓荆子
0.372792 0.648414 0.450679 0.732414 0.48675 0.510397 0.378796 0.30849 0.309421 0.685175 0.69739 0.650596 0.699044 0.4018 0.773894 0.378381 0.486471 0.438473 0.545626
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
139. 
patient tongue id: 04052140593562_4_3
label yaofang:
桂枝 陈皮 枳壳 太子参 黄芪 熟地黄 山茱萸 钩藤 天麻 石斛 蝉蜕 佛手 黄精
0.635852 0.324002 0.392188 0.46118 0.37386 0.306303
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
140. 
patient tongue id: 03012150136198_1_2_4
label yaofang:
甘草 川芎 太子参 黄芪 鸡血藤 酸枣仁 地黄 天麻 白花蛇舌草 地龙 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.91303 0.484646 0.549662 0.383856 0.333165 0.507668 0.398124 0.430433 0.328162 0.330539 0.326155
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
141. 
patient tongue id: 02281210092553_1_6
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 阿胶 五味子 熟地黄 火麻仁 苦参 炙甘草 黑枣
0.586421 0.422399 0.415072 0.366391 0.314021
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
142. 
patient tongue id: 05191947292297_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 熟地黄 栀子 牡丹皮 山药 菟丝子 桑寄生 女贞子 首乌藤 合欢花 艾叶
0.941413 0.513361 0.554686 0.364767 0.336268 0.535113 0.450662 0.448516 0.38032 0.378064 0.365814
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
143. 
patient tongue id: 03261558536838_1_3
label yaofang:
半夏 麦冬 枸杞子 酸枣仁 丹参 五味子 钩藤 天麻 三七 桑寄生 豆蔻 北沙参 石榴皮
0.708449 0.449267 0.450958 0.388648 0.329083
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
144. 
patient tongue id: 04141824584748_1_4_7
label yaofang:
甘草 党参 黄芪 枸杞子 白术 海螵蛸 杜仲 牛膝 郁金 厚朴 砂仁 菟丝子 鳖甲 莪术 鸡内金 紫苏叶 鲜龙葵果
0.339145 0.41417 0.376576
predicted yaofang:
甘草 茯苓 黄芪

------Score: precision: 0.666667, recall: 0.117647, error: 0.333333
145. 
patient tongue id: 04021108132391_1_4
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 党参 浙贝母 山药 砂仁 天麻 鳖甲 皂角刺 紫苏梗 蜈蚣 白花蛇舌 天山雪莲
0.984876 0.541617 0.621611 0.353749 0.384625 0.307954 0.637699 0.534735 0.517922 0.443774 0.450131 0.453053
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
146. 
patient tongue id: 02212025141620_4_7_6
label yaofang:
甘草 桔梗 连翘 牛蒡子 薏苡仁 浙贝母 天麻 白芷 鳖甲 皂角刺 浮小麦 蜈蚣 半枝莲 红豆杉 龙葵果 广升麻
0.955482 0.52365 0.5466 0.347896 0.313333 0.538927 0.453775 0.45053 0.380235 0.374515 0.361189
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
147. 
patient tongue id: 03062142384536_1_6_4
label yaofang:
甘草 柴胡 白芍 陈皮 茯苓 半夏 白术 龙眼肉 黄连 山楂 全蝎 鸡内金
0.440521 0.38242 0.332991 0.31226 0.569129 0.532569 0.325121 0.454575 0.339439 0.32998 0.399984 0.36656
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.416667, recall: 0.416667, error: 0.583333
148. 
patient tongue id: 06022246455187_1_4_6
label yaofang:
甘草 陈皮 茯苓 半夏 防风 羌活 党参 杜仲 牛膝 钩藤 天麻 僵蚕 桑寄生 首乌藤 紫苏叶 蜈蚣
0.4997 0.430196 0.345214 0.516572 0.504199 0.310299 0.424935 0.324745 0.454069 0.326952
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 杜仲 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
149. 
patient tongue id: 01132329356228_4
label yaofang:
白芍 远志 太子参 天麻 醋鳖甲 三七粉
0.308377 0.341776 0.305384 0.304758 0.301258 0.456899
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
150. 
patient tongue id: 05121841304545_5
label yaofang:
甘草 柴胡 黄芩 葛根 薏苡仁 鱼腥草 蒲公英 黄连 酒川芎 布渣叶 车前草
0.535824 0.400578 0.351728 0.385414 0.484135
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
151. 
patient tongue id: 02191229573088_2_5_7
label yaofang:
甘草 黄芩 茯苓 枸杞子 酸枣仁 浙贝母 牡丹皮 山药 山茱萸 桑叶 地黄 泽泻 石斛 建曲 沙苑子 木贼
0.976171 0.519654 0.592291 0.436929 0.365562 0.580156 0.52493 0.551263 0.43118 0.444888 0.468717
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
152. 
patient tongue id: 02191439309511_1_4_7
label yaofang:
甘草 法半夏 茯苓 远志 党参 丹参 黄连 竹茹 胆南星 郁金 天麻 全蝎 莪术 豆蔻 浮小麦
0.97026 0.528279 0.588413 0.365443 0.355988 0.310533 0.590506 0.500201 0.482023 0.420221 0.428392 0.41765
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
153. 
patient tongue id: 04102056113232_4
label yaofang:
甘草 茯苓 柏子仁 肉桂 干姜 砂仁 制川乌 附片
0.366946 0.310752 0.333775 0.336274 0.300266 0.413719 0.405202
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.285714, recall: 0.250000, error: 0.714286
154. 
patient tongue id: 01122232481532_1_2
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 山药 地黄 天麻 麦芽 广藿香 蜈蚣 半枝莲 醋鳖甲
0.968052 0.524014 0.584031 0.373618 0.340232 0.572488 0.479719 0.471202 0.391365 0.396395 0.390037
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
155. 
patient tongue id: 02190520261200_1_4_6
label yaofang:
甘草 大枣 茯苓 远志 党参 酸枣仁 生地黄 山药 山茱萸 鳖甲 补骨脂 续断 土鳖虫 牛大力
0.887455 0.486924 0.488129 0.444947 0.41013 0.338047 0.417134
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
156. 
patient tongue id: 03021315406427_4
label yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.425718 0.778543 0.424836 0.863595 0.561498 0.616647 0.381854 0.30577 0.322478 0.348149 0.821949 0.849322 0.772665 0.830927 0.368691 0.930387 0.447068 0.583428 0.445891 0.632484
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
157. 
patient tongue id: 02212026241597_4_6
label yaofang:
甘草 前胡 酸枣仁 生地黄 牡丹皮 杜仲 天麻 鳖甲 苦杏仁 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.971855 0.524264 0.590569 0.402214 0.379141 0.310293 0.301895 0.596798 0.521612 0.522134 0.433303 0.449757 0.452677
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
158. 
patient tongue id: 03090809433571_6_7
label yaofang:
甘草 川芎 法半夏 茯苓 龙骨 远志 党参 酸枣仁 丹参 胆南星 郁金 石菖蒲 麦芽 首乌藤
0.820424 0.455611 0.463967 0.343578 0.471483 0.34223 0.374216
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
159. 
patient tongue id: 04071309309172_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.407065 0.716815 0.453027 0.796275 0.522503 0.55422 0.382773 0.310214 0.310343 0.34468 0.746659 0.770647 0.695794 0.757962 0.381291 0.862576 0.412283 0.542844 0.431378 0.578784
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
160. 
patient tongue id: 02120805419233_1_2
label yaofang:
甘草 柴胡 白芍 茯苓 党参 生地黄 山药 车前子 荆芥穗 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲
0.975792 0.53083 0.596646 0.373036 0.36132 0.30889 0.591943 0.508695 0.503643 0.423554 0.429467 0.431084
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
161. 
patient tongue id: 01312048229509_1_3
label yaofang:
桃仁 黄芪 白术 海螵蛸 杜仲 牛膝 当归尾 砂仁 鸡内金 北沙参 紫苏梗 骨碎补 土鳖虫 红豆杉 石上柏 稻芽
0.346163 0.339222 0.402611 0.450821 0.423167 0.34323 0.356396 0.348606 0.410846 0.374719 0.378358 0.385817 0.420825 0.449843 0.472733 0.306849 0.317297 0.321221
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.111111, recall: 0.125000, error: 0.888889
162. 
patient tongue id: 05042045323541_4
label yaofang:
甘草 生地黄 浙贝母 石膏 苍术 细辛 紫苏叶 川木通
0.360426 0.302495 0.397974 0.321837 0.362947 0.33819 0.38364 0.524453
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.125000, error: 0.875000
163. 
patient tongue id: 06170914288323_7_6_1
label yaofang:
甘草 柴胡 白芍 茯苓 龙齿 麦冬 黄芪 白术 丹参 郁金 当归尾 珍珠母 麦芽 佛手
0.502826 0.387092 0.349628 0.49807 0.54024 0.376599 0.302332
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
164. 
patient tongue id: 05161920141572_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.423702 0.785187 0.424266 0.896089 0.576984 0.612656 0.394325 0.308849 0.327164 0.848123 0.873889 0.808394 0.861225 0.400921 0.9234 0.428417 0.597935 0.466717 0.65146
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
165. 
patient tongue id: 05231953508528_1_2
label yaofang:
茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.452357 0.859883 0.424344 0.928534 0.621608 0.672254 0.386492 0.306814 0.343606 0.894447 0.915767 0.850067 0.902914 0.361463 0.968614 0.462256 0.641523 0.4649 0.693828
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 1.000000, error: 0.368421
166. 
patient tongue id: 06191325531391_1_2
label yaofang:
甘草 茯苓 太子参 鸡血藤 白术 生地黄 浙贝母 山药 鳖甲 补骨脂 北沙参 白花蛇舌 蜂房 岗梅根 四季青
0.9736 0.539304 0.613042 0.375088 0.387974 0.316686 0.603485 0.504679 0.489502 0.416756 0.423099 0.420133
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
167. 
patient tongue id: 06141828152611_4
label yaofang:
甘草 桔梗 龙骨 牡蛎 酸枣仁 桑叶 山楂 射干 鸡内金 枇杷叶 苦杏仁 蝉蜕 紫苏叶
0.304335 0.332737 0.423032 0.362196 0.322123 0.301596 0.382426 0.31804 0.363179 0.322153 0.369434 0.432132 0.509555
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.153846, recall: 0.153846, error: 0.846154
168. 
patient tongue id: 04112211287244_1
label yaofang:
当归 茯苓 木香 龙骨 远志 黄芪 白术 酸枣仁 柏子仁 石菖蒲 仙鹤草 蝉蜕 炙甘草
0.316993 0.409105 0.31405 0.368889 0.329231 0.307875 0.301371 0.487739 0.565449
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
169. 
patient tongue id: 02020834411300_1_6
label yaofang:
甘草 白芍 陈皮 法半夏 茯苓 葛根 木香 蒲公英 党参 白术 山药 砂仁 柿蒂 麦芽
0.966646 0.516239 0.589657 0.355209 0.347715 0.306264 0.588463 0.477028 0.463937 0.393823 0.403164 0.407633
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
170. 
patient tongue id: 04282256596421_2_6
label yaofang:
甘草 茯苓 远志 党参 鸡血藤 白术 酸枣仁 赤芍 天麻 菟丝子 鳖甲 蜈蚣 天山雪莲 半枝莲 红豆杉
0.990872 0.553917 0.651278 0.350582 0.408889 0.322961 0.684116 0.58724 0.555965 0.486429 0.503795 0.506002
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
171. 
patient tongue id: 02120828090160_2_6
label yaofang:
甘草 柴胡 白芍 枳壳 党参 延胡索 浙贝母 山药 天麻 五灵脂 鳖甲 诃子 建曲 蜈蚣 白花蛇舌 天山雪莲
0.951818 0.51536 0.578466 0.379967 0.375519 0.314084 0.565842 0.477464 0.465191 0.39747 0.407651 0.408321
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
172. 
patient tongue id: 02151839406159_1_4
label yaofang:
甘草 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 香薷 紫菀 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.382943 0.592853 0.445923 0.687524 0.469216 0.511639 0.373403 0.317803 0.316767 0.332885 0.63805 0.653091 0.618895 0.664783 0.403155 0.730004 0.39257 0.488468 0.434937 0.528549
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.571429, error: 0.600000
173. 
patient tongue id: 03221302246306_2_1_6
label yaofang:
甘草 枳壳 茯苓 白术 山药 薤白 天麻 瓜蒌皮 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.991747 0.557765 0.635425 0.358426 0.376294 0.318398 0.666701 0.578708 0.549848 0.471233 0.48976 0.489676
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
174. 
patient tongue id: 03061502517284_1
label yaofang:
大枣 当归 茯苓 木香 远志 党参 黄芪 白术 柏子仁 白芷 蔓荆子 炙甘草
0.325609 0.313458 0.331721 0.344164 0.307141 0.329028 0.460352
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.714286, recall: 0.416667, error: 0.285714
175. 
patient tongue id: 03180107377514_1
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 天麻 白花蛇舌草 炙甘草 百合 紫苏叶
0.355476 0.32234 0.419364 0.311598 0.377777 0.323968 0.466203 0.538967
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
176. 
patient tongue id: 04131816268121_6
label yaofang:
甘草 白芍 桃仁 党参 丹参 生地黄 赤芍 青皮 郁金 天花粉 瓜蒌皮 莪术 王不留行 皂角刺 猫爪草
0.95584 0.525123 0.569062 0.365721 0.346208 0.552688 0.476773 0.460676 0.398778 0.39793 0.387612
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
177. 
patient tongue id: 01040009253578_7_5
label yaofang:
甘草 柴胡 枳壳 茯苓 远志 党参 白术 酸枣仁 赤芍 栀子 牡丹皮 郁金 淡豆豉 莪术 麦芽 首乌藤
0.993923 0.53218 0.618742 0.327429 0.677431 0.55339 0.535508 0.440104 0.458431 0.482416
predicted yaofang:
甘草 茯苓 党参 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
178. 
patient tongue id: 05262208395203_2_4
label yaofang:
甘草 川芎 前胡 桔梗 浙贝母 牛膝 钩藤 地黄 天麻 益母草 款冬花 麦芽 苦杏仁
0.964869 0.53102 0.589623 0.380283 0.377617 0.319145 0.583412 0.514787 0.492681 0.434432 0.440093 0.436425
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
179. 
patient tongue id: 02202247302805_5_6
label yaofang:
甘草 黄芩 法半夏 茯苓 薏苡仁 桃仁 远志 细辛 桑白皮 干姜 款冬花 苇茎 苦杏仁 紫苏子 辛夷 炙麻黄
0.967625 0.522951 0.589656 0.381473 0.372079 0.313666 0.586312 0.512352 0.498641 0.429088 0.442255 0.439395
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.125000, error: 0.833333
180. 
patient tongue id: 03012204468651_1_6_2
label yaofang:
甘草 茯苓 党参 白术 杜仲 山药 天麻 槐花 桑寄生 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.953148 0.528188 0.559672 0.359488 0.346406 0.319196 0.559073 0.491953 0.466632 0.418092 0.416119 0.400901
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
181. 
patient tongue id: 05172110352803_1_6
label yaofang:
甘草 川芎 龙骨 羌活 党参 酸枣仁 柏子仁 牛膝 地黄 天麻 全蝎 糯稻根 半枝莲 醋鳖甲
0.95988 0.530242 0.577805 0.36461 0.356103 0.311013 0.558813 0.480376 0.461368 0.401487 0.396109 0.382311
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
182. 
patient tongue id: 05182113274928_1_4
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.302218 0.368992 0.334879 0.384066 0.325031 0.394021 0.516217
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
183. 
patient tongue id: 06190153138023_1_4
label yaofang:
甘草 川芎 茯苓 独活 党参 白术 生地黄 红花 延胡索 牛膝 山药 菟丝子 桑寄生 益母草 秦艽 威灵仙
0.918624 0.494201 0.572662 0.334075 0.3554 0.534488 0.333052 0.353721
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
184. 
patient tongue id: 02281446049432_6
label yaofang:
枳壳 太子参 白术 柏子仁 黄连 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶 山慈菇
0.390764 0.317633 0.335916 0.397861 0.55864
predicted yaofang:
白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
185. 
patient tongue id: 02231746012860_2_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.40597 0.764704 0.427003 0.859889 0.548394 0.604985 0.36764 0.322241 0.805592 0.83556 0.766935 0.826591 0.372183 0.911866 0.425126 0.569511 0.458168 0.617162
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
186. 
patient tongue id: 04061954104522_1_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.311847 0.31174 0.311053 0.305135 0.397006 0.422471
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.166667, recall: 0.066667, error: 0.833333
187. 
patient tongue id: 02191429014241_4_6_1
label yaofang:
甘草 茯苓 薏苡仁 党参 山药 砂仁 天麻 鳖甲 扁豆花 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲
0.942107 0.508894 0.528252 0.406354 0.471492 0.397718 0.444545 0.322305 0.322361 0.306603
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.571429, error: 0.200000
188. 
patient tongue id: 05140848405914_6
label yaofang:
甘草 茯苓 薏苡仁 党参 鸡血藤 白术 酸枣仁 红花 天麻 桑寄生 鳖甲 续断 蜈蚣 天山雪莲 半枝莲
0.978626 0.538611 0.627954 0.352525 0.407647 0.315537 0.648039 0.533188 0.502717 0.444509 0.449927 0.455963
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
189. 
patient tongue id: 05201512412021_6_7_1
label yaofang:
甘草 茯苓 木香 薏苡仁 党参 赤芍 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 红豆杉 鱼古 瓦楞子 姜黄
0.953025 0.526732 0.559596 0.361613 0.333501 0.542612 0.457355 0.436079 0.377679 0.379369 0.368178
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
190. 
patient tongue id: 01211230117926_2_1_7
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 牡丹皮 干姜 天花粉 炙甘草 猫爪草 风栗壳 石见穿
0.42188 0.319188 0.349906 0.385719 0.34186 0.341233
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
191. 
patient tongue id: 03230722168819_6_5_2
label yaofang:
甘草 白芍 川芎 法半夏 茯苓 麦冬 白术 酸枣仁 生地黄 牡丹皮 苍术 天麻 僵蚕 磁石 蒺藜 浮小麦
0.907676 0.499234 0.501766 0.385359 0.418059 0.340261 0.372232
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
192. 
patient tongue id: 03302013477513_1_6
label yaofang:
甘草 茯苓 半夏 黄芪 白术 丹参 黄连 杜仲 郁金 僵蚕 莪术 麦芽 北沙参 紫苏叶 蜈蚣 合欢皮 预知子
0.447624 0.401978 0.333037 0.300673 0.554082 0.506316 0.430122 0.320972 0.305382 0.410997 0.331503
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.636364, recall: 0.411765, error: 0.363636
193. 
patient tongue id: 04282308231656_2_6
label yaofang:
甘草 白芍 茯苓 太子参 酸枣仁 知母 地黄 天麻 白花蛇舌草 浮小麦 首乌藤 建曲 蜈蚣 半枝莲 醋鳖甲
0.918256 0.492038 0.551129 0.354747 0.317925 0.503542 0.37493 0.388496 0.307669 0.306119
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
194. 
patient tongue id: 06111043050997_1_2
label yaofang:
甘草 木香 党参 丹参 五味子 山药 水蛭 砂仁 菟丝子 益母草 猪苓 茵陈 虎杖 麦芽
0.950181 0.520912 0.550957 0.37286 0.318797 0.530013 0.464833 0.457232 0.387508 0.385901 0.374433
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
195. 
patient tongue id: 05262217595901_4_1_6
label yaofang:
甘草 枳壳 法半夏 党参 郁金 薤白 砂仁 天麻 瓜蒌皮 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.967319 0.533038 0.585024 0.369629 0.355882 0.313214 0.580942 0.50648 0.485048 0.422973 0.428726 0.414655
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
196. 
patient tongue id: 03101740290818_2_4
label yaofang:
法半夏 茯苓 前胡 太子参 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 广藿香 麸炒白术 炒六神曲
0.392696 0.67402 0.427999 0.795222 0.495878 0.552758 0.388292 0.31603 0.738781 0.758617 0.706307 0.767485 0.426235 0.834103 0.405263 0.524904 0.440787 0.581002
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.785714, error: 0.388889
197. 
patient tongue id: 06111051532762_1_5
label yaofang:
甘草 防风 金银花 党参 黄芪 白术 五味子 红花 石膏 水牛角 荆芥穗 麦芽 白鲜皮 地肤子
0.947554 0.518647 0.564571 0.351504 0.329203 0.547328 0.462113 0.446781 0.389478 0.388244 0.375854
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
198. 
patient tongue id: 02202223187827_7_4
label yaofang:
甘草 川芎 茯苓 桔梗 桃仁 红花 赤芍 青蒿 五灵脂 银柴胡 决明子 浮小麦 建曲 威灵仙
0.950799 0.518264 0.565013 0.372973 0.347214 0.540125 0.421036 0.429995 0.33967 0.345018 0.341493
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
199. 
patient tongue id: 05242228238885_1_6_4
label yaofang:
甘草 法半夏 茯苓 羌活 党参 白术 酸枣仁 天麻 鳖甲 威灵仙 蜈蚣 天山雪莲 半枝莲 红豆杉
0.943587 0.31291 0.50474 0.570811 0.370577 0.329139 0.53584 0.437953 0.427899 0.361302 0.364533 0.351808
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
200. 
patient tongue id: 06191158228686_7_4
label yaofang:
甘草 川芎 桔梗 防风 羌活 白术 赤芍 浙贝母 牛膝 细辛 荆芥穗 天麻 白芷 蔓荆子 粉葛
0.977634 0.542011 0.618902 0.353587 0.397941 0.332575 0.633165 0.543197 0.502277 0.459585 0.462336 0.462313
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
201. 
patient tongue id: 03040852019318_6_1
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉
0.988579 0.554071 0.631506 0.352145 0.375787 0.312137 0.648859 0.558032 0.527701 0.452942 0.461469 0.463138
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.666667, error: 0.333333
202. 
patient tongue id: 06190800459646_4_1
label yaofang:
桂枝 甘草 白芍 川芎 党参 白术 红花 赤芍 地黄 僵蚕 桑寄生 桑枝 骨碎补 乌梢蛇 络石藤
0.950075 0.506962 0.528775 0.40054 0.3141 0.512852 0.453329 0.490086 0.38214 0.376973 0.390079
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
203. 
patient tongue id: 05222109198156_4_1_7
label yaofang:
陈皮 茯苓 半夏 牡蛎 黄芪 白术 丹参 砂仁 苦杏仁 合欢皮 牛大力 墨旱莲
0.490455 0.377947 0.330638 0.565052 0.55103 0.423139 0.307406 0.309864 0.306238
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.555556, recall: 0.416667, error: 0.444444
204. 
patient tongue id: 05272345494049_4_1_6
label yaofang:
黄芪 白术 砂仁 桑寄生 莲子 白鲜皮 续断 橘络 首乌藤 土鳖虫 红豆杉 合欢皮 山慈菇
0.485185 0.428055 0.346621 0.369076 0.385581
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
205. 
patient tongue id: 02131317268245_1_4_7
label yaofang:
甘草 柴胡 黄芩 法半夏 防风 金银花 薏苡仁 党参 白芷 白前 辛夷 干鱼腥草
0.844576 0.432541 0.529794 0.461933
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
206. 
patient tongue id: 01132142541437_1_6
label yaofang:
甘草 党参 生地黄 杜仲 山药 山茱萸 天麻 鳖甲 续断 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.924201 0.509318 0.535192 0.376543 0.324397 0.501093 0.409299 0.419831 0.340235 0.339422 0.333678
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
207. 
patient tongue id: 01192130569170_6_2_4
label yaofang:
甘草 葛根 党参 鸡血藤 赤芍 山药 天麻 吴茱萸 白花蛇舌草 建曲 蜈蚣 半枝莲 醋鳖甲 乌梢蛇
0.743433 0.459835 0.320877 0.435318 0.366854 0.474432 0.322757 0.30345 0.312572 0.375734
predicted yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 浙贝母 厚朴 天麻 蜈蚣

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
208. 
patient tongue id: 02211359023524_1_2_7
label yaofang:
甘草 麦冬 太子参 枸杞子 玄参 生地黄 牡丹皮 知母 山药 天麻 天花粉 北沙参 黄精
0.46357 0.395475 0.391243 0.510561 0.309311
predicted yaofang:
甘草 茯苓 党参 黄芪 牛膝

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
209. 
patient tongue id: 03101935570478_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.448816 0.850511 0.415645 0.922688 0.613184 0.685713 0.357711 0.3498 0.889573 0.907319 0.839325 0.895211 0.339691 0.961847 0.470116 0.645784 0.467621 0.672164
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
210. 
patient tongue id: 01122340349168_5_6
label yaofang:
甘草 川芎 茯苓 党参 黄连 生地黄 赤芍 川楝子 牛膝 细辛 天麻 僵蚕 白芷 桑寄生 益母草
0.951671 0.516165 0.542049 0.372695 0.306404 0.527559 0.44627 0.446025 0.361146 0.362202 0.345767
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
211. 
patient tongue id: 02241428006805_4_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草
0.323846 0.380036 0.316941 0.342894 0.343363 0.544724
predicted yaofang:
甘草 白芍 茯苓 党参 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
212. 
patient tongue id: 04282219396447_2_5
label yaofang:
甘草 柴胡 白芍 茯苓 桃仁 党参 栀子 牡丹皮 山药 山茱萸 鳖甲 茵陈 虎杖 土鳖虫 鹿衔草
0.924175 0.489774 0.534575 0.319362 0.483904 0.334344 0.346982
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
213. 
patient tongue id: 06070640249717_5_6
label yaofang:
甘草 柴胡 白芍 龙骨 薏苡仁 远志 黄连 天麻 鳖甲 浮小麦 蜈蚣 天山雪莲 合欢花 半枝莲 广金钱草
0.881174 0.300389 0.490064 0.525028 0.378834 0.304225 0.457791 0.378242 0.39473 0.31699 0.310252
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
214. 
patient tongue id: 05140835033106_6_2_1
label yaofang:
甘草 川芎 远志 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.991888 0.558105 0.646211 0.344513 0.397139 0.309408 0.690761 0.601015 0.564008 0.493163 0.511699 0.515973
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
215. 
patient tongue id: 05222049530901_7_5_1
label yaofang:
甘草 黄芪 白术 海螵蛸 砂仁 三七 桑寄生 火麻仁 鸡内金 北沙参 首乌藤 紫苏梗 瓦楞子 合欢皮
0.478727 0.398246 0.325298 0.566182 0.512031 0.434555 0.319225 0.313934 0.374655 0.328432
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
216. 
patient tongue id: 04201952394364_1_2
label yaofang:
甘草 防风 金银花 红花 水牛角 荆芥穗 天麻 鳖甲 火麻仁 麦芽 白鲜皮 地肤子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.982385 0.54326 0.616806 0.354011 0.384625 0.311521 0.637619 0.552748 0.528427 0.464358 0.473296 0.474627
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
217. 
patient tongue id: 03200652043789_4
label yaofang:
甘草 法半夏 茯苓 薏苡仁 细辛 天麻 款冬花 莪术 诃子 白花蛇舌草 地龙 紫苏梗 蜈蚣 醋鳖甲
0.967826 0.531512 0.579322 0.375208 0.362236 0.302156 0.58814 0.521957 0.516573 0.440619 0.444467 0.441012
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
218. 
patient tongue id: 03151942236274_1_4_2
label yaofang:
桂枝 当归 薏苡仁 黄芪 鸡血藤 白术 海螵蛸 厚朴 生半夏 砂仁 鸡内金 土茯苓 稻芽 红参
0.541981 0.409664 0.361562 0.550233 0.495525 0.435733 0.300958 0.307959 0.338198
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
219. 
patient tongue id: 04072001175511_5
label yaofang:
白芍 龙齿 麦冬 太子参 枸杞子 酸枣仁 升麻 野菊花 决明子 珍珠母 夏枯草 百合 五指毛桃
0.815087 0.437002 0.518295 0.356353 0.411723
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
220. 
patient tongue id: 05131434370866_4_6
label yaofang:
甘草 法半夏 桔梗 桃仁 鱼腥草 远志 浙贝母 细辛 天麻 鳖甲 款冬花 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.831689 0.465315 0.536644 0.309392 0.347542 0.481192
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
221. 
patient tongue id: 03020722409937_1_7
label yaofang:
甘草 黄芪 酸枣仁 红花 赤芍 山楂 天麻 肉苁蓉 桑寄生 麦芽 地龙 谷芽 乌梢蛇 炒鸡内金
0.960623 0.518022 0.571645 0.402 0.352777 0.556683 0.47618 0.495816 0.394502 0.398218 0.39355
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
222. 
patient tongue id: 05112027139116_1_5_7
label yaofang:
牡蛎 薏苡仁 黄芪 白术 黄连 赤芍 郁金 砂仁 茵陈 莪术 鸡内金 红豆杉 预知子 稻芽
0.390571 0.378793 0.481886 0.444377 0.321242 0.326054
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 北沙参

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
223. 
patient tongue id: 05032112400317_1_4_6
label yaofang:
陈皮 桔梗 太子参 鸡血藤 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 葫芦茶
0.451342 0.373416 0.337812 0.415057 0.345096 0.377656
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
224. 
patient tongue id: 04300900263194_5
label yaofang:
甘草 荆芥 金银花 蒲公英 紫花地丁 白术 丹参 浙贝母 地黄 紫草 麦芽 皂角刺 白鲜皮 地肤子
0.979896 0.514118 0.612179 0.382639 0.376823 0.617863 0.515082 0.521061 0.418707 0.432307 0.456155
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
225. 
patient tongue id: 05161932161591_1_4
label yaofang:
陈皮 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香 蜜麻黄
0.395321 0.680813 0.43351 0.791558 0.511556 0.559459 0.39023 0.311939 0.311384 0.331243 0.737563 0.760072 0.705046 0.764155 0.412624 0.838028 0.416754 0.530427 0.451142 0.591153
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
226. 
patient tongue id: 03012057254423_5_6
label yaofang:
甘草 陈皮 法半夏 茯苓 远志 党参 酸枣仁 丹参 黄连 胆南星 石菖蒲 天麻 地龙 首乌藤
0.980282 0.531729 0.612982 0.366839 0.389725 0.303806 0.629163 0.552348 0.539434 0.465013 0.470389 0.479707
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
227. 
patient tongue id: 04121300101271_4
label yaofang:
陈皮 法半夏 前胡 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.414321 0.78539 0.424089 0.858292 0.567239 0.59912 0.363627 0.304663 0.316427 0.333861 0.817053 0.848231 0.767588 0.826348 0.340794 0.932566 0.422227 0.574707 0.419163 0.621301
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 1.000000, error: 0.350000
228. 
patient tongue id: 03311619563889_6_7
label yaofang:
甘草 半夏 橘红 牡蛎 薏苡仁 党参 白术 浙贝母 鸡内金 浮小麦 黑枣 合欢皮 墨旱莲
0.419644 0.382953 0.372631 0.365376 0.360677
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
229. 
patient tongue id: 02110746413439_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.472923 0.404706 0.364859 0.359782 0.358731
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
230. 
patient tongue id: 05111924494952_2
label yaofang:
枸杞子 白术 丹参 赤芍 浙贝母 牡丹皮 山药 厚朴 山楂 砂仁 天麻 僵蚕 北沙参 炙甘草 百合 紫苏叶 合欢皮 蛇舌草 岗梅
0.404945 0.340024 0.385384 0.656827 0.611541 0.343605 0.320399 0.539626 0.370214 0.360127 0.420503 0.446628
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.416667, recall: 0.263158, error: 0.583333
231. 
patient tongue id: 03221615435248_6_5
label yaofang:
麻黄 甘草 陈皮 法半夏 茯苓 桃仁 黄柏 桑白皮 厚朴 款冬花 射干 地龙 苦杏仁 紫苏子 五倍子 紫苏梗
0.981867 0.550964 0.607753 0.355287 0.360317 0.31123 0.611789 0.529147 0.499938 0.434123 0.437327 0.428716
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.125000, error: 0.833333
232. 
patient tongue id: 02142337588099_8_5
label yaofang:
甘草 防风 金银花 白术 红花 牡丹皮 水牛角 荆芥穗 火麻仁 百部 麦芽 白鲜皮 地肤子
0.96192 0.534551 0.564794 0.364095 0.351323 0.31062 0.565333 0.492769 0.476165 0.414706 0.412789 0.404808
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
233. 
patient tongue id: 01172354588540_1_2
label yaofang:
茯苓 薏苡仁 党参 黄芪 杜仲 山药 巴戟天 芡实 莲子
0.443049 0.438143 0.433147 0.346922 0.344346 0.395048 0.422509 0.342096 0.377657 0.331907 0.55339 0.307275
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香

------Score: precision: 0.083333, recall: 0.111111, error: 0.916667
234. 
patient tongue id: 04150711552399_4_7_6
label yaofang:
甘草 川芎 茯苓 薏苡仁 党参 黄连 生地黄 赤芍 山药 补骨脂 浮小麦 白花蛇舌 土鳖虫
0.845013 0.44671 0.511926 0.343974 0.395007
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
235. 
patient tongue id: 04192234395911_6_2
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 天麻 鳖甲 款冬花 白前 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.968472 0.524405 0.592684 0.376131 0.353873 0.300642 0.569126 0.493264 0.481003 0.407702 0.410398 0.406806
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
236. 
patient tongue id: 04300909341453_5
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 黄连 苍术 山药 厚朴 菟丝子 益母草 豆蔻 合欢花 麸炒枳壳
0.95693 0.524186 0.570477 0.376056 0.349659 0.302585 0.556904 0.492455 0.471281 0.415879 0.417031 0.408144
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
237. 
patient tongue id: 02252115452588_5_6
label yaofang:
甘草 枳壳 薏苡仁 蒲公英 白术 厚朴 天麻 鳖甲 补骨脂 三棱 蜈蚣 天山雪莲 半枝莲 红豆杉
0.932612 0.496457 0.529229 0.397079 0.309894 0.485426 0.407571 0.434063 0.321022 0.327846 0.32913
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
238. 
patient tongue id: 03061506533188_6
label yaofang:
甘草 柴胡 川芎 香附 防风 赤芍 荆芥穗 白芷 蔓荆子 续断 郁李仁 芥子
0.351793 0.330481 0.326177 0.306638 0.377355 0.531214
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
239. 
patient tongue id: 06191151002359_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 桃仁 远志 五味子 浙贝母 细辛 干姜 款冬花 苦杏仁 炙麻黄
0.950146 0.523015 0.560463 0.401895 0.362469 0.30394 0.559538 0.492194 0.494005 0.411738 0.419652 0.416188
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
240. 
patient tongue id: 05032116526318_1_2
label yaofang:
白芍 川芎 葛根 独活 黄芪 细辛 干姜 川牛膝 炙甘草 蜈蚣 姜黄 海桐皮 鹿衔草
0.725015 0.368997 0.380182 0.462539 0.333204
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
241. 
patient tongue id: 04131849529759_1_7
label yaofang:
甘草 枳壳 茯苓 龙骨 薏苡仁 黄芪 白术 黄连 海螵蛸 杜仲 泽泻 厚朴 莪术 麦芽 合欢皮 蛇舌草 荔枝核
0.709214 0.453305 0.419959 0.39079 0.433065
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.235294, error: 0.200000
242. 
patient tongue id: 06091956252385_1_4_6
label yaofang:
甘草 半夏 牡蛎 黄芪 阿胶 白术 海螵蛸 杜仲 牛膝 山药 菊花 白茅根 芡实 鸡内金 北沙参 百合 紫苏梗 玉米须 蜈蚣 骨碎补 红豆杉 预知子
0.491991 0.36037 0.386028 0.383516 0.447464
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.136364, error: 0.400000
243. 
patient tongue id: 02191255253650_4_6
label yaofang:
甘草 黄芩 前胡 桔梗 浙贝母 细辛 天麻 鳖甲 白前 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.955423 0.519864 0.582536 0.385008 0.388292 0.324526 0.301536 0.591528 0.503654 0.492259 0.430475 0.436981 0.437301
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
244. 
patient tongue id: 06072249163764_1_4
label yaofang:
甘草 桔梗 独活 芦根 薏苡仁 白术 浙贝母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.973054 0.527362 0.597841 0.368092 0.368664 0.317483 0.603943 0.51958 0.506144 0.436719 0.447017 0.454365
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
245. 
patient tongue id: 03231117500690_2_7_4
label yaofang:
甘草 枳壳 法半夏 大枣 茯苓 连翘 薏苡仁 葶苈子 细辛 桑白皮 莱菔子 款冬花 白芥子 苇茎 苦杏仁 紫苏子
0.879549 0.476455 0.471015 0.317718 0.503616 0.34738 0.434117
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.125000, error: 0.714286
246. 
patient tongue id: 06031048391762_1_7_6
label yaofang:
甘草 茯苓 前胡 金银花 远志 浙贝母 细辛 天麻 鳖甲 款冬花 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.97144 0.53889 0.591186 0.353256 0.36077 0.322489 0.594898 0.511342 0.480201 0.430196 0.426604 0.422489
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
247. 
patient tongue id: 05131555385714_1_2_5
label yaofang:
甘草 柴胡 当归 薏苡仁 党参 黄芪 红花 赤芍 熟地黄 天麻 败酱草 皂角刺 女贞子 广升麻 墨旱莲
0.842253 0.480258 0.477163 0.399258 0.392653 0.340226
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
248. 
patient tongue id: 03230725352245_6_2_7
label yaofang:
甘草 柴胡 白芍 香附 木香 生地黄 延胡索 赤芍 山药 砂仁 天花粉 五灵脂 瓜蒌皮 麦芽 皂角刺 合欢花
0.97076 0.531405 0.581569 0.364977 0.344982 0.579683 0.506028 0.495794 0.421126 0.423141 0.415405
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.062500, error: 0.909091
249. 
patient tongue id: 01192218022805_7_1
label yaofang:
甘草 牡丹皮 杜仲 黄柏 知母 山茱萸 地黄 天麻 桑寄生 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 骨碎补
0.684035 0.385432 0.35749 0.381649
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
250. 
patient tongue id: 04102037040759_6
label yaofang:
甘草 枳壳 桔梗 黄芪 白术 枳实 槟榔 厚朴 肉苁蓉 火麻仁 紫菀 郁李仁
0.467737 0.331186 0.360301 0.405298 0.35092 0.302999
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
251. 
patient tongue id: 06171152162574_4
label yaofang:
麻黄 白芍 前胡 半夏 防风 太子参 黄芪 白术 细辛 干姜 紫菀 紫苏子 炙甘草 辛夷 广藿香
0.404549 0.762186 0.443099 0.85795 0.546953 0.588787 0.384202 0.330597 0.807794 0.829181 0.764144 0.821351 0.389675 0.897045 0.415119 0.568255 0.454912 0.624489
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.388889, recall: 0.466667, error: 0.611111
252. 
patient tongue id: 02111346154633_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 黄精
0.529089 0.309494 0.369302 0.41205 0.400283
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
253. 
patient tongue id: 03012048349617_2
label yaofang:
甘草 麦冬 太子参 生地黄 浙贝母 山药 山茱萸 鳖甲 辛夷 苍耳子 白花蛇舌 天山雪莲 蜂房 四季青
0.968177 0.531702 0.583741 0.374708 0.3665 0.326099 0.301086 0.593642 0.51885 0.499435 0.435595 0.445271 0.437038
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
254. 
patient tongue id: 01051903009901_1_5
label yaofang:
法半夏 前胡 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.343292 0.505854 0.450799 0.549916 0.399897 0.436786 0.353822 0.337962 0.498593 0.512583 0.500704 0.540613 0.418237 0.612645 0.346317 0.399754 0.352138 0.418811
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.800000, error: 0.333333
255. 
patient tongue id: 03221323433079_6_4
label yaofang:
甘草 法半夏 茯苓 桔梗 远志 浙贝母 天麻 鳖甲 扁豆花 诃子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 木棉花
0.982803 0.543147 0.611103 0.366241 0.368748 0.31351 0.617696 0.539889 0.513755 0.448061 0.45766 0.452713
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
256. 
patient tongue id: 05162045203884_5_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 黄柏 郁金 山药 厚朴 砂仁 豆蔻 苦杏仁 紫苏梗 广藿香 白花蛇舌
0.961663 0.526743 0.581933 0.38265 0.381037 0.325532 0.307044 0.578284 0.513615 0.497105 0.439741 0.444128 0.436793
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
257. 
patient tongue id: 02212215372723_1_6
label yaofang:
甘草 独活 党参 白术 杜仲 细辛 地黄 天麻 桑寄生 忍冬藤 续断 蜈蚣 半枝莲 醋鳖甲
0.975191 0.539003 0.575322 0.321099 0.32955 0.305816 0.605601 0.504411 0.466627 0.411946 0.418899 0.412154
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
258. 
patient tongue id: 04291506135523_6_4_2
label yaofang:
甘草 茯苓 龙骨 远志 酸枣仁 知母 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.979672 0.533051 0.60883 0.356747 0.381152 0.309664 0.627832 0.546071 0.524399 0.459189 0.46875 0.475293
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
259. 
patient tongue id: 04210356231584_2_6_4
label yaofang:
甘草 法半夏 茯苓 前胡 桃仁 酸枣仁 浙贝母 细辛 天麻 白花蛇舌草 苦杏仁 蜈蚣 半枝莲 醋鳖甲
0.95322 0.514008 0.558553 0.373383 0.337548 0.55191 0.474403 0.47309 0.401805 0.402415 0.401364
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
260. 
patient tongue id: 01101812305293_2
label yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.378236 0.648062 0.447121 0.724286 0.493397 0.546897 0.367866 0.307058 0.340511 0.683512 0.698697 0.657538 0.70847 0.38137 0.794642 0.400662 0.515378 0.432726 0.558901
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
261. 
patient tongue id: 03151859004925_6_1
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 瓦楞子
0.342281 0.400115 0.31011 0.339876 0.328883 0.382616 0.548483
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
262. 
patient tongue id: 06071922405605_6_7
label yaofang:
甘草 黄芩 半夏 枸杞子 生地黄 红花 赤芍 海螵蛸 牡丹皮 杜仲 莪术 续断 赭石
0.458266 0.397224 0.423241 0.474817 0.303118 0.300899
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 北沙参

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
263. 
patient tongue id: 04131845026619_1_7
label yaofang:
甘草 半夏 木香 龙骨 薏苡仁 白术 赤芍 海螵蛸 杜仲 郁金 厚朴 砂仁 莪术 续断 合欢皮 预知子 蛇舌草
0.539059 0.394437 0.336609 0.548677 0.574172 0.435547 0.331828 0.325868 0.316439
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.555556, recall: 0.294118, error: 0.444444
264. 
patient tongue id: 02241439135245_4
label yaofang:
甘草 防风 何首乌 熟地黄 牡丹皮 乌梅 珍珠母 蝉蜕 白鲜皮 地肤子 徐长卿
0.769415 0.367932 0.412701 0.500695 0.369384 0.381765
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
265. 
patient tongue id: 02120809383432_1_4
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 酸枣仁 知母 郁金 山药 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲
0.924311 0.49407 0.502255 0.404849 0.440979 0.377542 0.428198
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.857143, recall: 0.400000, error: 0.142857
266. 
patient tongue id: 04111958094040_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.44716 0.816333 0.420524 0.901111 0.588508 0.652953 0.398521 0.306517 0.325499 0.359657 0.86136 0.888197 0.816603 0.871472 0.384393 0.952446 0.475134 0.619838 0.468837 0.665343
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.923077, error: 0.400000
267. 
patient tongue id: 03151816189692_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.509151 0.393647 0.398521 0.536925 0.346984 0.314298 0.34483
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝 厚朴

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
268. 
patient tongue id: 06181858106239_5
label yaofang:
甘草 党参 白术 红花 杜仲 天麻 桑寄生 鳖甲 忍冬藤 蜈蚣 天山雪莲 半枝莲 牛大力 千斤拔
0.838679 0.475618 0.49473 0.345084 0.409774
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
269. 
patient tongue id: 03152048311128_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.433531 0.375387 0.365186 0.436199 0.504289 0.403942 0.317417 0.402041 0.305398 0.351636 0.312886 0.372845 0.306298 0.336385 0.363226 0.359586
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.250000, recall: 0.307692, error: 0.750000
270. 
patient tongue id: 05140635035940_1_2_6
label yaofang:
甘草 白芍 太子参 生地黄 红花 赤芍 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤
0.962982 0.513919 0.588815 0.362245 0.344597 0.305051 0.572821 0.459005 0.458579 0.379234 0.385742 0.387348
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
271. 
patient tongue id: 06181852205852_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 连翘 党参 黄芪 白术 黄连 乌梅 山药 车前子 干姜 莱菔子 白扁豆 建曲 广升麻
0.956918 0.530383 0.535804 0.393894 0.306052 0.498206 0.457036 0.476285 0.377888 0.366698 0.357835
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.222222, error: 0.636364
272. 
patient tongue id: 03020842548696_1_6
label yaofang:
甘草 远志 党参 酸枣仁 天麻 秦艽 鳖甲 白花蛇舌草 浮小麦 蜈蚣 天山雪莲 半枝莲 龟甲
0.982465 0.542318 0.610917 0.364878 0.382056 0.317421 0.632878 0.555763 0.532893 0.467328 0.47464 0.478839
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.615385, error: 0.333333
273. 
patient tongue id: 02191437207816_5_6_7
label yaofang:
甘草 黄芩 茯苓 桔梗 牛蒡子 桃仁 白术 酸枣仁 玄参 浙贝母 牡丹皮 菟丝子 益母草 威灵仙
0.994482 0.556631 0.670452 0.360028 0.416075 0.331417 0.709297 0.608524 0.585643 0.493904 0.522239 0.535379
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
274. 
patient tongue id: 04200046451932_6_2
label yaofang:
甘草 白芍 陈皮 木香 防风 连翘 党参 白术 山药 车前子 白扁豆 粉葛 建曲
0.929336 0.50142 0.546303 0.393842 0.334614 0.513536 0.450123 0.45654 0.37593 0.377558 0.36867
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
275. 
patient tongue id: 02171855235107_4
label yaofang:
甘草 防风 黄芪 细辛 荆芥穗 白芷 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术
0.429914 0.826331 0.428415 0.905183 0.586074 0.633735 0.377611 0.325546 0.861537 0.887048 0.816109 0.873048 0.363634 0.951179 0.438599 0.605401 0.463134 0.660761
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.222222, recall: 0.363636, error: 0.777778
276. 
patient tongue id: 02120813557638_1_7
label yaofang:
甘草 独活 党参 延胡索 杜仲 地黄 天麻 桑寄生 白花蛇舌草 威灵仙 蜈蚣 半枝莲 醋鳖甲 骨碎补 牛大力
0.924258 0.506563 0.469425 0.327155 0.390746 0.315352
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
277. 
patient tongue id: 04201850139171_1_2_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.40276 0.68841 0.442678 0.793011 0.519668 0.558627 0.390819 0.312279 0.310749 0.333223 0.742403 0.761352 0.702314 0.760255 0.397561 0.852652 0.412689 0.534575 0.443489 0.577647
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
278. 
patient tongue id: 03101847268894_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 干姜 豆蔻 姜半夏 炙甘草 紫苏梗
0.368001 0.342322 0.342625 0.348939 0.355486 0.447269
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
279. 
patient tongue id: 03292043443064_1_4
label yaofang:
陈皮 前胡 半夏 防风 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香 苍耳子
0.404111 0.681109 0.435924 0.764906 0.505382 0.540128 0.375766 0.316598 0.321343 0.329619 0.7139 0.742158 0.67784 0.730779 0.37412 0.844057 0.406191 0.515064 0.43989 0.562647
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
280. 
patient tongue id: 04201858525959_4
label yaofang:
陈皮 茯苓 前胡 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄
0.42211 0.751349 0.432574 0.854049 0.550198 0.585214 0.389385 0.315297 0.316173 0.33352 0.799133 0.827643 0.761916 0.817832 0.38381 0.907652 0.425506 0.559708 0.442646 0.618781
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 1.000000, error: 0.400000
281. 
patient tongue id: 04172212191990_6_2
label yaofang:
陈皮 枳壳 茯苓 党参 黄芪 白术 砂仁 莱菔子 鸡内金 佛手 紫苏梗
0.467935 0.374965 0.394452 0.321133 0.358874
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.363636, error: 0.200000
282. 
patient tongue id: 05032256029190_7_1
label yaofang:
甘草 党参 生地黄 延胡索 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力 千斤拔
0.995804 0.565178 0.67526 0.342991 0.400299 0.30185 0.728059 0.619891 0.596017 0.504968 0.525832 0.54914
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
283. 
patient tongue id: 03231102369038_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.465885 0.895884 0.392356 0.957805 0.653504 0.723836 0.371964 0.347473 0.93176 0.949703 0.895434 0.93941 0.347331 0.983944 0.479051 0.692194 0.471595 0.733164
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.800000, error: 0.333333
284. 
patient tongue id: 01111904284190_1_4
label yaofang:
甘草 陈皮 茯苓 佩兰 豆蔻 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶 炒稻芽 炒麦芽
0.413929 0.784896 0.437812 0.878889 0.566646 0.619782 0.362339 0.33991 0.831025 0.844371 0.787851 0.848603 0.380802 0.904735 0.429221 0.583441 0.462068 0.639705
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.166667, recall: 0.230769, error: 0.833333
285. 
patient tongue id: 04221843524752_1
label yaofang:
白芍 川芎 大枣 当归 党参 太子参 黄芪 枸杞子 熟地黄 炙甘草 续断 麸炒白术 盐菟丝子 酒女贞子
0.443531 0.841789 0.4194 0.929468 0.610618 0.67532 0.385439 0.304508 0.304193 0.357236 0.892703 0.910202 0.848985 0.903365 0.387552 0.952776 0.476447 0.644713 0.485096 0.684429
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.142857, error: 0.900000
286. 
patient tongue id: 02191221430931_4_1
label yaofang:
甘草 茯苓 党参 白术 丹参 天麻 鳖甲 补骨脂 扁豆花 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.819423 0.478467 0.45028 0.353574 0.361247
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 1.000000, recall: 0.357143, error: 0.000000
287. 
patient tongue id: 04192241350389_2_6
label yaofang:
甘草 香附 党参 酸枣仁 丹参 青皮 浙贝母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.970495 0.536038 0.574132 0.348946 0.318254 0.563786 0.488005 0.469216 0.40069 0.400412 0.3859
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
288. 
patient tongue id: 01092042185837_6_4
label yaofang:
甘草 独活 酸枣仁 生地黄 杜仲 山药 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜
0.935142 0.502964 0.522352 0.405571 0.306282 0.486809 0.38963 0.448694 0.317478 0.322028 0.310096
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
289. 
patient tongue id: 01041641519556_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗
0.417785 0.374398 0.347293 0.331836 0.397926 0.315544
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.166667, recall: 0.111111, error: 0.833333
290. 
patient tongue id: 02120937134578_6
label yaofang:
甘草 柴胡 白芍 黄芩 当归 茯苓 党参 白术 丹参 熟地黄 益母草 淫羊藿 合欢花 麸炒枳壳
0.942828 0.31898 0.494845 0.551599 0.358246 0.301933 0.521766 0.415195 0.420906 0.342901 0.344611 0.336882
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
291. 
patient tongue id: 02201305480823_6
label yaofang:
桂枝 川芎 葛根 独活 赤芍 海螵蛸 细辛 川牛膝 炙甘草 蜈蚣 姜黄 海桐皮 鹿衔草
0.534486 0.390611 0.367336 0.405613 0.344935 0.354279
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
292. 
patient tongue id: 04260311123007_2_6
label yaofang:
甘草 党参 丹参 生地黄 浙贝母 郁金 山茱萸 天花粉 瓜蒌皮 款冬花 紫菀 王不留行 枇杷叶 苦杏仁
0.96773 0.535314 0.592527 0.366909 0.379302 0.314593 0.599915 0.524001 0.497043 0.445092 0.447644 0.449127
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
293. 
patient tongue id: 05102017330846_1
label yaofang:
陈皮 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.418727 0.832677 0.423243 0.918354 0.587464 0.658126 0.389914 0.33013 0.877473 0.901448 0.83237 0.889656 0.394724 0.957623 0.452647 0.622398 0.46265 0.676137
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.916667, error: 0.388889
294. 
patient tongue id: 01200658109438_1_2_4
label yaofang:
甘草 前胡 桔梗 浙贝母 细辛 天麻 鳖甲 款冬花 白前 诃子 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.980291 0.534073 0.594486 0.386271 0.372601 0.316738 0.606687 0.533598 0.533686 0.440188 0.45652 0.458932
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
295. 
patient tongue id: 05022101393382_6_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 黄连 胆南星 牛膝 山药 细辛 瓜蒌皮 王不留行 麸炒枳壳
0.942862 0.301859 0.505874 0.562061 0.37272 0.336379 0.30245 0.534416 0.434489 0.434361 0.359188 0.363972 0.357832
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
296. 
patient tongue id: 02122229191206_6_7
label yaofang:
甘草 川芎 远志 赤芍 牛膝 山茱萸 细辛 天麻 全蝎 菟丝子 莪术 金樱子 蛇床子 麦芽 覆盆子
0.971571 0.529003 0.580422 0.385745 0.365962 0.303385 0.57977 0.508566 0.50741 0.427176 0.433247 0.42836
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
297. 
patient tongue id: 04130904167793_2_4
label yaofang:
甘草 茯苓 桔梗 橘红 太子参 浙贝母 山药 鳖甲 紫菀 白花蛇舌 蜂房 岗梅根 四季青
0.952756 0.523171 0.58032 0.378818 0.370559 0.313626 0.569777 0.49689 0.480818 0.423287 0.430541 0.425088
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
298. 
patient tongue id: 02130104036462_1_2_6
label yaofang:
甘草 白芍 陈皮 木香 防风 白术 黄连 天麻 鳖甲 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.924054 0.498309 0.516027 0.408493 0.465431 0.384665 0.440763 0.306134 0.310289 0.301759
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
299. 
patient tongue id: 01041852042791_9
label yaofang:
柴胡 白芍 川芎 黄芩 当归 枳实 石膏 杏仁 细辛 干姜 大黄 生地 滑石 川朴 法夏
0.399171 0.399173 0.515694 0.46301 0.303916 0.350755 0.371896
predicted yaofang:
甘草 茯苓 黄芪 白术 海螵蛸 厚朴 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
300. 
patient tongue id: 02272217029894_4_6
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 白花蛇舌草 麦芽 百合 紫苏叶 独脚金 山慈菇
0.405137 0.358214 0.336597 0.324676 0.340555
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
301. 
patient tongue id: 03081838101446_4
label yaofang:
麻黄 陈皮 前胡 半夏 防风 细辛 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.396882 0.704516 0.436789 0.789581 0.511121 0.567167 0.373923 0.301059 0.341162 0.74068 0.75738 0.699004 0.759248 0.381758 0.842481 0.413559 0.53863 0.457814 0.58923
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
302. 
patient tongue id: 03100007485193_5
label yaofang:
甘草 黄芩 荆芥 金银花 连翘 蒲公英 紫花地丁 白术 红花 牡丹皮 地黄 紫草 麦芽 皂角刺 白鲜皮
0.909759 0.494475 0.503151 0.406204 0.438918 0.338043 0.408799
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.133333, error: 0.714286
303. 
patient tongue id: 03261709381039_2
label yaofang:
甘草 桔梗 连翘 薄荷 芦根 桑叶 菊花 苦杏仁 板蓝根 四季青
0.40565 0.380951 0.360389 0.387318 0.36087
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
304. 
patient tongue id: 02191405243852_1_4
label yaofang:
茯苓 太子参 黄芪 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 炙甘草 制远志 酒女贞子 墨旱莲 煅龙骨 炒酸枣仁 干益母草
0.448733 0.849886 0.418443 0.928565 0.61585 0.677105 0.373155 0.359355 0.893318 0.90866 0.850899 0.902629 0.371148 0.956647 0.470426 0.641988 0.479818 0.687904
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.222222, recall: 0.250000, error: 0.777778
305. 
patient tongue id: 04130049495240_6_1
label yaofang:
甘草 党参 丹参 生地黄 杜仲 天麻 桑寄生 鳖甲 补骨脂 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.916648 0.48823 0.528587 0.452365 0.306236 0.461899 0.392144 0.459508 0.318009 0.328165 0.335338
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
306. 
patient tongue id: 05030818564159_1_4
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.423557 0.374753 0.380868 0.306104 0.422719 0.515896 0.413254 0.324799 0.416162 0.331407 0.364818 0.313564 0.407164 0.316102 0.363163 0.393953 0.389693
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.235294, recall: 0.333333, error: 0.764706
307. 
patient tongue id: 03232300296240_1_7
label yaofang:
甘草 白芍 川芎 法半夏 茯苓 党参 枸杞子 白术 黄连 生地黄 牛膝 天麻 麦芽 首乌藤
0.979699 0.543465 0.602298 0.369345 0.38028 0.32458 0.620678 0.549065 0.526554 0.459382 0.471234 0.474213
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
308. 
patient tongue id: 03310927377008_4
label yaofang:
法半夏 前胡 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.447481 0.834724 0.422993 0.906487 0.599756 0.644366 0.375772 0.303576 0.320082 0.354927 0.869506 0.89505 0.821368 0.879801 0.350409 0.958188 0.454194 0.625072 0.454582 0.672873
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
309. 
patient tongue id: 05221923039529_1
label yaofang:
陈皮 法半夏 大枣 茯苓 桔梗 牛蒡子 白术 大腹皮 厚朴 白芷 炙甘草 紫苏叶 广藿香 徐长卿
0.37498 0.339603 0.31033 0.453162 0.562508
predicted yaofang:
白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
310. 
patient tongue id: 05232043293154_1_4_7
label yaofang:
甘草 陈皮 当归 茯苓 半夏 党参 枸杞子 白术 杜仲 牛膝 山药 厚朴 菟丝子 鸡内金 紫苏叶 骨碎补 红豆杉
0.583308 0.426844 0.394964 0.373309 0.38916
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.235294, error: 0.200000
311. 
patient tongue id: 05181347264083_2_6
label yaofang:
甘草 白芍 茯苓 龙骨 远志 党参 酸枣仁 生地黄 知母 麦芽 女贞子 首乌藤
0.889292 0.466781 0.483802 0.408527 0.378913 0.365675
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
312. 
patient tongue id: 01140853111671_1_6
label yaofang:
甘草 白术 生地黄 杜仲 山药 山茱萸 天麻 鳖甲 火麻仁 补骨脂 蜈蚣 天山雪莲 半枝莲 红豆杉
0.919656 0.500109 0.529021 0.389516 0.313013 0.487342 0.39019 0.419533 0.325278 0.322489 0.323307
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
313. 
patient tongue id: 05022113227397_6_4
label yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 郁金 鳖甲 苦杏仁 浮小麦 白花蛇舌 天山雪莲 合欢花 猫爪草
0.986119 0.552887 0.629044 0.352879 0.406368 0.326289 0.66953 0.577791 0.545195 0.487282 0.499621 0.5037
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
314. 
patient tongue id: 06190753330257_1_4
label yaofang:
甘草 薏苡仁 党参 鸡血藤 赤芍 杜仲 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.968265 0.526969 0.607237 0.380308 0.403597 0.321541 0.301556 0.61521 0.519178 0.50478 0.43736 0.446282 0.445842
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
315. 
patient tongue id: 03261556438389_4
label yaofang:
甘草 柴胡 白芍 当归 茯苓 龙骨 牡蛎 白术 酸枣仁 磁石 珍珠母 炙甘草 浮小麦 黑枣
0.530486 0.393035 0.352205 0.452322 0.498148 0.329807
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
316. 
patient tongue id: 04192225428001_1_6
label yaofang:
甘草 法半夏 茯苓 龙骨 党参 酸枣仁 丹参 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.96763 0.533458 0.583201 0.364887 0.364971 0.310764 0.588358 0.503845 0.481941 0.421089 0.425227 0.41384
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
317. 
patient tongue id: 02181626041591_2_1
label yaofang:
甘草 枳壳 防风 生地黄 茜草 天麻 地榆 槐花 鳖甲 火麻仁 五倍子 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.967685 0.520923 0.57285 0.380031 0.350772 0.570071 0.498029 0.500504 0.4185 0.420802 0.419569
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
318. 
patient tongue id: 04221901043765_4
label yaofang:
甘草 法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.467451 0.887844 0.418856 0.951253 0.638846 0.702357 0.374729 0.342129 0.920415 0.938557 0.880508 0.929715 0.354352 0.976542 0.473626 0.667659 0.478641 0.722812
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.800000, error: 0.333333
319. 
patient tongue id: 02182237155530_6_2
label yaofang:
甘草 柴胡 黄芩 法半夏 茯苓 桔梗 橘红 浙贝母 栀子 牡丹皮 款冬花 扁豆花 紫菀 贯众
0.952894 0.52348 0.555247 0.349682 0.322677 0.53908 0.455137 0.438682 0.384315 0.377401 0.366263
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
320. 
patient tongue id: 03141956031149_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮
0.305649 0.373239 0.317772 0.348203 0.331211 0.375499 0.543635
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
321. 
patient tongue id: 03192252347417_5_6_1
label yaofang:
甘草 柴胡 白芍 陈皮 木香 防风 党参 白术 黄连 生地黄 川楝子 乌梅 山药 仙鹤草 茜草 麦芽 合欢花
0.953433 0.528832 0.559002 0.348637 0.323144 0.300201 0.542163 0.457257 0.431842 0.380461 0.377877 0.360075
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.235294, error: 0.666667
322. 
patient tongue id: 06111119154654_4_1
label yaofang:
甘草 柴胡 川芎 黄芩 茯苓 桔梗 防风 金银花 芦根 党参 浙贝母 荆芥穗 麦芽 苍耳子 贯众
0.942353 0.51283 0.555871 0.371943 0.356122 0.304885 0.543666 0.461803 0.448448 0.387503 0.390522 0.386532
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
323. 
patient tongue id: 02231914176151_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.37337 0.683367 0.438319 0.778574 0.499895 0.54193 0.381669 0.303582 0.723648 0.748202 0.69069 0.745266 0.399045 0.846214 0.385446 0.509271 0.437216 0.570312
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 0.875000, error: 0.222222
324. 
patient tongue id: 01250651428909_2
label yaofang:
甘草 黄芩 桔梗 太子参 浙贝母 乌梅 牛膝 地黄 火麻仁 白花蛇舌草 北沙参 蜂房 岗梅根 醋鳖甲
0.960488 0.513506 0.580547 0.377108 0.340447 0.550946 0.469272 0.462697 0.389886 0.394101 0.381297
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
325. 
patient tongue id: 06182225235967_1_3
label yaofang:
甘草 茯苓 党参 黄芪 白术 五味子 柏子仁 山茱萸 糯稻根 芡实 浮小麦
0.898382 0.304113 0.498103 0.514802 0.35786 0.470832 0.362163 0.37554
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.363636, error: 0.500000
326. 
patient tongue id: 05271847328133_1
label yaofang:
柴胡 茯苓 白术 山药 山楂 莱菔子 鸡内金 麦芽 炙甘草 黑枣 独脚金 稻芽 葫芦茶
0.670426 0.442954 0.383945 0.34559 0.419484
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
327. 
patient tongue id: 04260020033725_6_2
label yaofang:
甘草 陈皮 枳壳 茯苓 独活 酸枣仁 郁金 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜
0.988538 0.557025 0.649722 0.36154 0.413898 0.333059 0.675776 0.580729 0.54248 0.481848 0.494205 0.49977
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
328. 
patient tongue id: 02182011581295_4_6_2
label yaofang:
甘草 桔梗 酸枣仁 浙贝母 郁金 鳖甲 扁豆花 夏枯草 北沙参 白花蛇舌 天山雪莲 蜂房 岗梅根 四季青
0.987216 0.551291 0.628498 0.367758 0.39951 0.337282 0.304078 0.660896 0.577906 0.552729 0.480508 0.497768 0.500177
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
329. 
patient tongue id: 04171812332287_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 仙鹤草 炙甘草 百合 紫苏叶
0.375294 0.386393 0.30961 0.388323 0.358901 0.38113 0.452727
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
330. 
patient tongue id: 03101737585550_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.436344 0.790421 0.417594 0.878237 0.570402 0.62194 0.387937 0.309414 0.327708 0.344435 0.835519 0.863864 0.794287 0.847982 0.372848 0.940341 0.448344 0.592426 0.457724 0.650645
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
331. 
patient tongue id: 06171336573826_4_1
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.847315 0.477902 0.490737 0.358443 0.403037 0.30525
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
332. 
patient tongue id: 02051501583846_2_4
label yaofang:
白芍 附子 炙甘草
0.737942 0.337359 0.440761 0.449752 0.364207 0.32095
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.333333, error: 0.833333
333. 
patient tongue id: 03280649043639_3_7
label yaofang:
桂枝 柴胡 白芍 当归 茯苓 桃仁 党参 白术 红花 延胡索 炙甘草 女贞子 墨旱莲 两面针
0.468651 0.37055 0.342936 0.49314 0.485879 0.333553
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
334. 
patient tongue id: 05260707251401_5_6
label yaofang:
甘草 白芍 川芎 黄芩 法半夏 茯苓 前胡 牛蒡子 白术 款冬花 紫菀 紫苏梗
0.88606 0.454561 0.461065 0.476374 0.323362 0.380941
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
335. 
patient tongue id: 01180607593521_1_2_6
label yaofang:
甘草 白芍 陈皮 枳壳 茯苓 蒲公英 党参 白术 天麻 鳖甲 麦芽 五倍子 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.986816 0.538632 0.612256 0.357966 0.322076 0.59989 0.512956 0.509853 0.401659 0.411462 0.405911
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
336. 
patient tongue id: 03111514175614_6_2_7
label yaofang:
甘草 柴胡 白芍 茯苓 桃仁 党参 丹参 山药 鳖甲 虎杖 麦芽 百合 黄精 土鳖虫 鹿衔草
0.704712 0.436026 0.427355 0.357312 0.429248
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
337. 
patient tongue id: 03142004068581_1_7
label yaofang:
桂枝 甘草 茯苓 桔梗 薏苡仁 党参 白术 山药 干姜 砂仁 白扁豆 广藿香
0.311456 0.41137 0.307361 0.322667 0.312578 0.509219 0.6182
predicted yaofang:
柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
338. 
patient tongue id: 03231116340524_6_1_2
label yaofang:
甘草 川芎 茯苓 羌活 党参 白术 砂仁 天麻 白芷 鳖甲 柿蒂 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.90653 0.486085 0.519058 0.419156 0.450617 0.355213 0.424418
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 1.000000, recall: 0.437500, error: 0.000000
339. 
patient tongue id: 05140845284954_2_5
label yaofang:
甘草 法半夏 茯苓 桔梗 太子参 浙贝母 郁金 鳖甲 射干 北沙参 苦杏仁 白花蛇舌 天山雪莲 蜂房
0.95392 0.301965 0.520948 0.569604 0.364779 0.352455 0.31444 0.565965 0.494166 0.473865 0.418847 0.422414 0.417466
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
340. 
patient tongue id: 03230720557981_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 酸枣仁 生地黄 赤芍 牡丹皮 菟丝子 益母草 浮小麦 合欢花
0.980879 0.546541 0.613262 0.367371 0.377154 0.317497 0.621515 0.53951 0.512004 0.449045 0.455714 0.449946
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
341. 
patient tongue id: 04142223349966_4
label yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 远志 党参 郁金 石菖蒲 天麻 鳖甲 扁豆花 蜈蚣 白花蛇舌 天山雪莲
0.940112 0.508809 0.561588 0.374815 0.33603 0.537239 0.444307 0.439056 0.370161 0.373395 0.365683
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
342. 
patient tongue id: 04132047086619_6_5
label yaofang:
甘草 柴胡 黄芩 茯苓 党参 白术 酸枣仁 丹参 生地黄 赤芍 青皮 栀子 牡丹皮 郁金 王不留行 佛手
0.97111 0.525392 0.588167 0.348024 0.345313 0.583968 0.486381 0.474784 0.40237 0.400448 0.393405
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
343. 
patient tongue id: 01041816268260_2
label yaofang:
桂枝 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.419917 0.751959 0.427119 0.850899 0.546658 0.605001 0.378632 0.307966 0.308204 0.345444 0.802464 0.823098 0.764321 0.823318 0.398277 0.893467 0.440628 0.566655 0.476343 0.6322
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.875000, error: 0.300000
344. 
patient tongue id: 04201926503545_6_4
label yaofang:
甘草 茯苓 木香 党参 白术 酸枣仁 山药 益母草 鳖甲 茵陈 虎杖 麦芽 板蓝根 黄精 土鳖虫
0.903054 0.488632 0.532872 0.406978 0.333848 0.495886 0.374624 0.414366 0.303965 0.314024 0.318775
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
345. 
patient tongue id: 03101742043210_4
label yaofang:
甘草 薏苡仁 滑石 豆蔻 萹蓄 焦栀子 干鱼腥草 麸炒白术 川木通 广金钱草 车前草
0.438684 0.847508 0.402198 0.931268 0.601168 0.685147 0.388043 0.308389 0.341088 0.894476 0.916086 0.856595 0.906575 0.38699 0.965414 0.479718 0.641338 0.482916 0.707299
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
346. 
patient tongue id: 03291339049060_1_6
label yaofang:
甘草 黄芩 薏苡仁 浙贝母 桑白皮 莱菔子 天麻 鳖甲 莪术 枇杷叶 麦芽 苦杏仁 紫苏子 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.860858 0.490825 0.485692 0.367165 0.424698 0.303108 0.346309
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.235294, error: 0.428571
347. 
patient tongue id: 01192235440678_1_2_4
label yaofang:
甘草 远志 白术 生地黄 黄柏 山药 天麻 糯稻根 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.95335 0.515458 0.567702 0.374934 0.352336 0.313147 0.563062 0.464827 0.458367 0.385859 0.393604 0.398101
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
348. 
patient tongue id: 01190631214937_6_4
label yaofang:
甘草 桔梗 党参 丹参 生地黄 浙贝母 郁金 天麻 白芷 鳖甲 皂角刺 白花蛇舌 天山雪莲 半枝莲
0.971582 0.52354 0.580091 0.378298 0.342023 0.561973 0.457126 0.472248 0.368103 0.374939 0.366471
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
349. 
patient tongue id: 03312026599069_1_2
label yaofang:
甘草 独活 党参 白术 酸枣仁 生地黄 杜仲 天麻 桑寄生 鳖甲 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.966075 0.529142 0.591216 0.365818 0.377963 0.316951 0.592443 0.512487 0.495617 0.432314 0.438136 0.435821
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.733333, error: 0.083333
350. 
patient tongue id: 04210647556418_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 天麻 款冬花 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.926654 0.482526 0.544243 0.393178 0.333038 0.510547 0.364949 0.421142 0.313761
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
351. 
patient tongue id: 02122221457940_5
label yaofang:
甘草 茯苓 薏苡仁 党参 黄连 生地黄 赤芍 牛膝 石膏 山药 山茱萸 细辛 白芷 粉葛 广升麻
0.935676 0.506902 0.542264 0.370848 0.490905 0.402785 0.414131 0.332012 0.328319 0.312664
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
352. 
patient tongue id: 04282304217407_6_5
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 茯苓 党参 酸枣仁 柏子仁 生地黄 栀子 牡丹皮 火麻仁 浮小麦 百合
0.989223 0.549688 0.644081 0.363845 0.420676 0.301363 0.680441 0.584828 0.558592 0.486363 0.497959 0.514148
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
353. 
patient tongue id: 02122111385208_3_4
label yaofang:
甘草 柴胡 白芍 川芎 陈皮 法半夏 茯苓 党参 五味子 熟附子 赤芍 细辛 干姜 天麻 全蝎 建曲
0.970655 0.53068 0.594968 0.373931 0.37503 0.317877 0.60471 0.528914 0.512205 0.441753 0.450747 0.453828
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
354. 
patient tongue id: 02111327355363_1_2_7
label yaofang:
川芎 陈皮 法半夏 防风 乳香 胆南星 藿香 荆芥穗 白芷 辛夷 苍耳子 芥子 醋没药
0.423114 0.380902 0.34243 0.459476 0.424675
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
355. 
patient tongue id: 06171321555675_4_6
label yaofang:
白芍 香附 枳壳 法半夏 党参 延胡索 海螵蛸 佩兰 白芷 北柴胡 麦芽 炙甘草 蒺藜 紫苏梗
0.568593 0.30063 0.397577 0.421347 0.390969
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
356. 
patient tongue id: 03041051547101_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.4195 0.738739 0.433024 0.819957 0.52497 0.586065 0.386593 0.304136 0.319333 0.333985 0.775019 0.799422 0.732926 0.791173 0.393964 0.891826 0.426811 0.547517 0.465687 0.613712
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
357. 
patient tongue id: 03061506095891_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 延胡索 赤芍 海螵蛸 牛膝
0.331791 0.381206 0.384193 0.348678 0.433169 0.472789
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
358. 
patient tongue id: 03012248540921_6_4
label yaofang:
甘草 茯苓 桔梗 党参 浙贝母 栀子 牡丹皮 郁金 菟丝子 益母草 鳖甲 扁豆花 夏枯草 猫爪草
0.963048 0.530764 0.562636 0.34778 0.318693 0.555058 0.470474 0.453955 0.390703 0.387443 0.369752
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
359. 
patient tongue id: 03062002596262_2_6
label yaofang:
甘草 党参 丹参 山药 天麻 鳖甲 茵陈 虎杖 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 鹿衔草 赶黄草
0.98857 0.555432 0.634352 0.347668 0.399986 0.341013 0.300862 0.669807 0.580769 0.546269 0.485231 0.495713 0.502832
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
360. 
patient tongue id: 01041833428780_1_4
label yaofang:
薏苡仁 党参 太子参 黄芪 芡实 北沙参 山萸肉 续断 盐菟丝子
0.402427 0.725768 0.408656 0.840123 0.510077 0.592864 0.377641 0.300439 0.310259 0.325008 0.768503 0.813695 0.74808 0.807534 0.386017 0.886054 0.426537 0.560232 0.494939 0.608187
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.222222, error: 0.900000
361. 
patient tongue id: 06031135067510_4_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 黄芩 法半夏 茯苓 前胡 党参 生地黄 桑寄生 款冬花
0.967643 0.528419 0.587321 0.358488 0.353271 0.300977 0.576386 0.493225 0.464845 0.412501 0.415426 0.403886
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
362. 
patient tongue id: 03292019072082_6_5
label yaofang:
甘草 枳壳 黄芩 半夏 牡丹皮 郁金 厚朴 北沙参 板蓝根 辛夷 合欢皮 墨旱莲 岗梅
0.835968 0.455907 0.510283 0.404657 0.415874 0.34197
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
363. 
patient tongue id: 02251119519932_2
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.373081 0.675122 0.444381 0.771399 0.483171 0.531206 0.369353 0.302526 0.714524 0.729343 0.67723 0.732764 0.395523 0.815821 0.376341 0.504102 0.436294 0.560955
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.833333, recall: 1.000000, error: 0.166667
364. 
patient tongue id: 03011058408918_1_7
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 车前子 仙鹤草 炙甘草 百合 紫苏叶
0.44957 0.339147 0.340837 0.394659 0.352932 0.321965
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
365. 
patient tongue id: 02241444525546_6_1
label yaofang:
大枣 当归 茯苓 木香 龙骨 远志 党参 黄芪 白术 酸枣仁 柏子仁 炙甘草
0.352488 0.334277 0.33384 0.331087 0.378641 0.338791
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.833333, recall: 0.416667, error: 0.166667
366. 
patient tongue id: 01101817073236_4
label yaofang:
陈皮 茯苓 前胡 桔梗 防风 钩藤 荆芥穗 白芷 百部 炙甘草 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.431602 0.778834 0.417109 0.87781 0.571083 0.626004 0.381908 0.310044 0.321094 0.356625 0.830152 0.858494 0.79125 0.849451 0.380017 0.927672 0.451795 0.597807 0.461274 0.645253
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.642857, error: 0.550000
367. 
patient tongue id: 01061615465878_6_5
label yaofang:
甘草 薏苡仁 浙贝母 山药 山茱萸 地黄 桑白皮 天麻 菟丝子 益母草 淡竹叶 白花蛇舌草 蜈蚣 醋鳖甲
0.928414 0.318756 0.492082 0.531826 0.351251 0.499908 0.399234 0.401706 0.323469 0.327523 0.318472
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
368. 
patient tongue id: 03242127065079_1_2
label yaofang:
党参 白术 柏子仁 附子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.422001 0.383241 0.353189 0.352565 0.385998 0.328053
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
369. 
patient tongue id: 04250812199577_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.404597 0.350387 0.449494 0.330222 0.448025 0.537924 0.496654 0.404508 0.481447 0.407403 0.463164 0.404206 0.522705 0.347392 0.476012 0.516416 0.519647
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.294118, recall: 0.384615, error: 0.705882
370. 
patient tongue id: 04121828578682_2_4_1
label yaofang:
法半夏 茯苓 葛根 前胡 桔梗 防风 麦冬 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.420073 0.768651 0.435407 0.855153 0.546674 0.597782 0.394864 0.303809 0.311599 0.336378 0.808504 0.835209 0.763878 0.822233 0.392966 0.916371 0.429534 0.57382 0.459028 0.627804
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
371. 
patient tongue id: 04142234086409_1_2
label yaofang:
甘草 柴胡 白芍 薏苡仁 党参 黄芪 熟附子 山药 天麻 鳖甲 败酱草 蜈蚣 天山雪莲 半枝莲
0.775525 0.318363 0.433611 0.458888 0.358094 0.332329
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
372. 
patient tongue id: 04202009273167_1_2_5
label yaofang:
甘草 茯苓 薏苡仁 玉竹 党参 白术 赤芍 浙贝母 全蝎 鸡内金 北沙参 蛤壳 辛夷 猫爪草 冬凌草
0.431372 0.390473 0.343813 0.514237 0.390653 0.352314 0.336124
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.714286, recall: 0.333333, error: 0.285714
373. 
patient tongue id: 03100548001906_5_6
label yaofang:
甘草 柴胡 党参 酸枣仁 丹参 赤芍 青皮 郁金 天麻 王不留行 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲
0.960188 0.512169 0.558916 0.424954 0.347515 0.302967 0.538663 0.480125 0.513644 0.398359 0.407452 0.422384
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
374. 
patient tongue id: 02141933115641_4
label yaofang:
甘草 海螵蛸 肉桂 干姜 附片
0.831904 0.44804 0.520965 0.364075 0.438719 0.305773
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.200000, error: 0.833333
375. 
patient tongue id: 05032308049925_3_2
label yaofang:
甘草 白芍 茯苓 薏苡仁 蒲公英 党参 白术 栀子 山药 天麻 莪术 蜈蚣 半枝莲 醋鳖甲
0.958983 0.508996 0.585591 0.36157 0.358724 0.57333 0.45705 0.447955 0.376461 0.381843 0.392818
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
376. 
patient tongue id: 02141951249645_1
label yaofang:
桂枝 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.561579 0.40474 0.458537 0.34465 0.346015 0.311804 0.375596
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
377. 
patient tongue id: 04102042154753_4_1
label yaofang:
陈皮 桔梗 牛蒡子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.390922 0.321057 0.332939 0.421958 0.583223
predicted yaofang:
白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
378. 
patient tongue id: 04111945124571_1_6_7
label yaofang:
甘草 茯苓 半夏 蒲公英 党参 白术 海螵蛸 郁金 山药 厚朴 鸡内金 紫苏梗 黑枣
0.520375 0.417064 0.370263 0.426594 0.400937
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
379. 
patient tongue id: 04121310514640_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.325422 0.520284 0.445721 0.557377 0.408525 0.428405 0.344974 0.30158 0.521896 0.524226 0.493586 0.528103 0.386742 0.632345 0.316082 0.395853 0.333372 0.417238
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
380. 
patient tongue id: 02281438483617_2
label yaofang:
陈皮 当归 党参 黄芪 白术 砂仁 天麻 天花粉 炙甘草 辛夷 龙葵
0.369566 0.302627 0.379826 0.3249 0.390923 0.360723 0.392877 0.459455
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.272727, error: 0.625000
381. 
patient tongue id: 04172200051605_3_1
label yaofang:
陈皮 半夏 龙骨 牡蛎 芦根 白术 延胡索 杜仲 石菖蒲 菟丝子 巴戟天 淫羊藿 浮小麦 狗脊 青果
0.407962 0.365448 0.53996 0.503326 0.394147 0.302311 0.342768 0.313865
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.125000, recall: 0.066667, error: 0.875000
382. 
patient tongue id: 01201303413246_1_2_7
label yaofang:
甘草 茯苓 黄芪 鸡血藤 酸枣仁 生地黄 杜仲 山药 细辛 天麻 桑寄生 补骨脂 地龙 灯盏细辛
0.964942 0.519728 0.564492 0.398071 0.344507 0.562396 0.48846 0.502274 0.410603 0.408362 0.421728
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
383. 
patient tongue id: 01132309492493_1_7
label yaofang:
前胡 薄荷 芦根 牛蒡子 葶苈子 玉竹 栀子 白茅根 淡豆豉 蝉蜕 白眉草
0.334777 0.34095 0.343128 0.346245 0.31403 0.482467
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
384. 
patient tongue id: 04151225136040_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.446085 0.884023 0.416001 0.949537 0.639213 0.691001 0.376067 0.337595 0.918253 0.935532 0.877513 0.925093 0.35925 0.9739 0.46229 0.659523 0.46614 0.711328
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.928571, error: 0.277778
385. 
patient tongue id: 01040508356900_6_5
label yaofang:
甘草 黄芩 前胡 桔梗 芦根 桃仁 远志 浙贝母 鳖甲 款冬花 紫菀 苦杏仁 炙麻黄 白花蛇舌
0.980487 0.544984 0.607917 0.332555 0.357836 0.305981 0.614464 0.488196 0.466136 0.402642 0.403193 0.397023
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
386. 
patient tongue id: 05290824102268_2_5
label yaofang:
甘草 桔梗 金银花 芦根 酸枣仁 浙贝母 天麻 鳖甲 诃子 麦芽 百合 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.982388 0.541635 0.62499 0.362768 0.379239 0.630568 0.546744 0.5176 0.446174 0.461845 0.458067
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
387. 
patient tongue id: 01032340551599_5_6
label yaofang:
甘草 法半夏 茯苓 党参 白术 杜仲 郁金 石菖蒲 天麻 桑寄生 麦芽 地龙 辛夷 合欢花
0.98764 0.540382 0.633578 0.386864 0.40029 0.324582 0.653157 0.574458 0.560557 0.471501 0.49473 0.504121
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
388. 
patient tongue id: 04120813034404_1_4_7
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子
0.432812 0.382169 0.316807 0.410994 0.494566 0.364112 0.3545
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
389. 
patient tongue id: 02212221050546_6
label yaofang:
甘草 柴胡 白芍 栀子 牡丹皮 天麻 鳖甲 佛手 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.962426 0.529062 0.573131 0.35864 0.338647 0.306001 0.558978 0.467431 0.454822 0.386822 0.385444 0.374815
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
390. 
patient tongue id: 04101907167307_1_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.401409 0.666744 0.453154 0.742644 0.502962 0.539079 0.392662 0.31883 0.322271 0.345733 0.698973 0.715135 0.664486 0.715244 0.405285 0.801894 0.407551 0.516028 0.445419 0.563776
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
391. 
patient tongue id: 01192148343243_5_6
label yaofang:
甘草 法半夏 薏苡仁 赤芍 青皮 郁金 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.991855 0.547381 0.630553 0.356714 0.394517 0.318248 0.680486 0.579322 0.56979 0.47706 0.49266 0.515762
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
392. 
patient tongue id: 05022040178729_4_7
label yaofang:
桂枝 甘草 川芎 法半夏 茯苓 白术 红花 赤芍 细辛 天麻 全蝎 僵蚕
0.984165 0.543516 0.634275 0.365146 0.410573 0.330371 0.655389 0.560169 0.529139 0.467429 0.47951 0.479155
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
393. 
patient tongue id: 05242207155046_5_1
label yaofang:
甘草 薏苡仁 党参 白术 桑叶 天麻 野菊花 莪术 白花蛇舌草 佛手 蜈蚣 半枝莲 醋鳖甲 炒鸡内金
0.978925 0.531044 0.609543 0.356004 0.36953 0.308618 0.604146 0.50899 0.487926 0.41001 0.418058 0.40967
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
394. 
patient tongue id: 02212211400297_6_2
label yaofang:
甘草 白芍 川芎 独活 酸枣仁 生地黄 延胡索 杜仲 牛膝 山茱萸 钩藤 天麻 桑寄生 续断
0.981273 0.53936 0.616792 0.362319 0.406471 0.342743 0.309936 0.647238 0.564435 0.529929 0.479254 0.488967 0.484992
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
395. 
patient tongue id: 03192305575571_6_5
label yaofang:
甘草 陈皮 法半夏 茯苓 龙骨 牡蛎 远志 党参 酸枣仁 黄连 胆南星 天麻 首乌藤 紫苏梗 广藿香
0.591426 0.312723 0.39266 0.417756 0.380057
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
396. 
patient tongue id: 03311802088239_1_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 钩藤 细辛 白芷 辛夷 紫苏梗 广藿香 炒苍耳子 炒蔓荆子
0.445816 0.839435 0.422696 0.911922 0.598745 0.645706 0.378357 0.30524 0.336631 0.874334 0.898625 0.826091 0.881916 0.352377 0.960716 0.44878 0.619317 0.458054 0.670611
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.421053, recall: 0.571429, error: 0.578947
397. 
patient tongue id: 05191836060471_5
label yaofang:
当归 荆芥 牛蒡子 知母 石膏 苍术 通草 地黄 火麻仁 蝉蜕 苦参 蜂房
0.794248 0.358243 0.432812 0.472314 0.364817 0.325096
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
398. 
patient tongue id: 05232000358524_6
label yaofang:
甘草 枳壳 黄芩 半夏 蒲公英 枸杞子 白术 黄连 浙贝母 牡丹皮 山茱萸 厚朴 淡豆豉 北沙参 蜈蚣 合欢皮 预知子
0.550973 0.397071 0.320049 0.556044 0.57926 0.301557 0.452113 0.331265 0.354606 0.330367
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.500000, recall: 0.294118, error: 0.500000
399. 
patient tongue id: 05230811378034_1_2
label yaofang:
甘草 法半夏 桔梗 橘红 防风 金银花 太子参 藿香 白前 鸡内金 蜜百部 干鱼腥草
0.535738 0.390215 0.425476 0.486643 0.435511 0.30389 0.47469 0.408774 0.429954 0.348062 0.409014 0.367145 0.463164 0.430185 0.399906 0.420079 0.396883
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 酸枣仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.058824, recall: 0.083333, error: 0.941176
400. 
patient tongue id: 04020755337352_2_7_6
label yaofang:
甘草 白芍 茯苓 党参 酸枣仁 丹参 黄连 生地黄 山茱萸 益母草 北沙参 粉葛
0.989888 0.553399 0.639129 0.347049 0.412813 0.329387 0.684085 0.591627 0.562954 0.493928 0.508982 0.509975
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.416667, error: 0.583333
401. 
patient tongue id: 01201948462277_1_7_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 丹参 郁金 天麻 桑寄生 鳖甲 续断 浮小麦 蜈蚣 天山雪莲 合欢花 半枝莲 红豆杉
0.980326 0.536715 0.593036 0.364984 0.350237 0.303535 0.600616 0.519512 0.50058 0.424207 0.432097 0.430233
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.352941, error: 0.500000
402. 
patient tongue id: 03012046007710_2
label yaofang:
甘草 玉竹 太子参 浙贝母 郁金 天麻 天花粉 鳖甲 北沙参 白扁豆 浮小麦 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.948784 0.523641 0.53783 0.375434 0.310499 0.509313 0.461045 0.464087 0.384131 0.377117 0.365426
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
403. 
patient tongue id: 02182207523925_5_7_6
label yaofang:
甘草 法半夏 茯苓 桃仁 远志 党参 酸枣仁 丹参 竹茹 胆南星 栀子 淡豆豉 莪术 麦芽 首乌藤
0.982064 0.547211 0.614292 0.359412 0.406088 0.3406 0.306349 0.652205 0.568551 0.539851 0.485079 0.49527 0.503675
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
404. 
patient tongue id: 06031126381101_6_4
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 熟附子 浙贝母 细辛 干姜 款冬花 地龙 苦杏仁 紫苏子 炙麻黄
0.970173 0.527975 0.599473 0.364604 0.378527 0.325262 0.603077 0.505656 0.480157 0.423915 0.429217 0.420356
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.125000, error: 0.833333
405. 
patient tongue id: 02141931048148_4
label yaofang:
大枣 龙骨 党参 阿胶 生地黄 肉桂 车前子 干姜 火麻仁 炙甘草 附片
0.346321 0.302946 0.378178 0.305724 0.365433 0.386767 0.313263 0.378509 0.45501
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.181818, error: 0.777778
406. 
patient tongue id: 02251129516936_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.381783 0.355548 0.456587 0.318663 0.374583 0.406307 0.372251
predicted yaofang:
甘草 法半夏 茯苓 前胡 黄芪 北沙参 炙甘草

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
407. 
patient tongue id: 03311622155321_5_7_6
label yaofang:
薏苡仁 黄芪 白术 赤芍 海螵蛸 牛膝 砂仁 鸡内金 红豆杉 土茯苓 合欢皮 墨旱莲 山慈菇 蛇舌草
0.695236 0.445749 0.454385 0.406226 0.330525 0.315332
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
408. 
patient tongue id: 01190632211910_6_2
label yaofang:
甘草 香附 茯苓 远志 党参 酸枣仁 砂仁 三棱 莪术 麦芽 佛手 浮小麦 首乌藤
0.990051 0.555818 0.636662 0.354774 0.403364 0.342071 0.68527 0.593914 0.560909 0.490226 0.514604 0.517677
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
409. 
patient tongue id: 01101820477482_1_4
label yaofang:
川芎 法半夏 前胡 木香 太子参 郁金 北柴胡 白前 百部 豆蔻 北沙参 炙甘草 麸炒白术 甘松 麸炒枳壳 姜厚朴
0.361003 0.56396 0.423627 0.650393 0.449022 0.492304 0.361357 0.313151 0.310715 0.592158 0.624468 0.589821 0.638622 0.385226 0.728935 0.370819 0.459254 0.416907 0.505973
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.368421, recall: 0.437500, error: 0.631579
410. 
patient tongue id: 05242129576063_1_2
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.945017 0.510893 0.579216 0.371833 0.367072 0.300863 0.569255 0.468778 0.452249 0.393343 0.397413 0.392038
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.857143, error: 0.000000
411. 
patient tongue id: 05232120532433_1_4_7
label yaofang:
甘草 茯苓 党参 白术 浙贝母 杜仲 巴戟天 补骨脂 鸡内金 枇杷叶 紫苏子 紫苏叶 蜈蚣 骨碎补 南杏仁
0.43995 0.34732 0.373403 0.65172 0.616136 0.337903 0.335785 0.550945 0.372956 0.34631 0.395117 0.440091
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
412. 
patient tongue id: 06022228410780_1_4_7
label yaofang:
甘草 陈皮 半夏 党参 白术 海螵蛸 杜仲 牛膝 山药 僵蚕 莪术 鸡内金 桑椹 紫苏梗 骨碎补 红豆杉 预知子
0.464115 0.382524 0.329514 0.307973 0.588229 0.549647 0.306444 0.475982 0.342656 0.331602 0.393747 0.364093
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.500000, recall: 0.352941, error: 0.500000
413. 
patient tongue id: 04282237170670_5_2
label yaofang:
牡蛎 玉竹 生地黄 浙贝母 牡丹皮 黄柏 知母 山药 山茱萸 泽泻 北沙参 辛夷 合欢皮 冬凌草
0.304477 0.300889 0.341316 0.392268 0.312532 0.400794
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
414. 
patient tongue id: 01132145197254_5_6
label yaofang:
甘草 枳壳 党参 白术 苍术 大黄 厚朴 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.944272 0.505354 0.515969 0.433475 0.45297 0.402861 0.469929 0.326287 0.327808 0.327022
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.642857, error: 0.100000
415. 
patient tongue id: 04131801300910_1_6
label yaofang:
甘草 白芍 川芎 龙骨 白术 酸枣仁 丹参 竹茹 牛膝 郁金 薤白 天麻 全蝎 瓜蒌皮 浮小麦 降香
0.982154 0.544801 0.61061 0.323586 0.353897 0.629446 0.52917 0.491655 0.438237 0.44286 0.435727
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
416. 
patient tongue id: 04222050458278_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.403267 0.712368 0.428594 0.826235 0.517951 0.574227 0.390393 0.302657 0.301391 0.323002 0.770542 0.794322 0.728583 0.791682 0.412185 0.872052 0.417854 0.541541 0.456214 0.598425
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
417. 
patient tongue id: 05140712142753_4_1_6
label yaofang:
甘草 茯苓 桔梗 党参 白术 浙贝母 天麻 鳖甲 豆蔻 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.987556 0.550116 0.627331 0.345657 0.3938 0.333071 0.65645 0.565381 0.53307 0.472926 0.477996 0.479421
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
418. 
patient tongue id: 03281925025110_3_2
label yaofang:
柴胡 陈皮 黄芩 法半夏 防风 黄连 栀子 石膏 苍术 干姜 厚朴 炙甘草 广藿香
0.81659 0.441771 0.45111 0.413091 0.308883 0.320538
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
419. 
patient tongue id: 06181649282845_2_1
label yaofang:
白芍 川芎 陈皮 枳壳 当归 茯苓 党参 鸡血藤 白术 熟地黄 乌药 山药 鸡内金 决明子 麦芽 炙甘草 半枝莲 五指毛桃 蛇舌草
0.503101 0.374386 0.312242 0.54223 0.561936 0.437319 0.336184 0.336883 0.333755
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.333333, recall: 0.157895, error: 0.666667
420. 
patient tongue id: 05080854491068_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.391538 0.344286 0.374085 0.430536 0.495296 0.418523 0.324233 0.414484 0.303059 0.371457 0.34733 0.396668 0.356722 0.393533 0.391055
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.733333, recall: 0.916667, error: 0.266667
421. 
patient tongue id: 04131401530044_2_7
label yaofang:
甘草 法半夏 前胡 桔梗 薏苡仁 浙贝母 细辛 鳖甲 款冬花 莪术 白前 苦杏仁 炙麻黄 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.947796 0.520528 0.543449 0.358565 0.307287 0.51203 0.425467 0.427968 0.349977 0.342039 0.328337
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.235294, error: 0.636364
422. 
patient tongue id: 05022215346235_2_6
label yaofang:
甘草 党参 玄参 赤芍 浙贝母 郁金 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲 猫爪草
0.982833 0.545492 0.616131 0.349195 0.373276 0.306466 0.62829 0.533686 0.500847 0.44366 0.447969 0.445948
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
423. 
patient tongue id: 04222129332247_2_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.426127 0.831931 0.423945 0.917441 0.592462 0.648196 0.385577 0.330426 0.875755 0.896171 0.833054 0.886664 0.384612 0.950836 0.447482 0.617051 0.472729 0.675322
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
424. 
patient tongue id: 03232258028475_5_6_7
label yaofang:
甘草 法半夏 茯苓 牡蛎 远志 党参 酸枣仁 丹参 黄连 竹茹 胆南星 栀子 薤白 淡豆豉 天麻 瓜蒌皮
0.892341 0.394379 0.523849 0.308876 0.429716 0.405227
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 天麻

------Score: precision: 0.833333, recall: 0.312500, error: 0.166667
425. 
patient tongue id: 05092218467250_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 款冬花 白前 苦杏仁 炙麻黄
0.988481 0.551799 0.637659 0.355849 0.392279 0.318284 0.65183 0.563074 0.533895 0.462622 0.475121 0.477526
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.166667, error: 0.833333
426. 
patient tongue id: 01122214468115_1_5
label yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 黄连 牛膝 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.963641 0.518129 0.585796 0.38109 0.352631 0.309891 0.585401 0.491994 0.483025 0.405993 0.420294 0.418144
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
427. 
patient tongue id: 01040644032083_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 橘红 金银花 芦根 浙贝母 莱菔子 白前 紫苏子
0.97465 0.536241 0.588032 0.354037 0.359846 0.324131 0.609632 0.517446 0.493274 0.429009 0.437579 0.430926
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
428. 
patient tongue id: 03231252164418_6_1_2
label yaofang:
甘草 党参 赤芍 天麻 桑寄生 鳖甲 决明子 续断 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲 红曲
0.982174 0.533653 0.605224 0.391763 0.383016 0.301889 0.621543 0.537729 0.541907 0.444897 0.456037 0.471809
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
429. 
patient tongue id: 04282026134510_3
label yaofang:
甘草 川芎 茯苓 党参 黄芪 生地黄 杜仲 山药 山茱萸 补骨脂 金樱子 桑螵蛸 地龙 辛夷 有瓜石斛
0.985398 0.546706 0.638957 0.365122 0.416486 0.324749 0.665995 0.558335 0.528051 0.460483 0.475398 0.475959
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
430. 
patient tongue id: 04291500458045_1_2_6
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 山药 山茱萸 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.968314 0.522951 0.57282 0.408509 0.346536 0.557134 0.486389 0.510173 0.396311 0.406096 0.410408
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
431. 
patient tongue id: 05290800416213_2_6
label yaofang:
甘草 香附 茯苓 枸杞子 生地黄 牡丹皮 川楝子 山药 山茱萸 泽泻 菟丝子 益母草 王不留行 女贞子 续断
0.983515 0.544046 0.612104 0.362014 0.379173 0.316673 0.628254 0.544939 0.521587 0.45049 0.460361 0.455133
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
432. 
patient tongue id: 02142125143703_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.377413 0.717587 0.424978 0.820849 0.534223 0.548859 0.358851 0.766545 0.792746 0.725017 0.781409 0.357605 0.883397 0.373501 0.530296 0.401446 0.580322
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.823529, recall: 0.933333, error: 0.176471
433. 
patient tongue id: 06162200210480_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.383659 0.809779 0.407914 0.909733 0.552009 0.60988 0.361869 0.854683 0.881718 0.820132 0.874384 0.395314 0.936088 0.398252 0.5775 0.451837 0.647042
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.647059, recall: 0.785714, error: 0.352941
434. 
patient tongue id: 02201316507832_2
label yaofang:
大枣 当归 茯苓 木香 远志 党参 白术 柏子仁 肉桂 钩藤 川牛膝 炙甘草
0.67678 0.33638 0.404232 0.462533 0.353912 0.310682
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
435. 
patient tongue id: 03022154325280_7_2
label yaofang:
枳壳 当归 木香 牛蒡子 远志 党参 太子参 黄芪 鸡血藤 白术 柏子仁 神曲 山楂 砂仁 石斛 糯稻根 麦芽 炙甘草 浮小麦 百合 紫苏叶
0.721075 0.406945 0.472746 0.319393 0.334519
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.095238, error: 0.600000
436. 
patient tongue id: 05232035256784_4
label yaofang:
柴胡 白芍 香附 枳壳 桃仁 延胡索 海螵蛸 浙贝母 豆蔻 白花蛇舌草 姜半夏 炙甘草 紫苏梗
0.40227 0.320499 0.428863 0.399139 0.336261 0.413135 0.45455
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
437. 
patient tongue id: 02190438125539_1_2_4
label yaofang:
甘草 远志 党参 生地黄 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲 宽筋藤
0.937029 0.514592 0.534338 0.35724 0.494556 0.40108 0.411183 0.330317 0.320516 0.304163
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.571429, error: 0.200000
438. 
patient tongue id: 04211937576835_6_4_1
label yaofang:
蒲公英 太子参 黄芪 白术 延胡索 海螵蛸 郁金 砂仁 三七 桑寄生 鸡内金 北沙参 首乌藤 紫苏梗
0.595743 0.38877 0.39155 0.492359 0.487595 0.375238
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
439. 
patient tongue id: 03211855032110_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.456488 0.87425 0.425198 0.935671 0.631849 0.679553 0.37963 0.30442 0.351879 0.903647 0.926143 0.85706 0.910451 0.346378 0.974079 0.466937 0.653823 0.460359 0.699181
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
440. 
patient tongue id: 06080123471129_4_1
label yaofang:
甘草 川芎 法半夏 茯苓 党参 白术 厚朴 天麻 鳖甲 蒺藜 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.986723 0.542524 0.62896 0.353942 0.391663 0.320167 0.662238 0.575835 0.551481 0.482651 0.496499 0.511703
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.625000, error: 0.166667
441. 
patient tongue id: 03312046296299_2_6
label yaofang:
甘草 白芍 薏苡仁 熟附子 赤芍 郁金 山药 天麻 鳖甲 扁豆花 败酱草 续断 浮小麦 半枝莲 牛大力
0.850863 0.490056 0.494039 0.381758 0.413587 0.334391
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
442. 
patient tongue id: 06031044322372_6_2_1
label yaofang:
甘草 枳壳 远志 酸枣仁 丹参 生地黄 天麻 瓜蒌皮 鳖甲 紫菀 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.934155 0.51571 0.563636 0.364736 0.346082 0.536078 0.432092 0.416459 0.362589 0.358735 0.34966
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
443. 
patient tongue id: 01062349333519_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.458663 0.408228 0.404421 0.456914 0.306282 0.300676
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
444. 
patient tongue id: 03151929068214_1
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 火炭母
0.361159 0.340587 0.451351 0.441141
predicted yaofang:
甘草 茯苓 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
445. 
patient tongue id: 05181828424766_5_2
label yaofang:
甘草 前胡 鱼腥草 酸枣仁 浙贝母 桑白皮 瓜蒌皮 射干 枇杷叶 珍珠母 苦杏仁 辛夷 木蝴蝶 南杏仁
0.859591 0.478289 0.488893 0.42611 0.408641 0.309904 0.390434
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
446. 
patient tongue id: 04121953566816_1_4_2
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.364343 0.598016 0.444679 0.692732 0.464163 0.479746 0.377712 0.629253 0.653208 0.609873 0.662422 0.398957 0.761054 0.354145 0.46173 0.398275 0.506188
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.823529, recall: 0.875000, error: 0.176471
447. 
patient tongue id: 05031857245713_4
label yaofang:
桂枝 枳壳 茯苓 麦冬 酸枣仁 五味子 天冬 石斛 佛手 合欢皮 石榴皮
0.429508 0.371742 0.352809 0.300087 0.389897 0.329629
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
448. 
patient tongue id: 04282302233398_1_6
label yaofang:
甘草 川芎 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.963459 0.522051 0.573902 0.362468 0.356803 0.319818 0.580874 0.498585 0.481303 0.422247 0.428625 0.420318
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
449. 
patient tongue id: 06031655155380_4_1
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.464939 0.883062 0.420369 0.945209 0.638946 0.68745 0.383531 0.304632 0.348699 0.914015 0.933753 0.870328 0.921624 0.354945 0.976994 0.470759 0.66267 0.466004 0.71273
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
450. 
patient tongue id: 04181958020820_2
label yaofang:
甘草 白芍 枳壳 桔梗 黄芪 白术 生地黄 枳实 槟榔 厚朴 肉苁蓉 火麻仁 柿蒂 紫菀 郁李仁
0.495123 0.360679 0.349793 0.425285 0.377676 0.304074
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
451. 
patient tongue id: 05290842578937_3_2
label yaofang:
甘草 党参 黄芪 杜仲 天麻 鳖甲 桑螵蛸 锁阳 益智 蜈蚣 天山雪莲 半枝莲 广金钱草 红豆杉
0.983282 0.544434 0.63625 0.35308 0.398766 0.326111 0.647395 0.546328 0.507354 0.449433 0.461083 0.457293
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
452. 
patient tongue id: 01312127464193_5_8
label yaofang:
甘草 荆芥 防风 金银花 黄芪 白术 紫草 火麻仁 百部 麦芽 苦参 忍冬藤 白鲜皮 地肤子 土茯苓
0.970287 0.534016 0.607459 0.378675 0.409166 0.340194 0.308337 0.626739 0.545436 0.524786 0.465597 0.478129 0.478144
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.133333, error: 0.846154
453. 
patient tongue id: 02201753224110_1_4
label yaofang:
桂枝 陈皮 法半夏 茯苓 党参 海螵蛸 干姜 砂仁 炙甘草 广藿香 麸炒白术 麸炒苍术 炙黄芪 甘松
0.406202 0.731091 0.431376 0.815315 0.530435 0.568947 0.368636 0.306822 0.311697 0.331809 0.768613 0.795275 0.721614 0.782565 0.373683 0.88623 0.413268 0.544567 0.442687 0.600405
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.428571, error: 0.700000
454. 
patient tongue id: 02150557115241_6_2_4
label yaofang:
甘草 茯苓 白术 酸枣仁 生地黄 白茅根 茜草 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.871623 0.465804 0.484432 0.471705 0.371302 0.406752
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
455. 
patient tongue id: 02122110150955_6_2
label yaofang:
甘草 川芎 茯苓 龙骨 牡蛎 桃仁 酸枣仁 杜仲 牛膝 钩藤 天麻 桑寄生 麦芽
0.991258 0.557973 0.638398 0.369574 0.404775 0.339829 0.686542 0.601827 0.577434 0.495062 0.521849 0.529729
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
456. 
patient tongue id: 03231027523168_2_5_6
label yaofang:
甘草 柴胡 茯苓 丹参 赤芍 牡丹皮 黄柏 知母 山药 山茱萸 地黄 水牛角 淫羊藿 仙茅
0.946869 0.509891 0.561163 0.360322 0.310357 0.517697 0.415724 0.421991 0.339554 0.335348 0.322144
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
457. 
patient tongue id: 02141932250294_2_1
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.42818 0.766938 0.418664 0.861867 0.551255 0.619675 0.370475 0.301723 0.312292 0.350316 0.810393 0.837182 0.772627 0.835018 0.378688 0.910285 0.444183 0.584489 0.47924 0.635554
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
458. 
patient tongue id: 05092108299408_5_1_6
label yaofang:
甘草 陈皮 枳壳 茯苓 薏苡仁 蒲公英 白术 黄连 黄柏 苍术 荆芥穗 天麻 槐花 百部 苦参 五倍子
0.976994 0.539394 0.60361 0.342001 0.367753 0.618585 0.524814 0.496038 0.439473 0.442386 0.438829
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
459. 
patient tongue id: 02142330545320_6
label yaofang:
甘草 川芎 茯苓 防风 党参 白术 酸枣仁 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.98242 0.543662 0.608036 0.355554 0.373033 0.325751 0.631113 0.542058 0.515134 0.448823 0.463183 0.46204
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.733333, error: 0.083333
460. 
patient tongue id: 05162214044126_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.412759 0.787627 0.426838 0.889256 0.56112 0.610542 0.385341 0.319753 0.837045 0.863713 0.796127 0.855665 0.394451 0.92634 0.418884 0.586006 0.453975 0.645114
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.866667, error: 0.277778
461. 
patient tongue id: 02241440241654_1
label yaofang:
陈皮 桔梗 太子参 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.318052 0.314063 0.339688 0.375818 0.394007
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
462. 
patient tongue id: 05261943072541_1_4_7
label yaofang:
陈皮 茯苓 半夏 党参 枸杞子 白术 杜仲 牛膝 山药 厚朴 菟丝子 鸡内金 紫苏梗 蜈蚣 红豆杉 合欢皮 预知子 素馨花
0.492994 0.387369 0.396323 0.524066 0.373979 0.335574
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.222222, error: 0.333333
463. 
patient tongue id: 04112208554968_6
label yaofang:
甘草 法半夏 龙齿 酸枣仁 柏子仁 栀子 肉桂 干姜 淡豆豉 砂仁 天麻 蝉蜕 附片 百合 紫苏叶 蜈蚣
0.312737 0.342926 0.300293 0.525025
predicted yaofang:
白芍 茯苓 党参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
464. 
patient tongue id: 05140957086338_4_6
label yaofang:
甘草 柴胡 当归 茯苓 黄芪 白术 酸枣仁 杜仲 桑寄生 桑螵蛸 益智 紫苏梗 广藿香
0.960784 0.512555 0.584373 0.359059 0.352051 0.57415 0.467727 0.45658 0.38411 0.395627 0.390396
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
465. 
patient tongue id: 02231751486195_1_6
label yaofang:
白芍 川芎 法半夏 当归 茯苓 木香 丹参 川楝子 郁金 北柴胡 炙甘草 麸炒白术 醋香附 麸炒枳壳
0.406835 0.719725 0.438782 0.802709 0.516047 0.564914 0.376655 0.301644 0.302558 0.325633 0.753538 0.776156 0.711944 0.768914 0.388789 0.869608 0.414157 0.533849 0.454718 0.591597
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.214286, error: 0.850000
466. 
patient tongue id: 05092243531358_1_2
label yaofang:
黄芪 白术 熟地黄 浙贝母 牡丹皮 山茱萸 厚朴 砂仁 肉苁蓉 北沙参 桑枝 合欢皮 冬凌草
0.55632 0.348569 0.357822 0.688836 0.675245 0.349319 0.584015 0.373468 0.339911 0.398441 0.419071
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
467. 
patient tongue id: 06191338342788_1_4
label yaofang:
甘草 川芎 法半夏 茯苓 桔梗 党参 鸡血藤 白术 红花 浙贝母 天麻 僵蚕 地龙
0.967421 0.521768 0.563911 0.357785 0.340171 0.558204 0.481947 0.474474 0.396413 0.395815 0.395726
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
468. 
patient tongue id: 05182105440741_4
label yaofang:
柴胡 白芍 香附 枳壳 连翘 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 瓦楞子 青葙子
0.587947 0.332763 0.403763 0.421003 0.340431
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
469. 
patient tongue id: 05251937300629_2_5
label yaofang:
甘草 茯苓 桔梗 半夏 麦冬 黄芪 白术 牡丹皮 厚朴 砂仁 僵蚕 补骨脂 地龙 北沙参 苇根 蛤壳 蜈蚣
0.566423 0.396566 0.335067 0.581752 0.55845 0.309482 0.469658 0.335767 0.304855 0.376784 0.307896
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.636364, recall: 0.411765, error: 0.363636
470. 
patient tongue id: 04181937475329_1_7_4
label yaofang:
桂枝 甘草 白芍 茯苓 桃仁 白术 天冬 红花 牛膝 泽泻 车前子 茺蔚子 龟甲
0.968175 0.533081 0.591475 0.37642 0.378688 0.321578 0.596351 0.524925 0.499677 0.445173 0.451536 0.447417
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
471. 
patient tongue id: 05221853338757_4
label yaofang:
茯苓 龙骨 牡蛎 薏苡仁 白术 酸枣仁 厚朴 三七 赤小豆 首乌藤 五指毛桃 木棉花
0.807852 0.432664 0.451361 0.445304 0.301553
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
472. 
patient tongue id: 05172121421873_5_6_7
label yaofang:
甘草 法半夏 茯苓 连翘 党参 浙贝母 牡丹皮 佩兰 砂仁 天花粉 糯稻根 枇杷叶 麦芽 紫苏梗 广藿香
0.854602 0.316126 0.473618 0.518089 0.371218 0.454072 0.332354 0.349596
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
473. 
patient tongue id: 04281835578238_5
label yaofang:
甘草 桔梗 荆芥 防风 芦根 薏苡仁 细辛 瓜蒌皮 款冬花 紫菀 白前 百部 苦杏仁 蝉蜕 蜜麻黄 蒸陈皮
0.376624 0.328436 0.340422 0.347632 0.366406 0.413458
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.062500, error: 0.833333
474. 
patient tongue id: 02020855091092_6
label yaofang:
甘草 川芎 茯苓 牡蛎 白术 酸枣仁 生地黄 栀子 知母 天麻 全蝎 麦芽 浮小麦 首乌藤 百合
0.989111 0.539862 0.633192 0.373269 0.388351 0.303612 0.665244 0.576274 0.560489 0.475995 0.49483 0.512892
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
475. 
patient tongue id: 03311634589494_7_4
label yaofang:
甘草 柴胡 白芍 茯苓 白术 全蝎 猪苓 莪术 白花蛇舌草 半枝莲 蜂房 瓦楞子 山慈菇 山豆根 半边莲
0.483907 0.369932 0.335593 0.452141 0.401467 0.395206 0.309954 0.359813 0.319503 0.336166 0.360268
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 莱菔子 天麻

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
476. 
patient tongue id: 02202300060123_5_6
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 生地黄 栀子 乌药 淡竹叶 鸡内金 建曲 川木通 广金钱草 荔枝核
0.968524 0.521487 0.565778 0.367874 0.51884 0.418976 0.437486 0.331782 0.330916 0.329606
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.071429, error: 0.900000
477. 
patient tongue id: 01211245337731_3_4
label yaofang:
桂枝 柴胡 白芍 茯苓 薏苡仁 桃仁 枳实 牡丹皮 炙甘草
0.408176 0.357278 0.346414 0.313129 0.389282 0.324426
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.333333, recall: 0.222222, error: 0.666667
478. 
patient tongue id: 06171140560766_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 紫菀 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.397051 0.76682 0.427264 0.866919 0.549011 0.580403 0.383169 0.305512 0.81189 0.846122 0.775507 0.829839 0.379072 0.915004 0.392284 0.566089 0.444843 0.626452
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.600000, error: 0.500000
479. 
patient tongue id: 01202003017129_1_2
label yaofang:
甘草 陈皮 茯苓 太子参 白术 天冬 熟地黄 浙贝母 山药 山茱萸 砂仁 磁石 枇杷叶 黄精 冬凌草
0.608656 0.453952 0.369507 0.349968 0.400881
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
480. 
patient tongue id: 02271228148586_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.443919 0.395156 0.357528 0.528942
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
481. 
patient tongue id: 03021945363191_4
label yaofang:
麻黄 陈皮 茯苓 前胡 半夏 防风 神曲 细辛 款冬花 紫菀 白前 百部 紫苏子 炙甘草 广藿香
0.428994 0.830509 0.416908 0.916191 0.594224 0.661156 0.381477 0.348322 0.875014 0.896918 0.831648 0.890479 0.381405 0.951968 0.462288 0.625407 0.475313 0.683093
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.555556, recall: 0.666667, error: 0.444444
482. 
patient tongue id: 04182208380615_1_3_7
label yaofang:
甘草 当归 茯苓 党参 黄芪 白术 浙贝母 杜仲 厚朴 砂仁 款冬花 鸡内金 地龙 紫苏子 蜈蚣 鲜龙葵果
0.472425 0.400075 0.304458 0.544901 0.52822 0.433376 0.326409 0.300677 0.400767 0.338657
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.800000, recall: 0.500000, error: 0.200000
483. 
patient tongue id: 03151839184523_4
label yaofang:
甘草 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 香薷 紫菀 辛夷 紫苏梗 广藿香 苍耳子
0.422337 0.787327 0.428024 0.886267 0.562648 0.622378 0.380252 0.329927 0.837801 0.859925 0.794092 0.855037 0.385017 0.924723 0.432344 0.58898 0.46714 0.646644
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.333333, recall: 0.428571, error: 0.666667
484. 
patient tongue id: 02252120107638_5
label yaofang:
桂枝 甘草 白芍 黄芩 茯苓 桔梗 荆芥 防风 金银花 连翘 芦根 浙贝母 板蓝根 广藿香 大青叶
0.969139 0.509416 0.549201 0.436108 0.322998 0.522369 0.461653 0.51881 0.377575 0.380404 0.406265
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
485. 
patient tongue id: 03171341050059_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.381489 0.721444 0.422612 0.816788 0.516908 0.566474 0.350361 0.763366 0.790563 0.717949 0.77993 0.355315 0.889726 0.385576 0.527027 0.418388 0.573645
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.866667, error: 0.235294
486. 
patient tongue id: 01040659588675_6_1
label yaofang:
甘草 柴胡 白芍 香附 茯苓 木香 党参 延胡索 郁金 砂仁 鸡内金 麦芽 佛手 合欢花
0.995954 0.562724 0.680201 0.353451 0.422454 0.329742 0.723573 0.623453 0.596179 0.504519 0.533484 0.542884
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
487. 
patient tongue id: 06050809524703_1_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 车前子 干姜 鸡内金
0.402253 0.36423 0.369916 0.411866 0.537138 0.397688 0.407066 0.342704 0.356045 0.320406 0.349236 0.335008
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
488. 
patient tongue id: 02252111488011_1_6
label yaofang:
甘草 茯苓 党参 白术 栀子 牡丹皮 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.951037 0.507857 0.539875 0.431738 0.320203 0.505066 0.44534 0.493374 0.357732 0.371381 0.382118
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
489. 
patient tongue id: 03302120479306_1_4
label yaofang:
甘草 白芍 枳壳 薏苡仁 党参 延胡索 浙贝母 郁金 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲
0.987049 0.553187 0.625634 0.35713 0.392106 0.33201 0.654549 0.565765 0.53832 0.469635 0.481919 0.482901
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
490. 
patient tongue id: 02182009005132_6_2_4
label yaofang:
甘草 白芍 薏苡仁 党参 生地黄 郁金 石菖蒲 天麻 鳖甲 莪术 辛夷 百合 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.975835 0.533074 0.593231 0.362196 0.357618 0.307583 0.597255 0.516215 0.49654 0.427147 0.437218 0.425347
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
491. 
patient tongue id: 05182014049361_1_2
label yaofang:
黄芪 白术 杜仲 生半夏 砂仁 鸡内金 续断 合欢皮 山慈菇 蛇舌草 稻芽 红芪
0.499781 0.400756 0.332046 0.522699 0.525962 0.407064 0.314174 0.349678
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
492. 
patient tongue id: 03141252213917_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.610304 0.407534 0.349166 0.494825 0.370726 0.301548 0.403151 0.346754 0.354379 0.318989 0.343171 0.432309
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 酸枣仁 丹参 红花 牛膝 泽泻 莱菔子 天麻

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
493. 
patient tongue id: 06012130478797_3_4_6
label yaofang:
甘草 白芍 法半夏 茯苓 党参 黄芪 白术 五味子 细辛 款冬花 地龙 苦杏仁 紫苏子 炙麻黄 川加皮
0.814885 0.468075 0.528503 0.314937 0.465883
predicted yaofang:
甘草 茯苓 党参 酸枣仁 天麻

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
494. 
patient tongue id: 06170911050273_1_2_6
label yaofang:
龙齿 黄芪 白术 丹参 牡丹皮 砂仁 鸡内金 莲子 北沙参 首乌藤 合欢皮 墨旱莲
0.467796 0.380675 0.359222 0.573531 0.425941 0.401255 0.320136
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
495. 
patient tongue id: 03111505296377_3_4
label yaofang:
甘草 香附 法半夏 茯苓 白术 杜仲 山药 山茱萸 泽泻 天麻 补骨脂 桑螵蛸 益智 佛手 合欢花
0.617488 0.386721 0.415656 0.343656 0.463918
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
496. 
patient tongue id: 03221311417781_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 薏苡仁 桃仁 鱼腥草 浙贝母 细辛 桑白皮 地骨皮 苇茎 苦杏仁
0.967659 0.533467 0.566666 0.367182 0.331845 0.557631 0.482477 0.471098 0.399147 0.399299 0.381343
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
497. 
patient tongue id: 02182203165868_7_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 芦根 牛蒡子 桃仁 玄参 浙贝母 板蓝根 紫苏梗 威灵仙
0.934485 0.307728 0.51713 0.536389 0.337538 0.309513 0.525386 0.401879 0.385469 0.325918 0.325134 0.308496
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
498. 
patient tongue id: 03221258216564_4_1
label yaofang:
甘草 薏苡仁 党参 牡丹皮 山药 灯心草 天麻 鳖甲 茵陈 扁豆花 麦芽 蜈蚣 白花蛇舌 天山雪莲 木棉花
0.985833 0.544146 0.626286 0.358353 0.387959 0.317134 0.637939 0.537735 0.511808 0.44585 0.455091 0.453061
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
499. 
patient tongue id: 01070844265000_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.840751 0.464179 0.493119 0.329568 0.374958 0.410168
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
------Average Score: average precision: 0.458104, average recall: 0.368405, error: 0.541896