8512/8539 [============================>.] - ETA: 0s - loss: 0.1601Epoch 00000: val_loss improved from inf to 0.08370, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 69s - loss: 0.1599 - val_loss: 0.0837
Epoch 2/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0992Epoch 00001: val_loss improved from 0.08370 to 0.08072, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0992 - val_loss: 0.0807
Epoch 3/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0918Epoch 00002: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0918 - val_loss: 0.0812
Epoch 4/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0884Epoch 00003: val_loss improved from 0.08072 to 0.07844, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0884 - val_loss: 0.0784
Epoch 5/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0861Epoch 00004: val_loss improved from 0.07844 to 0.07702, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0861 - val_loss: 0.0770
Epoch 6/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0846Epoch 00005: val_loss improved from 0.07702 to 0.07596, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0846 - val_loss: 0.0760
Epoch 7/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0834Epoch 00006: val_loss improved from 0.07596 to 0.07568, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0834 - val_loss: 0.0757
Epoch 8/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0823Epoch 00007: val_loss improved from 0.07568 to 0.07488, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0823 - val_loss: 0.0749
Epoch 9/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0816Epoch 00008: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0816 - val_loss: 0.0756
Epoch 10/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0808Epoch 00009: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0808 - val_loss: 0.0756
Epoch 11/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0805Epoch 00010: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0805 - val_loss: 0.0751
Epoch 12/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0796Epoch 00011: val_loss improved from 0.07488 to 0.07411, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0795 - val_loss: 0.0741
Epoch 13/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0792Epoch 00012: val_loss improved from 0.07411 to 0.07405, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0791 - val_loss: 0.0741
Epoch 14/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0789Epoch 00013: val_loss improved from 0.07405 to 0.07354, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0789 - val_loss: 0.0735
Epoch 15/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0778Epoch 00014: val_loss improved from 0.07354 to 0.07342, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0778 - val_loss: 0.0734
Epoch 16/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0778Epoch 00015: val_loss improved from 0.07342 to 0.07331, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0778 - val_loss: 0.0733
Epoch 17/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0773Epoch 00016: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0773 - val_loss: 0.0736
Epoch 18/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0771Epoch 00017: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0771 - val_loss: 0.0734
Epoch 19/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0766Epoch 00018: val_loss improved from 0.07331 to 0.07287, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0766 - val_loss: 0.0729
Epoch 20/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0764Epoch 00019: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0764 - val_loss: 0.0731
Epoch 21/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0759Epoch 00020: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0759 - val_loss: 0.0729
Epoch 22/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0756Epoch 00021: val_loss improved from 0.07287 to 0.07277, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0757 - val_loss: 0.0728
Epoch 23/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0750Epoch 00022: val_loss improved from 0.07277 to 0.07272, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0750 - val_loss: 0.0727
Epoch 24/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0747Epoch 00023: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0747 - val_loss: 0.0748
Epoch 25/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0744Epoch 00024: val_loss improved from 0.07272 to 0.07234, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0744 - val_loss: 0.0723
Epoch 26/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0745Epoch 00025: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0745 - val_loss: 0.0724
Epoch 27/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0741Epoch 00026: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0740 - val_loss: 0.0725
Epoch 28/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0737Epoch 00027: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0737 - val_loss: 0.0728
Epoch 29/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0734Epoch 00028: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0734 - val_loss: 0.0724
Epoch 30/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0730Epoch 00029: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0730 - val_loss: 0.0730
Epoch 31/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0727Epoch 00030: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0727 - val_loss: 0.0725
Epoch 32/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0727Epoch 00031: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0727 - val_loss: 0.0732
Epoch 33/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0724Epoch 00032: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0724 - val_loss: 0.0726
Epoch 34/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0724Epoch 00033: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0724 - val_loss: 0.0732
Epoch 35/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0722Epoch 00034: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0721 - val_loss: 0.0730
Epoch 36/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0714Epoch 00035: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0714 - val_loss: 0.0733
Epoch 37/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0714Epoch 00036: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0714 - val_loss: 0.0726
Epoch 38/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0711Epoch 00037: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0711 - val_loss: 0.0729
Epoch 39/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0708Epoch 00038: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0708 - val_loss: 0.0733
Epoch 40/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0709Epoch 00039: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0709 - val_loss: 0.0732
Epoch 41/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0704Epoch 00040: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0704 - val_loss: 0.0738
Epoch 42/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0703Epoch 00041: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0703 - val_loss: 0.0738
Epoch 43/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0701Epoch 00042: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0701 - val_loss: 0.0736
Epoch 44/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0698Epoch 00043: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0698 - val_loss: 0.0736
Epoch 45/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0697Epoch 00044: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0697 - val_loss: 0.0734
Epoch 46/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0695Epoch 00045: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0695 - val_loss: 0.0739
Epoch 47/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0690Epoch 00046: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0690 - val_loss: 0.0732
Epoch 48/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0690Epoch 00047: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0690 - val_loss: 0.0735
Epoch 49/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0689Epoch 00048: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0689 - val_loss: 0.0733
Epoch 50/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0686Epoch 00049: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0686 - val_loss: 0.0737
Epoch 51/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0682Epoch 00050: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0682 - val_loss: 0.0739
Epoch 52/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0681Epoch 00051: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0681 - val_loss: 0.0743
Epoch 53/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0678Epoch 00052: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0678 - val_loss: 0.0740
Epoch 54/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0675Epoch 00053: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0675 - val_loss: 0.0743
Epoch 55/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0675Epoch 00054: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0675 - val_loss: 0.0741
Epoch 56/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0672Epoch 00055: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0672 - val_loss: 0.0744
Epoch 57/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0667Epoch 00056: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0667 - val_loss: 0.0745
Epoch 58/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0664Epoch 00057: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0664 - val_loss: 0.0746
Epoch 59/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0663Epoch 00058: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0663 - val_loss: 0.0745
Epoch 60/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00059: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0660 - val_loss: 0.0748
Epoch 61/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0657Epoch 00060: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0658 - val_loss: 0.0749
Epoch 62/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0655Epoch 00061: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0656 - val_loss: 0.0750
Epoch 63/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0651Epoch 00062: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0651 - val_loss: 0.0752
Epoch 64/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0650Epoch 00063: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0651 - val_loss: 0.0751
Epoch 65/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0647Epoch 00064: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0647 - val_loss: 0.0759
Epoch 66/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0644Epoch 00065: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0644 - val_loss: 0.0757
Epoch 67/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0644Epoch 00066: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0644 - val_loss: 0.0753
Epoch 68/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0642Epoch 00067: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0642 - val_loss: 0.0757
Epoch 69/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0638Epoch 00068: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0638 - val_loss: 0.0761
Epoch 70/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0634Epoch 00069: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0634 - val_loss: 0.0759
Epoch 71/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0634Epoch 00070: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0634 - val_loss: 0.0757
Epoch 72/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0633Epoch 00071: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0633 - val_loss: 0.0764
Epoch 73/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0628Epoch 00072: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0628 - val_loss: 0.0768
Epoch 74/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0628Epoch 00073: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0628 - val_loss: 0.0760
Epoch 75/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0625Epoch 00074: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0625 - val_loss: 0.0763
Epoch 76/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0624Epoch 00075: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0624 - val_loss: 0.0767
Epoch 77/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0623Epoch 00076: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0623 - val_loss: 0.0770
Epoch 78/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0621Epoch 00077: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0620 - val_loss: 0.0767
Epoch 79/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0617Epoch 00078: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0617 - val_loss: 0.0772
Epoch 80/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0614Epoch 00079: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0614 - val_loss: 0.0768
history: [(0.15989681650993626, None, 0.083697708207609023, None), (0.09918139700777065, None, 0.080715613978686346, None), (0.091779127973543567, None, 0.081223138222545926, None), (0.088415623383906503, None, 0.078444334668117566, None), (0.086088401320521174, None, 0.077017380450016409, None), (0.08464629136768434, None, 0.075958948377724531, None), (0.083442766158736303, None, 0.07568287347262595, None), (0.082281381378674731, None, 0.074877644060077242, None), (0.081591179751235796, None, 0.075559642561626089, None), (0.080814390002962214, None, 0.075576880967224036, None), (0.080466050128074562, None, 0.075145462848546299, None), (0.079544466555586238, None, 0.074113824483239166, None), (0.079144927725284878, None, 0.074051941270793314, None), (0.078897704351233125, None, 0.073535821212953698, None), (0.077848175125457678, None, 0.073422773089601004, None), (0.077795591662130834, None, 0.073308494965453719, None), (0.077267156845164359, None, 0.073582694644019717, None), (0.077063072298739918, None, 0.073353903033794507, None), (0.076633359130071882, None, 0.072866044256276699, None), (0.076388050473215202, None, 0.073121646876300211, None), (0.07587566662639543, None, 0.072906606854536593, None), (0.075652561894218678, None, 0.072774211947734535, None), (0.075028597551202419, None, 0.072720896793809123, None), (0.074742281451927781, None, 0.074834931464422313, None), (0.074380700148503329, None, 0.072339295030950185, None), (0.074452912110134231, None, 0.072404442061653071, None), (0.074046527141220245, None, 0.072465629477203988, None), (0.07366882016726771, None, 0.072838308937820326, None), (0.073375993332024936, None, 0.072383493730873411, None), (0.073042714943238315, None, 0.072995405330326099, None), (0.072726469665385332, None, 0.072503478672259897, None), (0.072698767058658631, None, 0.073199808897771237, None), (0.072441127231087837, None, 0.072574992647101155, None), (0.072390267302831088, None, 0.073210323577398775, None), (0.072139020938967666, None, 0.07298691256906524, None), (0.071412008412340258, None, 0.073345193250493684, None), (0.07144575126906276, None, 0.072584910215912291, None), (0.071092156426997885, None, 0.072907184151721094, None), (0.070836866370673088, None, 0.073328621385298373, None), (0.070880600839019148, None, 0.073174408722273154, None), (0.070411567802325339, None, 0.073766897613312302, None), (0.070306576566801435, None, 0.073776940177211828, None), (0.070058884264253204, None, 0.07355105642215673, None), (0.069826617034219551, None, 0.073562618113044417, None), (0.069722393013921719, None, 0.073358045583897899, None), (0.069478521573974925, None, 0.073852156435613672, None), (0.068988271118683234, None, 0.07324524466698859, None), (0.069014983806841568, None, 0.073517747523583768, None), (0.068910682310626942, None, 0.073286008430924601, None), (0.068578845531966429, None, 0.073667378980161513, None), (0.06824243631480463, None, 0.073919369569628232, None), (0.068068046624061018, None, 0.074347002247532643, None), (0.06777881542732235, None, 0.073967677332979417, None), (0.067512440851950961, None, 0.074294084921861306, None), (0.067462836487003006, None, 0.074079058409392176, None), (0.067180990981705255, None, 0.074422413831228731, None), (0.066693472603449627, None, 0.074486260885720731, None), (0.066363047056719401, None, 0.07463233134685418, None), (0.066333637257512443, None, 0.074480981262393928, None), (0.066035796393554072, None, 0.074796197233182607, None), (0.065758737088792402, None, 0.074938345031860545, None), (0.065555155624521327, None, 0.075004526874521277, None), (0.065075373006363998, None, 0.075229152709573185, None), (0.065052345162993755, None, 0.075101161669025487, None), (0.064712802012102957, None, 0.075935017167430216, None), (0.064407132249681073, None, 0.075686170941307432, None), (0.06441047653121347, None, 0.07531903790576118, None), (0.064201341433482648, None, 0.075661594341526098, None), (0.063825305266407673, None, 0.076114119845868911, None), (0.063429082289995997, None, 0.075914815914281564, None), (0.063429559497109253, None, 0.075680851990923337, None), (0.06329024648366928, None, 0.076420662167308098, None), (0.062810669505550087, None, 0.076818761698928942, None), (0.062794757454397249, None, 0.076009168838843316, None), (0.062491184574949864, None, 0.076284808226120784, None), (0.062372536118059305, None, 0.076739154483154146, None), (0.062279260608592624, None, 0.077015194673459603, None), (0.06204542530924588, None, 0.076659163603415861, None), (0.061711180685121853, None, 0.07724131611022321, None), (0.06144628097743951, None, 0.076839848534091482, None)]
0. 
patient tongue id: 05032315187968_1_2_5
label yaofang:
甘草 黄芩 桔梗 金银花 连翘 薄荷 芦根 牛蒡子 麦冬 太子参 浙贝母 天花粉 鳖甲 诃子 白花蛇舌
0.993505 0.586236 0.612496 0.364432 0.438893 0.360604 0.724531 0.689977 0.662007 0.578764 0.621494 0.642842
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
1. 
patient tongue id: 06121813533688_5
label yaofang:
甘草 金银花 芦根 薏苡仁 黄柏 野菊花 茵陈 夏枯草 土茯苓 木棉花
0.460452 0.361519 0.482106 0.50818 0.309518
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
2. 
patient tongue id: 05192000248873_2_6
label yaofang:
桂枝 甘草 川芎 茯苓 桃仁 党参 白术 生地黄 牡丹皮 山药 菟丝子 益母草 合欢花
0.983623 0.564699 0.597162 0.368635 0.407271 0.348982 0.650697 0.623657 0.571965 0.517892 0.545256 0.516806
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
3. 
patient tongue id: 04071401296033_1_2_3
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 厚朴 肉苁蓉
0.412462 0.357321 0.32511 0.494263 0.359412
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
4. 
patient tongue id: 02131318351272_1_2_7
label yaofang:
甘草 法半夏 橘红 防风 金银花 太子参 藿香 白前 鸡内金 辛夷 蜜百部 干鱼腥草
0.571231 0.388194 0.344534 0.47303 0.469
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
5. 
patient tongue id: 02202239234784_4_6_3
label yaofang:
甘草 薏苡仁 党参 黄芪 白术 丹参 熟附子 赤芍 山药 干姜 益母草 鳖甲 射干 莪术 紫苏梗 土鳖虫
0.971295 0.555447 0.579054 0.375922 0.389608 0.360556 0.608287 0.604862 0.55151 0.505895 0.52196 0.481249
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
6. 
patient tongue id: 03012022067732_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.418863 0.729497 0.413203 0.870965 0.438321 0.599927 0.36493 0.413728 0.37736 0.322401 0.403546 0.772907 0.777293 0.699797 0.801944 0.346165 0.872958 0.423997 0.457563 0.490418 0.571117
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
7. 
patient tongue id: 03170851202199_1_3
label yaofang:
甘草 当归 木香 党参 黄芪 丹参 枳实 大黄 厚朴 肉苁蓉 草豆蔻 六神曲
0.580852 0.389025 0.345048 0.473141 0.426882 0.376539 0.347796 0.313384
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
8. 
patient tongue id: 05221849341963_3
label yaofang:
桂枝 甘草 川芎 桔梗 薄荷 芦根 牛蒡子 浙贝母 桑叶 菊花 白芷 蔓荆子 苦杏仁 紫苏叶
0.4253 0.351051 0.332024 0.332636 0.310872 0.441602
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
9. 
patient tongue id: 02211851256656_2
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 火麻仁 麦芽 百合 紫苏叶 姜黄 鹿衔草
0.366796 0.369694 0.452147 0.356562 0.380539 0.405882 0.518222
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
10. 
patient tongue id: 03081426469129_1_2_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 赤芍 牛膝 郁金 六神曲
0.744753 0.435121 0.428793 0.343632 0.471416
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
11. 
patient tongue id: 02212102000446_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.474302 0.740454 0.370353 0.908051 0.436418 0.634655 0.401656 0.438773 0.411531 0.306653 0.406841 0.821311 0.834721 0.757646 0.849425 0.413538 0.922463 0.447216 0.487095 0.544295 0.61831
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 1.000000, error: 0.285714
12. 
patient tongue id: 05162221261895_4
label yaofang:
麻黄 前胡 半夏 防风 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 苍耳子
0.478685 0.798306 0.305996 0.957228 0.423261 0.708831 0.366999 0.435465 0.411017 0.399296 0.889842 0.901854 0.832296 0.914083 0.390516 0.967883 0.465134 0.519611 0.556315 0.666598
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.733333, error: 0.450000
13. 
patient tongue id: 04201438535233_1_4_7
label yaofang:
甘草 麦冬 太子参 枸杞子 丹参 玄参 生地黄 牡丹皮 知母 山药 天花粉 北沙参
0.45951 0.35765 0.382979 0.476372 0.370042
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
14. 
patient tongue id: 04251950373840_2_1
label yaofang:
甘草 桔梗 黄芪 白术 柏子仁 枳实 槟榔 厚朴 肉苁蓉 火麻仁 紫菀
0.704591 0.30791 0.374708 0.495094 0.358098 0.302771
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
15. 
patient tongue id: 05092010330173_4
label yaofang:
甘草 柴胡 白芍 当归 茯苓 白术 栀子 牡丹皮 牛膝 苏木 败酱草 车前草 墨旱莲 鹿衔草
0.596315 0.376893 0.321632 0.473458 0.394401 0.359588 0.327114 0.315086
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
16. 
patient tongue id: 03021253300788_1_3
label yaofang:
柴胡 法半夏 薏苡仁 党参 黄芪 延胡索 栀子 郁金 炙甘草 白鲜皮 地肤子 大青叶
0.463101 0.3776 0.39739 0.40652
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
17. 
patient tongue id: 05241941170238_4_6
label yaofang:
甘草 桔梗 金银花 薏苡仁 党参 白术 浙贝母 泽泻 天麻 鳖甲 豆蔻 苦杏仁 蜈蚣 天山雪莲 半枝莲
0.972857 0.537633 0.551065 0.404861 0.345108 0.344895 0.553519 0.516426 0.545723 0.415529 0.433179 0.443094
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
18. 
patient tongue id: 03101754205515_4
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.374195 0.372733 0.322241 0.301266 0.351674 0.324168 0.549774
predicted yaofang:
法半夏 茯苓 前胡 防风 黄芪 紫菀 炙甘草

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
19. 
patient tongue id: 02021010331063_1_5
label yaofang:
甘草 茯苓 玉竹 党参 白术 浙贝母 杜仲 牛膝 砂仁 天麻 桑寄生 珍珠母 预知子
0.357517 0.555867 0.398905 0.699832 0.344272 0.475934 0.316064 0.305829 0.306497 0.58839 0.578282 0.528699 0.604262 0.356782 0.697642 0.338568 0.363325 0.321774 0.391887
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.052632, recall: 0.076923, error: 0.947368
20. 
patient tongue id: 03132044584392_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.626378 0.435512 0.433589 0.336746 0.349043
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
21. 
patient tongue id: 04131858210536_4_7
label yaofang:
甘草 桃仁 葶苈子 黄芪 红花 赤芍 胆南星 牡丹皮 牛膝 大黄 厚朴 生半夏 砂仁 北沙参 赭石 瓜蒌子 黑枣
0.453513 0.37282 0.535444 0.561114 0.36956 0.34995 0.337418
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.714286, recall: 0.294118, error: 0.285714
22. 
patient tongue id: 05162218534053_2
label yaofang:
法半夏 茯苓 前胡 太子参 柏子仁 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 制远志 炒紫苏子 蜜麻黄
0.461137 0.877821 0.981411 0.426907 0.761922 0.332226 0.443109 0.381922 0.389792 0.934224 0.946299 0.875771 0.951732 0.331974 0.985557 0.442512 0.53168 0.587899 0.70914
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.812500, error: 0.315789
23. 
patient tongue id: 04112256007733_1_6
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶 独脚金
0.418461 0.314874 0.348686 0.334759 0.34136 0.447529 0.366683
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
24. 
patient tongue id: 05162137529786_4_2
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 橘红 芦根 酸枣仁 生地黄 浙贝母 鳖甲 白花蛇舌 蜂房 岗梅根 四季青
0.946618 0.530635 0.556095 0.401085 0.376879 0.338774 0.555314 0.534283 0.503158 0.445915 0.463637 0.423582
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
25. 
patient tongue id: 06022228410780_1_4_7
label yaofang:
甘草 陈皮 半夏 党参 白术 海螵蛸 杜仲 牛膝 山药 僵蚕 莪术 鸡内金 桑椹 紫苏梗 骨碎补 红豆杉 预知子
0.495522 0.361208 0.547631 0.537332 0.368726 0.302567
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 砂仁

------Score: precision: 0.333333, recall: 0.117647, error: 0.666667
26. 
patient tongue id: 04202018543058_5_7_6
label yaofang:
甘草 茯苓 太子参 黄芪 白术 赤芍 浙贝母 砂仁 北沙参 辛夷 合欢皮 蛇舌草 鲜龙葵果
0.840251 0.462258 0.453378 0.452185 0.304333 0.370549
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
27. 
patient tongue id: 03111500081471_6_5_2
label yaofang:
甘草 川芎 茯苓 党参 丹参 生地黄 栀子 牡丹皮 牛膝 石膏 钩藤 天麻 天花粉 石决明 赭石 粉葛
0.992926 0.58588 0.61969 0.33677 0.408467 0.344172 0.708571 0.665729 0.609888 0.541825 0.576077 0.569658
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
28. 
patient tongue id: 04202008022499_6_1_4
label yaofang:
甘草 茯苓 桔梗 牛蒡子 蒲公英 党参 海螵蛸 郁金 枇杷叶 北沙参 木蝴蝶 龙脷叶
0.612871 0.387047 0.423034 0.345331 0.356947
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
29. 
patient tongue id: 01192144269748_5_1_6
label yaofang:
甘草 枳壳 法半夏 薏苡仁 党参 丹参 赤芍 栀子 薤白 水蛭 厚朴 三棱 莪术 豆蔻 苦杏仁 瓜蒌子
0.857697 0.482312 0.447324 0.467583 0.325099 0.445051
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
30. 
patient tongue id: 03151849571614_4_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 瓦楞子
0.338781 0.37171 0.327749
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
31. 
patient tongue id: 06191206377802_1_4
label yaofang:
甘草 枳壳 薏苡仁 生地黄 牡丹皮 郁金 山药 天麻 地骨皮 鳖甲 莪术 浮小麦 蜈蚣 白花蛇舌 天山雪莲
0.988122 0.588058 0.606718 0.360488 0.42612 0.360703 0.676288 0.639466 0.592458 0.532811 0.556401 0.535271
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
32. 
patient tongue id: 03282216294439_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗
0.390827 0.345296 0.436484 0.362782 0.375555 0.359128 0.479544
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.400000, error: 0.428571
33. 
patient tongue id: 06140830371367_1_4_7
label yaofang:
桃仁 丹参 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.557727 0.379872 0.438277 0.362446
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
34. 
patient tongue id: 06020745487833_1_3
label yaofang:
甘草 法半夏 桔梗 橘红 金银花 薏苡仁 白前 鸡内金 蜜百部 干鱼腥草 稻芽
0.445616 0.30927 0.309581 0.419442 0.310673
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
35. 
patient tongue id: 02170747116568_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.39877 0.348988 0.397447 0.445995
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
36. 
patient tongue id: 03282214315784_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶
0.592706 0.31217 0.407626 0.350779 0.410292 0.374802
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术

------Score: precision: 0.166667, recall: 0.100000, error: 0.833333
37. 
patient tongue id: 05250029577059_1_5_6
label yaofang:
甘草 陈皮 法半夏 茯苓 砂仁 莱菔子 天麻 鳖甲 苦杏仁 紫苏子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.93803 0.522033 0.524447 0.366302 0.321681 0.32651 0.498401 0.402548 0.431404 0.301429 0.309376
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
38. 
patient tongue id: 03011855154941_4_1
label yaofang:
法半夏 前胡 防风 钩藤 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子
0.43941 0.767065 0.365411 0.924039 0.427765 0.649138 0.367315 0.417565 0.382064 0.394985 0.832966 0.84964 0.762126 0.867915 0.369418 0.934719 0.436549 0.483059 0.52159 0.610017
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
39. 
patient tongue id: 01250706281558_6_1_4
label yaofang:
甘草 法半夏 茯苓 龙骨 薏苡仁 远志 酸枣仁 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.960794 0.533551 0.580112 0.371878 0.38402 0.336511 0.59409 0.541492 0.496474 0.444822 0.461115 0.426079
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
40. 
patient tongue id: 01202011533510_4_5
label yaofang:
甘草 茯苓 白术 海螵蛸 浙贝母 大黄 厚朴 生半夏 火麻仁 莪术 鸡内金 蜈蚣 山慈菇 稻芽
0.414768 0.400736 0.440439 0.336854 0.347432
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
41. 
patient tongue id: 05251935084325_1_5
label yaofang:
甘草 白芍 枳壳 黄芪 白术 杜仲 乌药 厚朴 桑寄生 北沙参 蜈蚣 合欢皮 冬凌草 荔枝核 鸭脚艾
0.629949 0.397731 0.317182 0.563089 0.595494 0.31717 0.416395 0.353179 0.312298
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.666667, recall: 0.400000, error: 0.333333
42. 
patient tongue id: 05222256322084_4_1
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.376673 0.416923 0.466856 0.407141 0.320517
predicted yaofang:
甘草 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
43. 
patient tongue id: 02211819390295_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.429577 0.65409 0.370575 0.840098 0.395396 0.591228 0.370023 0.394195 0.388631 0.367641 0.739794 0.753056 0.701137 0.783615 0.409226 0.863929 0.434437 0.455315 0.510993 0.572635
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
44. 
patient tongue id: 01211156069739_1_7
label yaofang:
甘草 陈皮 葛根 党参 黄芪 赤芍 黄柏 升麻 蔓荆子
0.532762 0.362234 0.349641 0.40822 0.348778 0.317824
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.222222, error: 0.666667
45. 
patient tongue id: 01140816310922_1_2_6
label yaofang:
甘草 茯苓 龙骨 党参 酸枣仁 黄柏 牛膝 山药 山茱萸 地黄 青蒿 浮小麦 醋龟甲 合欢花
0.916465 0.508053 0.504287 0.380409 0.471215 0.439802 0.447675 0.345781 0.369439 0.351348
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
46. 
patient tongue id: 05191018286052_1_2
label yaofang:
甘草 法半夏 橘红 防风 金银花 太子参 藿香 白前 鸡内金 辛夷 蜜百部 干鱼腥草
0.32899 0.350644 0.350084
predicted yaofang:
党参 黄芪 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
47. 
patient tongue id: 05262101082118_2_4
label yaofang:
桂枝 甘草 白芍 党参 白术 桑叶 天麻 糯稻根 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.936252 0.501206 0.499963 0.450675 0.305534 0.454159 0.427064 0.521171 0.317455 0.35942 0.393717
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
48. 
patient tongue id: 05140839544138_5_6
label yaofang:
甘草 柴胡 白芍 枳壳 党参 酸枣仁 生地黄 牡丹皮 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.977683 0.55609 0.581806 0.365912 0.374363 0.327297 0.609054 0.588608 0.544643 0.479522 0.507292 0.480103
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
49. 
patient tongue id: 03180151242430_1_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮
0.436927 0.304125 0.362336 0.315125 0.354017 0.446339 0.347531
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
50. 
patient tongue id: 06071953147055_1
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 知母 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.982021 0.56258 0.586837 0.386876 0.410895 0.37348 0.652621 0.638881 0.594662 0.547744 0.56583 0.531741
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
51. 
patient tongue id: 04141858179075_4
label yaofang:
甘草 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 香薷 紫菀 辛夷 紫苏梗 广藿香 苍耳子
0.466881 0.722478 0.347129 0.904604 0.419131 0.648378 0.380229 0.420915 0.405761 0.400639 0.811146 0.828268 0.759156 0.847583 0.410285 0.923704 0.462217 0.493652 0.538833 0.616375
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.428571, error: 0.700000
52. 
patient tongue id: 01041301307309_6_1
label yaofang:
茯苓 麦冬 党参 酸枣仁 柏子仁 附子 干姜 磁石 炙甘草
0.442927 0.32589 0.356916 0.390133 0.348553 0.352117
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
53. 
patient tongue id: 01101813312426_4_6_1
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.403116 0.678995 0.422049 0.831533 0.411002 0.556491 0.351669 0.382461 0.355916 0.348504 0.726064 0.73162 0.648604 0.751592 0.354928 0.819957 0.392003 0.430578 0.446056 0.519987
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
54. 
patient tongue id: 03012332349717_2_6
label yaofang:
甘草 川芎 龙骨 党参 枸杞子 酸枣仁 生地黄 牛膝 知母 天麻 桑寄生 麦芽 首乌藤 合欢花
0.962438 0.524094 0.558738 0.420998 0.385355 0.367348 0.577628 0.58291 0.575604 0.494512 0.512574 0.521163
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
55. 
patient tongue id: 06191327021012_3_4
label yaofang:
甘草 柴胡 白芍 川芎 茯苓 木香 蒲公英 白及 党参 杜仲 牛膝 天麻 五灵脂 桑寄生 建曲 罗布麻
0.950708 0.530472 0.522695 0.388127 0.321463 0.477276 0.410778 0.457541 0.308481 0.318254
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
56. 
patient tongue id: 03231206395312_1_6
label yaofang:
甘草 大枣 茯苓 木香 远志 党参 白术 砂仁 天麻 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.969173 0.530636 0.568079 0.387556 0.369434 0.333086 0.604078 0.582794 0.571143 0.481829 0.515677 0.535635
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
57. 
patient tongue id: 03192253480337_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 牛蒡子 桃仁 党参 浙贝母 诃子 麦芽 紫苏梗 猫爪草
0.974255 0.569262 0.563985 0.353375 0.360345 0.325705 0.597575 0.578039 0.53162 0.475743 0.492132 0.462447
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
58. 
patient tongue id: 02271844423461_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.395997 0.679647 0.402459 0.83084 0.404717 0.553661 0.348127 0.366207 0.340296 0.348024 0.717011 0.71823 0.647096 0.751768 0.362808 0.824181 0.394889 0.415339 0.44914 0.517063
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
59. 
patient tongue id: 06070700518837_6_5
label yaofang:
甘草 法半夏 茯苓 木香 党参 白术 黄连 生地黄 肉桂 没药 淡竹叶 豆蔻 麦芽 苦杏仁 川木通
0.986698 0.582565 0.601342 0.363923 0.418135 0.37015 0.663327 0.654575 0.598847 0.544574 0.560507 0.530843
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
60. 
patient tongue id: 03311646042802_4
label yaofang:
柴胡 白芍 香附 枳壳 半夏 党参 延胡索 鸡内金 麦芽 炙甘草 紫苏梗 螵蛸
0.338573 0.38622 0.350718
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.333333, recall: 0.083333, error: 0.666667
61. 
patient tongue id: 04141308059963_4_2
label yaofang:
法半夏 茯苓 前胡 桔梗 木香 麦冬 太子参 郁金 北柴胡 款冬花 紫菀 白前 百部 北沙参 炙甘草 人参叶
0.371617 0.564054 0.39128 0.704729 0.362859 0.488422 0.339913 0.331537 0.341093 0.307039 0.594422 0.618567 0.551199 0.628392 0.374216 0.768594 0.348374 0.37462 0.368308 0.432565
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.687500, error: 0.450000
62. 
patient tongue id: 02272210171140_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 侧柏叶 炙甘草 百合 紫苏叶 青葙子
0.460563 0.316018 0.398973 0.323991 0.378465 0.381563 0.389284
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
63. 
patient tongue id: 01052113315962_2
label yaofang:
柴胡 白芍 黄芩 龙骨 牡蛎 麦冬 玄参 枳实 石膏 干姜 大黄 生地 法夏
0.928946 0.316818 0.510271 0.540514 0.390275 0.322034 0.494254 0.47551 0.470638 0.381615 0.399946 0.36798
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.076923, error: 0.916667
64. 
patient tongue id: 04122131259885_4_2
label yaofang:
陈皮 半夏 芦根 薏苡仁 麦冬 胆南星 石菖蒲 桑白皮 厚朴 瓜蒌皮 炙甘草 广藿香 土茯苓 青果
0.564293 0.381309 0.407413 0.308573 0.377346
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
65. 
patient tongue id: 05232018459156_1
label yaofang:
甘草 枳壳 茯苓 半夏 牡蛎 赤芍 浙贝母 郁金 厚朴 淡豆豉 砂仁 莪术 王不留行 麦芽 北沙参 合欢皮 预知子 蛇舌草
0.702539 0.440287 0.417318 0.341919 0.43302
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.111111, error: 0.600000
66. 
patient tongue id: 04261944097030_2
label yaofang:
陈皮 龙骨 牡蛎 薏苡仁 麦冬 酸枣仁 黄连 栀子 灯心草 厚朴 茵陈 莲子心 百合 四季青
0.54665 0.384231 0.385256 0.426061 0.394627
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
67. 
patient tongue id: 05160621245319_5
label yaofang:
陈皮 茯苓 半夏 薏苡仁 延胡索 浙贝母 牛膝 白茅根 厚朴 砂仁 土茯苓 山慈菇 蛇舌草 鲜龙葵果
0.40453 0.398455 0.499054 0.417685 0.385362
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
68. 
patient tongue id: 05191953220086_1_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 郁金 山药 石菖蒲 天麻 鳖甲 扁豆花 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.988371 0.573601 0.606414 0.364404 0.413204 0.35266 0.677026 0.640168 0.600688 0.527691 0.558733 0.548871
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.800000, error: 0.000000
69. 
patient tongue id: 06080222055171_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 木香 党参 川楝子 山药 山茱萸 灯心草 菟丝子 益智 合欢花 广金钱草 土萆薢
0.926783 0.517176 0.523581 0.400539 0.355862 0.33225 0.525827 0.457435 0.481704 0.363438 0.388623 0.394676
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
70. 
patient tongue id: 04210415204585_4_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 扁豆花 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.982212 0.541971 0.577815 0.37426 0.398283 0.340908 0.655347 0.609086 0.604668 0.505803 0.559118 0.599918
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
71. 
patient tongue id: 03281923313683_6
label yaofang:
麻黄 桂枝 甘草 柴胡 白芍 黄芩 法半夏 当归 葛根 龙骨 桃仁 党参 红花 石膏 滑石 煅牡蛎 苦杏仁 天山雪莲
0.854682 0.476282 0.498228 0.417854 0.403143 0.353068 0.400281
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.111111, error: 0.714286
72. 
patient tongue id: 03242139319596_2_7
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.706854 0.333358 0.39608 0.455146 0.382685
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
73. 
patient tongue id: 06070237366457_1_2
label yaofang:
甘草 茯苓 龙骨 党参 白术 酸枣仁 杜仲 山药 石菖蒲 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.981651 0.559674 0.581494 0.378175 0.383828 0.352576 0.625773 0.620046 0.578533 0.507641 0.527481 0.510259
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
74. 
patient tongue id: 03012129244529_6_5
label yaofang:
甘草 香附 陈皮 法半夏 茯苓 桔梗 牛蒡子 桃仁 浙贝母 栀子 牡丹皮 细辛 威灵仙 合欢花
0.755605 0.300511 0.375352 0.408593 0.460209 0.413174 0.301413
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
75. 
patient tongue id: 05140144494434_1_4
label yaofang:
甘草 薏苡仁 党参 鸡血藤 红花 山药 天麻 鳖甲 豆蔻 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.950882 0.50981 0.559847 0.360948 0.359861 0.302471 0.577233 0.483278 0.471303 0.381386 0.421351 0.420593
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
76. 
patient tongue id: 03022133170102_4_1
label yaofang:
桂枝 白芍 牛蒡子 太子参 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.863854 0.474026 0.489745 0.370604 0.419209 0.339873 0.370664
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
77. 
patient tongue id: 01092336447011_4_1
label yaofang:
陈皮 茯苓 蒲公英 丹参 黄连 枳实 竹茹 姜半夏 炙甘草 首乌藤 合欢皮
0.386075 0.329591 0.301519 0.414932 0.397576 0.311732 0.333665
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
78. 
patient tongue id: 02182024440714_1_4_7
label yaofang:
甘草 白芍 木香 薏苡仁 党参 黄连 天麻 赤石脂 鳖甲 莪术 豆蔻 建曲 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.938401 0.534334 0.538509 0.387601 0.365107 0.347182 0.549767 0.549407 0.517498 0.463155 0.473536 0.442005
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
79. 
patient tongue id: 01012048352078_1_5
label yaofang:
甘草 当归 茯苓 木香 党参 黄芪 酸枣仁 丹参 郁金 浮小麦 首乌藤 制远志
0.814696 0.462237 0.506084 0.383145
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.750000, recall: 0.250000, error: 0.250000
80. 
patient tongue id: 01051852419566_2
label yaofang:
陈皮 法半夏 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.451065 0.716402 0.38884 0.871471 0.429356 0.60796 0.381684 0.42728 0.414837 0.305251 0.392214 0.784395 0.791482 0.725315 0.811918 0.390799 0.889626 0.438909 0.476257 0.534882 0.60212
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
81. 
patient tongue id: 05270619533167_1_4
label yaofang:
甘草 白芍 枳壳 薏苡仁 党参 白术 厚朴 天麻 肉苁蓉 鳖甲 火麻仁 败酱草 蜈蚣 天山雪莲 半枝莲 红豆杉
0.99562 0.608489 0.637781 0.351667 0.451353 0.369301 0.73357 0.709836 0.647148 0.59285 0.620338 0.586406
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
82. 
patient tongue id: 04172227127295_1
label yaofang:
麻黄 桂枝 川芎 陈皮 枳壳 茯苓 桔梗 牛蒡子 蔓荆子 炙甘草 辛夷 百合 紫苏叶 苍耳子
0.462127 0.358699 0.399058 0.374882 0.311688
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
83. 
patient tongue id: 04120235160216_6_5_2
label yaofang:
甘草 黄芩 桔梗 党参 丹参 浙贝母 乌梅 知母 天花粉 鳖甲 鹿角霜 白花蛇舌 蜂房 岗梅根 四季青
0.957242 0.531411 0.567906 0.37255 0.354276 0.31184 0.565625 0.545609 0.497582 0.447636 0.46222 0.415247
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
84. 
patient tongue id: 04071412414750_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.4551 0.336353 0.42347 0.382291 0.310785
predicted yaofang:
甘草 茯苓 党参 黄芪 牛膝

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
85. 
patient tongue id: 05181822185525_3
label yaofang:
甘草 麦冬 玉竹 生地黄 附子 干姜 鳖甲 吴茱萸 龟甲
0.923946 0.509227 0.546699 0.378729 0.350974 0.321369 0.532517 0.451115 0.449534 0.351195 0.377881 0.353423
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.222222, error: 0.833333
86. 
patient tongue id: 04192239251218_2_1
label yaofang:
甘草 黄芩 太子参 生地黄 浙贝母 乌梅 山茱萸 白茅根 鳖甲 北沙参 白花蛇舌 天山雪莲 蜂房 四季青
0.977063 0.563204 0.582367 0.364348 0.388327 0.335444 0.621953 0.595987 0.540134 0.4878 0.50999 0.467825
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
87. 
patient tongue id: 05131945027570_5_7
label yaofang:
薏苡仁 黄芪 白术 赤芍 浙贝母 山药 车前子 生半夏 砂仁 补骨脂 土鳖虫 红豆杉 山慈菇 预知子 蛇舌草
0.401497 0.345924 0.307205 0.57257 0.465631 0.353225
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
88. 
patient tongue id: 01200707054893_6_2_1
label yaofang:
甘草 白芍 枳壳 当归 连翘 远志 党参 白术 莱菔子 天麻 巴戟天 鳖甲 蜈蚣 白花蛇舌 半枝莲 龙葵果
0.753233 0.472768 0.453129 0.31878 0.38403 0.328804
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
89. 
patient tongue id: 03301913498992_2_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.464938 0.75898 0.345179 0.92738 0.413149 0.652648 0.381406 0.43226 0.419896 0.375756 0.84586 0.860812 0.788455 0.876969 0.407381 0.945603 0.439065 0.486769 0.558682 0.638131
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
90. 
patient tongue id: 01122342387626_5_6_2
label yaofang:
甘草 白芍 当归 木香 蒲公英 党参 黄芪 茜草 天麻 赤石脂 鳖甲 蜈蚣 天山雪莲 半枝莲
0.961699 0.542615 0.568591 0.392129 0.397252 0.365315 0.598917 0.588361 0.54911 0.499728 0.510398 0.476163
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
91. 
patient tongue id: 04081600238870_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.766982 0.451625 0.418598 0.35627 0.456288
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
92. 
patient tongue id: 02232011405358_4
label yaofang:
陈皮 法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.444485 0.837699 0.328304 0.964443 0.440156 0.719808 0.345803 0.425044 0.387445 0.398006 0.900222 0.913296 0.837898 0.922743 0.340272 0.972275 0.441172 0.512108 0.561464 0.670218
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
93. 
patient tongue id: 04121327485317_1_2_4
label yaofang:
甘草 茯苓 葛根 麦冬 玉竹 黄芪 玄参 北沙参 百合 麸炒白术 干石斛
0.474314 0.837317 0.970732 0.417244 0.733025 0.345437 0.436742 0.408704 0.399778 0.913944 0.926633 0.857721 0.933506 0.360801 0.978325 0.460124 0.520839 0.564164 0.681653
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.052632, recall: 0.090909, error: 0.947368
94. 
patient tongue id: 02120746203658_6_5
label yaofang:
甘草 柴胡 黄芩 半夏 党参 郁金 巴戟天 瓜蒌皮 鸡内金 珍珠母 麦芽 首乌藤 黑枣
0.507314 0.387842 0.528864 0.541185 0.374666 0.338641 0.331795
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
95. 
patient tongue id: 03101829017847_4
label yaofang:
麻黄 陈皮 前胡 桔梗 半夏 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草
0.45424 0.730145 0.386477 0.876294 0.424845 0.61992 0.373929 0.430226 0.429502 0.392129 0.792147 0.799387 0.73564 0.820067 0.384319 0.898109 0.440279 0.474442 0.545667 0.612499
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
96. 
patient tongue id: 05080855488553_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.541676 0.384514 0.381408 0.465387 0.455187 0.317948
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
97. 
patient tongue id: 02251231106685_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.475897 0.318622 0.547112 0.468042 0.61264 0.377035 0.392164 0.311556 0.320459 0.517012 0.494482 0.391561 0.450986 0.300894 0.469634 0.324372
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香

------Score: precision: 0.625000, recall: 0.666667, error: 0.375000
98. 
patient tongue id: 01130656516962_1_6
label yaofang:
甘草 桔梗 金银花 薏苡仁 赤芍 浙贝母 郁金 莱菔子 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉
0.957297 0.525443 0.561317 0.341961 0.322907 0.303404 0.550201 0.491501 0.451555 0.378595 0.394394 0.349415
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
99. 
patient tongue id: 01132311483011_3_1
label yaofang:
桂枝 柴胡 白芍 黄芩 大枣 党参 牛膝 苏木 姜半夏 炙甘草 嫩桑枝 丝瓜络
0.408956 0.33014 0.366198 0.410124 0.501935 0.368011 0.388477 0.313476 0.301914 0.323158 0.311346 0.317638 0.322194
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.153846, recall: 0.166667, error: 0.846154
100. 
patient tongue id: 03020657106189_4_7_6
label yaofang:
甘草 法半夏 防风 金银花 丹参 红花 郁金 荆芥穗 天麻 火麻仁 麦芽 皂角刺 白鲜皮 天山雪莲 土茯苓
0.915699 0.479276 0.538406 0.37103 0.48543 0.405516 0.407227 0.301183 0.329496
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
101. 
patient tongue id: 06082045162398_1_2
label yaofang:
甘草 陈皮 茯苓 半夏 白术 杜仲 郁金 厚朴 僵蚕 补骨脂 枇杷叶 地龙 北沙参 蝉蜕 白鲜皮 紫苏叶
0.512865 0.380773 0.46179 0.518236 0.30789 0.306697
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 砂仁

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
102. 
patient tongue id: 05160619265255_1_6_4
label yaofang:
陈皮 茯苓 半夏 黄芪 白术 五味子 海螵蛸 杜仲 鸡内金 枇杷叶 北沙参 百合 蜈蚣 鲜龙葵果 守宫
0.714265 0.422535 0.358416 0.407809 0.534891
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
103. 
patient tongue id: 05290842578937_3_2
label yaofang:
甘草 党参 黄芪 杜仲 天麻 鳖甲 桑螵蛸 锁阳 益智 蜈蚣 天山雪莲 半枝莲 广金钱草 红豆杉
0.988347 0.577557 0.603774 0.351679 0.398635 0.33574 0.668882 0.636589 0.57793 0.518854 0.545658 0.510939
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
104. 
patient tongue id: 01062041205222_6_5
label yaofang:
甘草 白芍 陈皮 防风 薏苡仁 党参 白术 熟附子 天麻 鳖甲 败酱草 蜈蚣 天山雪莲 半枝莲 姜黄
0.966935 0.546052 0.554656 0.388876 0.354769 0.346748 0.566079 0.57185 0.54926 0.466152 0.485235 0.471576
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
105. 
patient tongue id: 02281835596993_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.463238 0.858761 0.975234 0.43745 0.745935 0.339619 0.442393 0.396594 0.403953 0.920453 0.933265 0.858311 0.940609 0.336959 0.980695 0.456387 0.523453 0.57191 0.690203
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
106. 
patient tongue id: 04072023027706_1_4
label yaofang:
牡蛎 黄芪 白术 延胡索 海螵蛸 浙贝母 砂仁 瓜蒌皮 莪术 鸡内金 枇杷叶 北沙参 蜈蚣 山慈菇 蛇舌草 鲜龙葵果
0.388957 0.337917 0.47726 0.46885
predicted yaofang:
甘草 茯苓 黄芪 白术

------Score: precision: 0.500000, recall: 0.125000, error: 0.500000
107. 
patient tongue id: 03090818154829_6_1
label yaofang:
甘草 茯苓 党参 白术 蒲黄 砂仁 天麻 全蝎 五灵脂 白花蛇舌草 麦芽 佛手 半枝莲 醋鳖甲
0.953859 0.534673 0.5471 0.380822 0.378235 0.344138 0.596557 0.535398 0.531444 0.443187 0.473179 0.512005
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
108. 
patient tongue id: 03091853271768_5_7
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 红花 杜仲 黄柏 苍术 桑寄生 浮小麦 首乌藤 威灵仙 骨碎补 牛大力 千斤拔
0.971915 0.538404 0.57276 0.362497 0.394708 0.334425 0.646386 0.580829 0.560089 0.48059 0.526274 0.558692
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
109. 
patient tongue id: 03020734569509_6_4
label yaofang:
甘草 桔梗 远志 浙贝母 桑白皮 天麻 补骨脂 白花蛇舌草 北沙参 浮小麦 蜈蚣 半枝莲 醋鳖甲 化橘红
0.986705 0.56579 0.604 0.369349 0.443929 0.30081 0.376748 0.698701 0.652687 0.624041 0.551998 0.593393 0.61524
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
110. 
patient tongue id: 02272200037416_1_6
label yaofang:
甘草 川芎 陈皮 枳壳 茯苓 龙骨 牡蛎 远志 柏子仁 竹茹 姜半夏
0.921787 0.516246 0.50279 0.349279 0.464176 0.377713 0.383524
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
111. 
patient tongue id: 01172236297565_2_6
label yaofang:
甘草 枸杞子 生地黄 红花 山药 山茱萸 天麻 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.902092 0.48454 0.523611 0.377292 0.476837 0.40461 0.41302 0.313262 0.317629 0.310299
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
112. 
patient tongue id: 02231816526293_4
label yaofang:
麻黄 前胡 半夏 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷
0.305823 0.390671 0.399056 0.395088 0.325305 0.410304 0.326872 0.35445 0.326433 0.345763 0.369918 0.545026
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
113. 
patient tongue id: 05172108352529_1_4
label yaofang:
甘草 陈皮 法半夏 茯苓 党参 砂仁 天麻 鳖甲 莪术 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.990491 0.598499 0.616121 0.348633 0.390689 0.33936 0.659109 0.650374 0.578741 0.534664 0.548533 0.485374
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
114. 
patient tongue id: 06191323471104_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 桃仁 党参 延胡索 川楝子 郁金 车前子 鸡内金 麦芽 广金钱草 石苇 荔枝核
0.952152 0.52578 0.556539 0.365204 0.34742 0.31985 0.563732 0.475362 0.474113 0.375695 0.389011 0.374096
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
115. 
patient tongue id: 03021209571176_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.30964 0.342078 0.421307 0.395657 0.423813 0.337286 0.376922 0.31248 0.36118 0.313565 0.345392 0.303392 0.359172 0.44485 0.348255 0.371934 0.309918 0.600708 0.325679
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
116. 
patient tongue id: 06182207450196_6_1_3
label yaofang:
大枣 茯苓 丹参 郁金 山药 桑寄生 炙甘草 浮小麦 首乌藤 牛大力 千斤拔
0.837103 0.483437 0.470978 0.370279 0.331975
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
117. 
patient tongue id: 05092124050849_6_4
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 黄芪 酸枣仁 天麻 鳖甲 白扁豆 佛手 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.981268 0.568756 0.604347 0.365775 0.406934 0.345874 0.641841 0.608314 0.546772 0.499241 0.523432 0.485789
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.625000, error: 0.166667
118. 
patient tongue id: 04051840590844_3_4
label yaofang:
桂枝 茯苓 半夏 木香 黄芪 白术 附子 山药 泽泻 茯苓皮 猪苓 白扁豆 紫苏叶 玉米须 蜈蚣
0.480945 0.371275 0.34954 0.446016 0.424262 0.361196 0.372135 0.315876 0.313569
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻 车前子

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
119. 
patient tongue id: 03291321221871_1
label yaofang:
白芍 香附 枳壳 党参 白芷 北柴胡 紫菀 麦芽 炙甘草 紫苏梗 煅瓦楞子
0.358885 0.368965 0.382855 0.315038 0.414447
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.272727, error: 0.400000
120. 
patient tongue id: 03151841014268_1
label yaofang:
桂枝 柴胡 玉竹 丹参 牛膝 干姜 大黄 萆薢 土茯苓 山慈菇
0.351898 0.454236 0.3134 0.334727 0.440233 0.571051
predicted yaofang:
柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.100000, error: 0.833333
121. 
patient tongue id: 04130415285916_1_6_7
label yaofang:
甘草 木香 薏苡仁 党参 白术 黄连 山药 鳖甲 莪术 建曲 白花蛇舌 红豆杉 鱼古 瓦楞子
0.858662 0.472074 0.44793 0.444082 0.349347 0.382619
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
122. 
patient tongue id: 04200633558601_1_6_5
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 砂仁 天麻 鳖甲 麦芽 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.96555 0.547452 0.571068 0.375424 0.386928 0.339654 0.587313 0.557208 0.511576 0.463061 0.47265 0.417779
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
123. 
patient tongue id: 03111614409760_1_7_6
label yaofang:
甘草 玉竹 党参 山药 砂仁 天麻 鳖甲 麦芽 北沙参 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.823035 0.45306 0.485067 0.394492 0.356247
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
124. 
patient tongue id: 05131455367709_1
label yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 熟附子 山药 天麻 鳖甲 败酱草 蜈蚣 天山雪莲 半枝莲
0.969067 0.548527 0.579891 0.37278 0.355782 0.324076 0.575379 0.546399 0.498486 0.445971 0.461908 0.396503
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
125. 
patient tongue id: 03312113058012_5
label yaofang:
甘草 法半夏 前胡 桔梗 桃仁 远志 浙贝母 细辛 鳖甲 款冬花 紫菀 白前 诃子 苦杏仁 炙麻黄 白花蛇舌
0.993242 0.594959 0.623159 0.357154 0.42455 0.364583 0.710227 0.699526 0.641989 0.583335 0.610155 0.57969
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
126. 
patient tongue id: 01312309025668_1_2_6
label yaofang:
甘草 白芍 党参 枸杞子 赤芍 天麻 磁石 鳖甲 火麻仁 麦芽 沙苑子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.910553 0.51967 0.531017 0.37853 0.348769 0.341166 0.527454 0.49616 0.47466 0.410883 0.418911 0.402458
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
127. 
patient tongue id: 05092101551866_2_6
label yaofang:
甘草 桔梗 远志 浙贝母 桑白皮 天麻 款冬花 紫菀 苇茎 白花蛇舌草 百合 蜈蚣 半枝莲 醋鳖甲
0.90344 0.471062 0.537104 0.339148 0.451779
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
128. 
patient tongue id: 05221859059633_2_1
label yaofang:
甘草 芦根 薏苡仁 麦冬 黄芪 生地黄 枳实 乌梅 山茱萸 虎杖 决明子 地龙 北沙参 百合
0.763814 0.465811 0.387863 0.393745 0.313776
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
129. 
patient tongue id: 01312048229509_1_3
label yaofang:
桃仁 黄芪 白术 海螵蛸 杜仲 牛膝 当归尾 砂仁 鸡内金 北沙参 紫苏梗 骨碎补 土鳖虫 红豆杉 石上柏 稻芽
0.425897 0.570894 0.412691 0.731722 0.385616 0.50569 0.371615 0.314495 0.356933 0.34565 0.342577 0.630513 0.63864 0.568084 0.64959 0.410705 0.754332 0.380335 0.399694 0.382639 0.44937
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.095238, recall: 0.125000, error: 0.904762
130. 
patient tongue id: 02120930580764_6_7_4
label yaofang:
桂枝 甘草 柴胡 当归 茯苓 桃仁 白术 酸枣仁 赤芍 栀子 牡丹皮 莱菔子 菟丝子 益母草 豆蔻
0.961397 0.526551 0.569965 0.388384 0.3761 0.343884 0.584839 0.560222 0.539033 0.462484 0.487208 0.465837
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
131. 
patient tongue id: 02142321119967_6_2_5
label yaofang:
甘草 茯苓 党参 黄芪 酸枣仁 丹参 黄连 赤芍 栀子 石膏 苍术 佩兰 扁豆花 木棉花
0.981096 0.554114 0.574171 0.395043 0.375384 0.340319 0.640297 0.626915 0.601234 0.527262 0.562603 0.556875
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
132. 
patient tongue id: 05102149233390_5
label yaofang:
甘草 防风 金银花 薏苡仁 鱼腥草 熟地黄 牡丹皮 荆芥穗 僵蚕 皂角刺 蝉蜕 蒺藜 地肤子
0.475651 0.841789 0.309121 0.970216 0.424376 0.72874 0.344673 0.434411 0.392717 0.404869 0.912854 0.922205 0.853154 0.933234 0.352676 0.976159 0.462664 0.525551 0.5637 0.68136
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.050000, recall: 0.076923, error: 0.950000
133. 
patient tongue id: 02281217357589_1_2_7
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.67766 0.417253 0.472252 0.342359 0.322587 0.343463
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 天麻

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
134. 
patient tongue id: 05050751063445_1_4
label yaofang:
甘草 独活 党参 白术 杜仲 山药 天麻 桑寄生 鳖甲 麦芽 续断 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.951712 0.522727 0.542961 0.37554 0.505005 0.487063 0.484186 0.380288 0.398775 0.363461
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.562500, error: 0.100000
135. 
patient tongue id: 02182023255241_2
label yaofang:
甘草 茯苓 党参 白术 生地黄 赤芍 牡丹皮 山药 山茱萸 菟丝子 益母草 北沙参 白花蛇舌 天山雪莲
0.979985 0.569479 0.599543 0.367176 0.407377 0.350455 0.632246 0.602248 0.543141 0.497571 0.519047 0.472293
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
136. 
patient tongue id: 05022013491871_9
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.4977 0.918681 0.991286 0.450749 0.81929 0.325889 0.460171 0.422554 0.420922 0.965594 0.970066 0.925403 0.973521 0.320625 0.994839 0.484124 0.578177 0.610155 0.761311
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
137. 
patient tongue id: 03061816228338_5_6
label yaofang:
甘草 前胡 桔梗 金银花 连翘 芦根 牛蒡子 浙贝母 款冬花 紫菀 白前
0.959682 0.541183 0.570459 0.372926 0.354797 0.32237 0.561231 0.533665 0.490624 0.430713 0.449005 0.407134
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.090909, error: 0.916667
138. 
patient tongue id: 03151904291657_4_1
label yaofang:
甘草 柴胡 白芍 枳壳 桔梗 黄芪 白术 生地黄 槟榔 厚朴 肉苁蓉 火麻仁 柿蒂 紫菀
0.333871 0.354979 0.453825 0.338325 0.379958 0.393293 0.532329
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
139. 
patient tongue id: 03022129231719_6
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 丹参 石菖蒲 车前子 磁石 升麻 蝉蜕 炙甘草
0.486925 0.325518 0.417481 0.393052 0.360746 0.342848
predicted yaofang:
甘草 柴胡 白芍 党参 白术 炙甘草

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
140. 
patient tongue id: 03011852441603_4
label yaofang:
麻黄 桂枝 白芍 前胡 半夏 太子参 黄芪 五味子 细辛 干姜 白前 百部 北沙参 紫苏子 炙甘草
0.38334 0.608313 0.401019 0.759205 0.389496 0.521739 0.342424 0.34622 0.322666 0.334577 0.643352 0.645488 0.586859 0.678797 0.365899 0.763421 0.37995 0.394348 0.412671 0.479831
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.533333, error: 0.600000
141. 
patient tongue id: 04062048246601_2_7_4
label yaofang:
甘草 枳壳 牛蒡子 桃仁 麦冬 玉竹 丹参 桑叶 天花粉 火麻仁 虎杖 决明子 枇杷叶 北沙参 野马追
0.767476 0.443061 0.414273 0.311067 0.465441 0.345463
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.166667, recall: 0.066667, error: 0.833333
142. 
patient tongue id: 02281159493517_1_7_6
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.401092 0.317748 0.39422 0.438461 0.442947 0.405653 0.337137 0.416745 0.313955 0.350992 0.363039 0.360818 0.34827 0.349428 0.360145
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.733333, recall: 0.916667, error: 0.266667
143. 
patient tongue id: 06031112062526_2_4_6
label yaofang:
甘草 法半夏 茯苓 桔梗 龙骨 党参 黄芪 酸枣仁 浙贝母 郁金 鳖甲 白花蛇舌 天山雪莲 合欢花 猫爪草
0.987133 0.567812 0.60223 0.363037 0.4061 0.349617 0.667552 0.646505 0.601433 0.533742 0.566157 0.547247
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
144. 
patient tongue id: 06190928468751_1_2_7
label yaofang:
甘草 白芍 茯苓 党参 黄芪 鸡血藤 黄连 生地黄 天麻 菟丝子 益母草 鳖甲 女贞子 蜈蚣 天山雪莲 半枝莲 红豆杉
0.973398 0.527943 0.582868 0.363859 0.407811 0.342859 0.64845 0.571922 0.546749 0.466784 0.514864 0.532019
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.470588, error: 0.333333
145. 
patient tongue id: 02261801151849_5_1
label yaofang:
甘草 黄芩 桔梗 乌梅 白茅根 细辛 白芷 蔓荆子 麦芽 皂角刺 辛夷 广藿香 苍耳子 蜂房
0.43858 0.412176 0.393302 0.329537
predicted yaofang:
甘草 茯苓 黄芪 北沙参

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
146. 
patient tongue id: 04291630466136_5_6
label yaofang:
甘草 法半夏 桃仁 浙贝母 郁金 天麻 天花粉 白花蛇舌草 苦杏仁 紫苏梗 威灵仙 蜈蚣 半枝莲 醋鳖甲 化橘红
0.983515 0.550873 0.584058 0.37104 0.438208 0.359884 0.683758 0.634756 0.61713 0.531518 0.581433 0.621315
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
147. 
patient tongue id: 03222004261246_2
label yaofang:
甘草 白芍 玄参 杜仲 牛膝 地黄 天麻 桑寄生 补骨脂 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.991576 0.588467 0.614921 0.365134 0.443939 0.300858 0.375011 0.705078 0.68108 0.631008 0.578983 0.606774 0.58559
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.307692, error: 0.692308
148. 
patient tongue id: 03161318279740_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.369621 0.431072 0.408064 0.519199 0.31943 0.384044 0.323328 0.375925 0.441523 0.458677 0.404747 0.456511 0.405087 0.609413
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.714286, recall: 0.666667, error: 0.285714
149. 
patient tongue id: 04260311123007_2_6
label yaofang:
甘草 党参 丹参 生地黄 浙贝母 郁金 山茱萸 天花粉 瓜蒌皮 款冬花 紫菀 王不留行 枇杷叶 苦杏仁
0.962296 0.542055 0.557045 0.39585 0.337262 0.321684 0.535989 0.531397 0.508085 0.426375 0.441515 0.398553
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
150. 
patient tongue id: 03291644359202_4_1
label yaofang:
甘草 葛根 鸡血藤 红花 山药 山茱萸 地黄 天麻 僵蚕 天花粉 益母草 木瓜 威灵仙
0.991716 0.595065 0.621178 0.361787 0.430771 0.361016 0.697939 0.674284 0.617508 0.560058 0.590982 0.561671
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
151. 
patient tongue id: 02181611499233_6_1
label yaofang:
甘草 茯苓 党参 白术 延胡索 海螵蛸 砂仁 柿蒂 鸡内金 麦芽 首乌藤 紫苏梗 合欢皮 稻芽
0.658668 0.42048 0.366687 0.435382 0.508533 0.311522
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
152. 
patient tongue id: 03040848532852_1
label yaofang:
甘草 当归 黄连 生地黄 茜草 天麻 天花粉 鳖甲 火麻仁 枇杷叶 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.983805 0.565389 0.603522 0.357404 0.391619 0.349845 0.647973 0.618599 0.563896 0.509779 0.531994 0.504043
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
153. 
patient tongue id: 06072100088395_5
label yaofang:
麻黄 甘草 黄芩 法半夏 前胡 鱼腥草 桑白皮 僵蚕 款冬花 地龙 苦杏仁 紫苏子 重楼
0.977416 0.564347 0.575832 0.372382 0.379151 0.350465 0.603106 0.591343 0.554837 0.491609 0.504617 0.465653
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.076923, error: 0.916667
154. 
patient tongue id: 01182104031462_5_6
label yaofang:
甘草 黄芩 法半夏 前胡 桔梗 浙贝母 桑白皮 莱菔子 白芷 苦杏仁 紫苏子 辛夷 炙麻黄 广藿香 苍耳子
0.976761 0.558693 0.593595 0.362829 0.381648 0.353866 0.624368 0.601669 0.54783 0.500185 0.516052 0.476069
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.066667, error: 0.916667
155. 
patient tongue id: 01041307584982_2
label yaofang:
陈皮 茯苓 党参 白术 枳实
0.500498 0.323414 0.44555
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.666667, recall: 0.400000, error: 0.333333
156. 
patient tongue id: 04182312333390_6_1_4
label yaofang:
蒲公英 黄芪 白术 海螵蛸 郁金 山药 砂仁 珍珠母 首乌藤 蜈蚣 红豆杉 合欢皮
0.578451 0.413307 0.329831 0.505922 0.530877 0.354023 0.317225 0.324162
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
157. 
patient tongue id: 05242230246027_6_2
label yaofang:
川芎 龙骨 党参 枸杞子 酸枣仁 丹参 山茱萸 地黄 益母草 麦芽 沙苑子 酒女贞子 墨旱莲
0.988625 0.573355 0.599711 0.367112 0.415456 0.372119 0.668487 0.666508 0.620223 0.560886 0.581921 0.565159
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
158. 
patient tongue id: 04182211162881_1
label yaofang:
枳壳 黄芪 白术 赤芍 浙贝母 杜仲 砂仁 补骨脂 鸡内金 北沙参 紫苏梗 预知子 稻芽
0.649924 0.43044 0.350756 0.459364 0.496941 0.315655
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
159. 
patient tongue id: 04201417120633_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.736832 0.401873 0.326894 0.516663 0.330259 0.385577 0.302366 0.328623 0.419789
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 天麻

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
160. 
patient tongue id: 03151841427568_4
label yaofang:
麻黄 陈皮 前胡 桔梗 半夏 防风 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 苍耳子
0.434783 0.710216 0.40476 0.864458 0.428189 0.59357 0.372123 0.411417 0.38743 0.305507 0.378285 0.768553 0.774712 0.697514 0.793298 0.379103 0.867313 0.42485 0.459433 0.488694 0.569537
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.476190, recall: 0.714286, error: 0.523810
161. 
patient tongue id: 01041813358826_2
label yaofang:
麻黄 甘草 葛根 前胡 桔梗 半夏 防风 荆芥穗 石斛 紫菀 蝉蜕 辛夷 广藿香 苍耳子
0.38446 0.645571 0.328805 0.835148 0.365238 0.579948 0.314555 0.335621 0.368437 0.330313 0.721516 0.750812 0.684005 0.776067 0.346113 0.890637 0.399908 0.414165 0.420733 0.519604
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.428571, error: 0.700000
162. 
patient tongue id: 01180605332418_6_1_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 酸枣仁 黄连 川楝子 乌梅 山药 细辛 合欢花
0.983843 0.568541 0.574469 0.344639 0.354782 0.326302 0.609847 0.599682 0.549195 0.491514 0.506982 0.474275
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
163. 
patient tongue id: 02201311365886_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 肉桂 豆蔻 制川乌 姜半夏 炙甘草 紫苏梗
0.67051 0.364401 0.346084 0.425663 0.375223
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
164. 
patient tongue id: 02251232411241_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 广藿香
0.445963 0.763889 0.365263 0.916759 0.434804 0.648808 0.379005 0.421778 0.407935 0.394273 0.831455 0.843798 0.7732 0.861807 0.384718 0.934412 0.444414 0.488688 0.550411 0.630689
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.846154, error: 0.450000
165. 
patient tongue id: 04250816363920_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.462832 0.333698 0.419508 0.458589 0.480476 0.4394 0.35484 0.415546 0.355882 0.369081 0.340293 0.437474 0.407887 0.426329 0.430876
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.733333, recall: 0.916667, error: 0.266667
166. 
patient tongue id: 01202014305224_4_1
label yaofang:
甘草 茯苓 白术 海螵蛸 浙贝母 款冬花 诃子 枇杷叶 北沙参
0.64441 0.446843 0.378591 0.408108 0.448187 0.302369
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.444444, error: 0.333333
167. 
patient tongue id: 05222101141649_5_4
label yaofang:
麦冬 黄芪 五味子 杜仲 厚朴 僵蚕 瓜蒌皮 莪术 诃子 鸡内金 枇杷叶 地龙 北沙参 蝉蜕
0.586199 0.394717 0.35736 0.439235 0.482653
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
168. 
patient tongue id: 04300909341453_5
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 黄连 苍术 山药 厚朴 菟丝子 益母草 豆蔻 合欢花 麸炒枳壳
0.958636 0.521349 0.554159 0.376055 0.314824 0.54105 0.522856 0.495464 0.423583 0.446875 0.411107
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
169. 
patient tongue id: 04122041301217_6_2
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 桃仁 远志 浙贝母 款冬花 紫菀 苦杏仁 紫苏子 炙麻黄
0.879856 0.470862 0.453914 0.467174 0.341319 0.420381
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
170. 
patient tongue id: 02221240487142_1_2
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.395777 0.314926 0.394076 0.45628 0.320901
predicted yaofang:
甘草 茯苓 党参 黄芪 牛膝

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
171. 
patient tongue id: 05171901408977_4
label yaofang:
陈皮 前胡 桔梗 防风 款冬花 紫菀 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.454241 0.767239 0.347171 0.927909 0.430644 0.675348 0.370641 0.429882 0.395959 0.301425 0.415665 0.838289 0.857276 0.77317 0.870329 0.376384 0.938342 0.459299 0.509598 0.532666 0.620987
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.571429, recall: 1.000000, error: 0.428571
172. 
patient tongue id: 06181705535673_1_5
label yaofang:
甘草 桃仁 太子参 黄芪 赤芍 厚朴 生半夏 僵蚕 北沙参 苦杏仁 赭石 辛夷 蜈蚣 紫苑
0.35638 0.357173 0.360842 0.605746 0.538346 0.389634 0.319932 0.4291
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
173. 
patient tongue id: 04112052569546_6_1
label yaofang:
甘草 白芍 川芎 防风 白及 党参 白术 黄连 乌梅 山药 薤白 干姜 桑寄生 建曲
0.977037 0.551117 0.57438 0.368559 0.374346 0.340341 0.622398 0.600863 0.558524 0.495895 0.517237 0.495292
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
174. 
patient tongue id: 05162058092285_6_4
label yaofang:
麻黄 桂枝 白芍 牛蒡子 鱼腥草 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.30734 0.399493 0.353185 0.327003 0.369963 0.507154
predicted yaofang:
柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
175. 
patient tongue id: 05160620241721_5
label yaofang:
陈皮 茯苓 半夏 牡蛎 防风 薏苡仁 黄芪 赤芍 浙贝母 桑叶 辛夷 苍耳子
0.563427 0.394524 0.338482 0.461729 0.490151 0.309188
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
176. 
patient tongue id: 01031824153244_5
label yaofang:
防风 钩藤 荆芥穗 白芷 炙甘草 首乌藤 广藿香 威灵仙 香薰 炒六神曲 炒蔓荆子 棉萆薢 醋香附
0.4875 0.88151 0.304944 0.980996 0.450019 0.752457 0.354969 0.444039 0.399937 0.397741 0.938246 0.944879 0.881691 0.951082 0.355208 0.986131 0.455294 0.531262 0.590202 0.71206
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.307692, error: 0.800000
177. 
patient tongue id: 01012115347471_1_3
label yaofang:
丹参 牛膝 泽泻 莱菔子 天麻 决明子 夏枯草 制何首乌 盐车前子 燀桃仁
0.860394 0.479256 0.498702 0.397361 0.421673 0.306391 0.373537
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.142857, recall: 0.100000, error: 0.857143
178. 
patient tongue id: 05092054069181_4_6
label yaofang:
桂枝 甘草 茯苓 桔梗 薏苡仁 党参 白术 海螵蛸 山药 砂仁 王不留行 白扁豆 泽兰
0.504259 0.306559 0.401649 0.320952 0.411576 0.367834 0.337098
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
179. 
patient tongue id: 04301051453407_5_7_1
label yaofang:
甘草 白芍 牛蒡子 薏苡仁 白术 熟附子 大黄 天麻 鳖甲 火麻仁 败酱草 地龙 首乌藤 蜈蚣 天山雪莲 半枝莲
0.977944 0.579829 0.59587 0.361593 0.384377 0.341336 0.618868 0.598711 0.533243 0.486088 0.500633 0.437495
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
180. 
patient tongue id: 04271532307560_1_4_7
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.462506 0.35019 0.388222 0.438609 0.345708
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
181. 
patient tongue id: 02141828438609_4
label yaofang:
陈皮 法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.478501 0.785929 0.352127 0.93368 0.446222 0.679881 0.391372 0.448284 0.426628 0.307957 0.421945 0.856832 0.87088 0.794899 0.883648 0.393561 0.951038 0.463128 0.518615 0.565004 0.652047
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 1.000000, error: 0.285714
182. 
patient tongue id: 03282206291109_4
label yaofang:
白芍 当归 茯苓 薄荷 白术 柏子仁 枳实 北柴胡 炙甘草 猫爪草
0.314258 0.324834 0.422699 0.363035 0.330959 0.383448 0.489152
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.300000, error: 0.571429
183. 
patient tongue id: 02201838153825_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.409816 0.613055 0.383576 0.791981 0.37333 0.534097 0.352507 0.351404 0.341543 0.335724 0.676398 0.683044 0.628132 0.720723 0.39788 0.819004 0.386198 0.401694 0.436098 0.494531
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
184. 
patient tongue id: 05160610216675_1_3_4
label yaofang:
甘草 陈皮 前胡 桔梗 厚朴 僵蚕 川贝母 紫菀 百部 虎杖 枇杷叶 地龙 紫苏叶
0.503158 0.381376 0.359335 0.471404 0.378522
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
185. 
patient tongue id: 03032024280406_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.438762 0.70191 0.387437 0.867104 0.423924 0.606959 0.383589 0.423457 0.406714 0.316163 0.404021 0.769105 0.781882 0.710777 0.804376 0.384375 0.885158 0.435562 0.470357 0.509008 0.577722
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 1.000000, error: 0.285714
186. 
patient tongue id: 06191205259030_7_4_6
label yaofang:
甘草 茯苓 木香 连翘 党参 白术 大腹皮 砂仁 天麻 麦芽 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.947838 0.532034 0.523065 0.369132 0.308053 0.329347 0.497401 0.425733 0.452099 0.318967 0.325974 0.305666
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
187. 
patient tongue id: 02181954033451_6_4
label yaofang:
甘草 川芎 法半夏 茯苓 枸杞子 白术 牛膝 天麻 麦芽 女贞子 首乌藤 墨旱莲
0.950368 0.534498 0.546052 0.383718 0.353074 0.339869 0.548526 0.532269 0.498921 0.437674 0.453451 0.428815
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
188. 
patient tongue id: 05232036456742_5_2
label yaofang:
甘草 茯苓 半夏 薏苡仁 白术 红花 赤芍 海螵蛸 杜仲 郁金 僵蚕 麦芽 白鲜皮 土茯苓 合欢皮 蛇舌草
0.429938 0.394132 0.318596 0.555938 0.502078 0.369617 0.312509 0.402291
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
189. 
patient tongue id: 06031115585166_6_4
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 知母 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.921352 0.508908 0.541546 0.39971 0.337678 0.321885 0.508615 0.468258 0.459269 0.378254 0.392367 0.360282
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
190. 
patient tongue id: 04202215219709_2_1_7
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 丹参 生地黄 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989668 0.558625 0.596757 0.364764 0.401207 0.330138 0.683243 0.6343 0.612188 0.520097 0.570982 0.61281
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
191. 
patient tongue id: 04201425287126_1_2_7
label yaofang:
甘草 当归 茯苓 党参 黄芪 酸枣仁 丹参 鸡内金 浮小麦 首乌藤 百合 制远志
0.628213 0.378103 0.304408 0.477205 0.350522 0.335173 0.307694 0.339203
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.625000, recall: 0.416667, error: 0.375000
192. 
patient tongue id: 05162235022126_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 砂仁 紫菀 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.453577 0.702667 0.367347 0.881459 0.411705 0.613276 0.3723 0.403085 0.388787 0.388565 0.784008 0.798507 0.72623 0.822238 0.403097 0.901084 0.445693 0.475284 0.522979 0.591757
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.687500, error: 0.450000
193. 
patient tongue id: 04221902591730_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.324009 0.383707 0.358707 0.512297 0.358814 0.393112 0.399387 0.419147 0.391765 0.448653 0.412357 0.618603
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
194. 
patient tongue id: 06070022342291_1_6
label yaofang:
甘草 柴胡 白芍 茯苓 木香 党参 酸枣仁 槟榔 山药 桑叶 厚朴 砂仁 五灵脂 浮小麦 合欢花
0.981698 0.567832 0.598358 0.35733 0.392991 0.338215 0.639767 0.600788 0.546667 0.494467 0.510311 0.472516
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
195. 
patient tongue id: 03232309041318_2_4_6
label yaofang:
甘草 白芍 川芎 黄芩 远志 党参 白术 杜仲 牛膝 钩藤 天麻 僵蚕 防己 石决明 桑寄生 益母草 麦芽
0.962038 0.550922 0.56604 0.370756 0.352614 0.322152 0.564475 0.536887 0.491434 0.435592 0.439651 0.381119
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.235294, error: 0.666667
196. 
patient tongue id: 06022234091124_1_4_7
label yaofang:
甘草 陈皮 茯苓 半夏 党参 白术 海螵蛸 杜仲 厚朴 僵蚕 桑寄生 鸡内金 苦杏仁 紫苏子 紫苏叶 三七粉
0.497208 0.36147 0.329253 0.479628 0.466145
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.250000, error: 0.200000
197. 
patient tongue id: 05191941300488_7_2
label yaofang:
甘草 白芍 川芎 龙骨 桃仁 生地黄 红花 赤芍 山药 山茱萸 补骨脂 浮小麦 首乌藤 川木瓜
0.964241 0.544456 0.54356 0.351707 0.323018 0.312994 0.554353 0.548225 0.503704 0.441497 0.450272 0.409384
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
198. 
patient tongue id: 05221858010019_6
label yaofang:
陈皮 党参 黄芪 乌药 升麻 路路通 五指毛桃
0.870722 0.50101 0.479651 0.458689 0.303821 0.367686 0.328905 0.435293
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.125000, recall: 0.142857, error: 0.875000
199. 
patient tongue id: 01202005541697_1_7_4
label yaofang:
黄芪 白术 海螵蛸 浙贝母 砂仁 瓜蒌皮 莪术 鸡内金 北沙参 蛤壳 威灵仙 山慈菇 蛇舌草 鲜龙葵果
0.420977 0.329543 0.390347 0.447186 0.436547 0.31306 0.322852 0.363833 0.378512 0.354559 0.31001 0.354336 0.366442 0.429237
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.142857, recall: 0.142857, error: 0.857143
200. 
patient tongue id: 03301936137931_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄 炒蔓荆子
0.437633 0.623445 0.36625 0.820683 0.386467 0.571531 0.378017 0.305593 0.388742 0.393419 0.36268 0.707124 0.734876 0.670652 0.751779 0.416336 0.858581 0.411965 0.427272 0.468531 0.531236
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.571429, recall: 0.800000, error: 0.428571
201. 
patient tongue id: 06092002532115_1_2_7
label yaofang:
甘草 陈皮 茯苓 半夏 木香 远志 党参 枸杞子 白术 柏子仁 海螵蛸 山药 菟丝子 鸡内金 紫苏子 红豆杉 岗梅
0.710336 0.435175 0.388877 0.359746 0.483272 0.309707
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.235294, error: 0.333333
202. 
patient tongue id: 02151811281936_1_4_7
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.56074 0.356575 0.452757 0.37018 0.322131 0.308331
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
203. 
patient tongue id: 06062242229137_2_1
label yaofang:
甘草 玉竹 太子参 山茱萸 天麻 猪苓 鳖甲 鸡内金 麦芽 北沙参 蜈蚣 天山雪莲 半枝莲 广金钱草
0.973741 0.550614 0.575898 0.367325 0.353562 0.328873 0.584721 0.573291 0.534275 0.468977 0.490495 0.451365
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
204. 
patient tongue id: 06052008134039_5
label yaofang:
柴胡 川芎 香附 陈皮 橘红 芦根 蒲公英 竹茹 桑白皮 砂仁 白芷 瓜蒌皮 扁豆花 百合 土茯苓
0.342978 0.550666 0.38597 0.358856
predicted yaofang:
茯苓 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
205. 
patient tongue id: 02141950490270_2_7
label yaofang:
金樱子 覆盆子
0.802609 0.475179 0.478511 0.435199 0.301755 0.354614 0.309836 0.395994
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
206. 
patient tongue id: 01012109111003_1_4_6
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.419692 0.318564 0.330632 0.435161 0.418464 0.345248 0.343298
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
207. 
patient tongue id: 03020846301098_6
label yaofang:
甘草 茯苓 白术 酸枣仁 栀子 牡丹皮 桑叶 天麻 鳖甲 白花蛇舌草 浮小麦 蜈蚣 天山雪莲 半枝莲
0.899601 0.471928 0.451545 0.503195 0.337517 0.458469
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
208. 
patient tongue id: 05092036130253_7_4
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮
0.325043 0.365232 0.455383 0.357688 0.363039 0.309373 0.44282 0.512143
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
209. 
patient tongue id: 03291852466870_4_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草
0.411876 0.369085 0.464966 0.380952 0.398249 0.375191 0.460936
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
210. 
patient tongue id: 02231829161766_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.415011 0.641528 0.361105 0.838541 0.379587 0.586595 0.349621 0.376138 0.386644 0.350981 0.728084 0.747586 0.694576 0.779933 0.388183 0.870397 0.417836 0.442469 0.486509 0.547311
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
211. 
patient tongue id: 05131450331869_1_2_7
label yaofang:
甘草 茯苓 独活 党参 黄芪 丹参 赤芍 牛膝 山茱萸 水蛭 桑寄生 补骨脂 鹿角霜 续断 川加皮 牛大力
0.997155 0.619307 0.648443 0.345005 0.452107 0.376602 0.754868 0.739043 0.674662 0.622497 0.648893 0.609736
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
212. 
patient tongue id: 01201841171872_1_4
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 远志 党参 黄芪 酸枣仁 黄连 乌梅 皂角刺 首乌藤 建曲 麸炒枳壳
0.911274 0.50927 0.538868 0.412406 0.318723 0.32983 0.471726 0.462405 0.46319 0.369015 0.374248 0.347807
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
213. 
patient tongue id: 01110410437100_2
label yaofang:
白芍 薏苡仁 延胡索 牛膝 全蝎 木瓜 苏木 炙甘草 蜈蚣 两面针
0.53274 0.339026 0.38715 0.386005 0.340977 0.316954
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
214. 
patient tongue id: 05112014197641_1_2_5
label yaofang:
甘草 牡蛎 黄芪 白术 生地黄 海螵蛸 浙贝母 山茱萸 枇杷叶 北沙参 辛夷 红豆杉 合欢皮 山慈菇 蛇舌草
0.574148 0.37921 0.317965 0.550768 0.596037 0.312882 0.411716 0.351671
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
215. 
patient tongue id: 02201804227201_4_1
label yaofang:
法半夏 茯苓 前胡 麦冬 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.473735 0.799018 0.345182 0.943428 0.442881 0.687833 0.382226 0.439671 0.413959 0.414425 0.871499 0.884138 0.809432 0.895733 0.38652 0.957478 0.462713 0.517997 0.562093 0.656312
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
216. 
patient tongue id: 02171932515469_1_2
label yaofang:
当归 黄芪 鸡血藤 白术 仙鹤草 砂仁 补骨脂 莪术 鹿角胶 鸡内金 女贞子 黄精 骨碎补 稻芽 红芪 红参
0.41294 0.38504 0.329157 0.499834 0.322582
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
217. 
patient tongue id: 04202104064834_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 蜜枇杷叶 龙脷叶
0.302845 0.331004 0.345818 0.305149 0.325314 0.479577
predicted yaofang:
甘草 白芍 党参 黄芪 白术 炙甘草

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
218. 
patient tongue id: 03020235042112_6_2
label yaofang:
甘草 独活 党参 白术 杜仲 地黄 天麻 桑寄生 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲 烫狗脊
0.985878 0.571961 0.580374 0.372936 0.373696 0.338827 0.639396 0.622937 0.589172 0.513883 0.53656 0.506761
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
219. 
patient tongue id: 04291846378756_1_2_7
label yaofang:
甘草 薏苡仁 太子参 黄芪 生地黄 天麻 鳖甲 补骨脂 地龙 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫
0.704604 0.420333 0.431748 0.389156
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
220. 
patient tongue id: 04281833289090_5
label yaofang:
甘草 柴胡 白芍 桃仁 鸡血藤 红花 制枳壳
0.524105 0.315017 0.402472 0.32555 0.416642 0.381995 0.31192
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.428571, recall: 0.428571, error: 0.571429
221. 
patient tongue id: 05042045323541_4
label yaofang:
甘草 生地黄 浙贝母 石膏 苍术 细辛 紫苏叶 川木通
0.379961 0.371858 0.460188 0.372924 0.37711 0.307048 0.390243 0.511373
predicted yaofang:
甘草 柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.125000, error: 0.875000
222. 
patient tongue id: 05272331421838_2_5
label yaofang:
黄芪 白术 生地黄 山茱萸 天麻 僵蚕 芡实 枇杷叶 北沙参 辛夷 山慈菇 蛇舌草 冬凌草
0.672639 0.415589 0.443643 0.350757 0.404836
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
223. 
patient tongue id: 06080204163206_5_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 远志 枸杞子 白术 酸枣仁 泽泻 天麻 麦芽 女贞子 首乌藤 沙苑子
0.983539 0.55424 0.592687 0.366899 0.406574 0.34905 0.662171 0.618364 0.58184 0.510211 0.54768 0.556584
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
224. 
patient tongue id: 04291627449856_1_2_5
label yaofang:
甘草 远志 党参 酸枣仁 生地黄 山药 天麻 鳖甲 豆蔻 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.836014 0.45121 0.427278 0.494215 0.377402
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
225. 
patient tongue id: 04202222399246_6_3
label yaofang:
桂枝 甘草 当归 茯苓 桃仁 党参 酸枣仁 红花 赤芍 杜仲 郁金 薤白 桑寄生 瓜蒌皮 醋香附
0.983617 0.549841 0.607071 0.360874 0.42538 0.347967 0.684087 0.601523 0.577601 0.487467 0.53816 0.568113
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
226. 
patient tongue id: 02142327391310_1_5_6
label yaofang:
甘草 法半夏 茯苓 桔梗 酸枣仁 浙贝母 栀子 天麻 扁豆花 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 木棉花
0.984216 0.564162 0.592926 0.364422 0.415739 0.348562 0.673977 0.615915 0.591487 0.503184 0.554163 0.577536
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
227. 
patient tongue id: 03230709325389_6_4_7
label yaofang:
甘草 香附 茯苓 桔梗 党参 丹参 浙贝母 郁金 佩兰 鳖甲 扁豆花 莪术 诃子 夏枯草 猫爪草
0.99205 0.57525 0.603813 0.363638 0.412129 0.353928 0.696411 0.674085 0.643502 0.559253 0.600492 0.606888
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
228. 
patient tongue id: 04300853010361_6_2
label yaofang:
甘草 荆芥 桃仁 蒲公英 红花 牡丹皮 郁金 地黄 地骨皮 天花粉 紫草 瓜蒌皮 王不留行 麦芽 白鲜皮
0.905198 0.473063 0.502785 0.396783 0.428859 0.37316
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.066667, error: 0.833333
229. 
patient tongue id: 04150749217863_1_3
label yaofang:
桃仁 丹参 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.470907 0.329143 0.420851 0.463666 0.473134 0.435588 0.353406 0.428533 0.317555 0.375615 0.353855 0.420523 0.409051 0.406792 0.416906
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.666667, recall: 0.833333, error: 0.333333
230. 
patient tongue id: 04221854155670_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.442842 0.646488 0.397714 0.80582 0.424061 0.571662 0.398837 0.41497 0.397328 0.332591 0.404807 0.702228 0.723918 0.65451 0.741102 0.412491 0.833407 0.437666 0.313414 0.455239 0.496149 0.55464
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.727273, recall: 1.000000, error: 0.272727
231. 
patient tongue id: 02242336085557_4_1
label yaofang:
甘草 海螵蛸 桑白皮 僵蚕 川贝母 枇杷叶 地龙 苦杏仁 紫苏子 蝉蜕 炙麻黄
0.677537 0.364389 0.37132 0.448511
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.090909, error: 0.750000
232. 
patient tongue id: 01200647426200_1_4
label yaofang:
甘草 薏苡仁 党参 白术 酸枣仁 砂仁 天麻 豆蔻 白花蛇舌草 白扁豆 建曲 蜈蚣 半枝莲 醋鳖甲
0.95654 0.517232 0.547926 0.39453 0.351629 0.324471 0.575041 0.521776 0.537986 0.418848 0.461578 0.491437
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
233. 
patient tongue id: 01070848167168_1_4_5
label yaofang:
甘草 枳壳 木香 党参 酸枣仁 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.462104 0.326082 0.410242 0.461772 0.453004 0.432422 0.345039 0.426745 0.311037 0.371268 0.357 0.395204 0.388414 0.390721 0.398461
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.266667, recall: 0.333333, error: 0.733333
234. 
patient tongue id: 04222109289231_1_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.479746 0.855773 0.976592 0.445001 0.749433 0.360181 0.447659 0.404844 0.421761 0.9243 0.936268 0.864138 0.9412 0.355592 0.983179 0.470456 0.537223 0.574461 0.694568
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
235. 
patient tongue id: 04141831574013_4_7
label yaofang:
甘草 柴胡 白芍 当归 茯苓 薄荷 白术 栀子 牡丹皮 杜仲 郁金 菟丝子 鸡内金 紫苏梗
0.729974 0.434978 0.406672 0.373153 0.450847
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
236. 
patient tongue id: 03240106147377_7_2
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 薏苡仁 党参 酸枣仁 天麻 肉苁蓉 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 土鳖虫
0.965384 0.538204 0.564655 0.374447 0.348006 0.312203 0.563159 0.535033 0.501909 0.42712 0.452121 0.418668
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
237. 
patient tongue id: 03301924065599_2
label yaofang:
陈皮 法半夏 前胡 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.437344 0.671749 0.376813 0.858006 0.39352 0.589685 0.367692 0.393524 0.385549 0.367362 0.753545 0.767373 0.702304 0.799519 0.393825 0.878487 0.426637 0.455646 0.494794 0.565224
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
238. 
patient tongue id: 06071854140427_4
label yaofang:
甘草 陈皮 茯苓 半夏 龙骨 牡蛎 白术 酸枣仁 钩藤 菊花 天麻 首乌藤 广金钱草
0.403288 0.305977 0.312969 0.428369 0.465076
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
239. 
patient tongue id: 06031722190912_1_4
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.433262 0.609794 0.37953 0.795227 0.396921 0.561487 0.369678 0.320532 0.37499 0.364858 0.364834 0.692216 0.700615 0.65257 0.732462 0.416331 0.808973 0.431382 0.43811 0.483826 0.543239
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
240. 
patient tongue id: 02190536266329_1_7_6
label yaofang:
甘草 酸枣仁 生地黄 乌药 山药 山茱萸 天麻 鳖甲 桑螵蛸 益智 鹿角霜 浮小麦 蜈蚣 天山雪莲 半枝莲
0.824672 0.475289 0.497558 0.361788 0.397674 0.319699
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
241. 
patient tongue id: 04121330297024_4
label yaofang:
麻黄 茯苓 葛根 前胡 桔梗 半夏 防风 款冬花 紫菀 白前 百部 紫苏子 炙甘草 广藿香
0.463753 0.810168 0.341305 0.95163 0.428686 0.701305 0.360446 0.44268 0.39976 0.41233 0.876531 0.890583 0.809182 0.903789 0.362667 0.960128 0.452914 0.51626 0.550443 0.649419
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
242. 
patient tongue id: 05312254443887_2_4_6
label yaofang:
甘草 桔梗 金银花 芦根 牛蒡子 白术 浙贝母 乌梅 鳖甲 皂角刺 白花蛇舌 蜂房 岗梅根 四季青
0.972436 0.516624 0.573229 0.371462 0.346891 0.300582 0.608328 0.563457 0.552534 0.450583 0.492658 0.504351
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
243. 
patient tongue id: 04141828577813_1_4_6
label yaofang:
党参 枸杞子 白术 浙贝母 杜仲 牛膝 桑叶 厚朴 僵蚕 百部 北沙参 紫苏子 紫苏叶 紫苑 南杏仁
0.458817 0.357835 0.576309 0.584579 0.418932 0.353176 0.336937
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
244. 
patient tongue id: 03020817068483_5_6
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 党参 白术 浙贝母 细辛 款冬花 苦杏仁 紫苏子 炙麻黄
0.956312 0.503928 0.553682 0.389222 0.339526 0.316224 0.572273 0.545583 0.542976 0.447431 0.478679 0.496998
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
245. 
patient tongue id: 03132043551916_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.43953 0.389159 0.389793
predicted yaofang:
甘草 茯苓 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
246. 
patient tongue id: 05021912574027_7
label yaofang:
白芍 川芎 当归 茯苓 党参 白术 熟地黄 杜仲 升麻 三七 炙甘草 炙黄芪 血余炭
0.417288 0.339041 0.351081 0.366542 0.440999 0.300137 0.308122
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
247. 
patient tongue id: 01012057139636_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.597074 0.398685 0.300718 0.44614 0.438488 0.33948 0.313218
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
248. 
patient tongue id: 06070654263175_7_4
label yaofang:
甘草 川芎 法半夏 茯苓 白术 红花 杜仲 牛膝 郁金 石菖蒲 天麻 桑螵蛸 益智 天山雪莲
0.965822 0.536693 0.587392 0.365923 0.37553 0.325548 0.600597 0.544698 0.501412 0.439582 0.457497 0.418013
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
249. 
patient tongue id: 01041647064004_6_1
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.717203 0.402316 0.447085 0.359764
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
250. 
patient tongue id: 03012046007710_2
label yaofang:
甘草 玉竹 太子参 浙贝母 郁金 天麻 天花粉 鳖甲 北沙参 白扁豆 浮小麦 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.95016 0.526455 0.536909 0.394083 0.307271 0.308803 0.508988 0.507168 0.503325 0.403272 0.421559 0.403355
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
251. 
patient tongue id: 05222126267759_2_1_7
label yaofang:
蒲公英 龙齿 太子参 黄芪 白术 延胡索 海螵蛸 郁金 砂仁 三七 桑寄生 鸡内金 北沙参 首乌藤
0.536429 0.387497 0.31281 0.505287 0.525482 0.352587
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
252. 
patient tongue id: 03211943521366_1_4
label yaofang:
甘草 陈皮 当归 党参 黄芪 白术 肉桂 干姜 砂仁 升麻 北柴胡 金钱草 桑螵蛸 炙甘草 附片 覆盆子 车前草
0.30865 0.398084 0.342588 0.302648 0.406719 0.548281
predicted yaofang:
柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.176471, error: 0.500000
253. 
patient tongue id: 05260637133544_1_2
label yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 桑螵蛸 益智 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.974981 0.537123 0.551705 0.379561 0.343586 0.309581 0.604893 0.570471 0.574889 0.458708 0.506256 0.525584
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
254. 
patient tongue id: 03291357396673_1_2
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 生地黄 栀子 黄柏 牛膝 山药 灯心草 淡竹叶 麦芽 浮小麦 百合
0.932629 0.524751 0.5461 0.38371 0.33551 0.340889 0.527765 0.512833 0.488637 0.413084 0.428131 0.406898
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.294118, error: 0.583333
255. 
patient tongue id: 01130645266672_6_7_2
label yaofang:
柴胡 白芍 法半夏 党参 延胡索 槟榔 厚朴 天麻 五灵脂 鳖甲 炙甘草 蜈蚣 天山雪莲 半枝莲 姜黄
0.991631 0.595848 0.61088 0.346775 0.385912 0.337849 0.65725 0.661129 0.585696 0.543433 0.55544 0.487185
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
256. 
patient tongue id: 02141908353026_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.434093 0.720182 0.357137 0.891989 0.414476 0.635728 0.366548 0.419585 0.406254 0.396503 0.795735 0.817006 0.738776 0.834596 0.381862 0.911507 0.444494 0.48364 0.530743 0.604248
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
257. 
patient tongue id: 02182308122067_1_6
label yaofang:
甘草 太子参 酸枣仁 丹参 五味子 山药 天麻 鳖甲 补骨脂 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.957986 0.538493 0.565119 0.361681 0.353206 0.338993 0.57678 0.54726 0.500697 0.44125 0.453988 0.414895
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
258. 
patient tongue id: 02122223403050_1_7
label yaofang:
甘草 薏苡仁 党参 黄芪 白术 丹参 熟附子 赤芍 山药 干姜 菟丝子 益母草 鳖甲 莪术 土鳖虫
0.97605 0.554192 0.578715 0.382427 0.395608 0.301321 0.363734 0.618215 0.621807 0.578425 0.527031 0.539574 0.511605
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
259. 
patient tongue id: 03240616592582_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 桔梗 白术 丹参 浙贝母 郁金 麦芽 猫爪草 红曲
0.951927 0.533468 0.560852 0.36882 0.338218 0.306364 0.542081 0.50274 0.465755 0.401993 0.419949 0.373314
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
260. 
patient tongue id: 03091854342645_5_6
label yaofang:
甘草 枳壳 桔梗 金银花 连翘 牛蒡子 白术 浙贝母 莱菔子 麦芽 苦杏仁 独脚金 稻芽
0.983966 0.5581 0.588182 0.385971 0.402973 0.348203 0.664333 0.624335 0.614278 0.513306 0.561311 0.588434
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
261. 
patient tongue id: 03311827135004_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄
0.471601 0.773166 0.327713 0.941682 0.41676 0.689614 0.364929 0.42905 0.401841 0.405821 0.862347 0.875964 0.801849 0.892227 0.387667 0.953535 0.464169 0.51208 0.545612 0.639833
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
262. 
patient tongue id: 04241916421754_2_5
label yaofang:
甘草 陈皮 金银花 芦根 浙贝母 扁豆花 三棱 莪术 黑枣 半枝莲 猫爪草 蛇舌草
0.421539 0.315353 0.377886 0.330838 0.342548
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
263. 
patient tongue id: 02212123403940_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.46912 0.834573 0.318616 0.965954 0.443909 0.725481 0.362567 0.441861 0.402058 0.410156 0.905569 0.917517 0.842625 0.925729 0.363072 0.974182 0.45791 0.521958 0.567159 0.679321
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
264. 
patient tongue id: 01192242058142_6_4
label yaofang:
甘草 桃仁 远志 细辛 天麻 鳖甲 款冬花 紫菀 诃子 苦杏仁 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989858 0.556474 0.595392 0.357798 0.404698 0.342322 0.690361 0.654127 0.624467 0.546952 0.588858 0.601615
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
265. 
patient tongue id: 04200312336406_1_2
label yaofang:
甘草 党参 酸枣仁 生地黄 延胡索 杜仲 细辛 天麻 鳖甲 补骨脂 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.990503 0.581292 0.607843 0.366287 0.426711 0.379597 0.696469 0.67068 0.629106 0.557186 0.589038 0.581632
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
266. 
patient tongue id: 04300851441426_5_1
label yaofang:
甘草 茯苓 党参 白术 佩兰 天麻 鳖甲 莪术 豆蔻 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.968046 0.533549 0.565046 0.391631 0.385915 0.336511 0.623224 0.589855 0.570878 0.485273 0.525674 0.54799
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
267. 
patient tongue id: 03302134133528_6_2_4
label yaofang:
甘草 川芎 法半夏 茯苓 牡蛎 白术 酸枣仁 黄连 生地黄 肉桂 灯心草 天麻 滑石 麦芽 艾叶
0.950464 0.542605 0.546426 0.383035 0.347348 0.335948 0.540254 0.53023 0.49322 0.430207 0.443515 0.38728
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
268. 
patient tongue id: 03012043402562_6_5
label yaofang:
甘草 白芍 川芎 茯苓 党参 黄芪 牛膝 山药 山茱萸 天麻 磁石 蔓荆子 女贞子 墨旱莲
0.876756 0.482753 0.500233 0.393129 0.429195 0.355666 0.408451
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
269. 
patient tongue id: 01211238133672_4_7_1
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 鸡血藤 牡丹皮 干姜 全蝎 天花粉 炙甘草 蜈蚣 土鳖虫 狗脊
0.599892 0.369774 0.455895 0.30871
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.250000, recall: 0.058824, error: 0.750000
270. 
patient tongue id: 06162224154952_1_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.451632 0.740807 0.372909 0.902026 0.438365 0.629563 0.377969 0.417437 0.392707 0.390818 0.812302 0.825621 0.746179 0.841455 0.386002 0.918517 0.438446 0.483586 0.521686 0.613097
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
271. 
patient tongue id: 05242226331835_2_4
label yaofang:
甘草 桔梗 芦根 牛蒡子 麦冬 太子参 浙贝母 天麻 白花蛇舌草 北沙参 紫苏子 蜈蚣 半枝莲 醋鳖甲
0.985962 0.569367 0.588442 0.377113 0.387343 0.347997 0.6386 0.643915 0.597829 0.537893 0.55387 0.515791
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
272. 
patient tongue id: 05191940070762_2_1
label yaofang:
甘草 薏苡仁 桃仁 太子参 红花 延胡索 浙贝母 川楝子 郁金 天麻 鳖甲 苦杏仁 百合 蜈蚣 白花蛇舌 红豆杉
0.976065 0.575716 0.588863 0.377568 0.401632 0.359586 0.618656 0.608907 0.559987 0.507906 0.527454 0.49358
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
273. 
patient tongue id: 03240557245976_7_4_6
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 法半夏 大枣 茯苓 龙骨 牡蛎 远志 党参 丹参 干姜 浮小麦 首乌藤
0.930895 0.520302 0.537178 0.356409 0.308705 0.501325 0.448483 0.42722 0.355193 0.359171 0.304182
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
274. 
patient tongue id: 04101858078843_1_4
label yaofang:
甘草 前胡 桔梗 防风 薄荷 荆芥穗 白芷 北柴胡 香薷 紫菀 百部 辛夷 紫苏梗 广藿香
0.473154 0.79109 0.327826 0.949477 0.418072 0.692599 0.363929 0.424179 0.394533 0.392547 0.876045 0.887951 0.814935 0.903784 0.384455 0.960292 0.455738 0.511314 0.548454 0.652276
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.571429, error: 0.600000
275. 
patient tongue id: 01062042235429_5_6_7
label yaofang:
白芍 陈皮 当归 防风 白术 黄连 乌梅 山药 干姜 仙鹤草 败酱草 皂角刺 炙甘草 姜黄 艾叶
0.959946 0.53243 0.564883 0.382953 0.335141 0.324191 0.552071 0.540367 0.519073 0.439526 0.463234 0.437598
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
276. 
patient tongue id: 06181846209617_2_7
label yaofang:
甘草 茯苓 桃仁 党参 生地黄 赤芍 山茱萸 天麻 鳖甲 女贞子 浮小麦 首乌藤 沙苑子 蜈蚣 白花蛇舌 半枝莲
0.97772 0.562812 0.586156 0.367357 0.390915 0.33658 0.624947 0.602814 0.5508 0.495667 0.516091 0.484436
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
277. 
patient tongue id: 04131817492617_4_6
label yaofang:
甘草 茯苓 木香 薏苡仁 党参 酸枣仁 生地黄 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.944969 0.529557 0.533557 0.411938 0.37296 0.363939 0.558219 0.535278 0.5428 0.447712 0.468234 0.479601
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
278. 
patient tongue id: 01250639374407_1_7
label yaofang:
甘草 茯苓 龙骨 党参 酸枣仁 丹参 柏子仁 生地黄 山药 山茱萸 补骨脂
0.954219 0.536619 0.571076 0.37319 0.377785 0.346588 0.586098 0.558675 0.513442 0.463791 0.479997 0.437418
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.454545, error: 0.583333
279. 
patient tongue id: 04020849361473_1
label yaofang:
甘草 陈皮 法半夏 茯苓 橘红 远志 党参 杜仲 山药 山茱萸 巴戟天 补骨脂 金樱子 佛手
0.969444 0.532196 0.567239 0.399358 0.373619 0.350169 0.569644 0.557168 0.540339 0.450217 0.461213 0.440383
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
280. 
patient tongue id: 01180606399632_4
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 桑白皮 款冬花 射干 紫菀 苦杏仁 炙麻黄
0.990257 0.569865 0.598282 0.350414 0.352442 0.322184 0.645618 0.625863 0.584626 0.503006 0.53036 0.509535
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
281. 
patient tongue id: 02122119459694_6_1
label yaofang:
甘草 白芍 龙骨 赤芍 天麻 鳖甲 补骨脂 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜 宽筋藤
0.950138 0.531193 0.565565 0.375205 0.380216 0.350081 0.575581 0.548921 0.503324 0.456336 0.469698 0.426767
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
282. 
patient tongue id: 03012152059904_6_2
label yaofang:
甘草 茯苓 白术 酸枣仁 生地黄 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.83874 0.475707 0.474404 0.414898 0.304877 0.401166 0.30648 0.400101
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.428571, error: 0.250000
283. 
patient tongue id: 04071309309172_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.427572 0.679226 0.358511 0.86976 0.379303 0.603393 0.337063 0.364103 0.356362 0.3612 0.756357 0.771047 0.704046 0.803969 0.379209 0.88789 0.426638 0.439999 0.48737 0.556036
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
284. 
patient tongue id: 02191223545516_1_2_6
label yaofang:
甘草 白芍 防风 丹参 黄连 生地黄 红花 天麻 僵蚕 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 乌梢蛇
0.952503 0.500143 0.546937 0.376513 0.360787 0.300072 0.567604 0.494215 0.496524 0.398524 0.437168 0.446925
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.411765, error: 0.416667
285. 
patient tongue id: 03170957243964_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.465064 0.331543 0.407745 0.371626 0.302331
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
286. 
patient tongue id: 05092120334896_2_5
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 茯苓 党参 白术 生地黄 牛膝 石膏 淡竹叶 麦芽 广藿香 莲须
0.982941 0.582502 0.614827 0.351113 0.404885 0.34911 0.639633 0.603577 0.528503 0.487391 0.502468 0.439869
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
287. 
patient tongue id: 03192257565883_1_5_6
label yaofang:
甘草 柴胡 白芍 茯苓 木香 党参 白术 酸枣仁 黄连 延胡索 川楝子 乌梅 山药 白扁豆 建曲
0.94082 0.510342 0.555096 0.35637 0.330035 0.549258 0.453386 0.441855 0.34357 0.372917 0.348652
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
288. 
patient tongue id: 02151909348614_4
label yaofang:
陈皮 法半夏 前胡 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.418597 0.624273 0.375937 0.772396 0.409481 0.562033 0.370422 0.300575 0.397037 0.421238 0.301933 0.394225 0.674537 0.706444 0.650752 0.734089 0.380471 0.830792 0.433521 0.469403 0.489541 0.553728
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.545455, recall: 1.000000, error: 0.454545
289. 
patient tongue id: 04181924281899_4_6
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.320885 0.446734 0.342996 0.311415 0.433698 0.547298
predicted yaofang:
柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
290. 
patient tongue id: 06072126078339_4_1
label yaofang:
桂枝 甘草 柴胡 枳壳 法半夏 党参 丹参 赤芍 川楝子 郁金 薤白 瓜蒌皮 补骨脂 麦芽 田七末
0.981422 0.540518 0.541132 0.341124 0.309704 0.597739 0.554746 0.539606 0.443869 0.479062 0.496825
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
291. 
patient tongue id: 02141941523676_6
label yaofang:
海螵蛸 肉桂 干姜 附片
0.443581 0.307514 0.383686 0.317598 0.387793 0.387929 0.382854
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
292. 
patient tongue id: 03012059522541_1_4_6
label yaofang:
甘草 法半夏 大枣 葶苈子 党参 浙贝母 厚朴 砂仁 天麻 鳖甲 苦杏仁 丝瓜络 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.849146 0.489697 0.495477 0.432629
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.750000, recall: 0.187500, error: 0.250000
293. 
patient tongue id: 04150810567070_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.469187 0.361744 0.378961 0.441441 0.463192 0.391856 0.314573 0.37839 0.334968 0.315565 0.35135 0.320238 0.353797 0.358136
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.714286, recall: 0.833333, error: 0.285714
294. 
patient tongue id: 05080758021113_1_4_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 黄芪 生地黄 红花 赤芍 牛膝 六神曲
0.482864 0.383336 0.420826 0.423016 0.307741 0.303006
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
295. 
patient tongue id: 02241437124070_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 海螵蛸 山药 砂仁 菟丝子 白扁豆 续断
0.334362 0.423744 0.36301 0.354006 0.300931 0.486043 0.602806
predicted yaofang:
柴胡 白芍 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
296. 
patient tongue id: 03311700454911_1_7
label yaofang:
当归 茯苓 木香 党参 黄芪 鸡血藤 白术 柏子仁 海螵蛸 炙甘草 百合 紫苏叶
0.701604 0.315401 0.375172 0.430163 0.422278
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
297. 
patient tongue id: 03171210478673_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.392644 0.342593 0.331837 0.393524 0.53482 0.329031 0.356775
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
298. 
patient tongue id: 05131603487038_3
label yaofang:
甘草 茯苓 桃仁 党参 生地黄 红花 肉桂 山药 山茱萸 菟丝子 益母草 淫羊藿 仙茅 女贞子
0.978035 0.569546 0.588894 0.362221 0.376263 0.336224 0.611618 0.574857 0.524886 0.460723 0.484348 0.433705
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
299. 
patient tongue id: 06071851467799_1
label yaofang:
茯苓 薏苡仁 党参 黄芪 白术 酸枣仁 五味子 鸡内金 珍珠母 麦芽 炙甘草 煅龙骨 稻芽
0.518408 0.337481 0.358831 0.44755 0.391149
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
300. 
patient tongue id: 01041629189215_6
label yaofang:
柴胡 黄芩 大枣 龙骨 党参 白术 泽泻 天麻 姜半夏 炙甘草 续断
0.545401 0.318427 0.383717 0.359528 0.412201 0.387658 0.308073
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.571429, recall: 0.363636, error: 0.428571
301. 
patient tongue id: 01172359288914_1_5
label yaofang:
甘草 茯苓 半夏 橘红 太子参 白术 酸枣仁 砂仁 北沙参 首乌藤 合欢皮 山慈菇
0.777589 0.464419 0.445196 0.397386 0.320551 0.307724
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
302. 
patient tongue id: 04071400063437_1_2_7
label yaofang:
甘草 法半夏 前胡 桔梗 橘红 金银花 薏苡仁 藿香 白前 枇杷叶 苦杏仁 干鱼腥草
0.334837 0.458916 0.417896
predicted yaofang:
茯苓 黄芪 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
303. 
patient tongue id: 04182036131258_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 姜半夏 炙甘草 龙脷叶
0.704749 0.323457 0.442762 0.420733 0.399205 0.311011 0.311248
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
304. 
patient tongue id: 06012114330427_1_7
label yaofang:
甘草 枳壳 半夏 黄芪 黄连 杜仲 乌药 柿蒂 赭石 紫苏叶 蜈蚣 荔枝核
0.432516 0.384248 0.347158 0.55649 0.582552 0.302406 0.311572 0.428859 0.365772 0.367503
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.400000, recall: 0.333333, error: 0.600000
305. 
patient tongue id: 03101937397240_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.435725 0.637227 0.407286 0.792087 0.417488 0.561864 0.389901 0.411914 0.41334 0.317911 0.383336 0.700733 0.709198 0.657331 0.733985 0.409824 0.815676 0.431471 0.450765 0.495443 0.549992
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
306. 
patient tongue id: 05092147229753_4
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.419212 0.654812 0.371445 0.842857 0.394612 0.584383 0.34995 0.368249 0.353015 0.350398 0.725956 0.74243 0.676988 0.771954 0.38087 0.857495 0.414588 0.439409 0.470553 0.538839
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
307. 
patient tongue id: 01201325217604_1_2_5
label yaofang:
甘草 薏苡仁 鸡血藤 生地黄 天麻 肉苁蓉 鳖甲 火麻仁 补骨脂 莪术 蜈蚣 天山雪莲 半枝莲 乌梢蛇
0.958632 0.536233 0.546134 0.386155 0.321685 0.313981 0.529772 0.539899 0.522504 0.430621 0.448404 0.411247
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
308. 
patient tongue id: 02142157329991_2_7_6
label yaofang:
甘草 生地黄 山药 山茱萸 菊花 天麻 鳖甲 扁豆花 莪术 桑螵蛸 麦芽 益智 蜈蚣 天山雪莲 半枝莲 木棉花
0.38887 0.473981 0.431378 0.590784 0.35067 0.423184 0.337635 0.346526 0.505517 0.507267 0.45386 0.520298 0.402158 0.609067 0.331586 0.335516 0.330762 0.380337
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
309. 
patient tongue id: 05162139537286_1_2_4
label yaofang:
甘草 玉竹 太子参 灯心草 天麻 鳖甲 茵陈 扁豆花 麦芽 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.95922 0.537069 0.568785 0.358856 0.338653 0.543336 0.479456 0.436295 0.371225 0.390539 0.334472
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
310. 
patient tongue id: 01052140268764_4_6_7
label yaofang:
法半夏 茯苓 薏苡仁 酸枣仁 浙贝母 郁金 天麻 鳖甲 补骨脂 莪术 蜈蚣 天山雪莲 半枝莲
0.978347 0.5388 0.574483 0.360741 0.40043 0.342537 0.649895 0.596138 0.573882 0.49924 0.538367 0.579391
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.538462, error: 0.416667
311. 
patient tongue id: 01250632548641_1_7_4
label yaofang:
甘草 茯苓 党参 白术 丹参 赤芍 郁金 山楂 益母草 首乌藤 建曲 制何首乌 土茯苓 三七粉
0.946792 0.539189 0.550715 0.399215 0.351323 0.343397 0.526478 0.523449 0.502501 0.422408 0.433844 0.39422
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
312. 
patient tongue id: 05131635049192_6_2
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 砂仁 天麻 鳖甲 扁豆花 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.845808 0.450575 0.511444 0.365648 0.415687
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
313. 
patient tongue id: 04112154475540_1_2
label yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 黄柏 山药 白茅根 砂仁 菟丝子 桑寄生 益母草 白花蛇舌
0.932245 0.525451 0.563546 0.383539 0.365126 0.338847 0.54196 0.465608 0.452998 0.361887 0.37799 0.343827
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
314. 
patient tongue id: 04130049495240_6_1
label yaofang:
甘草 党参 丹参 生地黄 杜仲 天麻 桑寄生 鳖甲 补骨脂 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.941675 0.504773 0.514631 0.438831 0.321594 0.322532 0.492542 0.457216 0.523111 0.351869 0.392318 0.434742
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
315. 
patient tongue id: 03281927383412_6_2
label yaofang:
甘草 柴胡 白芍 当归 芦根 桃仁 丹参 枳实 栀子 桑叶 菊花 地黄 瓜蒌皮 北沙参 苦杏仁
0.491641 0.360116 0.416635 0.332389 0.325093
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
316. 
patient tongue id: 05261944346435_1_4_3
label yaofang:
甘草 陈皮 茯苓 半夏 木香 远志 太子参 枸杞子 白术 海螵蛸 杜仲 山药 砂仁 菟丝子 鸡内金 紫苏子 红豆杉
0.38271 0.363424 0.498654 0.470061 0.302225 0.30349
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 北沙参

------Score: precision: 0.500000, recall: 0.176471, error: 0.500000
317. 
patient tongue id: 03171357254611_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.471528 0.875294 0.980048 0.44926 0.763853 0.3398 0.448931 0.403559 0.413401 0.933812 0.943297 0.876418 0.950593 0.337411 0.984956 0.461294 0.535797 0.583668 0.707438
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
318. 
patient tongue id: 04251856245791_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.4589 0.72488 0.344487 0.910599 0.414978 0.650967 0.369221 0.410578 0.385102 0.395561 0.814333 0.832911 0.756732 0.85339 0.396269 0.926033 0.453302 0.490811 0.526236 0.610598
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
319. 
patient tongue id: 03012037039230_6_1_2
label yaofang:
甘草 党参 生地黄 赤芍 浙贝母 郁金 天麻 鳖甲 莪术 麦芽 续断 蜈蚣 白花蛇舌 红豆杉 猫爪草
0.978209 0.557005 0.590542 0.349011 0.371781 0.344803 0.616437 0.585883 0.526849 0.475758 0.487104 0.446894
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
320. 
patient tongue id: 02122113083107_2
label yaofang:
甘草 白芍 川芎 当归 防风 黄芪 何首乌 白术 五味子 生地黄 红花 牡丹皮 荆芥穗 火麻仁 麦芽 白鲜皮
0.832895 0.453301 0.454355 0.448263 0.345916 0.398308
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
321. 
patient tongue id: 05162148409727_2_5
label yaofang:
甘草 白芍 茯苓 木香 党参 白术 生地黄 牡丹皮 黄柏 山药 山茱萸 菟丝子 巴戟天 益母草 补骨脂 白花蛇舌
0.936996 0.521456 0.543733 0.342515 0.332551 0.310645 0.539906 0.428485 0.411525 0.326617 0.3416 0.306642
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
322. 
patient tongue id: 02141952414943_4
label yaofang:
甘草 法半夏 黄连 栀子 泽泻 大黄 淡豆豉 紫草 莪术 皂角刺 紫苏叶
0.878761 0.479885 0.497984 0.41516 0.308081 0.436246 0.419007 0.454493 0.338247 0.348605 0.337301
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.090909, error: 0.909091
323. 
patient tongue id: 01182204187497_2
label yaofang:
甘草 茯苓 桔梗 麦冬 太子参 丹参 浙贝母 乌梅 郁金 天花粉 鳖甲 白花蛇舌 蜂房 岗梅根 四季青
0.973185 0.557302 0.579017 0.369613 0.376255 0.338909 0.597056 0.585831 0.531664 0.483582 0.497212 0.445081
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
324. 
patient tongue id: 03012319140950_6_4
label yaofang:
甘草 川芎 法半夏 茯苓 桔梗 赤芍 浙贝母 牛膝 天麻 豆蔻 白花蛇舌草 浮小麦 蜈蚣 合欢花 醋鳖甲
0.983381 0.55864 0.589134 0.376746 0.383389 0.344043 0.635886 0.624053 0.578323 0.520246 0.539773 0.498555
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
325. 
patient tongue id: 02212049084926_5_3
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 黄连 熟附子 杜仲 肉桂 山药 泽泻 蛇床子 首乌藤 覆盆子
0.976855 0.564944 0.585563 0.376308 0.390972 0.362435 0.617846 0.624821 0.579947 0.526297 0.540941 0.50089
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
326. 
patient tongue id: 01211230117926_2_1_7
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 牡丹皮 干姜 天花粉 炙甘草 猫爪草 风栗壳 石见穿
0.423199 0.332429 0.428613 0.303063
predicted yaofang:
甘草 白芍 党参 炙甘草

------Score: precision: 0.500000, recall: 0.133333, error: 0.500000
327. 
patient tongue id: 01121839383441_4
label yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.446682 0.893813 0.311129 0.98297 0.435227 0.762167 0.316859 0.448684 0.389899 0.397631 0.938892 0.946997 0.877454 0.954288 0.985386 0.440774 0.532025 0.57663 0.70319
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
328. 
patient tongue id: 04132028204014_1_7_2
label yaofang:
当归 党参 黄芪 鸡血藤 白术 砂仁 瓜蒌皮 补骨脂 鸡内金 北沙参 女贞子 首乌藤 稻芽
0.494051 0.378456 0.499064 0.526608 0.354264 0.330385 0.303217
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
329. 
patient tongue id: 03022049238883_1_2
label yaofang:
甘草 当归 茯苓 桃仁 玉竹 党参 黄芪 枸杞子 山药 鸡内金 虎杖 麦芽 北沙参 六神曲 五指毛桃 有瓜石斛 三七粉
0.439941 0.346226 0.365481 0.438611 0.463002 0.382815 0.300532 0.379759 0.301599 0.314111 0.309131 0.338675 0.31272 0.332288 0.348039
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.333333, recall: 0.294118, error: 0.666667
330. 
patient tongue id: 02150738158983_1_4_7
label yaofang:
甘草 薏苡仁 麦冬 太子参 枸杞子 丹参 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 黄精 三七粉
0.424793 0.331555 0.300698 0.405886 0.467817 0.312816 0.337212
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
331. 
patient tongue id: 03291852082375_4_7
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.348316 0.321644 0.418062 0.355417 0.365036 0.352662 0.466642
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.363636, error: 0.428571
332. 
patient tongue id: 04282032543123_2_6
label yaofang:
甘草 白芍 川芎 茯苓 党参 枸杞子 白术 牛膝 山药 天麻 麦芽 蒺藜 首乌藤 沙苑子
0.972377 0.551834 0.580819 0.364193 0.377144 0.327068 0.607071 0.561986 0.514207 0.45355 0.479415 0.44582
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
333. 
patient tongue id: 04260639165286_2
label yaofang:
甘草 茯苓 党参 玄参 赤芍 浙贝母 郁金 山药 地黄 天麻 白花蛇舌草 蜈蚣 醋鳖甲
0.961473 0.520239 0.56334 0.392679 0.345876 0.327465 0.561943 0.542398 0.52226 0.438598 0.45848 0.443615
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.461538, error: 0.500000
334. 
patient tongue id: 03141630584108_1_3_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.537678 0.32565 0.304462 0.481604 0.338868 0.326091 0.31487
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
335. 
patient tongue id: 06170923024864_1_4
label yaofang:
黄芪 白术 赤芍 海螵蛸 浙贝母 砂仁 莪术 鸡内金 北沙参 首乌藤 红豆杉 合欢皮 预知子 稻芽
0.497696 0.415803 0.339565 0.388689 0.381102
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
336. 
patient tongue id: 04202112383755_4_1
label yaofang:
柴胡 黄芩 党参 白术 石菖蒲 泽泻 天麻 姜半夏 炙甘草 续断
0.362211 0.366385 0.310798 0.337862 0.569809
predicted yaofang:
白芍 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.600000, recall: 0.300000, error: 0.400000
337. 
patient tongue id: 03292057207162_1_3
label yaofang:
桂枝 当归 党参 黄芪 枸杞子 杜仲 肉桂 泽泻 芡实 桑椹
0.300346 0.322881 0.436533 0.38152 0.394683
predicted yaofang:
甘草 茯苓 黄芪 白术 炙甘草

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
338. 
patient tongue id: 05242107063927_6_1
label yaofang:
甘草 黄芩 党参 玄参 黄连 生地黄 牛膝 知母 石膏 苍术 细辛 白芷 天花粉
0.970916 0.54705 0.572727 0.363098 0.328036 0.302491 0.569416 0.537188 0.505587 0.42371 0.444785 0.412474
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
339. 
patient tongue id: 04112209487787_4_2
label yaofang:
甘草 独活 党参 白术 延胡索 杜仲 天麻 桑寄生 补骨脂 白花蛇舌草 威灵仙 蜈蚣 半枝莲 醋鳖甲
0.986211 0.577885 0.610768 0.361418 0.420904 0.364435 0.669857 0.626919 0.576994 0.519254 0.546451 0.519244
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
340. 
patient tongue id: 05162036179097_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.338921 0.345717 0.445957 0.359935 0.36929 0.308758 0.418614 0.500981
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.454545, error: 0.375000
341. 
patient tongue id: 05221909407436_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 黄芪 白术 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香
0.4054 0.517509 0.370025 0.711884 0.330086 0.479707 0.330818 0.349028 0.307975 0.312887 0.590472 0.62556 0.563515 0.656052 0.419629 0.778073 0.344016 0.357104 0.400402 0.440836
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.687500, error: 0.450000
342. 
patient tongue id: 04142003101879_6_4
label yaofang:
甘草 川芎 茯苓 党参 酸枣仁 牛膝 天麻 桑寄生 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.728156 0.438926 0.411933 0.473951 0.31906
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
343. 
patient tongue id: 02211822043233_4
label yaofang:
甘草 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 香薷 辛夷 紫苏叶 广藿香 苍耳子
0.458328 0.822623 0.340534 0.957473 0.432107 0.705751 0.349751 0.417595 0.38347 0.387248 0.890282 0.90157 0.823839 0.914306 0.360977 0.967014 0.446416 0.511448 0.560643 0.670032
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.384615, error: 0.750000
344. 
patient tongue id: 06141842372673_5
label yaofang:
前胡 半夏 牛蒡子 桃仁 蒲公英 白术 赤芍 浙贝母 郁金 大黄 厚朴 瓜蒌皮 莪术 北沙参 苦杏仁 赭石 瓜蒌子 紫苑
0.572004 0.405834 0.329814 0.343846 0.397536
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.055556, error: 0.800000
345. 
patient tongue id: 06092000121530_1_2_7
label yaofang:
陈皮 半夏 远志 党参 黄芪 枸杞子 白术 杜仲 牛膝 山药 鳖甲 麦芽 炙甘草 首乌藤 紫苏梗 龟甲 蛇舌草
0.66653 0.407631 0.39141 0.317769 0.494426
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.176471, error: 0.400000
346. 
patient tongue id: 04071421166889_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 细辛 白芷 款冬花 紫菀 百部 紫苏子 炙甘草 辛夷 广藿香
0.455373 0.779855 0.34383 0.94175 0.428478 0.680776 0.348991 0.409601 0.374309 0.383113 0.862759 0.874055 0.797271 0.892442 0.367385 0.949476 0.442236 0.500804 0.539817 0.640733
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
347. 
patient tongue id: 04181912250648_4_1
label yaofang:
陈皮 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄
0.431338 0.63285 0.395214 0.793973 0.40491 0.551252 0.381942 0.391201 0.385613 0.300269 0.38021 0.689138 0.69947 0.632479 0.719356 0.402699 0.822923 0.423851 0.429138 0.472142 0.522847
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
348. 
patient tongue id: 02211846378512_3
label yaofang:
桂枝 白芍 当归 茯苓 龙骨 牡蛎 牛蒡子 党参 黄芪 白术 附子 生石膏 炙甘草
0.486633 0.319181 0.387299 0.32417 0.388447 0.392784 0.362321
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.714286, recall: 0.384615, error: 0.285714
349. 
patient tongue id: 01040102132409_1_4_7
label yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 红花 延胡索 赤芍 牛膝 桑寄生 补骨脂 续断 威灵仙
0.962325 0.526107 0.577617 0.360364 0.349788 0.306849 0.576362 0.539357 0.476757 0.434928 0.450227 0.396189
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
350. 
patient tongue id: 03231250362498_4_1
label yaofang:
陈皮 法半夏 茯苓 葛根 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香
0.334965 0.324168 0.42781 0.422801 0.478648 0.319207 0.34576 0.342 0.400868 0.405348 0.33033 0.36326 0.346625 0.522882
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.785714, recall: 0.785714, error: 0.214286
351. 
patient tongue id: 03022148335899_4
label yaofang:
当归 木香 党参 黄芪 鸡血藤 白术 柏子仁 虎杖 白花蛇舌草 炙甘草 百合 紫苏叶
0.796524 0.438639 0.491859 0.368869 0.396582 0.302498
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
352. 
patient tongue id: 03290654197935_6_4_7
label yaofang:
甘草 茯苓 生地黄 牡丹皮 杜仲 黄柏 牛膝 山药 山茱萸 桑寄生 淡竹叶 补骨脂 续断
0.976416 0.546933 0.580359 0.38113 0.370746 0.326428 0.603787 0.576914 0.538891 0.473214 0.495217 0.45883
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
353. 
patient tongue id: 03231125431416_2_7_6
label yaofang:
甘草 党参 生地黄 杜仲 郁金 山药 白茅根 天麻 菟丝子 益母草 鳖甲 蜈蚣 天山雪莲 半枝莲 龙葵果
0.986703 0.567692 0.590062 0.382787 0.407099 0.338361 0.667877 0.625881 0.617501 0.502233 0.553222 0.587028
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
354. 
patient tongue id: 04130644000681_1_6
label yaofang:
甘草 白芍 川芎 龙骨 酸枣仁 玄参 天冬 红花 栀子 牛膝 桑寄生 麦芽 赭石 首乌藤 醋鳖甲
0.985392 0.578265 0.60267 0.362864 0.390873 0.330638 0.633786 0.607962 0.548728 0.499615 0.516471 0.462555
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
355. 
patient tongue id: 03022120589835_6_1_4
label yaofang:
当归 茯苓 桔梗 远志 党参 酸枣仁 丹参 玄参 五味子 天冬 柏子仁 生地黄 厚朴 火麻仁
0.427487 0.353739 0.573405 0.518727 0.383878 0.315393 0.307891
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
356. 
patient tongue id: 03151829210567_3
label yaofang:
白芍 川芎 大枣 当归 党参 太子参 枸杞子 熟地黄 山萸肉 炙甘草 续断 制何首乌 炙黄芪 盐菟丝子 酒女贞子
0.304852 0.314364 0.38569 0.330824 0.515148
predicted yaofang:
甘草 法半夏 茯苓 黄芪 炙甘草

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
357. 
patient tongue id: 01200638521477_6_5
label yaofang:
金银花 党参 红花 厚朴 荆芥穗 天麻 鳖甲 火麻仁 麦芽 白鲜皮 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 土茯苓
0.962275 0.526679 0.57165 0.398628 0.390085 0.301398 0.354126 0.622861 0.590752 0.584877 0.502415 0.54599 0.570333
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.437500, error: 0.461538
358. 
patient tongue id: 05250457504045_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 芦根 桃仁 麦冬 浙贝母 细辛 射干 诃子 蝉蜕
0.656176 0.433801 0.39782 0.312858 0.393414
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
359. 
patient tongue id: 02161925157422_4_1
label yaofang:
甘草 茯苓 半夏 橘红 太子参 山药 桑白皮 僵蚕 枇杷叶 地龙 紫苏叶 黑枣
0.505723 0.414804 0.304901 0.476912 0.398493 0.317531
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
360. 
patient tongue id: 04062006015367_1_4
label yaofang:
白芍 香附 枳壳 法半夏 党参 海螵蛸 车前子 北柴胡 麦芽 炙甘草 紫苏梗 威灵仙
0.354201 0.451151 0.324263 0.365265 0.325839 0.300994 0.457837 0.571416
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
361. 
patient tongue id: 05182054080989_6_4
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 广金钱草
0.68729 0.378181 0.352216 0.442056 0.368916
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
362. 
patient tongue id: 04282256596421_2_6
label yaofang:
甘草 茯苓 远志 党参 鸡血藤 白术 酸枣仁 赤芍 天麻 菟丝子 鳖甲 蜈蚣 天山雪莲 半枝莲 红豆杉
0.988993 0.566596 0.607964 0.364194 0.40516 0.343222 0.678861 0.646458 0.606079 0.539662 0.566264 0.548859
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
363. 
patient tongue id: 01192140304600_2_5
label yaofang:
甘草 川芎 牡蛎 党参 酸枣仁 牛膝 钩藤 泽泻 天麻 磁石 麦芽 地龙 蒺藜 首乌藤 谷精子
0.963667 0.520024 0.553744 0.37946 0.33803 0.335592 0.577222 0.547426 0.553518 0.438052 0.463462 0.482303
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
364. 
patient tongue id: 03012219456301_2_4_7
label yaofang:
甘草 浙贝母 郁金 山药 地黄 车前子 天麻 白花蛇舌草 茺蔚子 鹿角霜 浮小麦 百合 蜈蚣 合欢花 醋鳖甲 炒鸡内金
0.935198 0.534892 0.539801 0.385695 0.347255 0.327496 0.512489 0.493514 0.477179 0.406835 0.415703 0.376101
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
365. 
patient tongue id: 03022215287708_6_4
label yaofang:
甘草 白芍 川芎 茯苓 枸杞子 牛膝 天麻 全蝎 鳖甲 益智 女贞子 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.981744 0.570114 0.60017 0.375242 0.391622 0.365348 0.638726 0.626876 0.579529 0.520543 0.537634 0.503128
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
366. 
patient tongue id: 05182015393434_1_4_6
label yaofang:
薏苡仁 黄芪 何首乌 白术 海螵蛸 厚朴 菟丝子 桑寄生 橘络 桑枝 土鳖虫 红豆杉 山慈菇 黑老虎
0.516017 0.369368 0.38538 0.465788 0.361393
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
367. 
patient tongue id: 02202219177280_6_4
label yaofang:
甘草 法半夏 党参 酸枣仁 竹茹 浙贝母 郁金 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.94356 0.520488 0.536074 0.395177 0.332576 0.334651 0.526427 0.526646 0.518897 0.430595 0.448927 0.427173
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
368. 
patient tongue id: 05140651214677_3_4
label yaofang:
甘草 白芍 茯苓 党参 生地黄 熟附子 杜仲 山药 山茱萸 车前子 桑寄生 猪苓 补骨脂 牛大力
0.927581 0.529834 0.558684 0.375244 0.391927 0.352245 0.547448 0.481788 0.453562 0.402088 0.402877 0.365465
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
369. 
patient tongue id: 03021321513709_5
label yaofang:
甘草 陈皮 茯苓 薏苡仁 滑石 萹蓄 广藿香 焦栀子 干鱼腥草 麸炒白术 炒六神曲 川木通 广金钱草 车前草
0.392195 0.697725 0.427149 0.838844 0.416087 0.558836 0.343981 0.384007 0.329127 0.354464 0.72618 0.732734 0.639749 0.75414 0.321147 0.816147 0.384021 0.428987 0.418581 0.51857
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.214286, error: 0.850000
370. 
patient tongue id: 05221925279841_1
label yaofang:
麻黄 陈皮 前胡 桔梗 半夏 防风 白芷 款冬花 紫菀 白前 百部 蝉蜕 炙甘草 辛夷 紫苏梗
0.472377 0.799602 0.341184 0.94721 0.443752 0.68787 0.374514 0.434323 0.403607 0.404347 0.87393 0.886178 0.80762 0.896709 0.382505 0.958916 0.449322 0.510295 0.558256 0.655845
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.733333, error: 0.450000
371. 
patient tongue id: 02142002447507_1
label yaofang:
柴胡 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.41605 0.365365 0.374828 0.334089 0.337656
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
372. 
patient tongue id: 03311811209880_1_4
label yaofang:
陈皮 法半夏 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.469405 0.817837 0.322932 0.957694 0.425911 0.707836 0.362686 0.434613 0.401123 0.406341 0.888805 0.902223 0.82762 0.914063 0.370181 0.968623 0.459533 0.516762 0.563744 0.662846
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
373. 
patient tongue id: 06190157216929_2_4
label yaofang:
甘草 法半夏 茯苓 桔梗 橘红 芦根 太子参 浙贝母 鳖甲 紫菀 苦杏仁 百合 白花蛇舌 蜂房 四季青
0.958966 0.551061 0.56421 0.378192 0.367934 0.34174 0.571016 0.570596 0.518981 0.47234 0.486984 0.438414
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
374. 
patient tongue id: 02212041172234_5_6
label yaofang:
甘草 薏苡仁 丹参 杜仲 黄柏 苍术 山楂 天麻 决明子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 三七粉
0.98874 0.568758 0.605976 0.373199 0.402596 0.363453 0.66144 0.65881 0.618205 0.545083 0.568047 0.550738
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
375. 
patient tongue id: 01211235585240_4_7
label yaofang:
白芍 麦冬 党参 三七 鳖甲 酒萸肉
0.347144 0.362497 0.34423
predicted yaofang:
甘草 党参 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
376. 
patient tongue id: 05231133267962_1_4_7
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 厚朴
0.347145 0.314178 0.399578 0.427762 0.306107 0.324855
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝

------Score: precision: 0.833333, recall: 0.416667, error: 0.166667
377. 
patient tongue id: 05260712482286_1_2_7
label yaofang:
桂枝 甘草 柴胡 白芍 茯苓 桃仁 党参 青皮 牡丹皮 山药 菟丝子 益母草 王不留行 合欢花
0.972597 0.54933 0.570252 0.374549 0.388188 0.330132 0.63127 0.592598 0.565459 0.482301 0.517418 0.519863
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
378. 
patient tongue id: 05222048283442_1_6_5
label yaofang:
牡蛎 连翘 党参 白术 赤芍 山药 厚朴 砂仁 北沙参 土鳖虫 红豆杉 山慈菇 预知子 蛇舌草
0.514514 0.386319 0.308778 0.573706 0.563581 0.317844 0.431137 0.357682 0.304968 0.3533
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
379. 
patient tongue id: 02142200252756_6_4
label yaofang:
甘草 川芎 党参 丹参 栀子 苍术 天麻 全蝎 磁石 白芷 蔓荆子 麦芽 首乌藤 谷精子
0.947228 0.515065 0.542422 0.413095 0.367106 0.328791 0.536223 0.469932 0.499049 0.364248 0.399217 0.396824
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
380. 
patient tongue id: 04180847010682_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.587397 0.373753 0.320848 0.486118 0.354372 0.352609 0.328639 0.334805
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
381. 
patient tongue id: 01190059503846_5
label yaofang:
陈皮 黄芩 法半夏 茯苓 桔梗 芦根 牛蒡子 薏苡仁 鱼腥草 浙贝母 桑白皮 款冬花 紫菀 白前 苦杏仁 板蓝根
0.961592 0.536053 0.564055 0.369633 0.350397 0.336931 0.56728 0.560946 0.52748 0.456484 0.468664 0.432538
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.062500, error: 0.916667
382. 
patient tongue id: 03032026199387_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.447553 0.665431 0.392656 0.830598 0.424858 0.574811 0.410789 0.429635 0.418857 0.334304 0.404087 0.735095 0.748159 0.674289 0.760549 0.414912 0.851546 0.437342 0.304975 0.457215 0.487298 0.559383
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.727273, recall: 1.000000, error: 0.272727
383. 
patient tongue id: 03232300296240_1_7
label yaofang:
甘草 白芍 川芎 法半夏 茯苓 党参 枸杞子 白术 黄连 生地黄 牛膝 天麻 麦芽 首乌藤
0.979819 0.551102 0.582237 0.37834 0.402116 0.352206 0.633766 0.610878 0.584462 0.509416 0.544002 0.546347
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
384. 
patient tongue id: 03090800372196_5
label yaofang:
甘草 前胡 桔梗 芦根 牛蒡子 浙贝母 天麻 鳖甲 款冬花 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.939516 0.512706 0.509305 0.446879 0.327191 0.430609 0.414276 0.515444 0.30363 0.333364 0.357962
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
385. 
patient tongue id: 05262056463081_5_2
label yaofang:
甘草 柴胡 白芍 连翘 生地黄 石膏 山药 白芷 胡黄连 淡竹叶 芡实 麦芽 广藿香 天山雪莲 川木通
0.99302 0.575554 0.619054 0.363006 0.451543 0.366283 0.737619 0.684433 0.657142 0.573684 0.626306 0.666686
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
386. 
patient tongue id: 04261328517448_6_1
label yaofang:
甘草 柴胡 川芎 香附 防风 赤芍 荆芥穗 白芷 郁李仁 芥子
0.343398 0.34876 0.452638 0.364591 0.37168 0.37787 0.478179
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.200000, error: 0.714286
387. 
patient tongue id: 01042313228497_2
label yaofang:
枳壳 太子参 白术 枳实 神曲 山楂 砂仁 石斛 火麻仁 麦芽 郁李仁 百合 紫苏叶
0.513935 0.317565 0.402121 0.322585 0.417276 0.350798 0.344325
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
388. 
patient tongue id: 03281921581672_4
label yaofang:
麻黄 桂枝 甘草 柴胡 白芍 陈皮 黄芩 法半夏 当归 葛根 桔梗 龙骨 牡蛎 桃仁 麦冬 丹参 黄连 熟地黄 胆南星 栀子 细辛 地黄 干姜 石斛 三七 半边莲
0.958114 0.544289 0.559756 0.387001 0.366083 0.34294 0.561683 0.546045 0.513255 0.452688 0.462794 0.432657
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.038462, error: 0.916667
389. 
patient tongue id: 01090003183397_1_4
label yaofang:
桂枝 白芍 茯苓 薏苡仁 桃仁 牡丹皮
0.318246 0.504779 0.327446 0.573231 0.321335 0.419186 0.351422 0.374632 0.44977 0.647608 0.34914 0.438038 0.841747 0.355192
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香

------Score: precision: 0.071429, recall: 0.166667, error: 0.928571
390. 
patient tongue id: 02261310500870_5_6
label yaofang:
甘草 白术 丹参 杜仲 钩藤 天麻 天花粉 桑寄生 扁豆花 决明子 浮小麦 首乌藤
0.963652 0.53615 0.562836 0.389986 0.379939 0.348587 0.603011 0.57389 0.563985 0.480491 0.510763 0.519324
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.250000, error: 0.750000
391. 
patient tongue id: 05092233355207_1_3
label yaofang:
甘草 荆芥 防风 连翘 牛蒡子 党参 白术 杜仲 郁金 厚朴 火麻仁 枇杷叶 辛夷
0.628729 0.400631 0.404507 0.461081 0.420303
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
392. 
patient tongue id: 05231946058412_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 蜜麻黄 麸炒白术
0.316853 0.329198 0.377768 0.41405 0.311616 0.414062 0.322252 0.350031 0.304334 0.346272 0.396302 0.527202
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
393. 
patient tongue id: 05112033504579_5_7_1
label yaofang:
黄芪 白术 海螵蛸 浙贝母 杜仲 山楂 仙鹤草 砂仁 芡实 鸡内金 北沙参 紫苏梗 鲜龙葵果
0.59574 0.408559 0.351004 0.378107 0.447689
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
394. 
patient tongue id: 03291326435181_1_7
label yaofang:
甘草 柴胡 白芍 香附 当归 茯苓 薄荷 白术 丹参 砂仁 麦芽 广藿香
0.32458 0.324211 0.411371 0.335238 0.364597 0.375945 0.496877
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
395. 
patient tongue id: 05162149389680_2
label yaofang:
陈皮 法半夏 葛根 前胡 桔梗 麦冬 玉竹 太子参 款冬花 紫菀 北沙参 炙甘草 人参叶
0.419953 0.622261 0.383164 0.804191 0.378259 0.534723 0.368328 0.360443 0.375086 0.32419 0.699749 0.71756 0.661993 0.748973 0.416751 0.855525 0.387837 0.399241 0.4847 0.539942
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.692308, error: 0.550000
396. 
patient tongue id: 05191947588652_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 熟地黄 栀子 牡丹皮 山药 菟丝子 桑寄生 女贞子 首乌藤 合欢花 艾叶
0.978366 0.553398 0.582516 0.376426 0.387388 0.371772 0.627579 0.634068 0.593548 0.535297 0.549555 0.531005
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
397. 
patient tongue id: 01052206203844_1_3_7
label yaofang:
甘草 桔梗 黄芪 白术 熟地黄 浙贝母 山茱萸 桑螵蛸 夏枯草 北沙参 首乌藤 蜈蚣 合欢皮 墨旱莲
0.527153 0.415483 0.320126 0.429278 0.470162
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
398. 
patient tongue id: 02161855556278_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 紫菀 北沙参 炙甘草 广藿香 威灵仙 炒紫苏子 蜜麻黄 醋五味子
0.467608 0.825946 0.309297 0.964178 0.432358 0.724601 0.356305 0.437703 0.406751 0.41335 0.90405 0.915684 0.842932 0.924999 0.363625 0.97437 0.465217 0.524529 0.565044 0.681235
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.687500, error: 0.450000
399. 
patient tongue id: 04132033420666_1_2_6
label yaofang:
甘草 茯苓 桔梗 半夏 橘红 白术 枇杷叶 北沙参 苦杏仁 炙麻黄 首乌藤 合欢皮
0.369941 0.300907 0.589481
predicted yaofang:
黄芪 白术 炙甘草

------Score: precision: 0.333333, recall: 0.083333, error: 0.666667
400. 
patient tongue id: 01201308575284_1_2_4
label yaofang:
桂枝 甘草 茯苓 薏苡仁 党参 红花 郁金 山药 荆芥穗 鳖甲 莪术 白鲜皮 蜈蚣 白花蛇舌 天山雪莲 红豆杉 土茯苓
0.969792 0.54637 0.560905 0.406515 0.363257 0.337275 0.572627 0.561007 0.567979 0.453702 0.483878 0.484489
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.470588, error: 0.333333
401. 
patient tongue id: 04120319427338_4_6
label yaofang:
甘草 柴胡 白芍 茯苓 木香 蒲公英 白及 党参 白术 延胡索 五灵脂 合欢花 麸炒枳壳
0.987006 0.559597 0.629654 0.310891 0.395884 0.303495 0.666864 0.533907 0.470091 0.382166 0.426765 0.359231
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
402. 
patient tongue id: 01041317288799_6
label yaofang:
柴胡 白芍 当归 茯苓 薄荷 白术 栀子 淡豆豉 炙甘草 首乌藤
0.505906 0.328091 0.398637
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.333333, recall: 0.100000, error: 0.666667
403. 
patient tongue id: 05131443176807_7_2_6
label yaofang:
甘草 白芍 川芎 茯苓 桃仁 酸枣仁 丹参 红花 赤芍 薤白 水蛭 砂仁 瓜蒌皮 降香
0.896875 0.302026 0.476675 0.523935 0.386412 0.423777 0.334946 0.362356
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
404. 
patient tongue id: 01211210478406_4
label yaofang:
桂枝 柴胡 黄芩 桔梗 牡蛎 干姜 天花粉 炙甘草 玉米须
0.466577 0.378143 0.34422 0.462004 0.460055
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
405. 
patient tongue id: 03200652043789_4
label yaofang:
甘草 法半夏 茯苓 薏苡仁 细辛 天麻 款冬花 莪术 诃子 白花蛇舌草 地龙 紫苏梗 蜈蚣 醋鳖甲
0.978232 0.550822 0.586803 0.393746 0.388355 0.356719 0.626214 0.604852 0.577628 0.502027 0.52444 0.519762
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
406. 
patient tongue id: 05152045310016_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 黄芩 薏苡仁 黄芪 丹参 五味子 桑寄生 白花蛇舌草 制何首乌
0.328612 0.367363 0.468949 0.335022 0.358554 0.443867 0.530811
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
407. 
patient tongue id: 05022032291976_2_1
label yaofang:
甘草 桔梗 芦根 太子参 浙贝母 鳖甲 北沙参 辛夷 苍耳子 白花蛇舌 天山雪莲 蜂房 岗梅根 四季青
0.978362 0.567245 0.582985 0.377342 0.390985 0.346902 0.623614 0.603692 0.557618 0.498432 0.518094 0.475238
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
408. 
patient tongue id: 03151923165052_4_6
label yaofang:
甘草 茯苓 薏苡仁 白术 海螵蛸 山药 砂仁 姜半夏
0.507844 0.325529 0.315147 0.357559 0.438838
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.375000, error: 0.400000
409. 
patient tongue id: 05201501056523_1_6_7
label yaofang:
甘草 柴胡 黄芩 茯苓 龙骨 牡蛎 桃仁 远志 党参 白术 酸枣仁 生地黄 红花 莪术 浮小麦
0.920442 0.314215 0.528755 0.5139 0.358999 0.471255 0.415806 0.415469 0.314372 0.319499
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
410. 
patient tongue id: 06050808094870_1_3_7
label yaofang:
桂枝 茯苓 白术 栀子 通草 泽泻 车前子 大黄 滑石 猪苓 瞿麦 萹蓄 炙甘草
0.377231 0.375954 0.419894 0.487568 0.377993 0.405734 0.33636 0.33375 0.359666 0.343465 0.35152 0.376285
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
411. 
patient tongue id: 03282241538585_4_6
label yaofang:
甘草 川芎 黄芩 法半夏 茯苓 薏苡仁 黄芪 山药 厚朴 白芷 蔓荆子 豆蔻 苦杏仁 皂角刺 辛夷 苍耳子
0.974564 0.551673 0.596896 0.368619 0.380546 0.323008 0.612084 0.567081 0.521882 0.456996 0.481732 0.439904
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
412. 
patient tongue id: 05290752497715_5_6
label yaofang:
甘草 法半夏 前胡 桔梗 桃仁 远志 浙贝母 天麻 鳖甲 炙甘草 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.985632 0.567135 0.596692 0.371088 0.394176 0.345339 0.644645 0.624712 0.575279 0.51228 0.533825 0.494743
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
413. 
patient tongue id: 02111316314212_1_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.654476 0.392085 0.344604 0.330435 0.485002
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
414. 
patient tongue id: 05262159370822_3_5_6
label yaofang:
甘草 白芍 薏苡仁 党参 黄芪 白术 熟附子 天麻 巴戟天 鳖甲 建曲 蜈蚣 天山雪莲 半枝莲 广升麻
0.93353 0.533534 0.550707 0.397222 0.366168 0.345005 0.535682 0.502924 0.48851 0.414018 0.425273 0.383441
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
415. 
patient tongue id: 04021228157134_1_2_5
label yaofang:
甘草 茯苓 党参 白术 丹参 浙贝母 杜仲 厚朴 砂仁 火麻仁 金樱子 北沙参 木蝴蝶
0.706159 0.423553 0.351007 0.454129 0.554106 0.318413 0.311353
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.857143, recall: 0.461538, error: 0.142857
416. 
patient tongue id: 03111736170323_2_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 延胡索 川楝子 山药 桑叶 鳖甲 扁豆花 莪术 佛手 蜈蚣 白花蛇舌 天山雪莲
0.963821 0.537073 0.558883 0.373111 0.337477 0.321669 0.55687 0.544628 0.50731 0.438349 0.456496 0.422162
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
417. 
patient tongue id: 02241402106682_1_7_4
label yaofang:
黄芪 白术 厚朴 当归尾 砂仁 桑寄生 火麻仁 莪术 鸡内金 北沙参 女贞子 红豆杉 墨旱莲 稻芽
0.451724 0.375417 0.354194 0.443657 0.383443
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
418. 
patient tongue id: 05242242445813_1_2
label yaofang:
甘草 柴胡 白芍 枳壳 薏苡仁 党参 山药 天麻 鳖甲 莪术 建曲 蜈蚣 白花蛇舌 天山雪莲 红豆杉 龙葵果
0.966152 0.548421 0.573523 0.372838 0.385618 0.335732 0.591057 0.550256 0.507496 0.446888 0.466659 0.427069
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
419. 
patient tongue id: 02231916522230_2_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.40852 0.577518 0.410452 0.729789 0.39339 0.523046 0.368 0.316304 0.368718 0.35692 0.356457 0.629263 0.633177 0.582339 0.662116 0.399323 0.735899 0.405164 0.419326 0.435532 0.486282
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
420. 
patient tongue id: 01070839503393_1_2_6
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志 黄精
0.315284 0.421478 0.367111 0.454382 0.300417 0.391343 0.353245 0.351939 0.364934 0.471746 0.392697 0.414629 0.317322 0.67742
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.142857, recall: 0.166667, error: 0.857143
421. 
patient tongue id: 04142231049780_6_4_1
label yaofang:
甘草 柴胡 白芍 茯苓 木香 党参 白术 酸枣仁 黄连 延胡索 乌梅 山药 砂仁 首乌藤 建曲 合欢花
0.934853 0.51762 0.560346 0.351611 0.364644 0.334472 0.559982 0.417436 0.416825 0.310862 0.331927 0.305204
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
422. 
patient tongue id: 04260622320798_5
label yaofang:
甘草 黄芩 茯苓 前胡 桔梗 浙贝母 细辛 车前子 白前 苦杏仁 炙麻黄 广金钱草
0.990647 0.590072 0.607972 0.373372 0.425799 0.365144 0.68402 0.669067 0.621996 0.560731 0.590486 0.559979
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.166667, error: 0.833333
423. 
patient tongue id: 03101954444297_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 蜜麻黄
0.350754 0.387208 0.346328 0.456442
predicted yaofang:
法半夏 茯苓 黄芪 炙甘草

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
424. 
patient tongue id: 04101853358815_4
label yaofang:
法半夏 前胡 桔梗 防风 黄芪 白术 钩藤 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.34927 0.499406 0.380104 0.626558 0.326808 0.457053 0.317935 0.367571 0.318403 0.512804 0.530285 0.509778 0.553982 0.381983 0.69012 0.327596 0.328186 0.331857 0.3712
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
425. 
patient tongue id: 02120928504219_5_6
label yaofang:
甘草 白芍 防风 独活 薏苡仁 白及 党参 白术 黄连 苍术 山药 干姜 桑寄生 豆蔻 建曲
0.959834 0.5519 0.580489 0.365375 0.388505 0.363353 0.589853 0.571993 0.516057 0.470419 0.485842 0.433356
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
426. 
patient tongue id: 04112046581453_6_4
label yaofang:
甘草 白芍 太子参 车前子 天麻 桑寄生 鳖甲 补骨脂 瞿麦 鸡内金 鹿角霜 蜈蚣 天山雪莲 半枝莲 广金钱草 泽兰
0.985096 0.576271 0.606679 0.363504 0.423318 0.367511 0.664719 0.627478 0.570286 0.514038 0.534843 0.499997
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
427. 
patient tongue id: 03022151247743_1_4
label yaofang:
甘草 柴胡 白芍 香附 枳壳 茯苓 葛根 党参 太子参 白术 延胡索 海螵蛸 浙贝母 车前子 豆蔻 姜半夏 炙甘草 紫苏梗 瓦楞子 猫爪草
0.387393 0.320899 0.395344 0.372615 0.366072 0.324204 0.425026
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 1.000000, recall: 0.350000, error: 0.000000
428. 
patient tongue id: 04130628445294_6_4
label yaofang:
甘草 龙骨 牡蛎 酸枣仁 栀子 山茱萸 薤白 地黄 砂仁 蔓荆子 瓜蒌皮 麦芽 麸炒枳壳
0.965628 0.529077 0.563577 0.392428 0.385259 0.355577 0.590051 0.578799 0.553765 0.487762 0.497961 0.494849
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
429. 
patient tongue id: 04202108513924_6_1
label yaofang:
党参 枸杞子 白术 柏子仁 熟地黄 海螵蛸 杜仲 菟丝子 巴戟天 桑寄生 续断 制何首乌 艾叶
0.336767 0.445812 0.302412 0.331331 0.315632 0.322827 0.477128 0.627416
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
430. 
patient tongue id: 03312107129125_2_1
label yaofang:
甘草 大枣 茯苓 党参 酸枣仁 生地黄 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.987821 0.57555 0.60154 0.355673 0.402219 0.336747 0.659945 0.637058 0.58468 0.52021 0.549433 0.521207
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
431. 
patient tongue id: 03020825322183_6_1
label yaofang:
甘草 川芎 茯苓 党参 酸枣仁 生地黄 牛膝 天麻 鳖甲 白花蛇舌草 浮小麦 蜈蚣 天山雪莲 半枝莲 红豆杉
0.850225 0.462901 0.494005 0.402742 0.419402 0.362568
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
432. 
patient tongue id: 03221614105456_6_5
label yaofang:
甘草 柴胡 白芍 木香 蒲公英 白及 延胡索 川楝子 山药 砂仁 桑寄生 芡实 桑螵蛸 姜黄 麸炒枳壳
0.974822 0.556801 0.583691 0.363864 0.365721 0.336954 0.592054 0.578863 0.530302 0.467037 0.488741 0.452716
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
433. 
patient tongue id: 03282219499527_6_2
label yaofang:
甘草 白芍 陈皮 茯苓 防风 党参 白术 酸枣仁 黄连 乌梅 黄柏 山药 干姜 佛手 合欢花 花椒
0.979736 0.570531 0.589383 0.387379 0.446404 0.315383 0.38856 0.659158 0.634303 0.600908 0.539109 0.569393 0.557727
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.375000, error: 0.538462
434. 
patient tongue id: 02122125163675_5
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 鱼腥草 浙贝母 细辛 桑白皮 蔓荆子 款冬花 诃子 苦杏仁 紫苏子
0.945058 0.521046 0.56073 0.388766 0.377402 0.355381 0.567413 0.540783 0.512181 0.446495 0.465007 0.449953
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
435. 
patient tongue id: 03171030054772_1_3
label yaofang:
黄芩 金银花 牛蒡子 蒲公英 麦冬 太子参 细辛 蔓荆子 鸡内金 苍耳子 炒六神曲
0.447168 0.31724 0.369648 0.456764 0.417655 0.381301 0.305132 0.380843 0.311472 0.321715 0.323152 0.311711
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 制何首乌

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
436. 
patient tongue id: 02141946009950_1_2
label yaofang:
大枣 当归 茯苓 木香 龙骨 牡蛎 远志 党参 白术 酸枣仁 柏子仁 肉桂 炙甘草
0.694468 0.332518 0.411219 0.413921 0.376322
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
437. 
patient tongue id: 04282227441751_2
label yaofang:
甘草 白芍 茯苓 酸枣仁 生地黄 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 宽筋藤
0.922108 0.430931 0.552495 0.427645 0.381896
predicted yaofang:
甘草 法半夏 茯苓 党参 天麻

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
438. 
patient tongue id: 04112005011337_6_2
label yaofang:
甘草 酸枣仁 生地黄 延胡索 杜仲 天麻 桑寄生 瓜蒌皮 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.955436 0.527007 0.54606 0.392109 0.316319 0.315466 0.523027 0.519628 0.501731 0.423074 0.439412 0.402232
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
439. 
patient tongue id: 04200637551984_5_6
label yaofang:
甘草 柴胡 法半夏 茯苓 龙骨 牡蛎 远志 党参 酸枣仁 丹参 黄连 胆南星 栀子 桑白皮 淡豆豉
0.968971 0.531279 0.578556 0.368922 0.315986 0.545798 0.499658 0.469549 0.385068 0.41169 0.357385
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
440. 
patient tongue id: 01042351459091_6_1
label yaofang:
甘草 柴胡 茯苓 桃仁 酸枣仁 丹参 生地黄 赤芍 青皮 郁金 王不留行 天山雪莲 路路通
0.97433 0.530426 0.588729 0.357055 0.399891 0.338288 0.647897 0.585434 0.550587 0.474262 0.523232 0.533237
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
441. 
patient tongue id: 03221626506476_2_7
label yaofang:
甘草 独活 麦冬 党参 白术 熟地黄 紫河车 天麻 鳖甲 补骨脂 蜈蚣 天山雪莲 半枝莲
0.657559 0.436479 0.351888 0.34754 0.364365
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
442. 
patient tongue id: 01250627408011_1_6
label yaofang:
甘草 柴胡 白芍 川芎 金银花 连翘 党参 酸枣仁 生地黄 黄柏 石膏 苍术 车前子 天麻 全蝎 麦芽
0.856202 0.495895 0.46667 0.395842 0.37453 0.332087 0.396293
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.187500, error: 0.571429
443. 
patient tongue id: 02142155594604_2
label yaofang:
甘草 丹参 山药 地黄 天麻 菟丝子 益母草 白花蛇舌草 建曲 蜈蚣 醋香附 半枝莲 醋鳖甲 酒女贞子 墨旱莲
0.967762 0.540526 0.558409 0.395844 0.384855 0.35247 0.595466 0.557028 0.568702 0.452368 0.489283 0.518534
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
444. 
patient tongue id: 01042312130377_1
label yaofang:
茯苓 红花 熟地黄 牡丹皮 山药 泽泻 砂仁 菟丝子 金樱子 黄精 楮实子 酒萸肉
0.318185 0.326254 0.421887 0.359331 0.338393 0.397023 0.481552
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
445. 
patient tongue id: 03292130074047_4
label yaofang:
薏苡仁 白术 酸枣仁 五味子 厚朴 莱菔子 扁豆花 鸡内金 豆蔻 麦芽 广藿香 石榴皮
0.494948 0.373975 0.345306 0.386662 0.450543
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
446. 
patient tongue id: 03232319532562_6_2
label yaofang:
甘草 薏苡仁 远志 酸枣仁 生地黄 天麻 鳖甲 莪术 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 四季青
0.959452 0.52495 0.564827 0.360882 0.362906 0.333974 0.584537 0.534628 0.486078 0.429643 0.441538 0.421249
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
447. 
patient tongue id: 05222050374383_7_5_1
label yaofang:
甘草 黄芪 白术 海螵蛸 砂仁 三七 桑寄生 火麻仁 鸡内金 北沙参 首乌藤 紫苏梗 瓦楞子 合欢皮
0.4393 0.354618 0.560235 0.465537 0.330527
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
448. 
patient tongue id: 04301143580580_4_7
label yaofang:
甘草 川芎 法半夏 茯苓 桃仁 白术 生地黄 红花 赤芍 天麻 僵蚕 麦芽 首乌藤 威灵仙 骨碎补
0.972689 0.556727 0.579029 0.36461 0.370296 0.340767 0.604145 0.589813 0.537182 0.481195 0.500827 0.452961
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
449. 
patient tongue id: 02201257050750_1_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 石菖蒲 炙甘草 百合 紫苏叶 青葙子
0.347936 0.452479 0.32992 0.339258 0.30594 0.311338 0.465991 0.581234
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
450. 
patient tongue id: 03132020080823_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.486715 0.354457 0.319413 0.419168 0.480529 0.342339 0.321263
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
451. 
patient tongue id: 01211313548550_1_4
label yaofang:
桂枝 陈皮 大枣 茯苓 龙骨 牡蛎 白术 泽泻 姜半夏 炙甘草
0.651509 0.431247 0.451957 0.367364 0.371966
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
452. 
patient tongue id: 01101812592766_1
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 白芷 紫菀 白前 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄 醋五味子
0.400665 0.625605 0.407309 0.773141 0.401065 0.530617 0.357298 0.378604 0.371671 0.357027 0.670467 0.691284 0.603776 0.693983 0.357848 0.803043 0.378955 0.432904 0.398384 0.482183
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.812500, error: 0.350000
453. 
patient tongue id: 01312120493005_1_5_2
label yaofang:
甘草 当归 连翘 党参 黄芪 丹参 生地黄 天麻 鳖甲 皂角刺 蜈蚣 白花蛇舌 龙葵果 广升麻
0.821028 0.472023 0.46781 0.424368 0.351721 0.366586
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
454. 
patient tongue id: 01100134308971_4
label yaofang:
胆南星 牛膝 莱菔子 冬瓜子 皂角刺 紫苏子 海风藤 芥子 苍苏木
0.36487 0.339757 0.422062 0.376779 0.354435 0.34868 0.467725
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
455. 
patient tongue id: 05130828099434_4_6
label yaofang:
甘草 法半夏 龙骨 连翘 远志 党参 黄连 竹茹 胆南星 石菖蒲 莱菔子 白芷 麦芽 皂角刺
0.975376 0.559232 0.581288 0.375427 0.399731 0.357213 0.622226 0.601958 0.555648 0.505309 0.520191 0.481898
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
456. 
patient tongue id: 02241408255759_1_4
label yaofang:
桂枝 白芍 大枣 当归 黄芪 细辛 通草 水蛭 炙甘草
0.410096 0.385585 0.463856 0.355805 0.376423 0.389034 0.474628
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.222222, error: 0.714286
457. 
patient tongue id: 02020953237783_1_2_6
label yaofang:
甘草 柴胡 香附 党参 延胡索 赤芍 青皮 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.952905 0.509826 0.561852 0.342486 0.384193 0.32409 0.603921 0.46279 0.451424 0.37122 0.405331 0.442287
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
458. 
patient tongue id: 04252305076626_1_4
label yaofang:
甘草 黄芩 法半夏 大枣 茯苓 前胡 葶苈子 细辛 干姜 莱菔子 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲
0.969622 0.529452 0.58027 0.357612 0.341549 0.586498 0.544438 0.501636 0.439176 0.460118 0.421323
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
459. 
patient tongue id: 04130749583497_1_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 丹参 生地黄 天麻 鳖甲 麦芽 紫苏梗 蜈蚣 天山雪莲 半枝莲
0.980448 0.553462 0.57386 0.376722 0.369917 0.357407 0.619745 0.590723 0.575534 0.482158 0.501876 0.51066
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
460. 
patient tongue id: 02251135181772_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.467025 0.781087 0.359351 0.930109 0.445482 0.666496 0.380796 0.435578 0.412525 0.411286 0.853998 0.864168 0.785204 0.875625 0.386019 0.944658 0.453406 0.500404 0.560941 0.650815
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
461. 
patient tongue id: 04121953566816_1_4_2
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.438488 0.665736 0.386859 0.843503 0.406221 0.58177 0.365763 0.390754 0.37664 0.376263 0.739507 0.753135 0.689286 0.783558 0.396126 0.858263 0.434697 0.455832 0.500509 0.565687
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
462. 
patient tongue id: 02122058104687_1_4_6
label yaofang:
甘草 茯苓 龙骨 远志 党参 酸枣仁 生地黄 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.903989 0.303702 0.516193 0.501612 0.374456 0.30112 0.468298 0.438046 0.443183 0.349056 0.360522 0.330618
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
463. 
patient tongue id: 02161933236938_4
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.532924 0.30293 0.375241 0.350133 0.427103 0.380421
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
464. 
patient tongue id: 01081926499206_9
label yaofang:
柴胡 白芍 黄芩 当归 党参 枳实 石膏 干姜 大黄 生地 法夏 旋复花冲剂
0.908412 0.312262 0.491098 0.528421 0.381374 0.302872 0.480763 0.408505 0.420434 0.314181 0.341522 0.300511
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.166667, error: 0.833333
465. 
patient tongue id: 03221633143469_1_5_3
label yaofang:
桂枝 黄芪 白术 海螵蛸 当归尾 砂仁 鸡内金 首乌藤 蜈蚣 合欢皮 山慈菇 石上柏 稻芽 鲜龙葵果
0.543918 0.411676 0.319819 0.482093 0.500978 0.327781 0.312523 0.340497
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
466. 
patient tongue id: 05191935110809_2
label yaofang:
甘草 党参 鸡血藤 红花 赤芍 杜仲 山药 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.979063 0.562282 0.590952 0.364044 0.369441 0.328452 0.611057 0.594247 0.539978 0.480216 0.50153 0.453875
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
467. 
patient tongue id: 03231421213911_1_6
label yaofang:
甘草 白芍 薏苡仁 党参 黄芪 白术 天麻 肉苁蓉 鳖甲 火麻仁 补骨脂 莪术 蜈蚣 天山雪莲 半枝莲 红豆杉
0.760609 0.447739 0.403027 0.343284 0.497712 0.353534
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.833333, recall: 0.312500, error: 0.166667
468. 
patient tongue id: 04171746511486_6_7
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.344423 0.46172 0.304931 0.335334 0.318828 0.508545 0.613391
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.714286, recall: 0.454545, error: 0.285714
469. 
patient tongue id: 03101853053004_6
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 干姜 豆蔻 姜半夏 炙甘草 紫苏梗
0.362394 0.361877 0.310987 0.391198 0.472111
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
470. 
patient tongue id: 06022252446099_1_4_6
label yaofang:
甘草 陈皮 茯苓 半夏 党参 黄芪 枸杞子 白术 赤芍 牡丹皮 杜仲 山药 紫苏子 紫苏叶
0.430603 0.398617 0.496823 0.428443 0.404035
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
471. 
patient tongue id: 03141556479906_1_4_7
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 厚朴
0.33113 0.360182 0.378674 0.534804 0.366286 0.391459 0.333748 0.329756 0.337567
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 莱菔子 夏枯草 制何首乌

------Score: precision: 0.555556, recall: 0.384615, error: 0.444444
472. 
patient tongue id: 03012338069598_6_2_1
label yaofang:
白芍 枳壳 党参 酸枣仁 延胡索 天麻 五灵脂 鳖甲 火麻仁 麦芽 炙甘草 蜈蚣 天山雪莲 合欢花 半枝莲 姜黄
0.985378 0.567326 0.593288 0.369346 0.393755 0.35248 0.647687 0.638228 0.588132 0.532511 0.555642 0.52012
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
473. 
patient tongue id: 04122158242782_6_4
label yaofang:
甘草 独活 党参 白术 延胡索 川楝子 杜仲 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.805214 0.485829 0.410667 0.363069
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.214286, error: 0.250000
474. 
patient tongue id: 01101816345087_4_1
label yaofang:
陈皮 法半夏 前胡 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.389406 0.580916 0.392129 0.740188 0.364615 0.499079 0.3494 0.311502 0.338985 0.367762 0.302102 0.637788 0.650909 0.604551 0.675365 0.402616 0.791846 0.366971 0.372695 0.395854 0.45621
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
475. 
patient tongue id: 04171933015354_1_4
label yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.422336 0.739694 0.383045 0.893969 0.437095 0.601331 0.366152 0.405337 0.370372 0.378046 0.796284 0.805456 0.716986 0.823217 0.343101 0.914567 0.411112 0.445393 0.479186 0.580196
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
476. 
patient tongue id: 06070651122142_6_5
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 牛蒡子 白术 酸枣仁 山药 诃子 紫苏子 益智 白扁豆 建曲
0.98184 0.562132 0.596388 0.369669 0.396817 0.350199 0.646784 0.622167 0.57068 0.512329 0.534524 0.503345
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
477. 
patient tongue id: 01132128328959_5_1
label yaofang:
甘草 桔梗 薏苡仁 浙贝母 苍术 天麻 滑石 鳖甲 豆蔻 苦杏仁 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.711042 0.463278 0.39602 0.35337 0.454596
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
478. 
patient tongue id: 03291337145529_1_6_4
label yaofang:
甘草 川芎 金银花 浙贝母 牛膝 郁金 天麻 蔓荆子 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.927293 0.514811 0.543313 0.391734 0.344081 0.324326 0.526274 0.466939 0.4645 0.370197 0.391841 0.374637
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
479. 
patient tongue id: 02241435137246_4
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 海螵蛸 山药 砂仁 白扁豆
0.495013 0.341134 0.343816 0.384806 0.389365 0.307634
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.666667, recall: 0.400000, error: 0.333333
480. 
patient tongue id: 06022256283823_1_4
label yaofang:
陈皮 半夏 白术 浙贝母 山药 厚朴 僵蚕 紫苏子 紫苏叶 人参叶 龙脷叶 紫苑 南杏仁
0.342136 0.39132 0.479326 0.370981 0.396541 0.33414
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
481. 
patient tongue id: 05092100473520_2_6
label yaofang:
甘草 白芍 薏苡仁 太子参 牡丹皮 山药 天麻 鳖甲 莪术 虎杖 麦芽 女贞子 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.970159 0.548863 0.570367 0.380852 0.37165 0.345878 0.59393 0.592573 0.556328 0.490698 0.516797 0.493412
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
482. 
patient tongue id: 01092050087697_4_6
label yaofang:
甘草 川芎 香附 陈皮 当归 茯苓 半夏 黄芪 白术 厚朴 北沙参 合欢皮
0.748007 0.434373 0.38008 0.35735 0.541589 0.353822
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
483. 
patient tongue id: 03291643402571_1_2
label yaofang:
甘草 法半夏 茯苓 桔梗 羌活 薏苡仁 桃仁 远志 白术 生地黄 延胡索 浙贝母 郁金 桑叶 桑白皮 天麻 鳖甲 款冬花 王不留行 枇杷叶 苦杏仁 浮小麦 威灵仙 白花蛇舌 天山雪莲 半枝莲 贯众
0.975771 0.550181 0.58371 0.361851 0.372304 0.325057 0.615691 0.571818 0.528909 0.464259 0.482549 0.457614
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.296296, error: 0.333333
484. 
patient tongue id: 02191220419381_1_5_7
label yaofang:
桂枝 甘草 白芍 薏苡仁 党参 黄芪 鸡血藤 白术 熟附子 红花 延胡索 知母 苍术 忍冬藤 续断 威灵仙
0.916522 0.457938 0.535277 0.363816 0.481094 0.378119 0.394093 0.311275
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.375000, recall: 0.187500, error: 0.625000
485. 
patient tongue id: 02271241496111_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.48774 0.354188 0.332456 0.453426 0.421075 0.355763 0.342743
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
486. 
patient tongue id: 05180834032409_6_2
label yaofang:
甘草 柴胡 白芍 党参 牡丹皮 山药 天麻 菟丝子 益母草 鳖甲 佛手 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.988573 0.553042 0.608507 0.351669 0.436098 0.350651 0.708659 0.634723 0.603346 0.521444 0.57013 0.602768
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.529412, error: 0.250000
487. 
patient tongue id: 05131602393507_2_6
label yaofang:
甘草 白芍 香附 枳壳 黄芩 茯苓 桃仁 党参 白术 生地黄 菟丝子 桑寄生 艾叶
0.961884 0.523113 0.55853 0.393542 0.302734 0.506204 0.483962 0.481415 0.37139 0.396371 0.359247
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
488. 
patient tongue id: 02212238528554_1_2_7
label yaofang:
甘草 薏苡仁 党参 浙贝母 郁金 山药 砂仁 天麻 鳖甲 莪术 丝瓜络 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.954329 0.530117 0.562342 0.38858 0.384387 0.300458 0.355927 0.572219 0.553873 0.517479 0.473115 0.48019 0.457553
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
489. 
patient tongue id: 01211220036923_6
label yaofang:
桂枝 柴胡 白芍 大枣 薏苡仁 蒲公英 党参 黄芪 牛膝 苏木 败酱草 姜半夏 炙甘草
0.343702 0.342719 0.652366
predicted yaofang:
白芍 干姜 炙甘草

------Score: precision: 0.666667, recall: 0.153846, error: 0.333333
490. 
patient tongue id: 04111954484446_1_4_7
label yaofang:
甘草 枳壳 半夏 牛蒡子 薏苡仁 黄芪 枸杞子 赤芍 海螵蛸 杜仲 黄柏 牛膝 山药 厚朴 鳖甲 北沙参 紫苏梗 黑枣 骨碎补 红豆杉 蛇舌草 稻芽
0.487163 0.360793 0.365542 0.550249 0.416653 0.313882
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.136364, error: 0.500000
491. 
patient tongue id: 02281838178579_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.397016 0.528975 0.405557 0.673354 0.358146 0.474549 0.338666 0.33292 0.325476 0.325232 0.309954 0.569078 0.595775 0.526295 0.608005 0.393865 0.728851 0.350073 0.373996 0.366075 0.41848
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 1.000000, error: 0.285714
492. 
patient tongue id: 02142346012127_2_7_4
label yaofang:
甘草 柴胡 白芍 薏苡仁 延胡索 砂仁 天麻 五灵脂 白花蛇舌草 蜈蚣 醋香附 半枝莲 醋鳖甲 麸炒枳壳
0.888139 0.479342 0.4761 0.447038 0.368896 0.415166
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
493. 
patient tongue id: 04291624182539_1_2_6
label yaofang:
甘草 生地黄 红花 牡丹皮 山茱萸 天麻 地骨皮 鳖甲 火麻仁 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲
0.954567 0.52384 0.555117 0.395399 0.394622 0.348241 0.602487 0.552599 0.542465 0.459293 0.495894 0.517167
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
494. 
patient tongue id: 06062255050519_2
label yaofang:
甘草 白芍 茯苓 桔梗 荆芥 金银花 红花 浙贝母 地黄 白花蛇舌草 麦芽 白鲜皮 蜂房 醋鳖甲
0.979427 0.565217 0.585143 0.378947 0.38153 0.350239 0.61026 0.605262 0.557978 0.498337 0.515947 0.480498
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
495. 
patient tongue id: 05131846201235_5
label yaofang:
甘草 柴胡 白芍 川芎 黄芩 茯苓 防风 金银花 荆芥穗 蔓荆子 麦芽 板蓝根 辛夷 四季青
0.817496 0.459011 0.514351 0.338944 0.30435 0.461415
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
496. 
patient tongue id: 04180818390156_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 首乌藤 百合 制远志 牡荆子
0.446647 0.329949 0.379793 0.342803 0.373921
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
497. 
patient tongue id: 02122116201507_7_2
label yaofang:
甘草 白芍 川芎 香附 枳壳 黄芩 当归 茯苓 党参 白术 生地黄 砂仁 菟丝子 桑寄生
0.980011 0.538595 0.56974 0.37594 0.373524 0.343882 0.625206 0.605673 0.599406 0.506533 0.54029 0.550877
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
498. 
patient tongue id: 01192225448529_4_7
label yaofang:
桂枝 甘草 川芎 防风 羌活 白术 红花 赤芍 牛膝 知母 细辛 白芷 桑枝 威灵仙 乌梢蛇
0.942789 0.531501 0.552704 0.381728 0.409852 0.30652 0.363486 0.602158 0.559662 0.523233 0.479627 0.504999 0.510612
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.133333, error: 0.846154
499. 
patient tongue id: 05131654054133_5
label yaofang:
甘草 柴胡 黄芩 法半夏 薏苡仁 石菖蒲 滑石 茵陈 淡竹叶 豆蔻 板蓝根 广藿香 川木通 大青叶
0.970039 0.537486 0.556084 0.389847 0.377081 0.329939 0.619595 0.579629 0.568762 0.477284 0.520162 0.549348
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.071429, error: 0.916667
------Average Score: average precision: 0.451997, average recall: 0.354844, error: 0.548003
