5248/20571 [======>.......................] - ETA: 307s - loss: 0.18302017-11-13 13:00:54.664877: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:247] PoolAllocator: After 32538 get requests, put_count=32538 evicted_count=1000 eviction_rate=0.0307333 and unsatisfied allocation rate=0.0338066
2017-11-13 13:00:54.664949: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
20544/20571 [============================>.] - ETA: 0s - loss: 0.1193Epoch 00000: val_loss improved from inf to 0.08023, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 404s - loss: 0.1193 - val_loss: 0.0802
Epoch 2/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0881Epoch 00001: val_loss improved from 0.08023 to 0.07936, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 397s - loss: 0.0880 - val_loss: 0.0794
Epoch 3/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0843Epoch 00002: val_loss improved from 0.07936 to 0.07650, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 397s - loss: 0.0844 - val_loss: 0.0765
Epoch 4/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0827Epoch 00003: val_loss did not improve
20571/20571 [==============================] - 398s - loss: 0.0827 - val_loss: 0.0766
Epoch 5/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0815Epoch 00004: val_loss improved from 0.07650 to 0.07520, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 286s - loss: 0.0815 - val_loss: 0.0752
Epoch 6/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0805Epoch 00005: val_loss improved from 0.07520 to 0.07510, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 284s - loss: 0.0805 - val_loss: 0.0751
Epoch 7/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0798Epoch 00006: val_loss did not improve
20571/20571 [==============================] - 283s - loss: 0.0798 - val_loss: 0.0765
Epoch 8/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0791Epoch 00007: val_loss improved from 0.07510 to 0.07414, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 283s - loss: 0.0791 - val_loss: 0.0741
Epoch 9/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0784Epoch 00008: val_loss did not improve
20571/20571 [==============================] - 283s - loss: 0.0784 - val_loss: 0.0750
Epoch 10/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0777Epoch 00009: val_loss improved from 0.07414 to 0.07338, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 284s - loss: 0.0777 - val_loss: 0.0734
Epoch 11/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0772Epoch 00010: val_loss improved from 0.07338 to 0.07322, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 284s - loss: 0.0772 - val_loss: 0.0732
Epoch 12/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0767Epoch 00011: val_loss did not improve
20571/20571 [==============================] - 283s - loss: 0.0767 - val_loss: 0.0733
Epoch 13/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0763Epoch 00012: val_loss improved from 0.07322 to 0.07284, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 284s - loss: 0.0763 - val_loss: 0.0728
Epoch 14/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0759Epoch 00013: val_loss improved from 0.07284 to 0.07249, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 283s - loss: 0.0759 - val_loss: 0.0725
Epoch 15/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0755Epoch 00014: val_loss did not improve
20571/20571 [==============================] - 283s - loss: 0.0755 - val_loss: 0.0731
Epoch 16/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0749Epoch 00015: val_loss did not improve
20571/20571 [==============================] - 283s - loss: 0.0749 - val_loss: 0.0725
Epoch 17/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0747Epoch 00016: val_loss improved from 0.07249 to 0.07224, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 283s - loss: 0.0747 - val_loss: 0.0722
Epoch 18/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0742Epoch 00017: val_loss improved from 0.07224 to 0.07212, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 283s - loss: 0.0742 - val_loss: 0.0721
Epoch 19/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0740Epoch 00018: val_loss improved from 0.07212 to 0.07199, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 292s - loss: 0.0740 - val_loss: 0.0720
Epoch 20/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0735Epoch 00019: val_loss did not improve
20571/20571 [==============================] - 286s - loss: 0.0735 - val_loss: 0.0722
Epoch 21/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0733Epoch 00020: val_loss improved from 0.07199 to 0.07189, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 284s - loss: 0.0733 - val_loss: 0.0719
Epoch 22/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0729Epoch 00021: val_loss improved from 0.07189 to 0.07188, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 285s - loss: 0.0729 - val_loss: 0.0719
Epoch 23/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0725Epoch 00022: val_loss improved from 0.07188 to 0.07177, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 292s - loss: 0.0725 - val_loss: 0.0718
Epoch 24/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0722Epoch 00023: val_loss did not improve
20571/20571 [==============================] - 286s - loss: 0.0722 - val_loss: 0.0720
Epoch 25/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0719Epoch 00024: val_loss did not improve
20571/20571 [==============================] - 287s - loss: 0.0719 - val_loss: 0.0720
Epoch 26/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0716Epoch 00025: val_loss did not improve
20571/20571 [==============================] - 289s - loss: 0.0716 - val_loss: 0.0722
Epoch 27/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0712Epoch 00026: val_loss did not improve
20571/20571 [==============================] - 294s - loss: 0.0712 - val_loss: 0.0720
Epoch 28/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0710Epoch 00027: val_loss did not improve
20571/20571 [==============================] - 293s - loss: 0.0710 - val_loss: 0.0719
Epoch 29/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0707Epoch 00028: val_loss did not improve
20571/20571 [==============================] - 284s - loss: 0.0707 - val_loss: 0.0720
Epoch 30/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0703Epoch 00029: val_loss did not improve
20571/20571 [==============================] - 283s - loss: 0.0703 - val_loss: 0.0719
Epoch 31/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0700Epoch 00030: val_loss did not improve
20571/20571 [==============================] - 293s - loss: 0.0700 - val_loss: 0.0721
Epoch 32/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0696Epoch 00031: val_loss did not improve
20571/20571 [==============================] - 283s - loss: 0.0696 - val_loss: 0.0724
Epoch 33/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0694Epoch 00032: val_loss did not improve
20571/20571 [==============================] - 283s - loss: 0.0694 - val_loss: 0.0720
Epoch 34/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0689Epoch 00033: val_loss did not improve
20571/20571 [==============================] - 283s - loss: 0.0689 - val_loss: 0.0729
Epoch 35/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0686Epoch 00034: val_loss did not improve
20571/20571 [==============================] - 283s - loss: 0.0686 - val_loss: 0.0731
Epoch 36/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0683Epoch 00035: val_loss did not improve
20571/20571 [==============================] - 283s - loss: 0.0683 - val_loss: 0.0719
Epoch 37/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0681Epoch 00036: val_loss did not improve
20571/20571 [==============================] - 289s - loss: 0.0681 - val_loss: 0.0728
Epoch 38/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0677Epoch 00037: val_loss did not improve
20571/20571 [==============================] - 296s - loss: 0.0677 - val_loss: 0.0728
Epoch 39/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0674Epoch 00038: val_loss did not improve
20571/20571 [==============================] - 289s - loss: 0.0674 - val_loss: 0.0728
Epoch 40/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0670Epoch 00039: val_loss did not improve
20571/20571 [==============================] - 293s - loss: 0.0670 - val_loss: 0.0726
Epoch 41/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0666Epoch 00040: val_loss did not improve
20571/20571 [==============================] - 275s - loss: 0.0666 - val_loss: 0.0732
Epoch 42/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0664Epoch 00041: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0664 - val_loss: 0.0738
Epoch 43/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00042: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0660 - val_loss: 0.0734
Epoch 44/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0657Epoch 00043: val_loss did not improve
20571/20571 [==============================] - 170s - loss: 0.0657 - val_loss: 0.0732
Epoch 45/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0653Epoch 00044: val_loss did not improve
20571/20571 [==============================] - 309s - loss: 0.0653 - val_loss: 0.0733
Epoch 46/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0650Epoch 00045: val_loss did not improve
20571/20571 [==============================] - 287s - loss: 0.0650 - val_loss: 0.0735
Epoch 47/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0646Epoch 00046: val_loss did not improve
20571/20571 [==============================] - 299s - loss: 0.0646 - val_loss: 0.0735
Epoch 48/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0643Epoch 00047: val_loss did not improve
20571/20571 [==============================] - 306s - loss: 0.0643 - val_loss: 0.0733
Epoch 49/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0638Epoch 00048: val_loss did not improve
20571/20571 [==============================] - 303s - loss: 0.0638 - val_loss: 0.0730
Epoch 50/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0637Epoch 00049: val_loss did not improve
20571/20571 [==============================] - 289s - loss: 0.0637 - val_loss: 0.0740
Epoch 51/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0633Epoch 00050: val_loss did not improve
20571/20571 [==============================] - 297s - loss: 0.0633 - val_loss: 0.0736
Epoch 52/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0631Epoch 00051: val_loss did not improve
20571/20571 [==============================] - 301s - loss: 0.0631 - val_loss: 0.0742
Epoch 53/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0628Epoch 00052: val_loss did not improve
20571/20571 [==============================] - 311s - loss: 0.0628 - val_loss: 0.0734
Epoch 54/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0624Epoch 00053: val_loss did not improve
20571/20571 [==============================] - 288s - loss: 0.0624 - val_loss: 0.0738
Epoch 55/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0621Epoch 00054: val_loss did not improve
20571/20571 [==============================] - 287s - loss: 0.0621 - val_loss: 0.0742
Epoch 56/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0619Epoch 00055: val_loss did not improve
20571/20571 [==============================] - 287s - loss: 0.0619 - val_loss: 0.0738
Epoch 57/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0616Epoch 00056: val_loss did not improve
20571/20571 [==============================] - 288s - loss: 0.0616 - val_loss: 0.0736
Epoch 58/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0614Epoch 00057: val_loss did not improve
20571/20571 [==============================] - 287s - loss: 0.0614 - val_loss: 0.0745
Epoch 59/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0611Epoch 00058: val_loss did not improve
20571/20571 [==============================] - 287s - loss: 0.0611 - val_loss: 0.0737
Epoch 60/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0609Epoch 00059: val_loss did not improve
20571/20571 [==============================] - 288s - loss: 0.0609 - val_loss: 0.0745
Epoch 61/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0608Epoch 00060: val_loss did not improve
20571/20571 [==============================] - 287s - loss: 0.0608 - val_loss: 0.0751
Epoch 62/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0605Epoch 00061: val_loss did not improve
20571/20571 [==============================] - 287s - loss: 0.0605 - val_loss: 0.0745
Epoch 63/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0602Epoch 00062: val_loss did not improve
20571/20571 [==============================] - 288s - loss: 0.0602 - val_loss: 0.0751
Epoch 64/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0600Epoch 00063: val_loss did not improve
20571/20571 [==============================] - 287s - loss: 0.0600 - val_loss: 0.0752
Epoch 65/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0597Epoch 00064: val_loss did not improve
20571/20571 [==============================] - 287s - loss: 0.0597 - val_loss: 0.0751
Epoch 66/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0596Epoch 00065: val_loss did not improve
20571/20571 [==============================] - 288s - loss: 0.0596 - val_loss: 0.0751
Epoch 67/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0593Epoch 00066: val_loss did not improve
20571/20571 [==============================] - 217s - loss: 0.0593 - val_loss: 0.0750
Epoch 68/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0592Epoch 00067: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0592 - val_loss: 0.0751
Epoch 69/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0589Epoch 00068: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0589 - val_loss: 0.0750
Epoch 70/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0589Epoch 00069: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0588 - val_loss: 0.0762
Epoch 71/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0586Epoch 00070: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0586 - val_loss: 0.0752
Epoch 72/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0584Epoch 00071: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0584 - val_loss: 0.0755
Epoch 73/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0582Epoch 00072: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0582 - val_loss: 0.0751
Epoch 74/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0580Epoch 00073: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0580 - val_loss: 0.0755
Epoch 75/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0577Epoch 00074: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0577 - val_loss: 0.0757
Epoch 76/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0576Epoch 00075: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0576 - val_loss: 0.0760
Epoch 77/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0574Epoch 00076: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0574 - val_loss: 0.0757
Epoch 78/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0571Epoch 00077: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0572 - val_loss: 0.0758
Epoch 79/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0571Epoch 00078: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0571 - val_loss: 0.0760
Epoch 80/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0568Epoch 00079: val_loss did not improve
20571/20571 [==============================] - 239s - loss: 0.0568 - val_loss: 0.0760
history: [(0.11931147974176984, None, 0.080232465376048334, None), (0.088049738408351966, None, 0.079359453109119946, None), (0.084352789130430386, None, 0.076495916876074391, None), (0.082704447789698918, None, 0.076638066026990276, None), (0.081498023846745052, None, 0.075199630820225002, None), (0.080482833769445344, None, 0.075101735702569811, None), (0.079756345529444078, None, 0.076541405086103645, None), (0.079146325438280263, None, 0.074135758515725222, None), (0.078374535047091187, None, 0.07504057683492904, None), (0.077742460802009847, None, 0.073382278623646255, None), (0.077193051636737675, None, 0.073219601433480344, None), (0.076722114780596956, None, 0.073306629510775004, None), (0.07632310318012972, None, 0.07283606719299357, None), (0.075904676412989605, None, 0.072492771451694596, None), (0.075468439789363323, None, 0.073119895529892162, None), (0.074922348199104635, None, 0.072516370989960624, None), (0.0747379699606847, None, 0.072238083707687514, None), (0.074243288799583584, None, 0.072115433451973326, None), (0.07403343488810378, None, 0.071985724445891713, None), (0.073508976353610839, None, 0.072179004708744443, None), (0.073285618528291269, None, 0.071891299631769795, None), (0.072918618379774577, None, 0.071880777642879312, None), (0.07252590603966004, None, 0.071766682638243817, None), (0.072222068891342847, None, 0.072038494628858349, None), (0.07191859626515329, None, 0.072041811872290695, None), (0.071635525601733432, None, 0.072154757797808777, None), (0.071169337420637177, None, 0.071977924901419396, None), (0.07099269888416794, None, 0.071942691026394404, None), (0.070672799606796344, None, 0.072033957565483975, None), (0.07028733700684793, None, 0.071938050482733967, None), (0.07001191517480769, None, 0.072145860080849639, None), (0.06960141841688175, None, 0.072376452896692978, None), (0.069395695038324171, None, 0.071993502840694584, None), (0.068922610748179847, None, 0.072896852352212729, None), (0.068594803199064094, None, 0.073134344984044405, None), (0.068335150544942769, None, 0.071939343957959062, None), (0.068090488207623617, None, 0.072783934902201322, None), (0.067658845352449093, None, 0.072752813770346439, None), (0.067374842443236008, None, 0.072787500657084503, None), (0.067010760070440697, None, 0.07260302802380543, None), (0.066649191330709609, None, 0.073165977042015287, None), (0.066393914258675357, None, 0.073778199505406789, None), (0.06600132003802503, None, 0.073429019733288151, None), (0.065656029705341581, None, 0.073190890649500864, None), (0.065279794604551064, None, 0.073308985153017522, None), (0.065009912560605135, None, 0.073516364896859934, None), (0.064602089678460012, None, 0.07347168805165559, None), (0.064304761907299376, None, 0.073289415766477947, None), (0.063836400880507793, None, 0.073009398101036585, None), (0.063679878907847265, None, 0.074017346120769753, None), (0.063325059275698758, None, 0.073628169193841186, None), (0.063052415145494728, None, 0.074205197836166109, None), (0.062795507213044929, None, 0.073379770760485394, None), (0.062439490850900947, None, 0.073752895292444678, None), (0.062092495976337099, None, 0.074175122586650211, None), (0.061884825079177162, None, 0.073823946047591293, None), (0.06160818542817003, None, 0.073600045780975884, None), (0.061440044583109955, None, 0.074459910460803067, None), (0.061098019741278188, None, 0.07374069990542019, None), (0.060878867437846346, None, 0.074476580970454259, None), (0.060778912395321454, None, 0.075085617363725085, None), (0.060483245514353169, None, 0.07454411597012385, None), (0.060182501833626403, None, 0.075056969461738607, None), (0.059988126089174094, None, 0.075247733696410649, None), (0.059739505497717983, None, 0.075089815680839153, None), (0.059640538378601768, None, 0.075065557747126713, None), (0.059275727844747952, None, 0.074987856333840017, None), (0.059208496504651459, None, 0.07513835926397025, None), (0.058913657321398125, None, 0.075032954369324348, None), (0.058849574277175368, None, 0.076185143293311067, None), (0.058626235260669228, None, 0.075171028302140439, None), (0.058356385174429731, None, 0.075456991406154778, None), (0.058165699601206725, None, 0.075100476168878549, None), (0.058033206538369173, None, 0.075524523582088346, None), (0.057703469208110772, None, 0.075681673530120647, None), (0.057583651551363343, None, 0.076005378769231538, None), (0.057360625833926322, None, 0.075713092016121392, None), (0.05715026115256773, None, 0.075766069896780017, None), (0.057082427412511995, None, 0.075961490177309854, None), (0.056794197182550216, None, 0.075979716395406419, None)]
0. 
patient tongue id: 03231058256534_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 桃仁 酸枣仁 黄连 竹茹 浙贝母 牡丹皮 天花粉 威灵仙 合欢花
0.951566 0.475791 0.607298 0.493467 0.390036 0.447909
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
1. 
patient tongue id: 03231056064256_2_6
label yaofang:
甘草 白芍 酸枣仁 牡丹皮 山药 山茱萸 地黄 天麻 白花蛇舌草 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.988037 0.55174 0.680819 0.396916 0.407365 0.30589 0.332785 0.631411 0.585877 0.585374 0.514768 0.574038 0.591865
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
2. 
patient tongue id: 03132013566983_1_4_7
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 佩兰 浮小麦 首乌藤 百合 制远志
0.445969 0.31624 0.421681 0.476394 0.462161 0.455462 0.398853 0.421588 0.355883 0.385182 0.414914 0.426306 0.430347 0.441101 0.457952
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.266667, recall: 0.333333, error: 0.733333
3. 
patient tongue id: 06191217185190_4_6
label yaofang:
甘草 党参 鸡血藤 白术 生地黄 杜仲 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力 千斤拔
0.619843 0.359684 0.447352 0.508833 0.361458 0.509671 0.449285 0.420912 0.351038 0.392131 0.411529 0.459787 0.48164 0.427108 0.426236 0.402939
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.214286, error: 0.812500
4. 
patient tongue id: 04282038419013_1_6_5
label yaofang:
甘草 柴胡 白芍 黄芪 白术 丹参 延胡索 海螵蛸 枳实 砂仁 北沙参 广金钱草
0.460644 0.365195 0.429166 0.464077 0.363063
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
5. 
patient tongue id: 04171943375871_4
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 白芷 款冬花 紫菀 百部 豆蔻 蝉蜕 炙甘草 辛夷 广藿香 炒苍耳子 麸炒白术
0.533094 0.842994 0.358652 0.956334 0.369401 0.67772 0.323781 0.531862 0.491862 0.373153 0.879369 0.921507 0.822047 0.914997 0.315787 0.976168 0.495531 0.634925 0.555154 0.767949
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.750000, error: 0.400000
6. 
patient tongue id: 01201308575284_1_2_4
label yaofang:
桂枝 甘草 茯苓 薏苡仁 党参 红花 郁金 山药 荆芥穗 鳖甲 莪术 白鲜皮 蜈蚣 白花蛇舌 天山雪莲 红豆杉 土茯苓
0.964519 0.537564 0.581277 0.378764 0.30614 0.44282 0.393797 0.41377 0.323348 0.334213 0.303912
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.470588, error: 0.272727
7. 
patient tongue id: 03261712558199_7
label yaofang:
桃仁 丹参 红花 熟地黄 山茱萸 三七
0.399333 0.354889 0.432801 0.319639
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
8. 
patient tongue id: 04271848465838_1_7
label yaofang:
桂枝 甘草 半夏 桃仁 蒲公英 黄芪 白术 浙贝母 厚朴 莪术 柿蒂 北沙参 赭石 蛇舌草
0.589919 0.418634 0.418503 0.483209 0.541888 0.348908
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
9. 
patient tongue id: 01051911349112_1
label yaofang:
白芍 川芎 当归 党参 太子参 黄芪 枸杞子 煅牡蛎 北沙参 山萸肉 炙甘草 续断 盐菟丝子 酒女贞子 盐巴戟天 煅龙骨
0.457953 0.65371 0.411666 0.776228 0.361152 0.549894 0.34342 0.431379 0.419968 0.353674 0.668474 0.722913 0.637297 0.72315 0.377395 0.839288 0.434032 0.514589 0.494931 0.60575
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.187500, error: 0.850000
10. 
patient tongue id: 03242146453277_1_7_2
label yaofang:
甘草 枳壳 太子参 黄芪 白术 海螵蛸 厚朴 砂仁 火麻仁 鸡内金 北沙参 首乌藤 紫苏梗 合欢皮
0.428916 0.375162 0.376568 0.432104 0.453706 0.308847
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
11. 
patient tongue id: 04282238335651_3_4
label yaofang:
甘草 白芍 木香 薏苡仁 党参 黄芪 白术 熟附子 天麻 巴戟天 鳖甲 莪术 败酱草 蜈蚣 半枝莲 龙葵果
0.951363 0.525121 0.592355 0.352892 0.332116 0.314451 0.50902 0.417092 0.399945 0.344283 0.365303 0.346486
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
12. 
patient tongue id: 03240616592582_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 桔梗 白术 丹参 浙贝母 郁金 麦芽 猫爪草 红曲
0.901116 0.329812 0.491448 0.555155 0.365858 0.374243 0.320344
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
13. 
patient tongue id: 05272331421838_2_5
label yaofang:
黄芪 白术 生地黄 山茱萸 天麻 僵蚕 芡实 枇杷叶 北沙参 辛夷 山慈菇 蛇舌草 冬凌草
0.593839 0.366295 0.485582 0.36355 0.451314
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
14. 
patient tongue id: 02141934264802_1
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 砂仁 菟丝子 巴戟天 桑寄生 火麻仁 续断 制何首乌 黄精 艾叶
0.965771 0.521537 0.620357 0.346665 0.34581 0.316742 0.556635 0.456963 0.453366 0.376903 0.410456 0.402314
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
15. 
patient tongue id: 01192243204911_1_6
label yaofang:
甘草 葛根 党参 黄芪 黄连 赤芍 牡丹皮 苍术 山药 山茱萸 天麻 首乌藤 合欢花 土茯苓
0.996966 0.591325 0.693809 0.361521 0.358847 0.338817 0.67281 0.638227 0.635965 0.548643 0.594029 0.590706
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
16. 
patient tongue id: 04291611021476_1_2_6
label yaofang:
甘草 党参 白术 丹参 郁金 山药 砂仁 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.981157 0.553302 0.642209 0.386248 0.349358 0.318062 0.558833 0.529563 0.52825 0.46059 0.499055 0.49513
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
17. 
patient tongue id: 03301319121518_4
label yaofang:
法半夏 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.489477 0.766336 0.377692 0.89715 0.343997 0.595478 0.343067 0.475615 0.456087 0.34634 0.79181 0.844998 0.743389 0.841938 0.338251 0.934495 0.441368 0.557153 0.533344 0.685785
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
18. 
patient tongue id: 01042355272600_6_4
label yaofang:
麻黄 甘草 法半夏 茯苓 前胡 桔梗 桃仁 远志 浙贝母 细辛 益母草 鳖甲 款冬花 紫菀 紫苏子 白花蛇舌
0.943528 0.510659 0.598496 0.359323 0.316653 0.308437 0.508083 0.415453 0.41514 0.329155 0.363776 0.346391
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
19. 
patient tongue id: 02142001120764_4
label yaofang:
甘草 牛蒡子 肉桂 干姜 附片
0.489644 0.378153 0.355412 0.457803 0.34987 0.363687
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.200000, error: 0.833333
20. 
patient tongue id: 03170925189826_1_4_7
label yaofang:
薏苡仁 桃仁 鸡血藤 赤芍 牡丹皮 苍术 泽泻 萹蓄 炙甘草 威灵仙 土茯苓
0.63373 0.386635 0.519169 0.361714
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
21. 
patient tongue id: 06052030155347_4
label yaofang:
陈皮 茯苓 木香 薏苡仁 海螵蛸 砂仁 柿蒂 赭石 瓦楞子 预知子
0.947217 0.52427 0.588672 0.377262 0.316474 0.304205 0.473625 0.410655 0.41569 0.350009 0.367097 0.364057
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.100000, error: 0.916667
22. 
patient tongue id: 01172359288914_1_5
label yaofang:
甘草 茯苓 半夏 橘红 太子参 白术 酸枣仁 砂仁 北沙参 首乌藤 合欢皮 山慈菇
0.90308 0.506691 0.544375 0.433043 0.359219 0.398308
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
23. 
patient tongue id: 03091846366994_6_1
label yaofang:
甘草 赤芍 杜仲 郁金 天麻 菟丝子 桑寄生 鳖甲 王不留行 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.922334 0.339696 0.496512 0.556262 0.363169 0.365136 0.333482
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
24. 
patient tongue id: 04251849149681_5
label yaofang:
茯苓 党参 白术 肉桂 干姜 炙甘草
0.868135 0.300386 0.496192 0.517157 0.362158
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.500000, error: 0.400000
25. 
patient tongue id: 01061608531875_6_4_1
label yaofang:
甘草 茯苓 薏苡仁 白术 生地黄 浙贝母 郁金 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲
0.941469 0.526135 0.578369 0.397313 0.318569 0.336395 0.478397 0.445714 0.462974 0.375229 0.3959 0.383161
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.615385, error: 0.333333
26. 
patient tongue id: 01100248200851_1_2
label yaofang:
白芍 牛膝 全蝎 苏木 炙甘草 紫苏梗 蜈蚣 醋延胡索
0.405512 0.333075 0.332287 0.440634 0.330204 0.349057
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
27. 
patient tongue id: 04241848510427_1
label yaofang:
甘草 白芍 川芎 独活 柏子仁 牛膝 细辛 干姜 蜈蚣 姜黄 海桐皮 鹿衔草
0.343862 0.327319 0.301473 0.41575 0.360816 0.408378
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
28. 
patient tongue id: 02161941536123_6
label yaofang:
甘草 法半夏 浙贝母 石膏 苍术 淡竹叶 紫苏叶 川木通
0.392241 0.404671 0.314964 0.436904 0.533002
predicted yaofang:
白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
29. 
patient tongue id: 01192143110958_2_7
label yaofang:
甘草 桃仁 党参 生地黄 山茱萸 泽泻 车前子 天麻 鳖甲 鹿角霜 蜈蚣 白花蛇舌 天山雪莲 半枝莲 泽兰
0.440047 0.406455 0.429497 0.346227 0.419018 0.307048 0.310465
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.285714, recall: 0.133333, error: 0.714286
30. 
patient tongue id: 03101940324998_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄
0.455117 0.713635 0.369281 0.842656 0.379395 0.54663 0.422263 0.420502 0.315462 0.758584 0.811113 0.723157 0.815228 0.901781 0.407517 0.561762 0.503112 0.687424
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 1.000000, error: 0.222222
31. 
patient tongue id: 02161951460215_1
label yaofang:
甘草 白芍 当归 木香 党参 白术 海螵蛸 肉桂 车前子 肉豆蔻 诃子 炙甘草 附片
0.640209 0.361712 0.383384 0.507458 0.344831
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
32. 
patient tongue id: 02222335366851_6_4
label yaofang:
甘草 茯苓 半夏 橘红 白术 丹参 赤芍 瓜蒌皮 枇杷叶 北沙参 首乌藤 合欢皮 墨旱莲
0.541439 0.365498 0.429831 0.562554 0.497738 0.340133
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
33. 
patient tongue id: 05290815154503_4_6
label yaofang:
甘草 薏苡仁 桃仁 党参 浙贝母 郁金 山药 天麻 补骨脂 莪术 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.979335 0.553604 0.624465 0.351191 0.364245 0.303312 0.33641 0.579997 0.513183 0.481149 0.451249 0.471159 0.446903
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
34. 
patient tongue id: 06111029236383_2_4
label yaofang:
甘草 黄芩 麦冬 酸枣仁 浙贝母 山药 鳖甲 茵陈 扁豆花 麦芽 白花蛇舌 蜂房 岗梅根 四季青 木棉花
0.946456 0.515384 0.609828 0.367376 0.464365 0.401321 0.392505 0.331937 0.360956 0.34403
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
35. 
patient tongue id: 04252004191718_4_7
label yaofang:
柴胡 黄芩 羌活 党参 白术 泽泻 天麻 白芷 姜半夏 炙甘草 续断
0.436156 0.386935 0.343364 0.431432 0.368239 0.414576
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.272727, error: 0.500000
36. 
patient tongue id: 04211758115717_1
label yaofang:
法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.575174 0.856559 0.394331 0.93523 0.338134 0.560517 0.410967 0.534621 0.513031 0.328909 0.85069 0.891569 0.796151 0.889656 0.390519 0.971529 0.385861 0.565772 0.644062 0.785687
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.923077, error: 0.400000
37. 
patient tongue id: 04072021386808_1_2_6
label yaofang:
甘草 茯苓 党参 白术 丹参 厚朴 桑寄生 鸡内金 橘络 首乌藤 桑枝 合欢皮
0.509329 0.363474 0.462383 0.314364 0.375607
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
38. 
patient tongue id: 01061842504754_2_4
label yaofang:
甘草 茯苓 葛根 麦冬 玄参 牡丹皮 北沙参 百合 人参叶 干石斛
0.477537 0.649678 0.420099 0.759155 0.361961 0.527059 0.376675 0.442031 0.432734 0.309878 0.360114 0.65713 0.701778 0.630243 0.715477 0.403411 0.82202 0.426173 0.507358 0.524431 0.614285
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.095238, recall: 0.200000, error: 0.904762
39. 
patient tongue id: 06082021152527_2_5
label yaofang:
甘草 枳壳 连翘 党参 浙贝母 厚朴 僵蚕 北沙参 板蓝根 辛夷 紫苏叶 土牛膝
0.561456 0.423718 0.33728 0.379166 0.516977 0.565524 0.398956 0.352108 0.397984
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.444444, recall: 0.333333, error: 0.555556
40. 
patient tongue id: 02020829408841_2
label yaofang:
甘草 茯苓 酸枣仁 生地黄 牡丹皮 山药 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 骨碎补
0.988673 0.565389 0.659759 0.341726 0.420059 0.333052 0.34518 0.661904 0.587291 0.528998 0.517248 0.551319 0.53765
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
41. 
patient tongue id: 04111950080027_1_4_6
label yaofang:
甘草 党参 太子参 黄芪 枸杞子 白术 丹参 海螵蛸 杜仲 牛膝 郁金 山药 鸡内金 麦芽 北沙参 紫苏叶
0.552233 0.405982 0.451624 0.363608
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.750000, recall: 0.187500, error: 0.250000
42. 
patient tongue id: 05222048283442_1_6_5
label yaofang:
牡蛎 连翘 党参 白术 赤芍 山药 厚朴 砂仁 北沙参 土鳖虫 红豆杉 山慈菇 预知子 蛇舌草
0.582964 0.40567 0.392701 0.568729 0.564396 0.41264 0.328584 0.376949
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
43. 
patient tongue id: 02142001548586_4
label yaofang:
甘草 黄连 肉桂 干姜 附片
0.443751 0.402002 0.373199 0.421117 0.350717 0.315643 0.477686
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.200000, error: 0.857143
44. 
patient tongue id: 01200638521477_6_5
label yaofang:
金银花 党参 红花 厚朴 荆芥穗 天麻 鳖甲 火麻仁 麦芽 白鲜皮 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 土茯苓
0.983531 0.550946 0.64794 0.350417 0.317394 0.555945 0.455073 0.433978 0.345667 0.390327 0.35999
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
45. 
patient tongue id: 03021259173139_4
label yaofang:
陈皮 生姜 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子
0.335354 0.471162 0.413334 0.334685 0.341528 0.373681 0.334617 0.342433 0.307062 0.658746
predicted yaofang:
陈皮 法半夏 茯苓 前胡 干姜 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.600000, recall: 0.461538, error: 0.400000
46. 
patient tongue id: 05131439000784_6_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 天麻 鳖甲 白前 紫苏梗 蜈蚣 天山雪莲 半枝莲 红豆杉
0.919828 0.308195 0.502716 0.562077 0.355558 0.379548 0.303662 0.320642
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
47. 
patient tongue id: 04201932421557_1_4
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 白术 浙贝母 天麻 白花蛇舌草 苦杏仁 紫苏梗 蜈蚣 半枝莲 醋鳖甲
0.994758 0.576053 0.68048 0.344323 0.404689 0.311973 0.33933 0.683225 0.612416 0.582175 0.53983 0.575718 0.559133
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
48. 
patient tongue id: 06091943065186_1
label yaofang:
川芎 荆芥 防风 金银花 连翘 厚朴 白芷 天花粉 鳖甲 香薷 白扁豆 辛夷 紫苏叶
0.867716 0.486818 0.550303 0.399365 0.31584 0.313766
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
49. 
patient tongue id: 05080844507562_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.42952 0.352139 0.362788 0.434907 0.405822 0.393984 0.328322 0.35781 0.308356 0.341797 0.32469 0.308512 0.310308 0.316633
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.714286, recall: 0.833333, error: 0.285714
50. 
patient tongue id: 03301934485710_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 蝉蜕 炙甘草 紫苏梗 广藿香 蜜麻黄
0.542232 0.844423 0.352397 0.96653 0.413442 0.736066 0.310938 0.54509 0.483309 0.401521 0.906378 0.939288 0.855556 0.934105 0.312407 0.97528 0.547078 0.669343 0.579072 0.787657
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
51. 
patient tongue id: 04072015534511_2
label yaofang:
芦根 麦冬 酸枣仁 五味子 生地黄 知母 珍珠母 北沙参 板蓝根 百合
0.825985 0.495896 0.524601 0.388123 0.342424 0.319469
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
52. 
patient tongue id: 02251135181772_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.556635 0.869543 0.360016 0.96747 0.397346 0.690669 0.339419 0.531707 0.492695 0.36875 0.906721 0.935863 0.855251 0.933847 0.325097 0.977498 0.483224 0.645338 0.624989 0.810789
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
53. 
patient tongue id: 05242234242510_1_2_6
label yaofang:
甘草 柴胡 白芍 枳壳 薏苡仁 熟附子 天麻 鳖甲 莪术 败酱草 佛手 蜈蚣 半枝莲 龙葵果
0.950852 0.517714 0.595508 0.325088 0.311774 0.506754 0.398314 0.358701 0.310639 0.323986
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
54. 
patient tongue id: 04192239251218_2_1
label yaofang:
甘草 黄芩 太子参 生地黄 浙贝母 乌梅 山茱萸 白茅根 鳖甲 北沙参 白花蛇舌 天山雪莲 蜂房 四季青
0.98495 0.559317 0.640446 0.334347 0.363419 0.329977 0.604447 0.532455 0.476987 0.464449 0.482978 0.448632
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
55. 
patient tongue id: 01180640475023_6_4_7
label yaofang:
甘草 法半夏 茯苓 桃仁 远志 党参 酸枣仁 丹参 生地黄 红花 青皮 栀子 佛手 首乌藤 合欢花
0.978374 0.543101 0.616253 0.361077 0.348189 0.354892 0.581979 0.517312 0.499252 0.443715 0.469217 0.438326
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
56. 
patient tongue id: 04102106242777_4_1
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.3435 0.35952 0.310892 0.347349 0.558766
predicted yaofang:
白芍 党参 干姜 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
57. 
patient tongue id: 03221303504034_6_4_2
label yaofang:
甘草 党参 玄参 浙贝母 郁金 天麻 鳖甲 莪术 夏枯草 麦芽 百合 蜈蚣 白花蛇舌 红豆杉 猫爪草
0.8598 0.486584 0.535462 0.381903 0.351268 0.32965
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
58. 
patient tongue id: 03271352492395_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.467991 0.625148 0.417003 0.721777 0.329267 0.495634 0.359937 0.409564 0.404956 0.326026 0.629619 0.661958 0.607205 0.699081 0.390331 0.822836 0.38996 0.471693 0.489284 0.597229
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
59. 
patient tongue id: 05260704573725_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 牛蒡子 桃仁 远志 浙贝母 细辛 款冬花 白前 苦杏仁 紫苏梗 蜜麻黄
0.944633 0.512393 0.593414 0.343832 0.462368 0.345595 0.34578
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.133333, error: 0.714286
60. 
patient tongue id: 02231415272573_2
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.406639 0.436253 0.44401 0.41944 0.34455 0.324484 0.324405 0.369359 0.397799 0.360079 0.416134 0.396969 0.616608 0.331068 0.343939
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
61. 
patient tongue id: 03302134133528_6_2_4
label yaofang:
甘草 川芎 法半夏 茯苓 牡蛎 白术 酸枣仁 黄连 生地黄 肉桂 灯心草 天麻 滑石 麦芽 艾叶
0.890331 0.518265 0.528192 0.325061 0.36557
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
62. 
patient tongue id: 05162147413915_1_7
label yaofang:
甘草 枳壳 茯苓 桃仁 麦冬 党参 丹参 五味子 红花 山茱萸 补骨脂 鹿角霜 川加皮
0.966409 0.534444 0.601922 0.341246 0.33525 0.321448 0.535568 0.468472 0.434345 0.398601 0.412054 0.376321
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
63. 
patient tongue id: 05102146051069_2_1
label yaofang:
白芍 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 山萸肉 炙甘草 沙苑子 制远志 盐菟丝子 酒女贞子 煅龙骨 炒酸枣仁
0.407591 0.529363 0.436613 0.526497 0.314394 0.376526 0.360836 0.370626 0.362827 0.480226 0.489146 0.461922 0.501555 0.364868 0.668483 0.30798 0.38303 0.402108 0.475905
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.157895, recall: 0.187500, error: 0.842105
64. 
patient tongue id: 05172106000479_2_1
label yaofang:
甘草 桔梗 芦根 麦冬 黄连 浙贝母 细辛 鳖甲 北沙参 白花蛇舌 蜂房 岗梅根 四季青 广升麻
0.919351 0.508739 0.550085 0.339814 0.395024 0.309763
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
65. 
patient tongue id: 04200618296965_6_2_4
label yaofang:
甘草 茯苓 薏苡仁 桃仁 党参 山药 砂仁 天麻 菟丝子 益母草 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 广金钱草
0.921751 0.307043 0.494514 0.582124 0.384372 0.434103 0.366671 0.386963 0.303416 0.32902 0.318016
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
66. 
patient tongue id: 04111516230181_1_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 山药 天花粉 北沙参 玉米须 有瓜石斛
0.38356 0.32125 0.491921 0.420829 0.41186 0.518697 0.47388 0.483654 0.462392 0.467865 0.495517 0.516227 0.320344 0.531654 0.537663 0.557619
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.250000, error: 0.812500
67. 
patient tongue id: 04111958246301_1_4_7
label yaofang:
柴胡 陈皮 茯苓 半夏 党参 白术 丹参 海螵蛸 杜仲 牛膝 山药 僵蚕 桑寄生 秦艽 紫苏叶 布渣叶
0.628132 0.413435 0.443357 0.481685 0.533907 0.349829
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
68. 
patient tongue id: 04171933015354_1_4
label yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.466702 0.651637 0.417874 0.71611 0.34238 0.464373 0.385489 0.426949 0.437946 0.31979 0.628409 0.661001 0.602121 0.681697 0.393021 0.838701 0.356807 0.470373 0.538521 0.620978
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
69. 
patient tongue id: 02221224549676_4_1
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.81151 0.445401 0.53832 0.350803
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
70. 
patient tongue id: 02272224553829_1
label yaofang:
陈皮 当归 党参 黄芪 鸡血藤 白术 升麻 北柴胡 炙甘草 山慈菇
0.352041 0.339082 0.431443 0.328884 0.426335 0.342459 0.485989 0.527269
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.300000, error: 0.625000
71. 
patient tongue id: 04282247410426_1_2
label yaofang:
甘草 白芍 茯苓 龙骨 独活 党参 白术 酸枣仁 生地黄 杜仲 天麻 桑寄生 牛大力
0.982049 0.555036 0.628408 0.362742 0.348236 0.333425 0.570489 0.509461 0.492524 0.447547 0.47058 0.452153
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.461538, error: 0.500000
72. 
patient tongue id: 06190924057113_1_6
label yaofang:
甘草 茯苓 独活 桃仁 党参 红花 杜仲 桑寄生 麦芽 忍冬藤 续断 首乌藤 牛大力 千斤拔
0.992236 0.57231 0.668503 0.357639 0.39904 0.311115 0.32575 0.648254 0.599105 0.569433 0.527289 0.568254 0.561337
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
73. 
patient tongue id: 05161942480229_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.483617 0.719334 0.401986 0.864012 0.370861 0.597675 0.348735 0.483749 0.455693 0.385228 0.758995 0.810113 0.71529 0.806953 0.350607 0.909123 0.468758 0.554337 0.514721 0.666617
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
74. 
patient tongue id: 04142219043099_6_2_7
label yaofang:
甘草 白芍 茯苓 薏苡仁 桃仁 党参 白术 丹参 麦芽 白扁豆 合欢花 醋鳖甲 土鳖虫
0.927983 0.50533 0.587791 0.353797 0.464533 0.348038 0.354018
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
75. 
patient tongue id: 04020753291115_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 莪术 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97784 0.536507 0.648878 0.354573 0.371454 0.337332 0.595804 0.53045 0.491617 0.450407 0.489429 0.467024
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
76. 
patient tongue id: 03011852441603_4
label yaofang:
麻黄 桂枝 白芍 前胡 半夏 太子参 黄芪 五味子 细辛 干姜 白前 百部 北沙参 紫苏子 炙甘草
0.431125 0.593574 0.424579 0.624498 0.433795 0.35823 0.371689 0.384674 0.543804 0.563472 0.542434 0.608506 0.367542 0.76091 0.343874 0.404667 0.488856 0.538819
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.444444, recall: 0.533333, error: 0.555556
77. 
patient tongue id: 05221926227579_6_7
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.478332 0.372475 0.351378 0.456457 0.400531 0.35593
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
78. 
patient tongue id: 06111122598915_4_6
label yaofang:
甘草 白芍 龙骨 牡蛎 党参 酸枣仁 杜仲 山药 钩藤 天麻 桑寄生 决明子 浮小麦 建曲
0.978757 0.555931 0.621152 0.376832 0.348001 0.349697 0.561944 0.540101 0.522249 0.474365 0.497632 0.473388
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
79. 
patient tongue id: 03081802336456_4
label yaofang:
甘草 防风 丹参 生地黄 牡丹皮 乌梅 紫草 莪术 珍珠母 白鲜皮 紫苏叶 土茯苓 徐长卿
0.743583 0.378545 0.428659 0.524296 0.376437
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
80. 
patient tongue id: 03101753053496_4_1
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.532347 0.811736 0.382684 0.908044 0.337987 0.574759 0.379113 0.50045 0.483388 0.334729 0.812453 0.855436 0.77154 0.862584 0.365144 0.9507 0.404687 0.553265 0.624714 0.749208
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
81. 
patient tongue id: 02231849200584_4
label yaofang:
法半夏 前胡 防风 钩藤 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.49959 0.742463 0.384886 0.886458 0.363461 0.615112 0.3505 0.474928 0.4619 0.364453 0.784243 0.830547 0.744577 0.839152 0.367468 0.915042 0.457432 0.561655 0.553125 0.692297
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
82. 
patient tongue id: 06111122014228_4_6
label yaofang:
甘草 白芍 党参 青皮 浙贝母 郁金 天麻 鳖甲 王不留行 女贞子 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.984698 0.559124 0.642737 0.387201 0.321301 0.317733 0.546485 0.531313 0.529151 0.454336 0.491741 0.46636
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
83. 
patient tongue id: 05270615594126_2_4_6
label yaofang:
甘草 白芍 薏苡仁 酸枣仁 熟附子 天麻 巴戟天 鳖甲 莪术 败酱草 佛手 蜈蚣 天山雪莲 合欢花 半枝莲 红豆杉
0.963343 0.301584 0.538555 0.602195 0.357263 0.323474 0.315851 0.516447 0.445323 0.428734 0.380369 0.397597 0.374248
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
84. 
patient tongue id: 04291514412648_4_6
label yaofang:
甘草 川芎 防风 羌活 党参 鸡血藤 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.996311 0.593811 0.685528 0.359888 0.413675 0.322162 0.340221 0.692267 0.625765 0.590749 0.540106 0.583237 0.573401
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
85. 
patient tongue id: 01041842548170_1_2
label yaofang:
白芍 川芎 当归 党参 太子参 枸杞子 熟地黄 山萸肉 炙甘草 续断 沙苑子 炙黄芪 盐菟丝子 酒女贞子 盐杜仲 盐巴戟天
0.411964 0.621007 0.442068 0.651467 0.317815 0.41634 0.336598 0.385785 0.365775 0.568339 0.591224 0.509252 0.587395 0.322518 0.788455 0.317024 0.407063 0.418549 0.518451
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.105263, recall: 0.125000, error: 0.894737
86. 
patient tongue id: 02190532585082_6_2_1
label yaofang:
甘草 法半夏 茯苓 丹参 延胡索 赤芍 郁金 薤白 砂仁 五灵脂 瓜蒌皮 莪术 麦芽 合欢花
0.990288 0.57642 0.646985 0.365389 0.386883 0.312354 0.348295 0.62521 0.577286 0.544763 0.508675 0.53293 0.515906
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.142857, error: 0.846154
87. 
patient tongue id: 01041846116219_1_4
label yaofang:
法半夏 茯苓 前胡 防风 钩藤 白芷 百部 豆蔻 炙甘草 首乌藤 广藿香 威灵仙 麸炒白术 炒蔓荆子 棉萆薢
0.544082 0.801437 0.40388 0.907473 0.351392 0.562422 0.398561 0.516768 0.493846 0.35166 0.810997 0.849412 0.759741 0.856314 0.395245 0.943104 0.407698 0.552056 0.607202 0.733794
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.533333, error: 0.600000
88. 
patient tongue id: 03291954460128_2_5
label yaofang:
甘草 半夏 牛蒡子 枸杞子 白术 玄参 浙贝母 杜仲 僵蚕 补骨脂 射干 北沙参 蝉蜕 百合 蜈蚣 木蝴蝶 冬凌草 山豆根 岗梅
0.541906 0.402861 0.469863 0.491013 0.465246 0.341165
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.105263, error: 0.666667
89. 
patient tongue id: 04272308485765_6
label yaofang:
麻黄 桂枝 甘草 白芍 牡蛎 薏苡仁 桃仁 丹参 红花 赤芍 熟地黄 益母草 夏枯草 鹿角霜 姜炭 芥子
0.404465 0.322886 0.414938 0.324235 0.438314 0.361232 0.368977 0.471742
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.125000, error: 0.750000
90. 
patient tongue id: 05221916413616_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.462184 0.694634 0.369011 0.859608 0.363278 0.585608 0.420291 0.414186 0.348472 0.765565 0.804533 0.723567 0.825207 0.868261 0.445103 0.571347 0.545376 0.67533
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.833333, recall: 0.937500, error: 0.166667
91. 
patient tongue id: 04250815062973_1_3
label yaofang:
甘草 枳壳 法半夏 茯苓 橘红 党参 黄芪 丹参 延胡索 竹茹 郁金 厚朴 牡荆子
0.441142 0.323217 0.431406 0.451925 0.417402 0.4767 0.400077 0.424144 0.31837 0.382339 0.405672 0.411103 0.319727 0.396288 0.399348 0.40029
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.312500, recall: 0.384615, error: 0.687500
92. 
patient tongue id: 05262053546021_2_6
label yaofang:
甘草 白术 酸枣仁 生地黄 杜仲 天麻 糯稻根 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 田七末
0.941495 0.309097 0.51786 0.586816 0.387085 0.436656 0.396768 0.419095 0.335354 0.358443 0.352024
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
93. 
patient tongue id: 05251921163387_3_4
label yaofang:
桂枝 白芍 独活 薏苡仁 黄芪 苍术 炙甘草 桑枝 豨莶草 土茯苓 合欢皮 海桐皮 鹿衔草 走马胎
0.621556 0.404045 0.510204 0.370602
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
94. 
patient tongue id: 05242112449464_1_4
label yaofang:
甘草 法半夏 前胡 桔梗 远志 浙贝母 细辛 桑白皮 款冬花 地龙 苦杏仁 紫苏子 炙麻黄
0.994569 0.577731 0.687113 0.343348 0.395268 0.30092 0.342257 0.671398 0.600089 0.57013 0.530021 0.56676 0.552293
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.076923, recall: 0.076923, error: 0.923077
95. 
patient tongue id: 06070636307073_7_4
label yaofang:
甘草 陈皮 法半夏 茯苓 桃仁 远志 党参 莱菔子 款冬花 白前 紫苏子 蛤壳 木棉花
0.983552 0.565677 0.644637 0.385366 0.359856 0.338675 0.581062 0.555602 0.539069 0.494333 0.520947 0.503728
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
96. 
patient tongue id: 05092116241660_1_6
label yaofang:
甘草 远志 党参 白术 酸枣仁 玄参 柏子仁 浙贝母 地黄 白花蛇舌草 麦芽 首乌藤 醋鳖甲 猫爪草
0.850613 0.331012 0.478847 0.532119 0.358372 0.371536
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
97. 
patient tongue id: 06132008035599_6_1
label yaofang:
甘草 枳壳 薏苡仁 蒲公英 白术 赤芍 浙贝母 牡丹皮 杜仲 郁金 厚朴 僵蚕 莪术 北沙参 续断 蜈蚣 合欢皮 预知子
0.55552 0.430561 0.387741 0.501585 0.544733 0.375141 0.339794 0.378954
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.222222, error: 0.500000
98. 
patient tongue id: 05262120168956_4_1
label yaofang:
甘草 川芎 茯苓 党参 黄芪 白术 赤芍 胆南星 牡丹皮 天麻 僵蚕 芡实 地龙 益智 辛夷
0.994166 0.577863 0.667337 0.364483 0.379812 0.302177 0.357131 0.642441 0.5953 0.579995 0.522799 0.556344 0.529669
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
99. 
patient tongue id: 05061436054799_1_2
label yaofang:
茯苓 党参 僵蚕 磁石 巴戟天 淫羊藿 诃子 枇杷叶 地龙 北沙参 蝉蜕 木蝴蝶
0.468074 0.381073 0.419523 0.467183 0.413904
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
100. 
patient tongue id: 03021120341746_1_4_7
label yaofang:
甘草 法半夏 橘红 防风 金银花 太子参 藿香 白前 鸡内金 辛夷 蜜百部 干鱼腥草
0.407672 0.36947 0.473537 0.37598 0.406156 0.366069 0.406168 0.305735 0.366175 0.445041 0.335818 0.352586 0.367512 0.422715
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.071429, recall: 0.083333, error: 0.928571
101. 
patient tongue id: 02212230165457_1_2_4
label yaofang:
茯苓 桔梗 橘红 芦根 浙贝母 莱菔子 鳖甲 扁豆花 紫苏子 浮小麦 白花蛇舌 蜂房 四季青 红豆杉
0.959437 0.533971 0.58422 0.375064 0.313387 0.324839 0.490517 0.427758 0.433701 0.363201 0.379414 0.356238
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
102. 
patient tongue id: 06080146135403_1_7_6
label yaofang:
甘草 川芎 党参 酸枣仁 生地黄 延胡索 赤芍 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.920669 0.349177 0.504263 0.573266 0.391438 0.433895 0.381968 0.40037 0.326579 0.350493 0.342673
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
103. 
patient tongue id: 01040655150965_2
label yaofang:
甘草 茯苓 酸枣仁 生地黄 牡丹皮 山药 山茱萸 天麻 鳖甲 麦芽 蜈蚣 天山雪莲 半枝莲 红豆杉
0.991139 0.572002 0.647282 0.355853 0.392899 0.321817 0.360531 0.64605 0.581318 0.554698 0.518284 0.54485 0.525717
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
104. 
patient tongue id: 02272230289975_4_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.304944 0.332786 0.418317 0.334045 0.402788 0.336875 0.300797 0.312956 0.503086 0.559434
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
105. 
patient tongue id: 04210750135649_1_4_7
label yaofang:
甘草 法半夏 茯苓 桔梗 橘红 金银花 桃仁 党参 黄芪 丹参 枳实 竹茹 厚朴
0.421936 0.334052 0.327626 0.446526 0.453733 0.349511 0.335788 0.320053
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 车前子

------Score: precision: 0.750000, recall: 0.461538, error: 0.250000
106. 
patient tongue id: 03292052128505_4_3
label yaofang:
桔梗 橘红 神曲 石菖蒲 厚朴 僵蚕 鸡内金 麦芽 炙甘草 稻芽 芥子
0.483214 0.396177 0.432378 0.396754 0.349476
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
107. 
patient tongue id: 04201417120633_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.497298 0.346789 0.450795 0.475704 0.44809 0.489987 0.441623 0.433673 0.396323 0.41195 0.430544 0.474587 0.393854 0.471673 0.468272 0.475191
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.250000, recall: 0.307692, error: 0.750000
108. 
patient tongue id: 03192301282720_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 金银花 牛蒡子 浙贝母 细辛 桑白皮 瓜蒌皮 款冬花 苦杏仁
0.952808 0.308864 0.529266 0.598417 0.362002 0.335835 0.326422 0.516428 0.447209 0.425289 0.386701 0.399714 0.373909
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.153846, error: 0.846154
109. 
patient tongue id: 02171841358285_1
label yaofang:
麻黄 甘草 桔梗 防风 金银花 连翘 芦根 桑叶 菊花 荆芥穗 干鱼腥草 炒苍耳子 炒牛蒡子 燀苦杏仁
0.548329 0.83833 0.377563 0.941421 0.354141 0.617472 0.369704 0.518816 0.49744 0.349987 0.852434 0.892259 0.798418 0.89199 0.358756 0.965816 0.432943 0.593409 0.618565 0.767213
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.142857, error: 0.900000
110. 
patient tongue id: 02161834335559_1
label yaofang:
陈皮 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.572532 0.869494 0.375095 0.963315 0.379529 0.665825 0.357842 0.550658 0.496941 0.379387 0.893298 0.927888 0.829118 0.922475 0.34976 0.98124 0.484305 0.641726 0.606743 0.798483
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
111. 
patient tongue id: 03171008294996_1_2
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 酸枣仁 丹参 郁金 鸡内金 首乌藤 百合 制远志
0.386943 0.305353 0.351031 0.431742 0.449843 0.379519 0.35568 0.35839 0.301769 0.311265
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 车前子 决明子 制何首乌

------Score: precision: 0.500000, recall: 0.416667, error: 0.500000
112. 
patient tongue id: 03131236287109_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.558554 0.4165 0.48745 0.356147 0.33812
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
113. 
patient tongue id: 04181147356533_1_3_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.585449 0.361562 0.500641 0.558958 0.411985 0.308766 0.312705
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 厚朴

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
114. 
patient tongue id: 04132037495241_5_2
label yaofang:
甘草 茯苓 桔梗 橘红 党参 丹参 僵蚕 枇杷叶 北沙参 咸竹蜂
0.518088 0.386098 0.350094 0.477969 0.463161 0.379508 0.30863 0.347597 0.309484
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 车前子

------Score: precision: 0.444444, recall: 0.400000, error: 0.555556
115. 
patient tongue id: 01200432569719_6_5
label yaofang:
甘草 枳壳 龙骨 牡蛎 防风 连翘 党参 黄芪 白术 桑叶 莱菔子 浮小麦 独脚金 使君子
0.963629 0.531787 0.597175 0.391817 0.3361 0.310652 0.505649 0.453753 0.469637 0.387695 0.414198 0.409342
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
116. 
patient tongue id: 03022150160233_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.407433 0.32715 0.427543 0.306548 0.314724 0.441648 0.357894 0.433159 0.489786
predicted yaofang:
甘草 柴胡 白芍 香附 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.214286, error: 0.666667
117. 
patient tongue id: 04171746511486_6_7
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.327675 0.321656 0.405822 0.412427 0.362315 0.301698 0.416937 0.514523
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.454545, error: 0.375000
118. 
patient tongue id: 03081147402334_1_7
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.493103 0.373051 0.345423 0.441888 0.482993 0.366695 0.334058
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
119. 
patient tongue id: 05092044406781_1
label yaofang:
甘草 牛蒡子 浙贝母 射干 紫菀 豆蔻 马勃 姜半夏 广藿香 人参叶 龙脷叶 土牛膝
0.316816 0.409898 0.370165 0.34953 0.319406 0.317624 0.432229 0.575376 0.315159
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.111111, recall: 0.083333, error: 0.888889
120. 
patient tongue id: 03192244192786_1_6_2
label yaofang:
甘草 白芍 茯苓 独活 薏苡仁 党参 山药 天麻 鳖甲 莪术 白扁豆 佛手 蜈蚣 半枝莲 骨碎补
0.8812 0.485454 0.547564 0.439392 0.327389 0.357554
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
121. 
patient tongue id: 02191426477378_4_1_7
label yaofang:
甘草 茯苓 党参 鸡血藤 白术 生地黄 红花 天麻 僵蚕 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.985469 0.54047 0.625996 0.343832 0.32846 0.316076 0.582065 0.490688 0.483987 0.39023 0.428465 0.402509
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
122. 
patient tongue id: 04051927225104_1
label yaofang:
桂枝 甘草 当归 半夏 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 厚朴 砂仁 肉苁蓉 巴戟天 桑寄生 补骨脂 紫苏叶 骨碎补
0.749146 0.429261 0.526318 0.350652 0.325405 0.338039
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
123. 
patient tongue id: 04272313244644_6
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 浙贝母 紫菀 豆蔻 姜半夏 炙甘草 紫苏梗
0.633406 0.405615 0.376346 0.500693 0.340449
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
124. 
patient tongue id: 03291942043686_4
label yaofang:
甘草 半夏 薏苡仁 桃仁 白术 赤芍 浙贝母 牡丹皮 郁金 厚朴 僵蚕 夏枯草 北沙参 蛤壳 土鳖虫 猫爪草 山慈菇
0.545394 0.379348 0.486197 0.352851 0.387274
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.117647, error: 0.600000
125. 
patient tongue id: 03231031125155_3_7
label yaofang:
甘草 鸡血藤 枸杞子 白术 红花 熟地黄 杜仲 山药 山茱萸 菟丝子 桑寄生 益母草 淫羊藿 仙茅 威灵仙
0.962423 0.511569 0.614229 0.4065 0.300065 0.465674 0.377607 0.44376 0.33755 0.340833
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.133333, error: 0.800000
126. 
patient tongue id: 01061910374305_4
label yaofang:
法半夏 葛根 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 人参叶
0.450315 0.59008 0.431532 0.665007 0.343857 0.467072 0.37431 0.417098 0.409328 0.345063 0.580499 0.615003 0.565993 0.633585 0.394116 0.763692 0.388085 0.46016 0.484984 0.560024
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
127. 
patient tongue id: 04300853010361_6_2
label yaofang:
甘草 荆芥 桃仁 蒲公英 红花 牡丹皮 郁金 地黄 地骨皮 天花粉 紫草 瓜蒌皮 王不留行 麦芽 白鲜皮
0.970667 0.534355 0.625145 0.391178 0.358264 0.328404 0.541538 0.489525 0.485118 0.420336 0.46082 0.449485
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.066667, error: 0.916667
128. 
patient tongue id: 01070847139138_1_4
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 厚朴
0.486332 0.388697 0.386693 0.545914 0.451574 0.348431 0.346808
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.714286, recall: 0.416667, error: 0.285714
129. 
patient tongue id: 02211951264696_6_4
label yaofang:
柴胡 白芍 法半夏 大枣 茯苓 龙骨 牡蛎 党参 栀子 牡丹皮 石菖蒲 大黄 淫羊藿 豆蔻 炙甘草 浮小麦
0.959028 0.308081 0.533323 0.592475 0.373199 0.339607 0.333224 0.521616 0.447498 0.438764 0.390613 0.407529 0.386281
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.187500, error: 0.769231
130. 
patient tongue id: 05232113223439_1_4_6
label yaofang:
甘草 牡蛎 党参 阿胶 枸杞子 白术 牛膝 郁金 厚朴 僵蚕 桑寄生 火麻仁 紫苏子 紫苏叶 布渣叶 预知子 鲜龙葵果
0.614095 0.414814 0.302706 0.40185 0.560513 0.609207 0.421832 0.352287 0.381402
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.444444, recall: 0.235294, error: 0.555556
131. 
patient tongue id: 06091953147930_1_4_6
label yaofang:
甘草 茯苓 半夏 党参 黄芪 枸杞子 白术 柏子仁 海螵蛸 杜仲 牛膝 郁金 山药 厚朴 鸡内金 紫苏叶 黄精 红豆杉
0.77347 0.475301 0.502857 0.409357
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.222222, error: 0.000000
132. 
patient tongue id: 03020749445604_1_4_7
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.430358 0.367375 0.392778 0.429906 0.380919
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
133. 
patient tongue id: 04261956406519_4_1
label yaofang:
川芎 当归 茯苓 党参 太子参 黄芪 枸杞子 熟地黄 干姜 北沙参 山萸肉 炙甘草 续断 麸炒白术 盐菟丝子 酒女贞子
0.468751 0.644863 0.431027 0.706561 0.331523 0.452571 0.373768 0.41217 0.404021 0.314168 0.603612 0.640974 0.571371 0.646833 0.392336 0.84127 0.360872 0.455452 0.480614 0.585762
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.312500, error: 0.750000
134. 
patient tongue id: 01312052360825_1_7
label yaofang:
甘草 桃仁 黄芪 何首乌 白术 砂仁 磁石 菟丝子 桑寄生 桑枝 土鳖虫 红豆杉 姜黄 墨旱莲
0.90189 0.493115 0.530354 0.48967 0.304213 0.425533
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
135. 
patient tongue id: 01041825011435_4
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.489523 0.743778 0.377848 0.854443 0.336389 0.495061 0.361449 0.428799 0.450517 0.734153 0.766103 0.709543 0.793995 0.37291 0.873956 0.348052 0.467194 0.58131 0.674216
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
136. 
patient tongue id: 04131555111965_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.483936 0.3514 0.430109 0.537397 0.337179 0.319633
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
137. 
patient tongue id: 01040034403992_1_6_4
label yaofang:
甘草 川芎 桃仁 枸杞子 红花 杜仲 天麻 桑寄生 益母草 鳖甲 粉葛 沙苑子 白花蛇舌 半枝莲
0.936545 0.321209 0.515878 0.574655 0.366974 0.309193 0.307484 0.465895 0.398151 0.401433 0.342455 0.361165 0.341228
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
138. 
patient tongue id: 06011953346194_1_2_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 延胡索 川楝子 天麻 全蝎 鳖甲 浮小麦 白花蛇舌 半枝莲
0.989708 0.56628 0.661133 0.361131 0.371019 0.316949 0.609846 0.565792 0.545787 0.502592 0.536606 0.53283
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
139. 
patient tongue id: 02171836524924_4_2
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.539313 0.844935 0.373923 0.948394 0.39031 0.634009 0.355643 0.509892 0.489155 0.348875 0.86801 0.900926 0.81519 0.903686 0.354006 0.967431 0.450059 0.602768 0.601062 0.786687
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
140. 
patient tongue id: 02010417002740_5_6
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 党参 黄芪 酸枣仁 丹参 黄连 乌梅 皂角刺 建曲 合欢花 麸炒枳壳
0.912472 0.514378 0.561979 0.394789 0.331522 0.341507 0.481345 0.442852 0.43551 0.378697 0.394691 0.379405
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
141. 
patient tongue id: 02211829490908_4
label yaofang:
甘草 白芍 川芎 独活 柏子仁 细辛 干姜 白芷 蜈蚣 姜黄 海桐皮 鹿衔草
0.335646 0.343122 0.433369 0.332215 0.301544 0.407648 0.365318 0.310163 0.31917 0.484269 0.565202 0.312195
predicted yaofang:
甘草 柴胡 白芍 香附 茯苓 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.250000, recall: 0.250000, error: 0.750000
142. 
patient tongue id: 03282210355984_6_2_4
label yaofang:
甘草 法半夏 党参 浙贝母 郁金 干姜 厚朴 天麻 鳖甲 莪术 麦芽 紫苏梗 蜈蚣 白花蛇舌 红豆杉 猫爪草
0.995578 0.576848 0.693521 0.350722 0.397022 0.301679 0.354733 0.689331 0.638137 0.613728 0.559598 0.600625 0.58012
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.375000, error: 0.538462
143. 
patient tongue id: 06012108596980_6
label yaofang:
麻黄 甘草 黄芩 茯苓 黄芪 白术 杜仲 厚朴 僵蚕 辛夷 蜈蚣 猫爪草
0.656596 0.432028 0.411439 0.528563 0.599117 0.411799 0.35757 0.376755
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.625000, recall: 0.416667, error: 0.375000
144. 
patient tongue id: 03161318279740_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.47023 0.653963 0.421823 0.747036 0.342018 0.504593 0.368238 0.440065 0.428359 0.345814 0.648422 0.692206 0.612176 0.695179 0.372322 0.849019 0.387363 0.489984 0.50199 0.608899
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
145. 
patient tongue id: 04112009034632_5_6
label yaofang:
甘草 薏苡仁 党参 白术 牡丹皮 杜仲 牛膝 天麻 桑寄生 金樱子 桑螵蛸 佛手 合欢花
0.966879 0.536213 0.606597 0.362167 0.324706 0.318276 0.518172 0.466703 0.454132 0.405705 0.43034 0.409021
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
146. 
patient tongue id: 06191155533153_5
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 黄连 红花 山药 天麻 蛇床子 麦芽 地龙 苦参 白鲜皮
0.984408 0.555862 0.645072 0.348336 0.362839 0.342328 0.607755 0.537029 0.498059 0.467823 0.489523 0.464276
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
147. 
patient tongue id: 02181555324179_6_5
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 茯苓 白及 麦冬 党参 黄连 生地黄 山药 灯心草 没药
0.992488 0.577867 0.65407 0.354585 0.397786 0.322555 0.354986 0.649684 0.582382 0.55161 0.509852 0.542554 0.521546
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
148. 
patient tongue id: 04271849269035_4
label yaofang:
甘草 陈皮 前胡 桔梗 半夏 防风 荷叶 荆芥穗 款冬花 紫菀 百部 辛夷 苍耳子
0.510001 0.805441 0.385326 0.936186 0.388089 0.647709 0.321668 0.504 0.461443 0.365558 0.849323 0.889979 0.787544 0.887628 0.318387 0.95347 0.473763 0.596777 0.527774 0.723221
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.615385, error: 0.600000
149. 
patient tongue id: 02120804283361_4_1
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 黄连 浙贝母 郁金 砂仁 天麻 鳖甲 豆蔻 苦杏仁 蜈蚣 白花蛇舌 天山雪莲
0.985969 0.553123 0.632868 0.351247 0.370118 0.309704 0.359585 0.612747 0.550458 0.519497 0.477265 0.505379 0.467369
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.437500, error: 0.461538
150. 
patient tongue id: 02120817596003_4_2_6
label yaofang:
甘草 法半夏 当归 茯苓 橘红 远志 白术 浙贝母 细辛 款冬花 紫菀 苦杏仁 炙麻黄
0.889846 0.302176 0.477106 0.58119 0.37024 0.317489 0.449356 0.321481 0.339249
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
151. 
patient tongue id: 02182319320288_6_5
label yaofang:
甘草 柴胡 白芍 茯苓 龙骨 连翘 党参 酸枣仁 栀子 牡丹皮 菟丝子 益母草 合欢花 酒女贞子
0.940667 0.319069 0.525517 0.579246 0.371091 0.340473 0.306269 0.3411 0.513005 0.468334 0.431131 0.411473 0.420158 0.399773
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.357143, error: 0.642857
152. 
patient tongue id: 03090859055634_6_5
label yaofang:
甘草 柴胡 白芍 茯苓 木香 薏苡仁 蒲公英 党参 白术 山药 砂仁 麦芽 合欢花
0.934333 0.523044 0.569775 0.369589 0.44357 0.35647 0.377733 0.305239
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
153. 
patient tongue id: 01200648408446_1_7_5
label yaofang:
甘草 柴胡 蒲公英 黄芪 生地黄 天麻 白芷 天花粉 鳖甲 百部 王不留行 麦芽 皂角刺 蜈蚣 白花蛇舌 天山雪莲 半枝莲 广升麻
0.825071 0.422113 0.555679 0.353392 0.48078
predicted yaofang:
甘草 茯苓 党参 丹参 天麻

------Score: precision: 0.400000, recall: 0.111111, error: 0.600000
154. 
patient tongue id: 04051841265384_1_4_6
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 麦冬 玉竹 太子参 郁金 北柴胡 款冬花 紫菀 北沙参 人参叶
0.462065 0.685278 0.375133 0.869693 0.392998 0.613084 0.439631 0.436504 0.354002 0.784968 0.833057 0.752471 0.845994 0.331522 0.863199 0.503868 0.573454 0.501667 0.677337
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.421053, recall: 0.533333, error: 0.578947
155. 
patient tongue id: 03151857327355_4
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.421042 0.318385 0.416012 0.350538 0.435398 0.352132 0.36834 0.471564
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
156. 
patient tongue id: 03221621042522_5_2
label yaofang:
甘草 茯苓 桔梗 牛蒡子 白术 浙贝母 乌梅 鳖甲 诃子 白花蛇舌 天山雪莲 蜂房 岗梅根 四季青
0.974077 0.539105 0.624647 0.322588 0.517657 0.410109 0.373553 0.312284 0.337541
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.666667, recall: 0.428571, error: 0.333333
157. 
patient tongue id: 02182307154975_6_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 黄连 山药 干姜 砂仁 佛手 合欢花
0.978294 0.551805 0.621599 0.353834 0.360761 0.334604 0.587766 0.533306 0.477366 0.464216 0.478939 0.457584
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
158. 
patient tongue id: 04282313116234_2_6
label yaofang:
甘草 川芎 茯苓 党参 酸枣仁 丹参 生地黄 牡丹皮 山茱萸 泽泻 菟丝子 益母草 淫羊藿 女贞子 浮小麦 墨旱莲
0.952684 0.522872 0.611409 0.368303 0.350961 0.319779 0.522741 0.45773 0.433028 0.396935 0.424826 0.409002
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
159. 
patient tongue id: 01031835330729_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香
0.49407 0.724356 0.3799 0.895699 0.358087 0.620196 0.325764 0.45368 0.437957 0.344313 0.791341 0.843703 0.754778 0.848308 0.353637 0.906214 0.458816 0.5573 0.543237 0.67886
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
160. 
patient tongue id: 03230713488977_7_2_1
label yaofang:
甘草 柴胡 白芍 延胡索 郁金 桑白皮 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲 红豆杉 田七末
0.910026 0.333712 0.49424 0.555559 0.356238 0.366818 0.311061
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
161. 
patient tongue id: 05262223146094_2_7_6
label yaofang:
甘草 薏苡仁 白术 赤芍 山茱萸 天麻 巴戟天 鳖甲 补骨脂 莪术 豆蔻 蜈蚣 天山雪莲 半枝莲
0.952136 0.312166 0.527238 0.587487 0.386197 0.344683 0.307341 0.34073 0.5117 0.467977 0.466597 0.410187 0.433785 0.421288
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.500000, error: 0.500000
162. 
patient tongue id: 03021850550980_4_1_6
label yaofang:
薏苡仁 黄芪 白术 赤芍 浙贝母 杜仲 砂仁 菟丝子 桑寄生 橘核 土鳖虫 红豆杉 山慈菇
0.365481 0.342984 0.380874 0.478997 0.444512 0.318358
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
163. 
patient tongue id: 02150731549245_1_2
label yaofang:
甘草 法半夏 茯苓 桔梗 橘红 金银花 桃仁 党参 黄芪 丹参 枳实 竹茹 厚朴
0.424495 0.335572 0.436212 0.453925 0.421022 0.46186 0.404444 0.433 0.376814 0.409229 0.442384 0.422048 0.424716 0.437243 0.44974
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.400000, recall: 0.461538, error: 0.600000
164. 
patient tongue id: 03271921325280_2_4
label yaofang:
法半夏 茯苓 前胡 桔梗 麦冬 玉竹 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 人参叶
0.369675 0.732421 0.359873 0.891326 0.426878 0.576794 0.435736 0.396946 0.32584 0.797226 0.87156 0.663328 0.802236 0.949152 0.39868 0.607949 0.610989
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.529412, recall: 0.642857, error: 0.470588
165. 
patient tongue id: 03272238167313_1_2
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.602274 0.378928 0.49317 0.311894 0.406422
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
166. 
patient tongue id: 03062136387886_1_6_2
label yaofang:
甘草 白芍 党参 酸枣仁 郁金 山药 天麻 鳖甲 莪术 虎杖 浮小麦 蜈蚣 白花蛇舌 合欢花 红豆杉
0.982628 0.557325 0.636156 0.374862 0.355505 0.333775 0.580595 0.543305 0.514001 0.476296 0.502003 0.485818
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
167. 
patient tongue id: 04211756410401_1
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.497744 0.737684 0.402715 0.861007 0.358395 0.576871 0.365203 0.480061 0.452345 0.364595 0.75612 0.803281 0.704638 0.803954 0.363923 0.913814 0.437522 0.547273 0.552532 0.68239
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
168. 
patient tongue id: 05312142401562_1_5
label yaofang:
甘草 法半夏 茯苓 桔梗 太子参 丹参 黄连 浙贝母 薤白 款冬花 瓜蒌子 化橘红 麸炒枳壳
0.98869 0.56503 0.648692 0.36295 0.400206 0.322483 0.351122 0.638701 0.568468 0.543936 0.498491 0.534001 0.518354
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.153846, error: 0.846154
169. 
patient tongue id: 02131310133691_1_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.642027 0.425416 0.459462 0.370889 0.461263
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
170. 
patient tongue id: 06141843553587_6_2_5
label yaofang:
茯苓 牡蛎 熟地黄 牡丹皮 郁金 山药 山茱萸 泽泻 莪术 蜈蚣 土茯苓 合欢皮 姜黄
0.437188 0.39909 0.361209 0.388374 0.380655
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
171. 
patient tongue id: 01050652549915_5
label yaofang:
甘草 法半夏 茯苓 薏苡仁 白术 天麻 胡黄连 茵陈 白花蛇舌草 麦芽 苦杏仁 板蓝根 广藿香 蜈蚣 半枝莲 醋鳖甲
0.988892 0.567082 0.649373 0.363439 0.372167 0.300606 0.327532 0.61086 0.552393 0.533879 0.477945 0.514012 0.503976
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.375000, error: 0.538462
172. 
patient tongue id: 04300906068095_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 桃仁 鱼腥草 远志 浙贝母 细辛 鳖甲 款冬花 白花蛇舌草 苦杏仁 紫苏梗
0.98095 0.541105 0.629509 0.373424 0.345821 0.327188 0.561035 0.490016 0.491863 0.409866 0.444113 0.425973
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
173. 
patient tongue id: 04241825008241_4_6
label yaofang:
桂枝 柴胡 白芍 黄芩 党参 五味子 郁金 桑寄生 虎杖 白花蛇舌草 姜半夏 炙甘草 土茯苓
0.400932 0.320482 0.424882 0.301382 0.443229 0.352806 0.373962 0.451673
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.384615, error: 0.375000
174. 
patient tongue id: 05262215590382_6_1
label yaofang:
甘草 远志 党参 白术 酸枣仁 生地黄 天麻 鳖甲 续断 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.975926 0.543282 0.628255 0.35257 0.345896 0.324422 0.557384 0.471873 0.452542 0.397618 0.426533 0.403174
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
175. 
patient tongue id: 01061854494532_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.438696 0.54463 0.403819 0.664233 0.461031 0.302982 0.328351 0.324361 0.550352 0.605082 0.53086 0.634874 0.396178 0.784786 0.36699 0.407337 0.345467 0.484891
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 0.933333, error: 0.222222
176. 
patient tongue id: 02151823091572_1_2
label yaofang:
甘草 陈皮 茯苓 佩兰 茵陈 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶 木棉花 姜厚朴
0.534815 0.837509 0.369064 0.945184 0.3971 0.645289 0.356467 0.515679 0.480537 0.364501 0.869963 0.906364 0.809969 0.89935 0.343635 0.963565 0.469458 0.61504 0.589267 0.777143
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.230769, error: 0.850000
177. 
patient tongue id: 06082050440223_7_2_3
label yaofang:
甘草 枳壳 半夏 牡蛎 薏苡仁 玄参 熟地黄 杜仲 郁金 厚朴 僵蚕 莪术 紫苏叶 蜈蚣 合欢皮 预知子
0.603613 0.38952 0.391228 0.358172 0.645806 0.66561 0.30525 0.510756 0.389002 0.323897 0.450723 0.317103
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
178. 
patient tongue id: 05232004530790_2_7
label yaofang:
半夏 桃仁 黄芪 枸杞子 白术 丹参 赤芍 海螵蛸 浙贝母 厚朴 僵蚕 莪术 炙甘草 紫苏叶 蜈蚣 蛇舌草
0.540844 0.407671 0.440763 0.368397
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.062500, error: 0.750000
179. 
patient tongue id: 03132024282223_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.438021 0.335792 0.466232 0.325979 0.325043
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
180. 
patient tongue id: 01130637185885_1_2_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 鱼腥草 浙贝母 鳖甲 款冬花 紫菀 诃子 白花蛇舌 蜂房 四季青
0.960209 0.526682 0.59616 0.394772 0.308426 0.447435 0.3935 0.411544 0.328911 0.351571 0.330644
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
181. 
patient tongue id: 01201940535619_1_2_6
label yaofang:
甘草 党参 山药 山茱萸 地黄 天麻 菟丝子 益智仁 益母草 金樱子 白花蛇舌草 蜈蚣 棉萆薢 醋鳖甲
0.983719 0.549025 0.636744 0.349549 0.371458 0.301751 0.347243 0.608657 0.540439 0.499425 0.476028 0.497054 0.478496
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
182. 
patient tongue id: 05112016376905_1_2_6
label yaofang:
甘草 白芍 龙骨 黄芪 白术 桑寄生 芡实 金樱子 王不留行 桑螵蛸 橘络 紫苏梗 墨旱莲 山慈菇
0.463851 0.358496 0.428617 0.514823 0.421076 0.310957
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
183. 
patient tongue id: 06010646418162_1_2
label yaofang:
甘草 白芍 桔梗 牛蒡子 玉竹 党参 太子参 生地黄 浙贝母 乌梅 天花粉 鳖甲 北沙参 白花蛇舌 蜂房 四季青
0.995043 0.589461 0.674948 0.372308 0.411329 0.321368 0.343034 0.671731 0.619434 0.594358 0.54339 0.586083 0.577853
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
184. 
patient tongue id: 02252116489074_1_4_6
label yaofang:
甘草 川芎 陈皮 法半夏 茯苓 桔梗 党参 浙贝母 天麻 糯稻根 鳖甲 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.960985 0.306657 0.534166 0.600326 0.38348 0.349732 0.325881 0.52094 0.467898 0.459805 0.404392 0.430022 0.415059
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.562500, error: 0.307692
185. 
patient tongue id: 05242114524473_6_4_2
label yaofang:
甘草 当归 茯苓 党参 黄连 浙贝母 白芷 菟丝子 天花粉 益母草 鳖甲 续断 白花蛇舌 蜂房 四季青 红豆杉
0.97958 0.545209 0.635807 0.358474 0.369042 0.344245 0.593136 0.528638 0.494027 0.462355 0.486865 0.469304
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
186. 
patient tongue id: 02211819390295_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.494319 0.686236 0.407195 0.778651 0.327944 0.491867 0.386735 0.431577 0.432737 0.317402 0.665886 0.720428 0.645464 0.734315 0.41269 0.867606 0.366801 0.474057 0.518951 0.619376
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
187. 
patient tongue id: 03222018067763_1_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 仙鹤草 砂仁 炙甘草 浮小麦 百合 紫苏叶
0.314999 0.347205 0.454155 0.338099 0.403422 0.33255 0.330306 0.518906 0.59038
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
188. 
patient tongue id: 01012112410489_1_3
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.517589 0.415355 0.364906 0.524737 0.526654 0.383958 0.321268 0.400747
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
189. 
patient tongue id: 04101856433649_4_7
label yaofang:
川芎 茯苓 防风 薏苡仁 党参 黄芪 钩藤 赤小豆 芡实 炙甘草 首乌藤 广藿香 威灵仙 棉萆薢
0.407279 0.612878 0.435937 0.656198 0.330302 0.403721 0.329968 0.356696 0.330291 0.563752 0.580055 0.492884 0.578169 0.356493 0.74016 0.312516 0.402843 0.359448 0.477606
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.210526, recall: 0.285714, error: 0.789474
190. 
patient tongue id: 03141256460545_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.372916 0.396036 0.360875 0.377495 0.343843 0.394604
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
191. 
patient tongue id: 04131557407654_1_3_4
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.449707 0.344716 0.394359 0.449137 0.435413 0.434773 0.364717 0.387279 0.302906 0.33628 0.364549 0.382048 0.312663 0.366983 0.367663 0.371635
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.250000, error: 0.812500
192. 
patient tongue id: 04132035468762_6_2_7
label yaofang:
甘草 川芎 龙骨 牡蛎 桃仁 远志 党参 酸枣仁 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.983767 0.555796 0.646557 0.35031 0.375697 0.337681 0.596842 0.53136 0.495178 0.460225 0.49409 0.469792
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
193. 
patient tongue id: 05131646278177_2_7_6
label yaofang:
甘草 远志 党参 酸枣仁 丹参 生地黄 牡丹皮 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.99 0.56822 0.668539 0.367025 0.405432 0.319221 0.345147 0.652353 0.598248 0.567808 0.527077 0.567619 0.552373
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
194. 
patient tongue id: 01061841128612_2_4
label yaofang:
陈皮 法半夏 葛根 前胡 桔梗 麦冬 玄参 款冬花 紫菀 百部 北沙参 炙甘草 人参叶 干石斛
0.492471 0.740428 0.383786 0.873667 0.384925 0.58276 0.355173 0.460326 0.446631 0.357912 0.779312 0.818734 0.736984 0.829424 0.36889 0.892901 0.442057 0.550226 0.564168 0.701844
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.642857, error: 0.550000
195. 
patient tongue id: 03101734585745_4_1
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.491438 0.683533 0.43135 0.756865 0.351765 0.47979 0.399278 0.438514 0.422688 0.336856 0.66276 0.695387 0.633417 0.718066 0.40961 0.850144 0.384272 0.47481 0.546264 0.649428
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
196. 
patient tongue id: 04131602117514_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.485117 0.336969 0.454288 0.543873 0.349864 0.303092
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
197. 
patient tongue id: 05260625080453_2_7_6
label yaofang:
甘草 桃仁 黄芪 红花 赤芍 熟地黄 山茱萸 天麻 肉苁蓉 桑寄生 火麻仁 地龙 辛夷 首乌藤
0.990222 0.560167 0.658211 0.353764 0.368764 0.339939 0.613966 0.557138 0.530222 0.48767 0.518628 0.488619
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
198. 
patient tongue id: 03192240356696_6_4
label yaofang:
甘草 白芍 茯苓 党参 酸枣仁 玄参 柏子仁 黄连 生地黄 山茱萸 厚朴 火麻仁 麦芽 郁李仁 合欢花
0.942124 0.51836 0.607047 0.374232 0.324627 0.302668 0.485512 0.407163 0.419764 0.33509 0.369538 0.362112
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
199. 
patient tongue id: 01040704323472_5
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 远志 浙贝母 款冬花 白前 苇茎 苦杏仁 炙麻黄
0.989066 0.55475 0.651932 0.352483 0.368525 0.338138 0.617984 0.568897 0.536925 0.485805 0.521736 0.490455
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
200. 
patient tongue id: 05042132447729_2_4
label yaofang:
麻黄 桂枝 甘草 白芍 牡蛎 薏苡仁 桃仁 丹参 红花 赤芍 熟地黄 益母草 夏枯草 鹿角霜 姜炭 芥子
0.516952 0.36914 0.353454 0.476772 0.375198 0.302325
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
201. 
patient tongue id: 04012017170708_5
label yaofang:
甘草 金银花 蒲公英 酸枣仁 五味子 生地黄 栀子 车前子 大黄 仙鹤草 茜草 滑石 瞿麦 萹蓄 浮小麦 车前草
0.548844 0.314234 0.367899 0.500851 0.34832
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
202. 
patient tongue id: 01122227120653_1_6_7
label yaofang:
甘草 枳壳 茯苓 木香 党参 酸枣仁 生地黄 牡丹皮 山药 山茱萸 地骨皮 糯稻根 秦艽 首乌藤 合欢花
0.992778 0.577453 0.667196 0.352334 0.383648 0.30506 0.345581 0.651392 0.58676 0.554431 0.515473 0.54539 0.524351
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
203. 
patient tongue id: 04071327250754_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.434483 0.643773 0.386323 0.792415 0.348812 0.587656 0.316981 0.435285 0.423425 0.300814 0.348416 0.685071 0.744184 0.661675 0.752551 0.343646 0.849667 0.458846 0.53027 0.478902 0.612744
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
204. 
patient tongue id: 06070655339234_2_5
label yaofang:
甘草 龙骨 党参 白术 酸枣仁 生地黄 黄柏 知母 山茱萸 天花粉 糯稻根 淫羊藿 仙茅 女贞子 龟甲
0.993318 0.564841 0.693748 0.341146 0.400009 0.335203 0.676363 0.600582 0.565851 0.508753 0.561594 0.54697
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
205. 
patient tongue id: 05262101082118_2_4
label yaofang:
桂枝 甘草 白芍 党参 白术 桑叶 天麻 糯稻根 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.887687 0.50314 0.541182 0.46375 0.344762 0.406288
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
206. 
patient tongue id: 02171857185233_4
label yaofang:
法半夏 生姜 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.50249 0.781506 0.368745 0.929489 0.356774 0.649347 0.449947 0.459427 0.366235 0.847698 0.892877 0.788959 0.895639 0.947189 0.493653 0.665695 0.530567 0.727839
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 0.933333, error: 0.222222
207. 
patient tongue id: 04111955328078_1_3_4
label yaofang:
陈皮 当归 茯苓 半夏 党参 黄芪 白术 僵蚕 鸡内金 紫苏子 炙甘草 紫苏叶 木蝴蝶
0.329681 0.391308 0.33069 0.344019 0.398876
predicted yaofang:
甘草 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
208. 
patient tongue id: 01041843328962_1_4
label yaofang:
陈皮 法半夏 前胡 麦冬 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.499925 0.738951 0.384641 0.901752 0.368878 0.620805 0.32948 0.461909 0.446915 0.347871 0.800429 0.849535 0.75935 0.852662 0.345224 0.912522 0.453584 0.571043 0.533904 0.673613
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
209. 
patient tongue id: 02201257050750_1_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 石菖蒲 炙甘草 百合 紫苏叶 青葙子
0.338653 0.306606 0.385023 0.418923 0.351312 0.41316 0.486522
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
210. 
patient tongue id: 04112037326132_1_6
label yaofang:
甘草 桔梗 浙贝母 白茅根 地黄 天麻 蔓荆子 白花蛇舌草 辛夷 蜈蚣 蜂房 醋鳖甲 酒女贞子
0.955688 0.301682 0.533713 0.594348 0.346589 0.318914 0.308431 0.512906 0.425559 0.405356 0.353854 0.368359 0.345692
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
211. 
patient tongue id: 05222227181945_4
label yaofang:
茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.563971 0.836503 0.388683 0.926792 0.351651 0.5645 0.413911 0.523801 0.510166 0.341421 0.837508 0.877007 0.783603 0.879101 0.39219 0.966292 0.393564 0.570977 0.633005 0.776367
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
212. 
patient tongue id: 01050650379109_6_4
label yaofang:
甘草 茯苓 羌活 党参 延胡索 赤芍 山药 天麻 鳖甲 鹿角霜 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.947381 0.307149 0.523985 0.584892 0.373344 0.328222 0.313326 0.492057 0.420316 0.417003 0.353994 0.375603 0.360348
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
213. 
patient tongue id: 01040656112790_5_1
label yaofang:
甘草 黄芩 茯苓 薄荷 芦根 牛蒡子 党参 丹参 黄连 山药 鳖甲 补骨脂 白花蛇舌 蜂房 广升麻
0.981817 0.557806 0.635758 0.384558 0.364553 0.301006 0.34689 0.584691 0.539302 0.527972 0.473583 0.50167 0.489588
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
214. 
patient tongue id: 05032240225166_1_4_7
label yaofang:
甘草 茯苓 赤芍 杜仲 车前子 天麻 桑寄生 鳖甲 鹿角霜 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫
0.98075 0.553613 0.633867 0.368384 0.379813 0.312942 0.342784 0.600151 0.554305 0.530557 0.492534 0.521521 0.513056
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
215. 
patient tongue id: 03291337145529_1_6_4
label yaofang:
甘草 川芎 金银花 浙贝母 牛膝 郁金 天麻 蔓荆子 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.831754 0.455228 0.550416 0.40618 0.330542
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
216. 
patient tongue id: 05042033007056_6_1
label yaofang:
陈皮 桔梗 牛蒡子 海螵蛸 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.336399 0.327131 0.427595 0.415252 0.338832 0.452248 0.550288
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
217. 
patient tongue id: 03101650425340_1_2
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.356175 0.48783 0.434382 0.440757 0.509842 0.462541 0.486062 0.453115 0.461972 0.493772 0.515157 0.535907 0.546359 0.580103
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.357143, recall: 0.416667, error: 0.642857
218. 
patient tongue id: 06051108214309_1_7_4
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子
0.444173 0.308007 0.482273 0.478607 0.437892 0.513788 0.468414 0.466706 0.431666 0.44423 0.476493 0.518824 0.33061 0.519732 0.520836 0.542987
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.125000, recall: 0.181818, error: 0.875000
219. 
patient tongue id: 04271433218756_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.451582 0.343228 0.429214 0.462923 0.41484 0.463715 0.408436 0.418627 0.353352 0.393881 0.426281 0.427988 0.346501 0.423195 0.422623 0.435195
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
220. 
patient tongue id: 03301918329611_4
label yaofang:
法半夏 前胡 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.452207 0.620878 0.416518 0.734583 0.359967 0.526512 0.353898 0.445817 0.439063 0.316804 0.373732 0.63553 0.687607 0.597132 0.685174 0.350273 0.838156 0.422154 0.501703 0.461037 0.578787
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
221. 
patient tongue id: 04182037524552_1_4
label yaofang:
甘草 川芎 陈皮 枳壳 茯苓 龙骨 牡蛎 牛蒡子 远志 柏子仁 竹茹 紫菀 姜半夏
0.314731 0.420599 0.349451 0.312034 0.329511 0.523012 0.649298
predicted yaofang:
柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
222. 
patient tongue id: 01211244269324_4
label yaofang:
陈皮 前胡 薄荷 黄连 厚朴 白芷 冬瓜皮 豆蔻 苦杏仁 姜半夏 辛夷 广藿香 苍耳子
0.529241 0.407643 0.435946 0.339896
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
223. 
patient tongue id: 04210249494490_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 浙贝母 桑白皮 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.992728 0.577054 0.663079 0.362915 0.398824 0.320251 0.339851 0.66019 0.604487 0.574128 0.526325 0.569714 0.560067
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
224. 
patient tongue id: 05042040199607_4_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 姜半夏 百合 紫苏叶 独脚金
0.350444 0.450498 0.353222 0.385726 0.332617 0.307965 0.337312 0.566809 0.624273
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.166667, error: 0.777778
225. 
patient tongue id: 04140743185445_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.535478 0.319072 0.317303 0.490117 0.560265 0.357438 0.306172
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
226. 
patient tongue id: 01092337478772_4
label yaofang:
桂枝 白芍 大枣 茯苓 附子 苍术 炙甘草
0.373748 0.322184 0.334054 0.399452 0.389916 0.402453
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
227. 
patient tongue id: 03141624023390_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.579801 0.399651 0.480253 0.460778 0.418209
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
228. 
patient tongue id: 05181358505335_5_6
label yaofang:
甘草 荆芥 金银花 薏苡仁 远志 红花 黄柏 苍术 木瓜 莲子 豆蔻 决明子 苦杏仁 白鲜皮 土茯苓
0.897563 0.503848 0.548977 0.412669 0.304426 0.405664 0.357138 0.395588 0.315672 0.311268
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.066667, error: 0.900000
229. 
patient tongue id: 04121934537344_4_1
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.341695 0.404553 0.4845 0.431626 0.417489 0.309699
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
230. 
patient tongue id: 04130631448736_4_6
label yaofang:
甘草 川芎 党参 白术 生地黄 牡丹皮 杜仲 牛膝 山茱萸 钩藤 天麻 桑寄生 蒺藜 沙苑子 牛大力
0.92968 0.507256 0.579062 0.35611 0.317356 0.31076 0.482716 0.395152 0.378573 0.331717 0.346959 0.325253
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
231. 
patient tongue id: 02241843092411_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄
0.533002 0.866694 0.352717 0.96895 0.39783 0.717062 0.51829 0.45796 0.350834 0.913426 0.943479 0.861351 0.940082 0.307687 0.975791 0.500378 0.657754 0.605349 0.807299
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
232. 
patient tongue id: 04182157102374_7_5
label yaofang:
甘草 白芍 川芎 香附 当归 党参 白术 生地黄 黄柏 砂仁 麦芽 苦参 地肤子 土茯苓
0.972916 0.541779 0.62206 0.327837 0.361101 0.321721 0.586922 0.47284 0.422055 0.398362 0.419198 0.396742
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
233. 
patient tongue id: 06092000121530_1_2_7
label yaofang:
陈皮 半夏 远志 党参 黄芪 枸杞子 白术 杜仲 牛膝 山药 鳖甲 麦芽 炙甘草 首乌藤 紫苏梗 龟甲 蛇舌草
0.768473 0.307705 0.442633 0.529165 0.403927
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.117647, error: 0.600000
234. 
patient tongue id: 01312124447549_1_2_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 生地黄 砂仁 天麻 五灵脂 鳖甲 女贞子 蜈蚣 天山雪莲 半枝莲 墨旱莲
0.984931 0.561381 0.63953 0.358733 0.375851 0.309573 0.340654 0.608752 0.546502 0.502414 0.481035 0.506749 0.484767
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.562500, error: 0.307692
235. 
patient tongue id: 06111024184873_2_6
label yaofang:
甘草 柴胡 白芍 延胡索 郁金 天麻 鳖甲 鸡内金 虎杖 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 广金钱草
0.91847 0.316276 0.504949 0.574431 0.375562 0.438079 0.364011 0.369469 0.302916 0.317855 0.304059
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
236. 
patient tongue id: 06031527498984_2
label yaofang:
陈皮 茯苓 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.531099 0.759413 0.40674 0.869114 0.35762 0.559592 0.401026 0.503193 0.481669 0.374257 0.763193 0.80937 0.714761 0.807891 0.394571 0.934087 0.426827 0.546292 0.57475 0.706438
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
237. 
patient tongue id: 01120048459477_7
label yaofang:
陈皮 茯苓 丹参 黄连 枳实 竹茹 姜半夏 炙甘草 首乌藤 合欢皮
0.329179 0.376063 0.681361
predicted yaofang:
茯苓 干姜 炙甘草

------Score: precision: 0.666667, recall: 0.200000, error: 0.333333
238. 
patient tongue id: 04200312336406_1_2
label yaofang:
甘草 党参 酸枣仁 生地黄 延胡索 杜仲 细辛 天麻 鳖甲 补骨脂 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986336 0.569181 0.642175 0.369726 0.35978 0.334676 0.579398 0.539408 0.525724 0.479347 0.506431 0.489045
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
239. 
patient tongue id: 02202230192018_6_4
label yaofang:
甘草 川芎 法半夏 鸡血藤 白术 杜仲 仙鹤草 天麻 鳖甲 麦芽 蜈蚣 天山雪莲 半枝莲 墨旱莲
0.984381 0.550222 0.646279 0.363017 0.384081 0.309901 0.345016 0.61991 0.562326 0.532523 0.490614 0.522584 0.509556
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
240. 
patient tongue id: 05132137301527_1_6
label yaofang:
甘草 独活 党参 黄芪 白术 酸枣仁 生地黄 杜仲 天麻 糯稻根 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.94871 0.308092 0.517936 0.608849 0.334818 0.322416 0.514131 0.385607 0.353922 0.309031 0.342917 0.320704
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
241. 
patient tongue id: 04291632546604_6_2
label yaofang:
甘草 柴胡 连翘 党参 丹参 生地黄 红花 延胡索 赤芍 青皮 川楝子 郁金 瓜蒌皮 王不留行 皂角刺
0.988563 0.558364 0.66361 0.356357 0.384372 0.305105 0.341669 0.631984 0.550037 0.51652 0.473968 0.507428 0.487574
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.200000, error: 0.769231
242. 
patient tongue id: 05172138589688_4
label yaofang:
桂枝 川芎 陈皮 黄芪 丹参 栀子 乌药 小蓟 车前子 滑石 瞿麦 石韦 萹蓄 炙甘草 广金钱草
0.781237 0.350833 0.414538 0.521946 0.381247
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
243. 
patient tongue id: 05260633148369_1_7_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 砂仁 天麻 鳖甲 麦芽 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.984127 0.565353 0.647201 0.394438 0.396048 0.318224 0.354328 0.612651 0.572102 0.549606 0.50786 0.542161 0.533945
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
244. 
patient tongue id: 04120026149440_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 酸枣仁 生地黄 山药 糯稻根 桑寄生 胡黄连 淫羊藿 仙茅 龟甲
0.934456 0.497601 0.585577 0.438397 0.407916 0.329135 0.427776 0.300616
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
245. 
patient tongue id: 05242116526117_1_2_6
label yaofang:
甘草 白芍 川芎 当归 党参 黄芪 鸡血藤 白术 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲
0.968674 0.540254 0.6094 0.349901 0.335372 0.320739 0.541537 0.479579 0.439788 0.415158 0.429263 0.40882
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
246. 
patient tongue id: 05092033271525_6
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 车前子 砂仁 菟丝子 巴戟天 桑寄生 续断 制何首乌 艾叶
0.350594 0.300232 0.370635 0.431886 0.357405 0.302811 0.362376 0.436248
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
247. 
patient tongue id: 02120934136471_7_1_4
label yaofang:
甘草 白芍 茯苓 党参 鸡血藤 白术 生地黄 白茅根 赤石脂 鳖甲 补骨脂 建曲 蜈蚣 白花蛇舌 天山雪莲
0.973253 0.30196 0.549411 0.607804 0.353445 0.351446 0.301172 0.328669 0.556791 0.508129 0.45647 0.444374 0.459997 0.42743
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.714286, recall: 0.666667, error: 0.285714
248. 
patient tongue id: 05092117209911_6_4
label yaofang:
甘草 法半夏 桔梗 桃仁 红花 浙贝母 郁金 干姜 厚朴 佩兰 豆蔻 紫苏梗 威灵仙 合欢花
0.89961 0.503118 0.526919 0.370518 0.304319
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
249. 
patient tongue id: 02182224440174_1_2_6
label yaofang:
甘草 白及 地黄 天麻 没药 胡黄连 淡竹叶 白花蛇舌草 麦芽 广藿香 蜈蚣 半枝莲 醋鳖甲 川木通
0.965883 0.328533 0.523589 0.603752 0.361995 0.478644 0.428799 0.42545 0.361531 0.386594 0.363856
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
250. 
patient tongue id: 02202240225371_6_4_7
label yaofang:
甘草 柴胡 白芍 枳壳 延胡索 郁金 砂仁 天麻 鳖甲 浮小麦 蜈蚣 天山雪莲 合欢花 半枝莲 红豆杉
0.997687 0.59093 0.713776 0.328525 0.395759 0.351983 0.71966 0.64552 0.614277 0.557419 0.605069 0.584007
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
251. 
patient tongue id: 03222007493158_6_5_1
label yaofang:
甘草 白芍 陈皮 防风 党参 白术 黄连 延胡索 赤芍 乌梅 山药 干姜 五灵脂 五倍子 建曲 合欢花
0.948359 0.302362 0.522875 0.575902 0.359222 0.313451 0.311057 0.479098 0.41255 0.401478 0.350582 0.366825 0.342376
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
252. 
patient tongue id: 03081807286240_1_6
label yaofang:
桂枝 白芍 川芎 法半夏 大枣 龙骨 麦冬 党参 柏子仁 牡丹皮 吴茱萸
0.486429 0.340536 0.353363 0.424181 0.426955 0.304229
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
253. 
patient tongue id: 02020953237783_1_2_6
label yaofang:
甘草 柴胡 香附 党参 延胡索 赤芍 青皮 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.988244 0.554529 0.649734 0.365534 0.380757 0.313531 0.335758 0.621995 0.578816 0.55502 0.507759 0.541412 0.531219
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
254. 
patient tongue id: 01052158445066_4
label yaofang:
甘草 茯苓 半夏 党参 白术 砂仁 桑寄生 枇杷叶 地龙 北沙参 骨碎补 土鳖虫
0.755712 0.493267 0.430564 0.337561
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.333333, error: 0.000000
255. 
patient tongue id: 04201949569987_1_6
label yaofang:
甘草 川芎 党参 酸枣仁 生地黄 赤芍 山药 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.987206 0.565663 0.640325 0.352063 0.348675 0.310899 0.586328 0.520845 0.492379 0.451244 0.474635 0.461137
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
256. 
patient tongue id: 03021145252726_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.454476 0.363866 0.305429 0.447433 0.459082 0.310965 0.333479 0.304731
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
257. 
patient tongue id: 01122228287821_1_7
label yaofang:
桂枝 甘草 白芍 川芎 大枣 党参 黄芪 白术 生地黄 胆南星 山药 山茱萸 糯稻根 地龙 首乌藤
0.889868 0.310299 0.312597 0.519583 0.486937 0.311115
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 天麻

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
258. 
patient tongue id: 03101836186991_1_3_4
label yaofang:
枳壳 海螵蛸 厚朴 砂仁 天麻 鸡内金 麦芽 橘核 首乌藤 合欢皮 墨旱莲 红景天
0.368907 0.410382 0.388632 0.343296 0.302413 0.379886
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
259. 
patient tongue id: 04142242037259_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 独活 薏苡仁 远志 酸枣仁 浙贝母 薤白 细辛 瓜蒌皮 款冬花 苦杏仁
0.971751 0.523852 0.617604 0.311212 0.35782 0.312294 0.583672 0.42414 0.387424 0.344245 0.375655 0.354579
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
260. 
patient tongue id: 05162058399720_6_4
label yaofang:
桂枝 柴胡 白芍 黄芩 党参 郁金 虎杖 姜半夏 炙甘草 土茯苓
0.745367 0.39377 0.405963 0.512513 0.371103
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
261. 
patient tongue id: 05162104270945_6_4
label yaofang:
甘草 柴胡 白芍 法半夏 木香 白及 党参 白术 黄连 海螵蛸 山药 益智仁 桑螵蛸 麸炒枳壳
0.960089 0.309584 0.543841 0.602552 0.37356 0.344878 0.300848 0.332729 0.529059 0.473568 0.444951 0.415441 0.428715 0.407052
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.357143, error: 0.642857
262. 
patient tongue id: 05290807051922_2_4
label yaofang:
甘草 法半夏 茯苓 桃仁 党参 五味子 山药 厚朴 款冬花 补骨脂 苦杏仁 紫苏梗 威灵仙
0.982267 0.559132 0.62812 0.359238 0.340629 0.328701 0.562278 0.51113 0.482844 0.447821 0.465517 0.444123
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
263. 
patient tongue id: 02201829065462_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.52232 0.838339 0.377299 0.938233 0.373777 0.599911 0.350868 0.490595 0.470129 0.33282 0.852339 0.884079 0.799493 0.889579 0.341346 0.956947 0.420743 0.572805 0.616954 0.772463
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
264. 
patient tongue id: 05260810093004_1_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 木香 麦冬 党参 黄芪 丹参 五味子 熟附子 干姜 鸡内金 草豆蔻 六神曲
0.469203 0.337863 0.426033 0.561476 0.390036 0.304235
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
265. 
patient tongue id: 03231123019564_4_1_6
label yaofang:
甘草 川芎 防风 党参 白术 生地黄 车前子 天麻 鳖甲 白花蛇舌草 鹿角霜 蜈蚣 天山雪莲 半枝莲 川加皮 红豆杉
0.987772 0.551099 0.649315 0.387308 0.342704 0.307952 0.563198 0.518223 0.536366 0.438209 0.484535 0.476593
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
266. 
patient tongue id: 04260644078550_7_1
label yaofang:
甘草 独活 党参 白术 延胡索 杜仲 牛膝 地黄 天麻 桑寄生 续断 威灵仙 半枝莲 醋鳖甲
0.991808 0.578978 0.668183 0.346407 0.389369 0.302746 0.34918 0.650991 0.579179 0.544736 0.509644 0.541822 0.529228
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
267. 
patient tongue id: 04131755045604_1_2
label yaofang:
甘草 白芍 党参 鸡血藤 白术 丹参 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.979907 0.555047 0.624704 0.352467 0.370981 0.305177 0.346129 0.595251 0.54552 0.494909 0.474802 0.495284 0.471227
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
268. 
patient tongue id: 06191324429032_5_2
label yaofang:
甘草 酸枣仁 牡丹皮 杜仲 山药 山茱萸 地黄 天麻 桑寄生 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 牛大力
0.951924 0.521401 0.610296 0.364377 0.344162 0.325769 0.525959 0.439145 0.420937 0.377834 0.397306 0.385031
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
269. 
patient tongue id: 01132306473066_2_4
label yaofang:
白芍 麦冬 太子参 三七 鳖甲 蝉蜕 酒萸肉
0.516427 0.430359 0.422048
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
270. 
patient tongue id: 05221919100272_1_6_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶 山慈菇
0.366803 0.463087 0.365662 0.374956 0.351285 0.339073 0.336756 0.375668 0.571739 0.659361 0.341003
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
271. 
patient tongue id: 03292128363327_1_7_6
label yaofang:
甘草 前胡 党参 丹参 赤芍 山药 桑寄生 益母草 猪苓 鳖甲 款冬花 虎杖 苦杏仁 黄精 土鳖虫 鹿衔草
0.933688 0.513206 0.583674 0.40874 0.307339 0.325806 0.450448 0.409235 0.440984 0.341956 0.368597 0.354575
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
272. 
patient tongue id: 02211434499371_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.452131 0.394721 0.361488 0.496971 0.490767 0.31856 0.305354
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
273. 
patient tongue id: 03021206428394_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.379455 0.449209 0.313956
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 1.000000, recall: 0.250000, error: 0.000000
274. 
patient tongue id: 04151220095278_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.524978 0.783816 0.40154 0.856484 0.32472 0.500898 0.402481 0.479133 0.474114 0.318255 0.752282 0.793246 0.70485 0.808781 0.384038 0.939908 0.354262 0.519807 0.609031 0.729702
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
275. 
patient tongue id: 02231915359185_1
label yaofang:
白芍 川芎 茯苓 防风 丹参 钩藤 天麻 白芷 石决明 炙甘草 首乌藤 威灵仙 炒蔓荆子 棉萆薢
0.477968 0.686408 0.423824 0.771482 0.344466 0.498834 0.378344 0.446449 0.432229 0.343365 0.672833 0.711561 0.629227 0.72186 0.377467 0.865425 0.390285 0.48743 0.526842 0.634264
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.285714, error: 0.800000
276. 
patient tongue id: 05091928211821_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 薄荷 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 苍耳子
0.400027 0.696415 0.398561 0.82027 0.352669 0.538142 0.413374 0.362318 0.303663 0.717217 0.759679 0.640505 0.752495 0.890438 0.397414 0.498962 0.383765 0.61087
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.555556, recall: 0.666667, error: 0.444444
277. 
patient tongue id: 03291337035374_4
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 徐长卿
0.472192 0.408132 0.432759 0.372256 0.317294
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
278. 
patient tongue id: 03081811438533_6
label yaofang:
龙骨 丹参 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.32033 0.370539 0.307139 0.382366 0.344486 0.530171
predicted yaofang:
甘草 白芍 茯苓 党参 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
279. 
patient tongue id: 04061349559062_1_4
label yaofang:
甘草 法半夏 茯苓 前胡 防风 薄荷 荆芥穗 香薷 豆蔻 紫苏梗 广藿香 威灵仙 麸炒白术 炒六神曲
0.487693 0.701127 0.422963 0.777484 0.343147 0.483695 0.388025 0.448671 0.438477 0.326644 0.673246 0.712995 0.625127 0.721121 0.380349 0.881508 0.368672 0.481466 0.533971 0.646113
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.357143, error: 0.750000
280. 
patient tongue id: 04171947551792_1_4
label yaofang:
法半夏 茯苓 前胡 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子
0.560433 0.829965 0.33863 0.962097 0.382413 0.692776 0.524229 0.486897 0.358929 0.906593 0.933696 0.868483 0.93705 0.330689 0.965304 0.530365 0.652997 0.594453 0.808042
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.846154, error: 0.421053
281. 
patient tongue id: 04141949365862_2_5
label yaofang:
甘草 金银花 麦冬 玄参 黄连 生地黄 红花 山药 荆芥穗 火麻仁 百部 麦芽 白鲜皮 粉葛 建曲
0.982619 0.543751 0.631438 0.336317 0.39464 0.328127 0.356961 0.631373 0.539209 0.491252 0.469931 0.494651 0.475929
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.200000, error: 0.769231
282. 
patient tongue id: 05131625543094_6_1
label yaofang:
甘草 柴胡 白芍 茯苓 党参 酸枣仁 山药 天麻 白花蛇舌草 佛手 浮小麦 蜈蚣 合欢花 半枝莲 醋鳖甲
0.984075 0.559527 0.638529 0.35776 0.350116 0.322701 0.579291 0.51798 0.496789 0.45523 0.4745 0.455281
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
283. 
patient tongue id: 02252313550042_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 连翘 党参 栀子 牡丹皮 山药 莱菔子 麦芽 合欢花
0.984311 0.552477 0.627385 0.357856 0.362378 0.321072 0.577056 0.505734 0.487291 0.424797 0.458365 0.426894
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
284. 
patient tongue id: 03211951067165_1_4
label yaofang:
麻黄 桂枝 甘草 白芍 牡蛎 薏苡仁 桃仁 丹参 红花 赤芍 熟地黄 益母草 夏枯草 鹿角霜 姜炭 芥子
0.32926 0.457126 0.31216 0.37369 0.331581 0.337875 0.550103 0.683562
predicted yaofang:
柴胡 白芍 香附 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.062500, error: 0.875000
285. 
patient tongue id: 04150844069313
label yaofang:
桂枝 白芍 羌活 独活 薏苡仁 鸡血藤 丹参 乳香 狗脊 海风藤 醋没药 青风藤
0.442415 0.325796 0.393506 0.476702 0.445999 0.430125 0.377005 0.409879 0.320513 0.365867 0.396302 0.374873 0.381348 0.38854 0.411557
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.066667, recall: 0.083333, error: 0.933333
286. 
patient tongue id: 03282227443355_1_5
label yaofang:
甘草 茯苓 党参 酸枣仁 黄连 赤芍 石膏 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.994458 0.575946 0.682596 0.348462 0.407434 0.306166 0.357818 0.675293 0.609977 0.577106 0.53556 0.578571 0.564218
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
287. 
patient tongue id: 02252101236209_6
label yaofang:
甘草 川芎 法半夏 枸杞子 白术 杜仲 牛膝 天麻 桑寄生 决明子 麦芽 地龙 粉葛 首乌藤
0.992766 0.567863 0.666153 0.361074 0.404417 0.327096 0.351093 0.663749 0.597597 0.580859 0.523949 0.563973 0.556747
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
288. 
patient tongue id: 04111841125324_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.534825 0.793463 0.396274 0.906943 0.363041 0.60557 0.378626 0.519465 0.483604 0.374414 0.807794 0.85429 0.751545 0.847079 0.379864 0.948348 0.453152 0.579842 0.578522 0.727679
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
289. 
patient tongue id: 03261638567416_6_2
label yaofang:
柴胡 陈皮 麦冬 太子参 黄芪 酸枣仁 青皮 乌药 火麻仁 鸡内金 珍珠母 麦芽 合欢皮
0.712197 0.451249 0.47868 0.31615 0.365152
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
290. 
patient tongue id: 03281926557398_6_2
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 法半夏 当归 葛根 防风 麦冬 天冬 黄连 熟地黄 栀子 牡丹皮 石膏 地黄 石斛 吴茱萸 广藿香 淡附片
0.732198 0.459854 0.485359 0.400585
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.047619, error: 0.750000
291. 
patient tongue id: 02141935483313_4
label yaofang:
甘草 柴胡 香附 当归 茯苓 薄荷 牛蒡子 白术 海螵蛸 麦芽 姜半夏 广藿香 青葙子
0.591941 0.357624 0.386229 0.48961 0.34753
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
292. 
patient tongue id: 03200655201294_4
label yaofang:
甘草 白芍 蒲公英 白术 黄柏 细辛 天麻 白芷 地榆 槐花 火麻仁 麦芽 五倍子 土茯苓
0.83225 0.353623 0.47009 0.517223 0.389825 0.301126
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
293. 
patient tongue id: 01092045333786_5_4_7
label yaofang:
半夏 蒲公英 党参 黄芪 白术 海螵蛸 浙贝母 杜仲 厚朴 砂仁 莪术 鸡内金 白鲜皮 红豆杉
0.546388 0.416427 0.389467 0.505874 0.536842 0.378857 0.321275 0.359252
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
294. 
patient tongue id: 03291644359202_4_1
label yaofang:
甘草 葛根 鸡血藤 红花 山药 山茱萸 地黄 天麻 僵蚕 天花粉 益母草 木瓜 威灵仙
0.968012 0.537583 0.619189 0.358516 0.35491 0.334632 0.559786 0.500893 0.460409 0.436006 0.458849 0.435921
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
295. 
patient tongue id: 06140824471832_1_3_5
label yaofang:
甘草 桔梗 防风 金银花 太子参 藿香 白前 白鲜皮 六神曲 蜜百部 干鱼腥草 地肤子
0.311718 0.467707 0.44417 0.381651 0.506344 0.467138 0.485032 0.42831 0.460167 0.53434 0.492713 0.51579 0.521956 0.578195
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.071429, recall: 0.083333, error: 0.928571
296. 
patient tongue id: 04131941362179_3_7
label yaofang:
当归 枸杞子 五味子 杜仲 附子 山药 菟丝子 巴戟天 金樱子 覆盆子 骨碎补 黑老虎 灯盏细辛 豆豉姜
0.573563 0.418363 0.445328 0.356367 0.423988
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
297. 
patient tongue id: 01110245446192_4_7
label yaofang:
麻黄 茯苓 薏苡仁 阿胶 泽泻 滑石 猪苓
0.868147 0.300285 0.501976 0.545893 0.403504 0.353284 0.353422
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.142857, error: 0.857143
298. 
patient tongue id: 04120159461704_2_1_6
label yaofang:
甘草 独活 薏苡仁 党参 鸡血藤 生地黄 天麻 桑寄生 鳖甲 补骨脂 蜈蚣 天山雪莲 半枝莲 牛大力
0.855426 0.477078 0.549738 0.30929 0.475589 0.313205 0.380428
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
299. 
patient tongue id: 06031610364775_4
label yaofang:
法半夏 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 炒紫苏子 蜜麻黄
0.492243 0.737719 0.412101 0.864264 0.374123 0.564105 0.360881 0.489591 0.450534 0.374886 0.756589 0.805957 0.693226 0.787522 0.35422 0.920676 0.441511 0.539779 0.496379 0.661725
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
300. 
patient tongue id: 01050653538144_2
label yaofang:
甘草 桔梗 芦根 太子参 白术 浙贝母 乌梅 山药 鳖甲 茵陈 辛夷 白花蛇舌 蜂房 四季青
0.961136 0.533706 0.598073 0.332361 0.334011 0.311296 0.540811 0.401838 0.372876 0.321382 0.339128 0.320691
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
301. 
patient tongue id: 01172235169237_1_4
label yaofang:
甘草 川芎 茯苓 党参 鸡血藤 酸枣仁 丹参 生地黄 红花 赤芍 郁金 天麻 浮小麦 乌梢蛇
0.969743 0.54617 0.600751 0.381533 0.349138 0.300528 0.340257 0.536492 0.485555 0.473333 0.422547 0.442298 0.421213
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
302. 
patient tongue id: 03211953166678_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.641188 0.395832 0.497558 0.308184 0.32364 0.318394
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 天麻

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
303. 
patient tongue id: 04130337301233_2_1
label yaofang:
甘草 茯苓 太子参 浙贝母 牡丹皮 乌梅 天花粉 鳖甲 麦芽 北沙参 白花蛇舌 蜂房 岗梅根 四季青
0.940328 0.490063 0.602431 0.387843 0.320784 0.303179 0.489667 0.387941 0.423065 0.301158 0.347029 0.347307
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
304. 
patient tongue id: 05222207555699_4
label yaofang:
防风 钩藤 荆芥穗 白芷 香薷 炙甘草 辛夷 首乌藤 紫苏梗 广藿香 威灵仙 炒苍耳子 炒蔓荆子 棉萆薢
0.440652 0.636174 0.437451 0.675716 0.340403 0.43658 0.375109 0.414243 0.413461 0.311121 0.594 0.622176 0.560398 0.62783 0.360111 0.812049 0.340278 0.441411 0.476038 0.570278
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.357143, error: 0.750000
305. 
patient tongue id: 01032108212956_2_7_1
label yaofang:
甘草 薏苡仁 太子参 山药 山茱萸 细辛 天麻 鳖甲 补骨脂 莪术 蜈蚣 白花蛇舌 骨碎补 土鳖虫 红豆杉
0.597185 0.348629 0.366168 0.495204 0.37827
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
306. 
patient tongue id: 01172223149921_5_2
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 芦根 牛蒡子 黄连 浙贝母 鳖甲 蜈蚣 白花蛇舌 蜂房 岗梅根 四季青 广升麻
0.960971 0.524608 0.605183 0.360879 0.343012 0.327369 0.538229 0.442043 0.43862 0.372882 0.39984 0.389245
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
307. 
patient tongue id: 02191234446620_2_6
label yaofang:
甘草 黄芪 酸枣仁 熟地黄 黄柏 青蒿 天麻 胡黄连 鳖甲 白花蛇舌草 首乌藤 蜈蚣 天山雪莲 半枝莲 龟甲
0.997496 0.592512 0.696348 0.357975 0.409356 0.320947 0.358006 0.710386 0.651848 0.638956 0.570585 0.614924 0.600043
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
308. 
patient tongue id: 05042017367785_1_2_6
label yaofang:
甘草 白芍 黄芪 丹参 郁金 白茅根 小蓟 砂仁 巴戟天 珍珠母 浮小麦 首乌藤 百合
0.300708 0.392808 0.364894 0.327538 0.351518 0.439298 0.613238 0.30131
predicted yaofang:
柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
309. 
patient tongue id: 05221928036165_1_4
label yaofang:
法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 首乌藤 威灵仙 炒紫苏子 蜜麻黄 醋五味子
0.466044 0.646551 0.409067 0.761763 0.35763 0.522772 0.362433 0.443378 0.444534 0.302202 0.355919 0.657089 0.710062 0.630963 0.711694 0.388531 0.836297 0.421857 0.503997 0.497745 0.596767
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.812500, error: 0.380952
310. 
patient tongue id: 04221852359868_1
label yaofang:
白芍 大枣 党参 太子参 黄芪 枸杞子 煅牡蛎 山萸肉 炙甘草 续断 沙苑子 麸炒白术 盐菟丝子 酒女贞子 煅龙骨
0.51299 0.766937 0.388173 0.859282 0.312145 0.554398 0.371484 0.484187 0.479268 0.341114 0.749948 0.796586 0.712371 0.810432 0.371835 0.936637 0.399765 0.52862 0.592388 0.704815
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.133333, error: 0.900000
311. 
patient tongue id: 05232038297382_1
label yaofang:
甘草 白芍 桃仁 党参 枸杞子 白术 熟地黄 杜仲 砂仁 菟丝子 巴戟天 桑寄生 鳖甲 鹿角霜 续断
0.50569 0.386187 0.357489 0.47146 0.377344 0.362897
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
312. 
patient tongue id: 03292019427799_7_2
label yaofang:
甘草 枳壳 黄芩 茯苓 半夏 薏苡仁 黄芪 白术 赤芍 浙贝母 杜仲 郁金 天麻 莪术 麦芽 紫苏叶 蜈蚣 合欢皮 蛇舌草
0.874716 0.465213 0.575164 0.363851 0.428032 0.300014
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.263158, error: 0.166667
313. 
patient tongue id: 03151920512881_6_7
label yaofang:
柴胡 白芍 香附 枳壳 木香 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.542461 0.309977 0.385336 0.477155 0.34905
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
314. 
patient tongue id: 04211329132597_1_4
label yaofang:
白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.573588 0.865112 0.376234 0.954342 0.358991 0.647588 0.379148 0.553369 0.512506 0.366815 0.876231 0.914883 0.817621 0.908098 0.364224 0.979188 0.458793 0.618455 0.615603 0.787715
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.812500, error: 0.350000
315. 
patient tongue id: 05222322306981_1
label yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.491812 0.710541 0.423748 0.788828 0.346681 0.4797 0.387796 0.447598 0.43211 0.329155 0.687976 0.732057 0.646681 0.735715 0.380169 0.884736 0.365203 0.488387 0.544498 0.647961
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.916667, error: 0.450000
316. 
patient tongue id: 06071915502816_6
label yaofang:
甘草 半夏 薏苡仁 黄芪 海螵蛸 牡丹皮 杜仲 郁金 山茱萸 淡豆豉 砂仁 麦芽 紫苏叶 蜈蚣 骨碎补 合欢皮 预知子 蛇舌草
0.517964 0.40864 0.403735 0.427031 0.351953
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.111111, error: 0.600000
317. 
patient tongue id: 04300902356201_4_7_1
label yaofang:
甘草 法半夏 薏苡仁 黄连 郁金 苍术 天麻 地骨皮 糯稻根 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 红豆杉
0.963441 0.310996 0.521493 0.594969 0.366266 0.467116 0.395112 0.406923 0.328334 0.349746 0.324661
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
318. 
patient tongue id: 04251949592243_1_2
label yaofang:
桂枝 白芍 当归 茯苓 龙骨 牡蛎 牛蒡子 党参 黄芪 白术 炙甘草 辛夷
0.350315 0.362718 0.360717 0.319062 0.364089 0.531946 0.30314
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
319. 
patient tongue id: 02190509071895_6_4
label yaofang:
甘草 柴胡 白芍 茯苓 桃仁 丹参 青皮 牡丹皮 乌药 郁金 山茱萸 地黄 王不留行
0.976032 0.307351 0.552018 0.61255 0.359621 0.32988 0.324273 0.537619 0.490091 0.448516 0.433332 0.438219 0.410325
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
320. 
patient tongue id: 01041628059255_2_7
label yaofang:
甘草 防风 丹参 生地黄 牡丹皮 乌梅 紫草 莪术 珍珠母 白鲜皮 百合 紫苏叶 土茯苓 徐长卿
0.321235 0.362617 0.419861 0.392204 0.476191
predicted yaofang:
甘草 白芍 党参 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
321. 
patient tongue id: 02161933236938_4
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.351251 0.307947 0.410891 0.309099 0.414732 0.36176 0.409613 0.538751
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.363636, error: 0.500000
322. 
patient tongue id: 02212035224695_6_2_7
label yaofang:
甘草 茯苓 白术 酸枣仁 生地黄 牛膝 厚朴 天麻 肉苁蓉 桑寄生 火麻仁 首乌藤 乌梢蛇
0.98704 0.558847 0.646443 0.364074 0.385989 0.313924 0.362618 0.630441 0.582446 0.543742 0.501299 0.534431 0.509955
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.461538, error: 0.538462
323. 
patient tongue id: 02201759292386_4
label yaofang:
麻黄 甘草 前胡 桔梗 半夏 防风 薄荷 荆芥穗 紫菀 百部 辛夷 紫苏梗 广藿香 苍耳子
0.474038 0.811257 0.350048 0.943192 0.42787 0.673176 0.439701 0.383105 0.344194 0.870965 0.915164 0.827638 0.911039 0.950857 0.517746 0.614337 0.544747 0.738464
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.388889, recall: 0.500000, error: 0.611111
324. 
patient tongue id: 06080153395109_2
label yaofang:
甘草 白芍 金银花 连翘 丹参 生地黄 栀子 牡丹皮 石膏 淡竹叶 广藿香 黄精 天山雪莲 木贼 有瓜石斛 谷精子
0.99498 0.588791 0.693323 0.338085 0.398745 0.305373 0.33482 0.682462 0.611909 0.570399 0.539842 0.574845 0.55605
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.187500, error: 0.769231
325. 
patient tongue id: 03090813078403_5
label yaofang:
甘草 白芍 陈皮 茯苓 木香 党参 白术 黄连 车前子 砂仁 扁豆花 粉葛 建曲 紫苏梗 广藿香
0.725797 0.44746 0.522644 0.379375 0.307878
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
326. 
patient tongue id: 05140844336070_1_2
label yaofang:
黄芩 法半夏 茯苓 桔梗 薏苡仁 桃仁 鱼腥草 远志 浙贝母 款冬花 紫菀 苇茎 苦杏仁 炙麻黄
0.965788 0.536388 0.608682 0.36362 0.328782 0.322075 0.520842 0.463889 0.450742 0.402952 0.420821 0.398067
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.071429, error: 0.916667
327. 
patient tongue id: 03021155034951_1_2
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.373623 0.310413 0.44834 0.314551
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.750000, recall: 0.250000, error: 0.250000
328. 
patient tongue id: 05221907441380_1
label yaofang:
柴胡 茯苓 桔梗 党参 黄芪 白术 酸枣仁 山药 砂仁 升麻 珍珠母 首乌藤 救必应
0.628508 0.41242 0.448348 0.438965 0.417847
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
329. 
patient tongue id: 06182337195418_6_1
label yaofang:
甘草 法半夏 蒲公英 党参 白术 海螵蛸 砂仁 麦芽 紫苏梗 广藿香 麸炒枳壳 火炭母 救必应
0.93385 0.302152 0.523325 0.578056 0.36993 0.314841 0.314764 0.474998 0.418509 0.404108 0.35828 0.367318 0.339487
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
330. 
patient tongue id: 02201812563960_7_4
label yaofang:
甘草 白芍 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 炒僵蚕
0.434202 0.593746 0.427735 0.716909 0.378099 0.507919 0.342164 0.412478 0.393541 0.336356 0.628755 0.659048 0.586935 0.664907 0.356424 0.753225 0.397229 0.469326 0.438094 0.553824
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.050000, recall: 0.071429, error: 0.950000
331. 
patient tongue id: 03091911345577_5_6
label yaofang:
甘草 柴胡 川芎 黄芩 法半夏 茯苓 桔梗 防风 党参 浙贝母 荆芥穗 贯众 大青叶
0.972139 0.537494 0.624652 0.363231 0.356201 0.326711 0.560446 0.484753 0.478108 0.409444 0.443341 0.431129
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
332. 
patient tongue id: 06082035338278_1_5
label yaofang:
甘草 半夏 白术 赤芍 海螵蛸 杜仲 牛膝 山茱萸 厚朴 荷叶 砂仁 僵蚕 续断 赭石 蜈蚣 预知子
0.635332 0.433183 0.392191 0.492634 0.543066 0.369915 0.332025
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.187500, error: 0.571429
333. 
patient tongue id: 03221342376926_9
label yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.465803 0.677399 0.410911 0.791055 0.344755 0.531777 0.35922 0.451451 0.446182 0.359925 0.680309 0.73229 0.643074 0.736022 0.346385 0.872037 0.403128 0.51032 0.491661 0.611847
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.923077, error: 0.400000
334. 
patient tongue id: 04112157047370_7_6
label yaofang:
黄芩 茯苓 栀子 杜仲 牛膝 钩藤 石菖蒲 泽泻 天麻 石决明 桑寄生 益母草 蝉蜕 首乌藤
0.559067 0.360091 0.37974 0.487689 0.37347
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
335. 
patient tongue id: 02181608237552_5_1
label yaofang:
甘草 当归 茯苓 防风 薏苡仁 蒲公英 枸杞子 郁金 山药 砂仁 巴戟天 芡实 莲子 珍珠母 蝉蜕 苦参 首乌藤 土茯苓 蛇舌草 亚麻子
0.746839 0.441206 0.454925 0.392065 0.492899
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.100000, error: 0.600000
336. 
patient tongue id: 04131855379532_4
label yaofang:
甘草 橘红 葶苈子 黄芪 枸杞子 枳实 胆南星 浙贝母 附子 郁金 山茱萸 生半夏 全蝎 僵蚕 柿蒂 天竺黄 黑枣 土鳖虫
0.479065 0.381373 0.369932 0.534733 0.504587 0.347709 0.305195
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.111111, error: 0.714286
337. 
patient tongue id: 06012111194177_5
label yaofang:
甘草 半夏 薏苡仁 黄芪 白术 海螵蛸 郁金 蒲黄 厚朴 莪术 败酱草 麦芽 赭石 紫苏叶 蜈蚣 合欢皮 预知子 蛇舌草
0.883309 0.450631 0.519713 0.450148 0.573032 0.323717 0.300785 0.389288
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 蜈蚣

------Score: precision: 0.625000, recall: 0.277778, error: 0.375000
338. 
patient tongue id: 04071931382525_1_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香 苍耳子
0.629966 0.410344 0.388679 0.378786 0.629423 0.690298 0.317825 0.497178 0.412531 0.304273 0.436237 0.32845 0.305571
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 莪术 北沙参 合欢皮 蛇舌草

------Score: precision: 0.076923, recall: 0.066667, error: 0.923077
339. 
patient tongue id: 01100656247044_5
label yaofang:
白芍 麦冬 太子参 酸枣仁 丹参 五味子 鳖甲 玉米须
0.337028 0.355318 0.365086 0.361661
predicted yaofang:
甘草 茯苓 党参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
340. 
patient tongue id: 01122323557946_1_5_7
label yaofang:
甘草 白芍 党参 黄芪 黄连 赤芍 石膏 山药 山茱萸 益母草 佛手 首乌藤 合欢花
0.958288 0.534957 0.570174 0.360168 0.437618 0.382742 0.390823 0.310577 0.315222
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.222222, recall: 0.153846, error: 0.777778
341. 
patient tongue id: 03041420346568_8_5
label yaofang:
甘草 防风 金银花 远志 白术 黄连 生地黄 红花 桑白皮 水牛角 荆芥穗 火麻仁 白鲜皮 首乌藤 地肤子 土茯苓 蛇蜕
0.802886 0.428962 0.530535 0.309584 0.300702
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.117647, error: 0.600000
342. 
patient tongue id: 04122133579679_6_4
label yaofang:
甘草 香附 茯苓 薏苡仁 党参 郁金 天麻 鳖甲 扁豆花 莪术 浮小麦 蜈蚣 白花蛇舌 天山雪莲
0.983146 0.54058 0.650749 0.419668 0.335584 0.530109 0.479263 0.525879 0.401302 0.457723 0.48398
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
343. 
patient tongue id: 04210740217461_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.606113 0.315419 0.402413 0.477267 0.320472
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
344. 
patient tongue id: 05242127045970_5_1_2
label yaofang:
甘草 连翘 薏苡仁 蒲公英 党参 生地黄 红花 天麻 鳖甲 蜈蚣 白花蛇舌 半枝莲 红豆杉 制天南星
0.957992 0.542666 0.59406 0.379086 0.308995 0.327663 0.490698 0.474614 0.449863 0.405718 0.419488 0.384291
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
345. 
patient tongue id: 01040251058404_7_6_5
label yaofang:
甘草 薏苡仁 党参 白术 延胡索 细辛 天麻 鳖甲 补骨脂 三棱 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.988506 0.557323 0.652593 0.355632 0.395019 0.31625 0.361694 0.635503 0.577535 0.546048 0.511009 0.544897 0.523037
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
346. 
patient tongue id: 04122036094221_1_4_9
label yaofang:
甘草 茯苓 远志 党参 白术 厚朴 天麻 肉苁蓉 鳖甲 火麻仁 首乌藤 蜈蚣 天山雪莲 半枝莲 红豆杉
0.955354 0.521948 0.598 0.365624 0.336541 0.313091 0.52075 0.427164 0.425215 0.344179 0.375007 0.362878
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
347. 
patient tongue id: 03081758252928_1_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.387986 0.350863 0.429941
predicted yaofang:
茯苓 黄芪 炙甘草

------Score: precision: 0.666667, recall: 0.142857, error: 0.333333
348. 
patient tongue id: 06031122312143_6_4
label yaofang:
甘草 白芍 法半夏 茯苓 桔梗 浙贝母 桑白皮 天麻 鳖甲 款冬花 地龙 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.895443 0.479642 0.569764 0.385587 0.381824 0.323111
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
349. 
patient tongue id: 01140801547976_6_2
label yaofang:
甘草 柴胡 白芍 茯苓 桃仁 党参 白术 生地黄 栀子 牡丹皮 黄柏 菟丝子 益母草 合欢花 墨旱莲
0.968197 0.536918 0.613934 0.358668 0.349546 0.314245 0.550857 0.459945 0.442921 0.38914 0.41719 0.402048
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
350. 
patient tongue id: 01122218311736_1_2_6
label yaofang:
甘草 党参 鸡血藤 白术 酸枣仁 生地黄 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 乌梢蛇
0.99568 0.587485 0.680162 0.340524 0.378706 0.346445 0.669999 0.613453 0.572882 0.527961 0.562681 0.5287
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.625000, error: 0.166667
351. 
patient tongue id: 03311632574360_1_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 鹿衔草
0.357516 0.48104 0.36186 0.358549 0.334177 0.316093 0.316845 0.362747 0.615071 0.691857 0.31688
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.545455, recall: 0.545455, error: 0.454545
352. 
patient tongue id: 02231824390438_2
label yaofang:
川芎 茯苓 防风 黄芪 郁金 钩藤 白芷 石决明 北柴胡 炙甘草 首乌藤 威灵仙 炒蔓荆子 棉萆薢
0.496934 0.75859 0.379827 0.9026 0.384122 0.646941 0.340694 0.497777 0.461936 0.388602 0.802861 0.854728 0.74448 0.847751 0.345155 0.936825 0.492527 0.595423 0.537199 0.699482
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.285714, error: 0.800000
353. 
patient tongue id: 04112050024644_7_1
label yaofang:
甘草 蒲公英 紫花地丁 党参 赤芍 浙贝母 车前子 天麻 益母草 鳖甲 鹿角霜 蜈蚣 天山雪莲 半枝莲
0.977913 0.548402 0.621449 0.366429 0.334969 0.322451 0.536763 0.482983 0.462419 0.417913 0.439074 0.417482
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
354. 
patient tongue id: 01172242599197_4_6
label yaofang:
甘草 茯苓 桔梗 玄参 生地黄 浙贝母 牡丹皮 黄柏 知母 山药 山茱萸 泽泻 天花粉
0.988771 0.570608 0.624611 0.360349 0.357787 0.30293 0.336598 0.581994 0.544254 0.506093 0.477641 0.491545 0.454219
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.307692, error: 0.692308
355. 
patient tongue id: 04241831590206_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗
0.370939 0.486476 0.403901 0.342596 0.305637 0.339011 0.314135 0.400149 0.665476 0.727589 0.311061
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.545455, recall: 0.545455, error: 0.454545
356. 
patient tongue id: 03231120386377_5_1
label yaofang:
甘草 柴胡 白芍 薏苡仁 白术 黄柏 郁金 苍术 山药 车前子 荆芥穗 鳖甲 白花蛇舌草 蜈蚣 天山雪莲 红豆杉
0.946312 0.328914 0.519168 0.574307 0.384454 0.308482 0.458292 0.423322 0.434898 0.364595 0.377687 0.358439
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
357. 
patient tongue id: 01061927329459_4
label yaofang:
桂枝 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.356717 0.339889 0.386927 0.444947 0.323112 0.329308 0.346457 0.456042
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 黄芪 北沙参 炙甘草

------Score: precision: 0.625000, recall: 0.312500, error: 0.375000
358. 
patient tongue id: 04130856592193_6_2
label yaofang:
甘草 川芎 陈皮 法半夏 茯苓 白术 牛膝 天麻 僵蚕 桑寄生 补骨脂 地龙 蒺藜 首乌藤
0.972756 0.538536 0.62763 0.342435 0.358752 0.3332 0.575601 0.488051 0.43845 0.413159 0.437967 0.413936
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
359. 
patient tongue id: 04072032195649_1_2_6
label yaofang:
甘草 龙齿 黄芪 白术 厚朴 莪术 鸡内金 莲子 辛夷 首乌藤 合欢皮
0.408933 0.555139 0.440267 0.600655 0.313558 0.4025 0.326818 0.370921 0.345767 0.526938 0.548379 0.478586 0.548245 0.347357 0.73116 0.321064 0.383606 0.359537 0.475314
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.052632, recall: 0.090909, error: 0.947368
360. 
patient tongue id: 01042318203965_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.344708 0.330806 0.429748 0.315831 0.41586 0.363269 0.470378 0.524978
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
361. 
patient tongue id: 03222032126054_1_4_6
label yaofang:
甘草 茯苓 太子参 白术 五味子 海螵蛸 砂仁 僵蚕 糯稻根 枇杷叶 地龙 蜈蚣 木蝴蝶
0.806672 0.446817 0.552585 0.369634 0.323213
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
362. 
patient tongue id: 03081820015909_1_2_7
label yaofang:
甘草 茯苓 牡蛎 桃仁 党参 白术 丹参 砂仁 菟丝子 桑寄生 北沙参 橘核 土鳖虫 红豆杉 素馨花
0.417032 0.365653 0.379969 0.533814 0.372048 0.308195 0.301267
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.714286, recall: 0.333333, error: 0.285714
363. 
patient tongue id: 01121843155889_2
label yaofang:
法半夏 茯苓 前胡 防风 太子参 钩藤 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 威灵仙
0.435317 0.575235 0.420308 0.619518 0.317009 0.434489 0.375185 0.376272 0.383638 0.542025 0.566452 0.534071 0.601506 0.400611 0.719314 0.344648 0.41681 0.490242 0.5399
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.785714, error: 0.421053
364. 
patient tongue id: 03062124405515_1_4_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 砂仁 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲
0.981116 0.544065 0.659164 0.37795 0.316104 0.544181 0.49934 0.505682 0.431413 0.471659 0.462672
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
365. 
patient tongue id: 03012201489241_1_4_6
label yaofang:
甘草 茯苓 木香 薏苡仁 远志 党参 酸枣仁 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.97574 0.542415 0.619826 0.367843 0.337785 0.332345 0.552798 0.510702 0.480081 0.437505 0.45981 0.44072
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
366. 
patient tongue id: 02231907510580_4
label yaofang:
法半夏 前胡 桔梗 麦冬 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.439404 0.529352 0.442718 0.586663 0.344109 0.44467 0.374308 0.392365 0.3838 0.334233 0.516797 0.544962 0.507926 0.55569 0.404261 0.682063 0.362626 0.427589 0.420305 0.495223
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
367. 
patient tongue id: 03291353549746_1_7
label yaofang:
甘草 川芎 黄芪 鸡血藤 酸枣仁 生地黄 红花 杜仲 牛膝 山药 桑叶 天麻 桑寄生 地龙 浮小麦 灯盏细辛
0.982054 0.557315 0.627099 0.36611 0.355267 0.343538 0.572114 0.533372 0.512597 0.473197 0.492895 0.472986
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
368. 
patient tongue id: 03221946399570_2_6
label yaofang:
甘草 柴胡 白芍 党参 杜仲 山药 天麻 桑寄生 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.802077 0.339015 0.449782 0.534023 0.390786 0.304712
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
369. 
patient tongue id: 03012312250329_4_1
label yaofang:
桂枝 甘草 白芍 法半夏 茯苓 桃仁 鸡血藤 白术 酸枣仁 红花 赤芍 吴茱萸 麦芽 地龙
0.88976 0.346907 0.491418 0.547762 0.371604 0.368976 0.31161 0.334026
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
370. 
patient tongue id: 05092135201662_2_1
label yaofang:
甘草 茯苓 桔梗 薏苡仁 浙贝母 细辛 白芷 蔓荆子 白花蛇舌草 辛夷 广藿香 炒苍耳子 蜂房 醋鳖甲
0.880611 0.305427 0.472384 0.565285 0.368245 0.393871
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
371. 
patient tongue id: 04232010139991_3
label yaofang:
桂枝 甘草 党参 太子参 黄芪 附子 珍珠母
0.847308 0.458472 0.536392 0.325027 0.437414 0.330267 0.345267
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.428571, error: 0.571429
372. 
patient tongue id: 04300917010231_2_4
label yaofang:
甘草 茯苓 党参 白术 熟附子 杜仲 乌药 山茱萸 泽泻 车前子 天麻 补骨脂 桑螵蛸 地龙 益智 泽兰
0.690958 0.438836 0.494576 0.329027
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 1.000000, recall: 0.250000, error: 0.000000
373. 
patient tongue id: 06190819235998_1_4_6
label yaofang:
甘草 枳壳 薏苡仁 远志 党参 黄芪 白术 厚朴 天麻 肉苁蓉 鳖甲 桑螵蛸 蜈蚣 天山雪莲 半枝莲 红豆杉
0.975238 0.544808 0.610871 0.377786 0.366875 0.313226 0.333474 0.562408 0.508104 0.480262 0.440406 0.465966 0.443025
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
374. 
patient tongue id: 01092335072380_4
label yaofang:
桂枝 白芍 大枣 玉竹 炙甘草
0.649969 0.353566 0.416625 0.478409 0.392908
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.200000, error: 0.800000
375. 
patient tongue id: 04182155278057_5
label yaofang:
甘草 法半夏 桔梗 金银花 连翘 桃仁 紫花地丁 党参 丹参 浙贝母 郁金 夏枯草 皂角刺
0.926753 0.310225 0.514184 0.578521 0.375409 0.304411 0.303577 0.453894 0.388475 0.39716 0.324529 0.343051 0.334084
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.153846, error: 0.846154
376. 
patient tongue id: 04112102100143_1_6_3
label yaofang:
桂枝 白芍 当归 牡蛎 黄芪 白术 五味子 砂仁 糯稻根 北沙参 炙甘草 黑枣
0.526008 0.371045 0.314638 0.346484 0.647479 0.629024 0.483782 0.344405 0.309532 0.409677
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.400000, recall: 0.333333, error: 0.600000
377. 
patient tongue id: 04272321156884_1_7
label yaofang:
白芍 川芎 当归 防风 丹参 钩藤 荆芥穗 天麻 白芷 石决明 炙甘草 首乌藤 广藿香 炒蔓荆子 棉萆薢
0.52575 0.775571 0.404442 0.866582 0.334095 0.54727 0.386079 0.492972 0.475458 0.354621 0.757852 0.806905 0.709772 0.808726 0.375006 0.939498 0.408752 0.544946 0.581795 0.70963
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.266667, error: 0.800000
378. 
patient tongue id: 03282204574308_2_4
label yaofang:
甘草 黄芩 法半夏 茯苓 桃仁 远志 党参 浙贝母 山药 厚朴 紫菀 地龙 苦杏仁 紫苏子 鹿角霜 蜜麻黄
0.87851 0.47195 0.562675 0.368499 0.402538
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
379. 
patient tongue id: 01070839045705_1_4_2
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.480805 0.368343 0.452899 0.417653 0.33087
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
380. 
patient tongue id: 02141929017554_2
label yaofang:
白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.527734 0.817876 0.357322 0.947546 0.388734 0.669468 0.325525 0.5028 0.47861 0.371494 0.87039 0.909 0.818417 0.908019 0.333577 0.960628 0.500912 0.628487 0.575277 0.767894
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
381. 
patient tongue id: 02211842432388_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.37323 0.491036 0.401794 0.37781 0.318874 0.338513 0.381014 0.644549 0.686981
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 干姜 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
382. 
patient tongue id: 02142201304449_6
label yaofang:
甘草 党参 酸枣仁 牡丹皮 郁金 山药 天麻 鳖甲 扁豆花 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.996119 0.590291 0.699724 0.33315 0.407741 0.319829 0.66245 0.597806 0.546175 0.500326 0.547306 0.525081
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
383. 
patient tongue id: 01182056546495_6_4
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 黄芪 白术 竹茹 郁金 石菖蒲 桑螵蛸 益智 广升麻
0.98668 0.565455 0.635448 0.359227 0.381546 0.323451 0.357428 0.615301 0.570749 0.530273 0.506074 0.526958 0.500314
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
384. 
patient tongue id: 06080319044546_2
label yaofang:
甘草 白芍 党参 黄芪 牡丹皮 地黄 益母草 白花蛇舌草 麦芽 板蓝根 制何首乌 酒女贞子 墨旱莲 酒黄精
0.958377 0.311103 0.519288 0.613801 0.378586 0.334432 0.511664 0.435947 0.444396 0.364872 0.406111 0.401394
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
385. 
patient tongue id: 01110256056809_3
label yaofang:
桂枝 白芍 大枣 龙骨 牡蛎 炙甘草
0.531774 0.411474 0.411316 0.417157 0.485589
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
386. 
patient tongue id: 04210646332134_4_5
label yaofang:
甘草 法半夏 茯苓 前胡 连翘 牛蒡子 薏苡仁 浙贝母 桑白皮 莱菔子 款冬花 苇茎 苦杏仁 紫苏子
0.942613 0.521878 0.537464 0.350551 0.385198 0.314067 0.357495
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
387. 
patient tongue id: 06181845156965_1_5
label yaofang:
甘草 川芎 茯苓 党参 白术 赤芍 杜仲 牛膝 山药 钩藤 天麻 防己 桑寄生 决明子 粉葛 首乌藤
0.905464 0.478858 0.568471 0.412338 0.379043 0.360355
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.312500, error: 0.166667
388. 
patient tongue id: 05161917057692_4
label yaofang:
麻黄 茯苓 葛根 前胡 桔梗 半夏 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 苍耳子
0.501528 0.769352 0.398187 0.893072 0.369025 0.607145 0.350013 0.492281 0.461189 0.35802 0.790285 0.839076 0.739142 0.833119 0.363293 0.938232 0.460378 0.56929 0.543501 0.70738
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.666667, error: 0.500000
389. 
patient tongue id: 01211220485390_1
label yaofang:
茯苓 太子参 山药 钩藤 鸡内金 麦芽 蝉蜕 独脚金 稻芽 芒果核
0.484427 0.39674 0.415041 0.358124 0.381304
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
390. 
patient tongue id: 01211259013885_6_1
label yaofang:
柴胡 白芍 当归 茯苓 薄荷 白术 秦艽 炙甘草 嫩桑枝 丝瓜络 威灵仙
0.447979 0.367586 0.417734 0.358514 0.321678
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.272727, error: 0.400000
391. 
patient tongue id: 04121924134246_5_7
label yaofang:
甘草 独活 薏苡仁 杜仲 苍术 厚朴 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.888587 0.487279 0.544271 0.452447 0.321923 0.369691
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
392. 
patient tongue id: 02131312038334_1_7_4
label yaofang:
桂枝 葛根 桃仁 延胡索 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草
0.89631 0.323155 0.474243 0.572891 0.349493 0.392807
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
393. 
patient tongue id: 03291415175204_1_6
label yaofang:
甘草 白芍 防风 金银花 党参 白术 生地黄 红花 牡丹皮 水牛角 荆芥穗 白鲜皮 浮小麦 地肤子 合欢花
0.889799 0.322928 0.489187 0.545997 0.367108 0.377141 0.313914
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
394. 
patient tongue id: 04132019213277_1_7_6
label yaofang:
甘草 柴胡 白芍 黄芪 何首乌 丹参 枳实 郁金 小蓟 砂仁 珍珠母 浮小麦 首乌藤 百合
0.528495 0.395206 0.437048 0.385527 0.465112
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
395. 
patient tongue id: 01032224476237_5_2
label yaofang:
柴胡 白芍 黄芩 枳实 石膏 杏仁 细辛 干姜 大黄 生地 滑石 川朴 法夏
0.885138 0.328025 0.472186 0.55212 0.398006 0.365273 0.313391 0.346915
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
396. 
patient tongue id: 01050639076824_1_7_2
label yaofang:
甘草 赤芍 杜仲 山药 山茱萸 天麻 桑寄生 鳖甲 桑螵蛸 蜈蚣 天山雪莲 半枝莲 骨碎补 土鳖虫 牛大力
0.936539 0.501405 0.598591 0.350002 0.311849 0.484685 0.352787 0.363872 0.301429
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.555556, recall: 0.333333, error: 0.444444
397. 
patient tongue id: 05260618214147_4_7_6
label yaofang:
甘草 茯苓 桃仁 党参 白术 酸枣仁 红花 天麻 鳖甲 益智 辛夷 沙苑子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.496843 0.420034 0.39054 0.31516
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.750000, recall: 0.187500, error: 0.250000
398. 
patient tongue id: 05191953220086_1_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 郁金 山药 石菖蒲 天麻 鳖甲 扁豆花 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.978846 0.551149 0.630912 0.362854 0.354954 0.333348 0.570675 0.508996 0.492787 0.445773 0.468737 0.451091
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.800000, error: 0.000000
399. 
patient tongue id: 01070839503393_1_2_6
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志 黄精
0.482385 0.438487 0.336492 0.411594 0.334283 0.33378
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
400. 
patient tongue id: 03311657470159_1_6
label yaofang:
甘草 白芍 川芎 独活 牛蒡子 牛膝 细辛 干姜 蜈蚣 姜黄 海桐皮 鹿衔草
0.364675 0.37385 0.310685 0.407995 0.369682 0.326268 0.452855
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
401. 
patient tongue id: 05092118240753_3_4
label yaofang:
甘草 香附 法半夏 茯苓 党参 丹参 黄连 熟附子 红花 郁金 车前子 瓜蒌皮 莪术 鹿角霜 玉米须
0.974323 0.546872 0.622836 0.355364 0.329023 0.319597 0.53168 0.471319 0.449003 0.398836 0.420288 0.395105
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
402. 
patient tongue id: 05242130540310_2_5
label yaofang:
甘草 茯苓 桔梗 芦根 牛蒡子 太子参 白术 浙贝母 乌梅 天花粉 鳖甲 白花蛇舌 蜂房 四季青
0.978018 0.536701 0.642852 0.352482 0.354214 0.329272 0.581551 0.512234 0.484551 0.443566 0.470529 0.446503
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
403. 
patient tongue id: 03081829166099_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.469847 0.643616 0.415989 0.730197 0.323999 0.49677 0.369951 0.426199 0.421493 0.331768 0.637432 0.667736 0.613281 0.69745 0.385267 0.830068 0.381646 0.471902 0.525465 0.605675
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
404. 
patient tongue id: 02221233493656_1_3_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.444985 0.327581 0.454203 0.391457
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 1.000000, recall: 0.307692, error: 0.000000
405. 
patient tongue id: 05290820294519_4_6
label yaofang:
甘草 茯苓 薏苡仁 党参 杜仲 山药 天麻 菟丝子 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.976647 0.552809 0.618034 0.357312 0.338214 0.325149 0.54554 0.481441 0.452859 0.42457 0.435338 0.410225
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
406. 
patient tongue id: 01201949464024_3_5_7
label yaofang:
甘草 白芍 薏苡仁 熟附子 郁金 大腹皮 干姜 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 川木瓜 土鳖虫
0.99075 0.567506 0.62203 0.326481 0.317347 0.31971 0.582578 0.517403 0.505339 0.423944 0.450006 0.404024
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
407. 
patient tongue id: 05232027526791_2_1_5
label yaofang:
甘草 柴胡 半夏 蒲公英 党参 枸杞子 白术 厚朴 淡豆豉 砂仁 柿蒂 北沙参 赭石 合欢皮 预知子 鸡骨草
0.445755 0.399695 0.393356 0.56246 0.548925 0.3857 0.322948 0.471504
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.750000, recall: 0.375000, error: 0.250000
408. 
patient tongue id: 01032055340919_4
label yaofang:
甘草 川芎 茯苓 枸杞子 丹参 杜仲 牛膝 泽泻 天麻 防己 益母草 天山雪莲 吉利
0.94613 0.517886 0.58215 0.377295 0.305823 0.32003 0.475577 0.417752 0.418824 0.347237 0.362021 0.334573
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
409. 
patient tongue id: 03302021437010_2_1_4
label yaofang:
甘草 牛蒡子 桃仁 麦冬 枸杞子 玄参 山茱萸 生半夏 砂仁 僵蚕 莪术 北沙参 赭石 辛夷 紫苏叶 蜈蚣 木蝴蝶 土鳖虫 岗梅
0.493634 0.40412 0.386658 0.463045 0.478827 0.31061
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.166667, recall: 0.052632, error: 0.833333
410. 
patient tongue id: 03232310047761_3_4
label yaofang:
甘草 白芍 薏苡仁 党参 熟附子 肉桂 山药 山茱萸 车前子 大腹皮 猪苓 鳖甲 补骨脂 莪术 白花蛇舌 红豆杉
0.950331 0.520303 0.594634 0.37714 0.347277 0.330443 0.511954 0.445377 0.431776 0.378473 0.407202 0.395393
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
411. 
patient tongue id: 04142232323334_1_4
label yaofang:
桂枝 甘草 茯苓 党参 黄芪 白术 熟附子 泽泻 天麻 鳖甲 败酱草 建曲 蜈蚣 天山雪莲 半枝莲
0.924866 0.512302 0.565465 0.35705 0.410763 0.316021 0.336391
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 1.000000, recall: 0.466667, error: 0.000000
412. 
patient tongue id: 01182125572738_2_4_6
label yaofang:
甘草 枳壳 茯苓 连翘 党参 白术 浙贝母 郁金 山药 砂仁 鳖甲 火麻仁 鸡内金 苦杏仁 白花蛇舌 天山雪莲
0.976232 0.541164 0.613838 0.341122 0.342101 0.328307 0.564022 0.496163 0.460782 0.430457 0.449311 0.423655
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
413. 
patient tongue id: 04241924565699_5
label yaofang:
金银花 薏苡仁 枸杞子 赤小豆 野菊花 火麻仁 茵陈 夏枯草 四季青 木棉花
0.479788 0.37829 0.453682 0.409006 0.430665
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
414. 
patient tongue id: 04252311414224_6_4
label yaofang:
甘草 陈皮 黄芩 茯苓 前胡 桃仁 远志 细辛 款冬花 白前 苦杏仁 紫苏子 炙麻黄
0.940906 0.535268 0.545861 0.316069 0.409693 0.322948 0.310114
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
415. 
patient tongue id: 03291953364807_5_2_7
label yaofang:
甘草 桃仁 丹参 赤芍 牡丹皮 厚朴 射干 柿蒂 北沙参 苦杏仁 赭石 木蝴蝶 山豆根 岗梅
0.798268 0.434528 0.55455 0.337686 0.376316 0.374868
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
416. 
patient tongue id: 01190643310777_2_6
label yaofang:
甘草 柴胡 白芍 川芎 茯苓 酸枣仁 生地黄 牛膝 山药 山茱萸 细辛 天麻 全蝎 菟丝子 桑寄生 益母草
0.938568 0.356475 0.491346 0.564823 0.369092 0.370227 0.304786 0.351339
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
417. 
patient tongue id: 02151324327011_4_1
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子
0.41483 0.301386 0.418845 0.468963 0.400898 0.451877 0.40426 0.439402 0.359596 0.404867 0.455853 0.392206 0.40546 0.412998 0.446793
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.133333, recall: 0.181818, error: 0.866667
418. 
patient tongue id: 03302010244226_5
label yaofang:
甘草 枳壳 薏苡仁 桃仁 蒲公英 赤芍 牡丹皮 厚朴 石韦 北沙参 蜈蚣 土鳖虫 蛇舌草 冬凌草 鸭脚艾
0.618597 0.41559 0.504042 0.333837 0.3072 0.335623
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.166667, recall: 0.066667, error: 0.833333
419. 
patient tongue id: 04142013564760_6_5_1
label yaofang:
甘草 川芎 荆芥 牛膝 细辛 天麻 白芷 火麻仁 白花蛇舌草 麦芽 制何首乌 地肤子 蜈蚣 醋鳖甲
0.989663 0.559736 0.667112 0.362408 0.371672 0.345914 0.624208 0.563163 0.543377 0.493397 0.529753 0.516329
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
420. 
patient tongue id: 01190636595638_1_2_6
label yaofang:
甘草 白芍 太子参 何首乌 白术 酸枣仁 牡丹皮 天麻 鳖甲 火麻仁 续断 沙苑子 蜈蚣 白花蛇舌 天山雪莲 乌梢蛇
0.992769 0.562861 0.658424 0.366503 0.373004 0.310778 0.351236 0.652194 0.614868 0.582246 0.52806 0.564728 0.549654
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
421. 
patient tongue id: 05270749486627_1_4
label yaofang:
黄芪 仙鹤草 菟丝子 升麻 淫羊藿 鸡内金 虎杖 莲子 白花蛇舌草 麸炒白术 炙黄芪 炒稻芽 炒麦芽 穿山龙
0.520048 0.349863 0.435205 0.491292 0.427284 0.478557 0.428295 0.427101 0.354499 0.39674 0.42317 0.443015 0.392355 0.431405 0.432458 0.440215
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.062500, recall: 0.071429, error: 0.937500
422. 
patient tongue id: 05162139537286_1_2_4
label yaofang:
甘草 玉竹 太子参 灯心草 天麻 鳖甲 茵陈 扁豆花 麦芽 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.967869 0.302901 0.539045 0.613731 0.351109 0.321547 0.308768 0.525241 0.450825 0.419667 0.381026 0.399945 0.375799
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
423. 
patient tongue id: 06140811569035_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.407998 0.315084 0.480336 0.444216 0.464308 0.503519 0.45598 0.471079 0.448518 0.452351 0.480154 0.519945 0.314138 0.52787 0.538947 0.560717
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.250000, error: 0.812500
424. 
patient tongue id: 03171338007660_2
label yaofang:
甘草 茯苓 葛根 防风 麦冬 玄参 牡丹皮 荷叶 白芷 北沙参 百合 广藿香 炒六神曲 布渣叶 干石斛 荆芥炭
0.530135 0.821113 0.387164 0.904582 0.347081 0.579357 0.380068 0.507184 0.486318 0.336086 0.809187 0.857615 0.756811 0.855428 0.370316 0.961303 0.409019 0.563731 0.599315 0.755432
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.312500, error: 0.750000
425. 
patient tongue id: 01062340548391_1_4_7
label yaofang:
黄芩 金银花 牛蒡子 蒲公英 麦冬 细辛 山楂 蔓荆子 鸡内金 干鱼腥草 苍耳子 炒六神曲
0.543443 0.322468 0.455887 0.375816 0.313489
predicted yaofang:
甘草 法半夏 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
426. 
patient tongue id: 02260515162255_6_2
label yaofang:
甘草 党参 白术 杜仲 砂仁 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.980583 0.55466 0.626297 0.367921 0.34928 0.326805 0.55881 0.50789 0.496703 0.435119 0.467404 0.445787
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
427. 
patient tongue id: 01051856300945_4
label yaofang:
法半夏 前胡 防风 钩藤 白芷 款冬花 紫菀 白前 百部 豆蔻 炙甘草 辛夷 广藿香 威灵仙 炒紫苏子 蜜麻黄
0.522625 0.801373 0.352881 0.931959 0.408736 0.637321 0.356431 0.494072 0.479812 0.349397 0.857073 0.89368 0.812288 0.886377 0.364186 0.942206 0.469838 0.590315 0.574085 0.769377
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.812500, error: 0.350000
428. 
patient tongue id: 06022221214416_1_4_7
label yaofang:
党参 黄芪 枸杞子 白术 海螵蛸 杜仲 牛膝 山药 白茅根 泽泻 厚朴 巴戟天 紫苏叶 玉米须 蜈蚣 鲜龙葵果
0.651952 0.428011 0.451761 0.502586 0.539026 0.357246 0.301456 0.329007
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
429. 
patient tongue id: 03271408358225_1_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄
0.479311 0.677648 0.431319 0.733983 0.33358 0.4793 0.390957 0.446218 0.445327 0.342938 0.636276 0.677756 0.603066 0.686661 0.387397 0.853224 0.38069 0.480233 0.53155 0.616207
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
430. 
patient tongue id: 04141251098036_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.402304 0.633981 0.395682 0.745265 0.312991 0.501617 0.363493 0.319165 0.64809 0.688899 0.598596 0.699057 0.836695 0.370178 0.481166 0.355078 0.541081
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.866667, error: 0.235294
431. 
patient tongue id: 05162128599559_2_4
label yaofang:
甘草 当归 茯苓 生地黄 牡丹皮 杜仲 山药 山茱萸 仙鹤草 茜草 桑寄生 扁豆花 续断 鱼古
0.73056 0.425759 0.514001 0.327634 0.485993
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
432. 
patient tongue id: 03290714081600_3_2_6
label yaofang:
甘草 薏苡仁 党参 黄柏 乌药 厚朴 天麻 鳖甲 火麻仁 补骨脂 莪术 蜈蚣 白花蛇舌 红豆杉
0.511313 0.387333 0.374482 0.469607 0.356752 0.346415
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
433. 
patient tongue id: 05162056430383_2_6
label yaofang:
甘草 白芍 茯苓 党参 酸枣仁 生地黄 天麻 桑寄生 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.967979 0.542793 0.60372 0.375647 0.306181 0.310695 0.48892 0.452602 0.443942 0.395686 0.405856 0.382121
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
434. 
patient tongue id: 03171432118567_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.521617 0.784058 0.410624 0.851047 0.344 0.500804 0.407431 0.475985 0.475401 0.313533 0.751799 0.791695 0.713569 0.806427 0.39514 0.929665 0.364361 0.511505 0.623848 0.73169
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
435. 
patient tongue id: 02212006401213_1_2_6
label yaofang:
甘草 柴胡 白芍 茯苓 地黄 天麻 桑寄生 浮小麦 蜈蚣 合欢花 半枝莲 醋鳖甲 麸炒枳壳
0.908344 0.303183 0.485476 0.570523 0.332255 0.405245
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
436. 
patient tongue id: 05032320192138_1_5_6
label yaofang:
甘草 桔梗 金银花 芦根 牛蒡子 薏苡仁 浙贝母 天麻 天花粉 鳖甲 蜈蚣 天山雪莲 半枝莲 红豆杉
0.975271 0.533957 0.648325 0.40524 0.352922 0.318944 0.540432 0.450146 0.484239 0.360675 0.420793 0.434155
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
437. 
patient tongue id: 03302130480924_1_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 党参 浙贝母 莱菔子 天麻 莪术 紫菀 白花蛇舌草 蜈蚣 醋鳖甲
0.963278 0.537992 0.616561 0.394382 0.320176 0.313666 0.497285 0.471867 0.483153 0.404753 0.438579 0.433874
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
438. 
patient tongue id: 04071422593039_1_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.415223 0.526501 0.432291 0.566354 0.308987 0.419052 0.332562 0.331607 0.334812 0.484234 0.519216 0.462598 0.539349 0.38994 0.710132 0.358961 0.397537 0.360577 0.451761
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
439. 
patient tongue id: 04101916510584_1
label yaofang:
防风 太子参 黄芪 白术 细辛 白芷 炙甘草 辛夷 紫苏梗 广藿香 炒苍耳子
0.426718 0.453845 0.417737 0.488724 0.395865 0.329778 0.327576 0.313134 0.41439 0.459978 0.424239 0.494262 0.424255 0.700291 0.328594 0.367349 0.325815 0.411478
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 太子参 黄芪 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.333333, recall: 0.545455, error: 0.666667
440. 
patient tongue id: 03011059288122_6_4
label yaofang:
枳壳 桔梗 牛蒡子 党参 白术 海螵蛸 旋覆花 紫菀 百部 北沙参 炙甘草 紫苏梗 化橘红
0.401574 0.335901 0.439387 0.374605 0.35234
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
441. 
patient tongue id: 03231053473252_2_6
label yaofang:
甘草 茯苓 酸枣仁 生地黄 天麻 鳖甲 茵陈 扁豆花 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.946505 0.301745 0.515502 0.604909 0.387652 0.340971 0.329589 0.513026 0.471921 0.459366 0.40737 0.432884 0.423972
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
442. 
patient tongue id: 03302121431277_1_7
label yaofang:
甘草 川芎 法半夏 茯苓 桔梗 连翘 党参 黄芪 白术 浙贝母 山药 砂仁 莱菔子 天麻 麦芽 地龙
0.950832 0.306423 0.537948 0.577146 0.344137 0.313291 0.314279 0.494973 0.416868 0.391263 0.357108 0.359734 0.33213
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.375000, error: 0.538462
443. 
patient tongue id: 02231904414416_1_4
label yaofang:
茯苓 葛根 海螵蛸 干姜 佩兰 豆蔻 炙甘草 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炙黄芪 炒六神曲 甘松 干石斛
0.442909 0.62397 0.418177 0.746572 0.356891 0.535934 0.330193 0.427041 0.408544 0.347077 0.646043 0.693574 0.612974 0.698641 0.348519 0.816357 0.421825 0.4986 0.457569 0.581359
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.266667, error: 0.800000
444. 
patient tongue id: 05181825178638_6
label yaofang:
麦冬 酸枣仁 丹参 钩藤 灯心草 三七 煅牡蛎 煅龙骨 红景天 毛冬青
0.736939 0.303662 0.450822 0.502464 0.380007
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
445. 
patient tongue id: 03221309495509_1_2_6
label yaofang:
甘草 独活 党参 白术 酸枣仁 杜仲 山药 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.993154 0.573837 0.666611 0.336796 0.401922 0.314172 0.353652 0.671028 0.602408 0.565089 0.528926 0.563041 0.541907
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
446. 
patient tongue id: 03291351101751_1_6
label yaofang:
甘草 牡蛎 党参 白术 黄柏 郁金 山药 山茱萸 天麻 地骨皮 秦艽 白花蛇舌草 浮小麦 醋龟甲 蜈蚣 半枝莲 醋鳖甲
0.841144 0.308005 0.466289 0.56267 0.398021 0.355959 0.312816
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.294118, error: 0.285714
447. 
patient tongue id: 01040648125845_6_2
label yaofang:
甘草 香附 茯苓 龙骨 党参 太子参 酸枣仁 丹参 黄连 生地黄 乌药 益母草 麦芽 浮小麦
0.958552 0.517656 0.596502 0.334268 0.334076 0.311702 0.532543 0.409783 0.379454 0.337434 0.352752 0.33445
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
448. 
patient tongue id: 01201326209972_5_2
label yaofang:
甘草 黄芩 玄参 浙贝母 白茅根 地黄 茜草 天花粉 诃子 白花蛇舌草 辛夷 蜂房 岗梅根 醋鳖甲
0.922892 0.323175 0.50915 0.566205 0.371753 0.309256 0.310017 0.449625 0.386938 0.382492 0.32816 0.341131 0.323951
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.076923, recall: 0.071429, error: 0.923077
449. 
patient tongue id: 02191215541941_1_7
label yaofang:
甘草 川芎 党参 酸枣仁 生地黄 赤芍 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97526 0.543705 0.630659 0.383983 0.381387 0.316028 0.334364 0.587601 0.539974 0.528062 0.469884 0.507606 0.506601
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
450. 
patient tongue id: 05032303441320_5_7
label yaofang:
甘草 白芍 川芎 龙骨 天冬 杜仲 黄柏 牛膝 僵蚕 桑寄生 麦芽 地龙 赭石 首乌藤 醋鳖甲
0.964822 0.530469 0.622199 0.372766 0.322084 0.309402 0.518161 0.459185 0.462361 0.390241 0.419857 0.397653
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.066667, error: 0.916667
451. 
patient tongue id: 03012018245910_4
label yaofang:
甘草 法半夏 茯苓 前胡 防风 薄荷 荆芥穗 白芷 北柴胡 香薷 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子 炒六神曲
0.517775 0.74022 0.419552 0.831179 0.347721 0.520824 0.392081 0.468605 0.463193 0.347713 0.724467 0.761463 0.680376 0.778205 0.397451 0.91024 0.390911 0.521275 0.586902 0.695194
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.500000, error: 0.600000
452. 
patient tongue id: 05032225027079_1_6
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.383771 0.3313 0.323548 0.491416 0.67892
predicted yaofang:
白芍 党参 干姜 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
453. 
patient tongue id: 02122219175729_1_6
label yaofang:
甘草 荆芥 金银花 黄芪 白术 红花 天麻 白花蛇舌草 麦芽 苦参 白鲜皮 地肤子 蜈蚣 半枝莲 醋鳖甲
0.99363 0.571746 0.662924 0.343529 0.405862 0.328474 0.372184 0.672613 0.611064 0.572916 0.5381 0.569552 0.540184
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
454. 
patient tongue id: 04130648139042_2_6
label yaofang:
甘草 白芍 川芎 龙骨 牡蛎 酸枣仁 地黄 地骨皮 菟丝子 益母草 蒺藜 首乌藤 合欢花 酒女贞子 墨旱莲
0.987002 0.56683 0.645225 0.377867 0.374323 0.314075 0.349577 0.598448 0.552196 0.533769 0.48987 0.516476 0.501304
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.133333, error: 0.846154
455. 
patient tongue id: 04121948029325_1_4_2
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.45528 0.684595 0.357063 0.869601 0.369364 0.636276 0.425908 0.425193 0.347727 0.787234 0.841053 0.763115 0.853291 0.8716 0.495949 0.605347 0.532345 0.691011
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.866667, error: 0.277778
456. 
patient tongue id: 02131312386059_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.580729 0.411134 0.434387 0.409391 0.41288
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
457. 
patient tongue id: 05221919547156_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.53088 0.793264 0.401264 0.901746 0.371176 0.577604 0.382583 0.510623 0.480809 0.360388 0.801103 0.84796 0.740819 0.842498 0.364318 0.951509 0.427034 0.568824 0.565206 0.728634
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
458. 
patient tongue id: 03012006403838_4
label yaofang:
陈皮 法半夏 茯苓 党参 黄芪 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 炒六神曲 甘松
0.539635 0.780506 0.404783 0.891738 0.352371 0.551912 0.384007 0.489364 0.470224 0.355407 0.791569 0.83022 0.742599 0.84296 0.389153 0.930033 0.425578 0.553145 0.607115 0.724809
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.416667, error: 0.750000
459. 
patient tongue id: 03032020454767_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.532138 0.838773 0.389189 0.94306 0.368367 0.636821 0.35537 0.530089 0.482554 0.363423 0.861524 0.899898 0.794355 0.89376 0.335287 0.970296 0.45807 0.601057 0.579285 0.758961
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
460. 
patient tongue id: 06132027237493_1_4_6
label yaofang:
陈皮 前胡 半夏 荆芥 浙贝母 僵蚕 百部 苦杏仁 紫苏子 蝉蜕 紫苏叶 人参叶 紫苑
0.503549 0.384351 0.412805 0.480446 0.336375
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
461. 
patient tongue id: 05181820312126_3
label yaofang:
桔梗 半夏 荆芥 防风 牛蒡子 桑白皮 百部 苦杏仁 炙甘草 紫苑 芥子 青果 东风桔
0.767461 0.45202 0.451063 0.418428 0.52463 0.304283
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
462. 
patient tongue id: 05022047456811_1_2
label yaofang:
甘草 枳壳 茯苓 木香 党参 白术 酸枣仁 柏子仁 黄连 厚朴 桑寄生 火麻仁 浮小麦 合欢花 牛大力
0.820736 0.466521 0.525251 0.43672
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.266667, error: 0.000000
463. 
patient tongue id: 03151917074448_1_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.478187 0.348603 0.385317 0.444466 0.343885 0.354662
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
464. 
patient tongue id: 04061359408200_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.542654 0.815845 0.382939 0.920907 0.351526 0.591188 0.369568 0.508629 0.499844 0.35019 0.827199 0.869957 0.776166 0.873072 0.365542 0.961732 0.424958 0.578722 0.613273 0.754451
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
465. 
patient tongue id: 06010208339212_6_4_7
label yaofang:
甘草 法半夏 茯苓 党参 白术 砂仁 天麻 鳖甲 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.988724 0.560468 0.656202 0.379986 0.392988 0.314712 0.356564 0.631543 0.585563 0.565965 0.511152 0.553486 0.536413
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
466. 
patient tongue id: 02122233360852_6_1
label yaofang:
甘草 党参 丹参 知母 地黄 天麻 莪术 白花蛇舌草 浮小麦 首乌藤 蜈蚣 合欢花 半枝莲 醋鳖甲
0.942548 0.316276 0.518673 0.574626 0.386166 0.320923 0.310345 0.466328 0.420157 0.416591 0.36239 0.377418 0.361945
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
467. 
patient tongue id: 04112212203016_4_1
label yaofang:
甘草 柴胡 白芍 陈皮 枳壳 法半夏 茯苓 前胡 薏苡仁 党参 川楝子 乌药 山药 佛手
0.978198 0.553334 0.624884 0.387831 0.368829 0.312179 0.345729 0.572756 0.531039 0.522791 0.469482 0.499532 0.488929
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
468. 
patient tongue id: 04201426514805_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.345728 0.479483 0.410413 0.484956 0.496193 0.424712 0.466757 0.422299 0.44066 0.4795 0.49211 0.513697 0.509414 0.540019
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.214286, recall: 0.230769, error: 0.785714
469. 
patient tongue id: 06141844357697_6_2
label yaofang:
半夏 麦冬 黄芪 白术 浙贝母 杜仲 郁金 厚朴 僵蚕 桑寄生 莪术 柿蒂 北沙参 苦杏仁 辛夷 蜈蚣 合欢皮 预知子 岗梅
0.473097 0.38868 0.453413 0.386176 0.374475
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.105263, error: 0.600000
470. 
patient tongue id: 04271902046548_2
label yaofang:
茯苓 桔梗 防风 玉竹 太子参 黄芪 枸杞子 山药 细辛 白芷 芡实 北沙参 辛夷 炒苍耳子 人参叶
0.466095 0.646994 0.403867 0.753566 0.325939 0.505721 0.380974 0.436303 0.416966 0.323728 0.648454 0.692955 0.614995 0.70138 0.392833 0.846052 0.371502 0.478174 0.501278 0.602026
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.533333, error: 0.600000
471. 
patient tongue id: 04131750454167_1_6_4
label yaofang:
龙齿 黄芪 白术 海螵蛸 砂仁 桑寄生 鸡内金 北沙参 橘络 桑椹 首乌藤 红豆杉 合欢皮 稻芽
0.912324 0.492251 0.544825 0.465255 0.337991 0.409625
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
472. 
patient tongue id: 03291619029462_6_4
label yaofang:
甘草 独活 薏苡仁 酸枣仁 杜仲 天麻 菟丝子 秦艽 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.941964 0.48002 0.633825 0.328417 0.37613 0.30892 0.582794 0.411063 0.372281 0.318283 0.366118 0.362334
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
473. 
patient tongue id: 04131400541791_6_2
label yaofang:
甘草 茯苓 党参 酸枣仁 丹参 生地黄 牡丹皮 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.975533 0.553484 0.604992 0.371613 0.31853 0.306729 0.516501 0.483367 0.469833 0.417693 0.44632 0.41556
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
474. 
patient tongue id: 03170931326875_1_2_7
label yaofang:
甘草 枳壳 木香 太子参 丹参 黄连 海螵蛸 厚朴 鸡内金 草豆蔻 六神曲 五指毛桃
0.485386 0.386133 0.417923 0.490463 0.373847
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
475. 
patient tongue id: 05152113420975_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.32824 0.326298 0.306579 0.41174 0.340249 0.427853
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
476. 
patient tongue id: 05092058325703_2_4
label yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.481742 0.681953 0.425136 0.735618 0.324979 0.467741 0.391771 0.436614 0.44118 0.332007 0.64216 0.67514 0.613795 0.699198 0.385737 0.856837 0.362315 0.470385 0.567481 0.640136
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 1.000000, error: 0.400000
477. 
patient tongue id: 04061953289469_1_3
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.617721 0.4162 0.470354 0.383983
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
478. 
patient tongue id: 06190157216929_2_4
label yaofang:
甘草 法半夏 茯苓 桔梗 橘红 芦根 太子参 浙贝母 鳖甲 紫菀 苦杏仁 百合 白花蛇舌 蜂房 四季青
0.82152 0.320004 0.478456 0.502669 0.373189 0.306691
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
479. 
patient tongue id: 04202043006693_6_1
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 蝉蜕 炙甘草 百合 紫苏叶
0.326885 0.420797 0.32154 0.394061 0.345794 0.309906 0.317912 0.502966 0.581659
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
480. 
patient tongue id: 01110253175513_2_5
label yaofang:
桂枝 白芍 大枣 黄芪 炙甘草 土鳖虫 乌梢蛇
0.398912 0.336695 0.333892 0.435153 0.366253 0.381805
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
481. 
patient tongue id: 05182043239826_4
label yaofang:
麻黄 桂枝 白芍 法半夏 牛蒡子 五味子 浙贝母 细辛 干姜 款冬花 射干 紫菀 炙甘草
0.301632 0.314284 0.409606 0.39023 0.358002 0.305022 0.321874 0.452265 0.568421 0.308194
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.300000, recall: 0.230769, error: 0.700000
482. 
patient tongue id: 03211954556641_4_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 白芷 蔓荆子 豆蔻 姜半夏 炙甘草 紫苏梗
0.32936 0.320078 0.400635 0.301398 0.405933 0.369938 0.316019 0.419752 0.514861 0.309114
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.500000, recall: 0.416667, error: 0.500000
483. 
patient tongue id: 04061344130144_4_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 薏苡仁 党参 白术 天麻 败酱草 蜈蚣 半枝莲 醋鳖甲 淡附片
0.855897 0.473373 0.542487 0.435741 0.342423 0.349321
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 1.000000, recall: 0.428571, error: 0.000000
484. 
patient tongue id: 06182202482525_5_6
label yaofang:
党参 黄芪 枸杞子 熟地黄 杜仲 乌药 山茱萸 菟丝子 巴戟天 益智仁 芡实 金樱子 覆盆子 酒女贞子
0.84519 0.334287 0.489324 0.475956 0.302708
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
485. 
patient tongue id: 04182023122058_1_2
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.33141 0.449538 0.32748 0.370523 0.30895 0.338671 0.547563 0.664882
predicted yaofang:
柴胡 白芍 香附 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
486. 
patient tongue id: 05222229321601_1_4
label yaofang:
川芎 当归 防风 党参 太子参 黄芪 枸杞子 芡实 豆蔻 北沙参 山萸肉 续断 麸炒白术 盐菟丝子
0.522104 0.759792 0.399007 0.870284 0.351038 0.569369 0.381531 0.492663 0.473526 0.369149 0.765274 0.811679 0.713232 0.813062 0.384169 0.930486 0.429863 0.548904 0.575916 0.699278
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.214286, error: 0.850000
487. 
patient tongue id: 01250648304335_1_2
label yaofang:
甘草 茯苓 生地黄 牡丹皮 杜仲 乌药 郁金 山药 山茱萸 泽泻 桑寄生 桑螵蛸 益智 鹿角霜 佛手
0.955853 0.522177 0.589969 0.350757 0.328398 0.321854 0.512314 0.447206 0.427874 0.377804 0.396468 0.378315
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
488. 
patient tongue id: 05131648300090_2_6
label yaofang:
甘草 党参 杜仲 山药 天麻 桑寄生 鳖甲 麦芽 白扁豆 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989286 0.548404 0.657103 0.34479 0.375802 0.327664 0.625829 0.528509 0.497943 0.440975 0.482655 0.459714
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
489. 
patient tongue id: 03141544521724_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.448448 0.365841 0.427558 0.424238 0.328681
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
490. 
patient tongue id: 04211341312324_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.389907 0.40334 0.401674 0.464152 0.356067 0.342541 0.368568 0.403504 0.36713 0.461107 0.410889 0.645488 0.302162 0.30787
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香

------Score: precision: 0.571429, recall: 0.500000, error: 0.428571
491. 
patient tongue id: 05242110430794_6_2_1
label yaofang:
甘草 桔梗 薏苡仁 浙贝母 桑白皮 天麻 鳖甲 款冬花 紫菀 百合 蜈蚣 白花蛇舌 天山雪莲 合欢花
0.970676 0.544764 0.620154 0.339501 0.3482 0.327092 0.566788 0.477391 0.434029 0.413808 0.425798 0.39981
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
492. 
patient tongue id: 03020733570220_6_1
label yaofang:
甘草 法半夏 茯苓 酸枣仁 山药 天麻 鳖甲 桑螵蛸 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲
0.966064 0.520645 0.626556 0.372544 0.386382 0.302743 0.34305 0.57606 0.518042 0.505494 0.456063 0.49234 0.489067
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.692308, error: 0.307692
493. 
patient tongue id: 01042332284833_7_6
label yaofang:
甘草 羌活 远志 党参 鸡血藤 白术 地黄 天麻 白花蛇舌草 威灵仙 蜈蚣 半枝莲 醋鳖甲 乌梢蛇
0.964525 0.536 0.611604 0.381106 0.36487 0.300208 0.336263 0.548439 0.487459 0.482025 0.4204 0.452693 0.444208
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
494. 
patient tongue id: 05290802387660_2_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 桑白皮 厚朴 款冬花 地龙 苦杏仁 紫苏子 炙麻黄
0.956431 0.540609 0.56586 0.334096 0.461745 0.40604 0.384771 0.341702 0.346808 0.309552
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
495. 
patient tongue id: 06190156289663_2_6
label yaofang:
甘草 前胡 羌活 薏苡仁 党参 天麻 白芷 鳖甲 紫菀 苦杏仁 粉葛 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.972644 0.541406 0.623472 0.354702 0.347616 0.329748 0.563821 0.497756 0.46253 0.434896 0.448035 0.425865
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
496. 
patient tongue id: 04130633573998_7_6
label yaofang:
甘草 白芍 茯苓 桃仁 党参 酸枣仁 黄连 生地黄 杜仲 山茱萸 桑寄生 火麻仁 补骨脂 合欢花 牛大力
0.902523 0.484524 0.575647 0.372896 0.4036 0.330888
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
497. 
patient tongue id: 06190117161640_1_7
label yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 山药 桑寄生 芡实 白花蛇舌草 玉米须 广金钱草
0.947378 0.513574 0.589669 0.359796 0.483419 0.411278 0.407557 0.323895 0.360945 0.336116
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.333333, error: 0.600000
498. 
patient tongue id: 05140824141986_6_4_2
label yaofang:
甘草 黄芩 茯苓 桔梗 党参 太子参 酸枣仁 浙贝母 鳖甲 麦芽 北沙参 首乌藤 白花蛇舌 蜂房 岗梅根 四季青
0.947239 0.301508 0.514837 0.604799 0.357972 0.321123 0.300111 0.503534 0.398219 0.385797 0.323974 0.352564 0.333755
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.375000, error: 0.538462
499. 
patient tongue id: 05260706113577_1_4
label yaofang:
甘草 白芍 薏苡仁 蒲公英 党参 白术 熟附子 山药 砂仁 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲
0.948573 0.523468 0.592522 0.433147 0.437226 0.419207 0.480691 0.349564 0.386994 0.402378
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.571429, error: 0.200000
------Average Score: average precision: 0.447477, average recall: 0.361381, error: 0.552523