5504/20571 [=======>......................] - ETA: 126s - loss: 0.17592017-11-13 01:19:13.492492: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:247] PoolAllocator: After 34187 get requests, put_count=34185 evicted_count=1000 eviction_rate=0.0292526 and unsatisfied allocation rate=0.0322345
2017-11-13 01:19:13.492558: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
20544/20571 [============================>.] - ETA: 0s - loss: 0.1182Epoch 00000: val_loss improved from inf to 0.08520, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 167s - loss: 0.1182 - val_loss: 0.0852
Epoch 2/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0879Epoch 00001: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0878 - val_loss: 0.0873
Epoch 3/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0845Epoch 00002: val_loss improved from 0.08520 to 0.07672, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 164s - loss: 0.0845 - val_loss: 0.0767
Epoch 4/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0824Epoch 00003: val_loss improved from 0.07672 to 0.07550, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 164s - loss: 0.0824 - val_loss: 0.0755
Epoch 5/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0810Epoch 00004: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0810 - val_loss: 0.0777
Epoch 6/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0801Epoch 00005: val_loss improved from 0.07550 to 0.07483, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 164s - loss: 0.0801 - val_loss: 0.0748
Epoch 7/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0791Epoch 00006: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0791 - val_loss: 0.0758
Epoch 8/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0785Epoch 00007: val_loss improved from 0.07483 to 0.07427, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 164s - loss: 0.0785 - val_loss: 0.0743
Epoch 9/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0779Epoch 00008: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0779 - val_loss: 0.0759
Epoch 10/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0772Epoch 00009: val_loss improved from 0.07427 to 0.07328, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 164s - loss: 0.0772 - val_loss: 0.0733
Epoch 11/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0769Epoch 00010: val_loss improved from 0.07328 to 0.07266, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0769 - val_loss: 0.0727
Epoch 12/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0763Epoch 00011: val_loss improved from 0.07266 to 0.07250, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0763 - val_loss: 0.0725
Epoch 13/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0758Epoch 00012: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0758 - val_loss: 0.0729
Epoch 14/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0753Epoch 00013: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0753 - val_loss: 0.0725
Epoch 15/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0749Epoch 00014: val_loss improved from 0.07250 to 0.07194, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0750 - val_loss: 0.0719
Epoch 16/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0746Epoch 00015: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0746 - val_loss: 0.0730
Epoch 17/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0744Epoch 00016: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0744 - val_loss: 0.0726
Epoch 18/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0739Epoch 00017: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0739 - val_loss: 0.0722
Epoch 19/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0735Epoch 00018: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0735 - val_loss: 0.0721
Epoch 20/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0731Epoch 00019: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0731 - val_loss: 0.0719
Epoch 21/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0727Epoch 00020: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0727 - val_loss: 0.0720
Epoch 22/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0725Epoch 00021: val_loss improved from 0.07194 to 0.07182, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0725 - val_loss: 0.0718
Epoch 23/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0722Epoch 00022: val_loss improved from 0.07182 to 0.07175, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0722 - val_loss: 0.0717
Epoch 24/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0718Epoch 00023: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0718 - val_loss: 0.0721
Epoch 25/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0714Epoch 00024: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0714 - val_loss: 0.0721
Epoch 26/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0709Epoch 00025: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0709 - val_loss: 0.0718
Epoch 27/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0706Epoch 00026: val_loss improved from 0.07175 to 0.07170, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0706 - val_loss: 0.0717
Epoch 28/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0704Epoch 00027: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0704 - val_loss: 0.0727
Epoch 29/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0699Epoch 00028: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0699 - val_loss: 0.0720
Epoch 30/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0697Epoch 00029: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0697 - val_loss: 0.0728
Epoch 31/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0693Epoch 00030: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0693 - val_loss: 0.0721
Epoch 32/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0689Epoch 00031: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0689 - val_loss: 0.0721
Epoch 33/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0685Epoch 00032: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0685 - val_loss: 0.0723
Epoch 34/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0682Epoch 00033: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0682 - val_loss: 0.0719
Epoch 35/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0677Epoch 00034: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0677 - val_loss: 0.0728
Epoch 36/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0674Epoch 00035: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0674 - val_loss: 0.0725
Epoch 37/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0670Epoch 00036: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0671 - val_loss: 0.0732
Epoch 38/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0666Epoch 00037: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0666 - val_loss: 0.0722
Epoch 39/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0662Epoch 00038: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0662 - val_loss: 0.0724
Epoch 40/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00039: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0660 - val_loss: 0.0729
Epoch 41/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0654Epoch 00040: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0654 - val_loss: 0.0726
Epoch 42/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0651Epoch 00041: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0651 - val_loss: 0.0726
Epoch 43/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0649Epoch 00042: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0649 - val_loss: 0.0725
Epoch 44/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0645Epoch 00043: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0645 - val_loss: 0.0731
Epoch 45/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0643Epoch 00044: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0643 - val_loss: 0.0730
Epoch 46/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0639Epoch 00045: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0639 - val_loss: 0.0741
Epoch 47/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0635Epoch 00046: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0635 - val_loss: 0.0736
Epoch 48/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0634Epoch 00047: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0634 - val_loss: 0.0735
Epoch 49/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0630Epoch 00048: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0630 - val_loss: 0.0738
Epoch 50/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0627Epoch 00049: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0627 - val_loss: 0.0735
Epoch 51/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0624Epoch 00050: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0624 - val_loss: 0.0740
Epoch 52/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0621Epoch 00051: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0621 - val_loss: 0.0735
Epoch 53/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0619Epoch 00052: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0619 - val_loss: 0.0745
Epoch 54/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0616Epoch 00053: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0616 - val_loss: 0.0751
Epoch 55/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0614Epoch 00054: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0614 - val_loss: 0.0740
Epoch 56/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0611Epoch 00055: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0611 - val_loss: 0.0757
Epoch 57/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0610Epoch 00056: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0610 - val_loss: 0.0750
Epoch 58/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0606Epoch 00057: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0606 - val_loss: 0.0747
Epoch 59/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0605Epoch 00058: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0605 - val_loss: 0.0740
Epoch 60/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0603Epoch 00059: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0603 - val_loss: 0.0747
Epoch 61/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0601Epoch 00060: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0601 - val_loss: 0.0743
Epoch 62/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0600Epoch 00061: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0600 - val_loss: 0.0751
Epoch 63/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0598Epoch 00062: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0598 - val_loss: 0.0746
Epoch 64/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0595Epoch 00063: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0595 - val_loss: 0.0748
Epoch 65/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0593Epoch 00064: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0593 - val_loss: 0.0749
Epoch 66/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0591Epoch 00065: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0591 - val_loss: 0.0746
Epoch 67/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0588Epoch 00066: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0588 - val_loss: 0.0754
Epoch 68/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0587Epoch 00067: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0587 - val_loss: 0.0754
Epoch 69/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0585Epoch 00068: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0585 - val_loss: 0.0750
Epoch 70/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0583Epoch 00069: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0583 - val_loss: 0.0746
Epoch 71/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0582Epoch 00070: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0582 - val_loss: 0.0747
Epoch 72/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0580Epoch 00071: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0580 - val_loss: 0.0755
Epoch 73/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0579Epoch 00072: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0579 - val_loss: 0.0751
Epoch 74/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0576Epoch 00073: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0576 - val_loss: 0.0759
Epoch 75/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0575Epoch 00074: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0575 - val_loss: 0.0756
Epoch 76/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0572Epoch 00075: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0572 - val_loss: 0.0753
Epoch 77/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0571Epoch 00076: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0571 - val_loss: 0.0755
Epoch 78/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0569Epoch 00077: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0569 - val_loss: 0.0761
Epoch 79/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0568Epoch 00078: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0568 - val_loss: 0.0756
Epoch 80/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0565Epoch 00079: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0565 - val_loss: 0.0765
history: [(0.1182150303517762, None, 0.085196676841246669, None), (0.08784194099547292, None, 0.087311624550746814, None), (0.084482334590776448, None, 0.076718760725207155, None), (0.082432826350287647, None, 0.07550217419908109, None), (0.081009442503613638, None, 0.077673278680947269, None), (0.080063494909044935, None, 0.07482932486445211, None), (0.079114893659319813, None, 0.075801149623034747, None), (0.078462333633070883, None, 0.07426601829775574, None), (0.077858759561783314, None, 0.07589084185557822, None), (0.077228323322010975, None, 0.073281534458404268, None), (0.076888039271338124, None, 0.072656533058556974, None), (0.076259566478496063, None, 0.072503311448989943, None), (0.075813037523376217, None, 0.072850922698118187, None), (0.075306453833946962, None, 0.072523386295618344, None), (0.074950186010089931, None, 0.071940968955669954, None), (0.074615028258759875, None, 0.073014862415815965, None), (0.074353768013388388, None, 0.072618032903431759, None), (0.073863440324574495, None, 0.072157058110701625, None), (0.073494151408477273, None, 0.072066079978257008, None), (0.073080926380208008, None, 0.071948112871730349, None), (0.072733366967789037, None, 0.071976073732659157, None), (0.072482647601455119, None, 0.071818324188663532, None), (0.072151977713196952, None, 0.071748727317360803, None), (0.071775859141681844, None, 0.072106926136365226, None), (0.071409168436918302, None, 0.072080429297513252, None), (0.070931617406900307, None, 0.071770937838329385, None), (0.070593002487657999, None, 0.071698201959173063, None), (0.07035134853513117, None, 0.072653401387880928, None), (0.069862589248042312, None, 0.072002201161065246, None), (0.069655284593043432, None, 0.072822732422812703, None), (0.06928237601314241, None, 0.072084232563751113, None), (0.068869225132112452, None, 0.072096135971934469, None), (0.068466866250832592, None, 0.072319895777528148, None), (0.068174834328709327, None, 0.07191963012995059, None), (0.06769443325983418, None, 0.072772128306204512, None), (0.067382474334695103, None, 0.072541028692116288, None), (0.067051703555557535, None, 0.0731680857264288, None), (0.066581937124744681, None, 0.072207376224809591, None), (0.066240663416685483, None, 0.072353867431209515, None), (0.065995770118611602, None, 0.072948639795660422, None), (0.065414691859388391, None, 0.072552675469190198, None), (0.065124126399031618, None, 0.072576857729045222, None), (0.064903707605917058, None, 0.072452608943892757, None), (0.064543059947879428, None, 0.073080035626797546, None), (0.064302550282257426, None, 0.073019712222130509, None), (0.063866693137697023, None, 0.074111394504796785, None), (0.063544846963600812, None, 0.073560368059886277, None), (0.063376311361456494, None, 0.073540546963929768, None), (0.062980324296493251, None, 0.073782149379111858, None), (0.062684960368497161, None, 0.073464005391710246, None), (0.062404662276874932, None, 0.073993119350216338, None), (0.062137758712718483, None, 0.073496684057799647, None), (0.061923131278611127, None, 0.074470762679384545, None), (0.061557171659578608, None, 0.075123707294645556, None), (0.061442460345222862, None, 0.073984525099827642, None), (0.061113173708266785, None, 0.075658412919559798, None), (0.061007902623606461, None, 0.075019336159552252, None), (0.0606335949258286, None, 0.074712499669969901, None), (0.060456335868020551, None, 0.074028717521209514, None), (0.060292182056056083, None, 0.074666688385982311, None), (0.060081666078943483, None, 0.074290472373389038, None), (0.060010765306533882, None, 0.075068816837473365, None), (0.059755228941545821, None, 0.074604801958372963, None), (0.059535960458712713, None, 0.074805533595644, None), (0.05933663854015557, None, 0.074924725489166413, None), (0.059101142658555546, None, 0.074629632396059312, None), (0.058830975252591865, None, 0.075448513552659899, None), (0.058746880774494567, None, 0.075447884664687936, None), (0.058472640670781284, None, 0.074954812884149305, None), (0.058343518555785852, None, 0.074647645382394892, None), (0.05816271490789162, None, 0.07472655149899661, None), (0.057988151157466167, None, 0.075507725528023192, None), (0.057880030658180648, None, 0.075107549253391886, None), (0.057647548257365802, None, 0.075852312646590772, None), (0.057458733748726988, None, 0.075626221863918652, None), (0.057211987548375774, None, 0.075299495136538233, None), (0.057141203977101325, None, 0.075494827733827333, None), (0.056933675803235786, None, 0.076116178337841817, None), (0.056780936761551097, None, 0.07557441344090611, None), (0.056463249892635285, None, 0.076476935609109148, None)]
0. 
patient tongue id: 02231905596969_2_4
label yaofang:
甘草 白芍 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 炒僵蚕
0.455798 0.921569 0.364053 0.980532 0.500313 0.674962 0.394445 0.456289 0.44797 0.960129 0.961871 0.943104 0.968754 0.476837 0.988873 0.366877 0.42292 0.594282 0.906611
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.052632, recall: 0.071429, error: 0.947368
1. 
patient tongue id: 02142145154899_1_2
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.994036 0.505131 0.696704 0.493442 0.305282 0.372364 0.740511 0.655635 0.65843 0.537176 0.582841 0.602146
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
2. 
patient tongue id: 04291510105716_1_6
label yaofang:
甘草 薏苡仁 党参 黄芪 熟附子 泽泻 天麻 赤石脂 鳖甲 补骨脂 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.993111 0.510886 0.703854 0.469613 0.364279 0.727785 0.637919 0.618895 0.514526 0.556549 0.553346
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
3. 
patient tongue id: 04061943587990_2_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 麦芽 百合 紫苏叶
0.661684 0.353897 0.526845 0.517345
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.111111, error: 0.750000
4. 
patient tongue id: 04232016402822_4
label yaofang:
麻黄 桂枝 荆芥 防风 独活 延胡索 乳香 没药 炙甘草 豨莶草 海风藤 海桐皮 鹿衔草 走马胎
0.379071 0.401333 0.315538 0.422301 0.33697 0.35138
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
5. 
patient tongue id: 04181901234673_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 紫菀 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.388441 0.649316 0.473343 0.666584 0.411839 0.469669 0.408775 0.382135 0.378233 0.310579 0.612578 0.607889 0.604782 0.619348 0.470378 0.774741 0.311426 0.313128 0.370766 0.423871 0.59886
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.523810, recall: 0.785714, error: 0.476190
6. 
patient tongue id: 03290659148378_1_4_6
label yaofang:
甘草 茯苓 桔梗 远志 酸枣仁 浙贝母 天麻 鳖甲 苦杏仁 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986147 0.515875 0.68787 0.41002 0.31461 0.378362 0.714107 0.547943 0.483124 0.437188 0.480277 0.466888
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
7. 
patient tongue id: 01180059182288_2
label yaofang:
橘红 黄芪 熟地黄 牡丹皮 山茱萸 石菖蒲 水蛭 大黄 厚朴 火麻仁 鸡内金 枇杷叶 北沙参 稻芽
0.473256 0.415938 0.384555 0.376822 0.376211
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
8. 
patient tongue id: 04251959267487_2
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 车前子 升麻 炙甘草
0.381884 0.485193 0.365158 0.469995 0.464543 0.310883 0.484664 0.572105
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.444444, error: 0.500000
9. 
patient tongue id: 04201928295211_5
label yaofang:
甘草 川芎 法半夏 茯苓 羌活 金银花 蒲公英 白芷 蔓荆子 益母草 鳖甲 辛夷 苍耳子 土鳖虫
0.96145 0.475273 0.620851 0.456883 0.342894 0.606912 0.50776 0.491804 0.402424 0.429821 0.425333
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
10. 
patient tongue id: 02212226574723_1_2
label yaofang:
甘草 党参 酸枣仁 生地黄 郁金 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.988919 0.523264 0.68763 0.441601 0.306574 0.382521 0.705021 0.588225 0.547392 0.477552 0.521661 0.512367
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
11. 
patient tongue id: 01051914475464_5
label yaofang:
甘草 法半夏 桔梗 防风 薄荷 荆芥穗 香薷 辛夷 紫苏梗 广藿香 炒苍耳子
0.373606 0.667176 0.347105 0.883294 0.43383 0.602168 0.335085 0.825957 0.807408 0.773731 0.86904 0.343897 0.838716 0.415814 0.405723 0.448884 0.674239
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.294118, recall: 0.454545, error: 0.705882
12. 
patient tongue id: 04131822166239_6_2_1
label yaofang:
甘草 桔梗 薏苡仁 白及 太子参 仙鹤草 茜草 天麻 鳖甲 补骨脂 蜈蚣 白花蛇舌 天山雪莲 红豆杉 龙葵果
0.968338 0.495374 0.653566 0.478086 0.378991 0.656638 0.580488 0.56516 0.473214 0.519811 0.513142
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
13. 
patient tongue id: 05251935084325_1_5
label yaofang:
甘草 白芍 枳壳 黄芪 白术 杜仲 乌药 厚朴 桑寄生 北沙参 蜈蚣 合欢皮 冬凌草 荔枝核 鸭脚艾
0.529108 0.353767 0.42719 0.397886 0.57819 0.711061 0.305939 0.340722 0.437198 0.418212 0.351658 0.407032 0.330506
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
14. 
patient tongue id: 04282259083000_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 鱼腥草 浙贝母 桑白皮 蔓荆子 瓜蒌皮 款冬花 苦杏仁 紫苏子 苍耳子
0.99747 0.514891 0.744559 0.536392 0.388891 0.789146 0.700871 0.702469 0.547623 0.616855 0.613682
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
15. 
patient tongue id: 01082358468371_7_2_1
label yaofang:
麻黄 桂枝 甘草 白芍 香附 防风 薏苡仁 延胡索 牛膝 知母 附子 苍术 全蝎 防己 木瓜 丝瓜络 蜈蚣
0.774822 0.402237 0.538785 0.300656 0.620421 0.372912
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.333333, recall: 0.117647, error: 0.666667
16. 
patient tongue id: 01101817489925_1_4
label yaofang:
法半夏 茯苓 前胡 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.347969 0.32285 0.367657 0.309046 0.359008 0.398463 0.492408
predicted yaofang:
茯苓 前胡 黄芪 白术 百部 北沙参 炙甘草

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
17. 
patient tongue id: 02142000290219_6
label yaofang:
麻黄 桂枝 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.467776 0.302607 0.376465 0.305166 0.479941 0.481409 0.342652
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
18. 
patient tongue id: 03200652590400_5_1
label yaofang:
甘草 茯苓 桔梗 牛蒡子 白术 酸枣仁 丹参 生地黄 浙贝母 山药 天花粉 鳖甲 板蓝根 贯众
0.991703 0.514839 0.686885 0.471742 0.380275 0.715837 0.642928 0.615737 0.529659 0.572389 0.559166
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
19. 
patient tongue id: 03111712589485_6_2_7
label yaofang:
甘草 柴胡 白芍 香附 延胡索 砂仁 天麻 五灵脂 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲 红豆杉
0.976679 0.504382 0.633965 0.442366 0.35259 0.599896 0.533214 0.494401 0.428326 0.450168 0.421599
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
20. 
patient tongue id: 02272226177792_4_1
label yaofang:
白芍 当归 木香 党参 白术 肉桂 补骨脂 肉豆蔻 诃子 炙甘草
0.385366 0.340204 0.44023 0.453841 0.465971 0.385636 0.517704
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.400000, error: 0.428571
21. 
patient tongue id: 03111508488463_2_1
label yaofang:
甘草 川芎 茯苓 麦冬 太子参 白术 五味子 牛膝 郁金 山药 补骨脂 莪术 浮小麦
0.985065 0.515516 0.650805 0.469602 0.382429 0.641192 0.591817 0.564126 0.484228 0.508671 0.486213
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
22. 
patient tongue id: 02191440325559_6_4
label yaofang:
甘草 川芎 茯苓 党参 白术 酸枣仁 栀子 杜仲 钩藤 天麻 桑寄生 补骨脂 麦芽 红景天
0.997326 0.534849 0.70191 0.470448 0.305842 0.403336 0.756717 0.690261 0.672271 0.572053 0.61036 0.599946
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
23. 
patient tongue id: 03091826486290_4
label yaofang:
麻黄 茯苓 前胡 半夏 防风 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 苍耳子
0.411816 0.706171 0.400246 0.863303 0.423945 0.576543 0.377075 0.391242 0.368312 0.317012 0.303742 0.804878 0.802586 0.779134 0.839163 0.455666 0.879245 0.387792 0.301563 0.405338 0.50618 0.718412
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.687500, error: 0.500000
24. 
patient tongue id: 02141938275915_4
label yaofang:
枳壳 桔梗 牛蒡子 党参 白术 旋覆花 紫菀 百部 北沙参 紫苏子 炙甘草 化橘红 芥子
0.80507 0.316337 0.424146 0.532847 0.419212 0.343575
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
25. 
patient tongue id: 04051840590844_3_4
label yaofang:
桂枝 茯苓 半夏 木香 黄芪 白术 附子 山药 泽泻 茯苓皮 猪苓 白扁豆 紫苏叶 玉米须 蜈蚣
0.486532 0.354125 0.478959 0.342728 0.418148
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
26. 
patient tongue id: 02161920352266_5_7
label yaofang:
桃仁 党参 白术 赤芍 浙贝母 厚朴 地榆 槐花 火麻仁 鸡内金 北沙参 土鳖虫 红豆杉 合欢皮 山慈菇
0.437173 0.336597 0.448098 0.361231 0.629558 0.684188 0.347394 0.342898 0.484676 0.423266 0.42873 0.494125 0.358484
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
27. 
patient tongue id: 05172139304286_6_2_1
label yaofang:
甘草 枳壳 茯苓 远志 党参 白术 酸枣仁 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.805617 0.327882 0.406656 0.593124 0.418482 0.475909
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
28. 
patient tongue id: 06131957108961_6_5_7
label yaofang:
甘草 桃仁 蒲公英 枸杞子 黄连 生地黄 红花 牡丹皮 郁金 山茱萸 厚朴 麦芽 北沙参 百合 合欢皮 素馨花 稻芽
0.452965 0.330264 0.452038 0.535599 0.443422 0.324964
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝

------Score: precision: 0.166667, recall: 0.058824, error: 0.833333
29. 
patient tongue id: 04130619276007_3_2
label yaofang:
甘草 桃仁 党参 丹参 生地黄 红花 黄柏 乌药 肉桂 山茱萸 菟丝子 淫羊藿 补骨脂 仙茅 艾叶
0.9612 0.484693 0.682622 0.452497 0.302272 0.366968 0.648534 0.503562 0.467701 0.397533 0.44378 0.442992
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
30. 
patient tongue id: 06132114096266_1_4
label yaofang:
甘草 香附 茯苓 党参 白术 延胡索 海螵蛸 莪术 紫苏梗 半枝莲 瓦楞子 猫爪草 山慈菇
0.349005 0.416967 0.337459 0.385062 0.463795 0.390146 0.315335 0.504647 0.639841 0.313014 0.318803
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶 紫苏梗

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
31. 
patient tongue id: 06041020424503_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.404088 0.594285 0.436632 0.777513 0.418362 0.498765 0.374208 0.367558 0.334077 0.7178 0.699639 0.684648 0.754443 0.482516 0.785889 0.356788 0.313202 0.387828 0.440756 0.630019
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
32. 
patient tongue id: 04112208324499_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 浮小麦 白花蛇舌 天山雪莲 半枝莲
0.603995 0.391937 0.524475 0.446397 0.500779
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
33. 
patient tongue id: 03081847078615_4
label yaofang:
麻黄 陈皮 前胡 半夏 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香
0.363104 0.63229 0.385965 0.812603 0.390902 0.564028 0.329703 0.340917 0.31465 0.743508 0.734488 0.716581 0.794659 0.431401 0.840101 0.36893 0.393045 0.419619 0.63044
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
34. 
patient tongue id: 05262214284827_5_6
label yaofang:
甘草 柴胡 白芍 陈皮 茯苓 防风 党参 白术 延胡索 川楝子 乌药 山药 桑寄生 鸡内金 广金钱草
0.985471 0.521494 0.656968 0.440607 0.37462 0.666987 0.595229 0.538931 0.489729 0.521937 0.491564
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
35. 
patient tongue id: 05181041350539_5_7
label yaofang:
甘草 独活 薏苡仁 党参 白术 红花 延胡索 杜仲 苍术 桑寄生 补骨脂 鹿角霜 续断 牛大力 千斤拔
0.987641 0.501573 0.689197 0.552612 0.389778 0.71645 0.682583 0.691177 0.561536 0.615214 0.630089
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
36. 
patient tongue id: 02142127346160_2_6
label yaofang:
甘草 茯苓 薏苡仁 党参 酸枣仁 生地黄 熟附子 天麻 鳖甲 败酱草 蜈蚣 天山雪莲 半枝莲 红豆杉
0.978639 0.306884 0.505326 0.610104 0.444936 0.341108 0.570624 0.518508 0.478823 0.4118 0.417945 0.387211
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
37. 
patient tongue id: 03012039582436_6_1_2
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 延胡索 赤芍 川楝子 天麻 五灵脂 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲
0.93039 0.479462 0.614408 0.469018 0.342005 0.524035 0.425775 0.417921 0.321424 0.354424 0.341038
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
38. 
patient tongue id: 01041812514567_2_1
label yaofang:
陈皮 法半夏 前胡 桔梗 麦冬 太子参 款冬花 紫菀 百部 炙甘草 人参叶 北海参
0.402323 0.675844 0.371522 0.881154 0.432528 0.575493 0.331334 0.369748 0.341449 0.31521 0.823935 0.808532 0.791314 0.867326 0.381951 0.847555 0.413805 0.417337 0.499768 0.696385
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.750000, error: 0.550000
39. 
patient tongue id: 04020820414180_5
label yaofang:
甘草 金银花 连翘 紫花地丁 党参 白术 浙贝母 郁金 莱菔子 白芷 鸡内金 夏枯草 麦芽 皂角刺 猫爪草
0.994781 0.537685 0.699515 0.480019 0.390303 0.72623 0.664676 0.634081 0.537559 0.581341 0.564152
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
40. 
patient tongue id: 04191714094914_1_7_4
label yaofang:
枳壳 党参 黄芪 白术 延胡索 海螵蛸 浙贝母 厚朴 山楂 瓜蒌皮 火麻仁 鸡内金 桑螵蛸 益智 蜈蚣 鲜龙葵果
0.371407 0.354834 0.389424 0.385929 0.37403
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
41. 
patient tongue id: 06190759034003_6_4
label yaofang:
甘草 茯苓 酸枣仁 红花 栀子 牡丹皮 杜仲 钩藤 地黄 天麻 桑寄生 淡竹叶 浮小麦 川木通
0.985461 0.488833 0.651516 0.468827 0.310505 0.628372 0.517502 0.533102 0.387589 0.44049 0.441354
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
42. 
patient tongue id: 05222054167649_1_4
label yaofang:
甘草 陈皮 茯苓 党参 白术 五味子 厚朴 生半夏 僵蚕 诃子 枇杷叶 地龙 北沙参
0.654976 0.407199 0.499948 0.474231 0.614561 0.300791 0.310171 0.312286
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁

------Score: precision: 0.625000, recall: 0.384615, error: 0.375000
43. 
patient tongue id: 01062347071030_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.494114 0.348151 0.339886 0.504378 0.475084 0.43147 0.395541 0.313923
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
44. 
patient tongue id: 03232032274593_7_6_4
label yaofang:
甘草 茯苓 白术 酸枣仁 生地黄 赤芍 杜仲 天麻 全蝎 菟丝子 麦芽 皂角刺 女贞子 首乌藤 合欢花
0.944812 0.454692 0.669595 0.533864 0.355442 0.56914 0.484953 0.523917 0.358074 0.416932 0.427801
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
45. 
patient tongue id: 03020839159215_6
label yaofang:
甘草 香附 桔梗 芦根 酸枣仁 浙贝母 天麻 益母草 鳖甲 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.994326 0.497431 0.704935 0.46762 0.30294 0.36209 0.762814 0.667176 0.654305 0.550206 0.600008 0.614685
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
46. 
patient tongue id: 05261929075147_4
label yaofang:
薏苡仁 酸枣仁 丹参 黄连 黄柏 苍术 神曲 厚朴 山楂 砂仁 瓜蒌皮 鸡内金 麦芽 木棉花
0.523275 0.357405 0.487759 0.308762 0.407789
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
47. 
patient tongue id: 03061450474361_4_6
label yaofang:
桂枝 甘草 柴胡 白芍 香附 当归 茯苓 薄荷 白术 白花蛇舌草 麦芽 广藿香 田基黄
0.394346 0.311046 0.46585 0.313973 0.461939 0.308187
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
48. 
patient tongue id: 06010437439763_2_1_6
label yaofang:
甘草 党参 熟地黄 牡丹皮 山茱萸 地黄 泽泻 天麻 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲
0.995709 0.507922 0.698859 0.445748 0.330639 0.375442 0.797745 0.699087 0.693936 0.59906 0.639219 0.661952
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
49. 
patient tongue id: 01070841443443_1_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 赤芍 牛膝 郁金 六神曲
0.377965 0.347664 0.428505 0.411964 0.339352
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
50. 
patient tongue id: 03012152059904_6_2
label yaofang:
甘草 茯苓 白术 酸枣仁 生地黄 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.950341 0.495519 0.638344 0.475408 0.360906 0.521176 0.4242 0.414201 0.31236 0.338588 0.300857
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
51. 
patient tongue id: 02260659592562_5
label yaofang:
甘草 玄参 栀子 牡丹皮 山药 厚朴 火麻仁 茵陈 扁豆花 虎杖 麦芽 醋鳖甲 土鳖虫 鹿衔草
0.92874 0.478261 0.61599 0.428855 0.348279 0.558935 0.356061 0.352112
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
52. 
patient tongue id: 03311827135004_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄
0.457281 0.926371 0.335437 0.988857 0.525543 0.695563 0.367183 0.460956 0.424727 0.97575 0.976499 0.96099 0.982504 0.474926 0.991781 0.393732 0.420122 0.620218 0.921566
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
53. 
patient tongue id: 04271527541073_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.437109 0.305648 0.403734 0.49738 0.487799 0.460786 0.467997 0.363444 0.326512 0.328089 0.314887 0.323887 0.322156
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.692308, recall: 0.750000, error: 0.307692
54. 
patient tongue id: 04121315221338_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.422722 0.82795 0.428526 0.920897 0.449511 0.561113 0.424362 0.440062 0.434143 0.884541 0.881744 0.863208 0.896367 0.513281 0.957637 0.330689 0.391634 0.569294 0.826504
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
55. 
patient tongue id: 01062345001684_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.439034 0.307715 0.340123 0.529955 0.437688 0.314177 0.387818 0.428013
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
56. 
patient tongue id: 05222107503767_5_6
label yaofang:
甘草 白芍 牡蛎 麦冬 黄芪 白术 五味子 厚朴 全蝎 女贞子 首乌藤 合欢皮 墨旱莲
0.66469 0.374877 0.445617 0.459845 0.642582 0.763276 0.427399 0.499537 0.448702 0.329073 0.352858 0.386301 0.42829 0.348997
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 僵蚕 莪术 鸡内金 北沙参 合欢皮

------Score: precision: 0.357143, recall: 0.384615, error: 0.642857
57. 
patient tongue id: 02190502579320_6_5
label yaofang:
甘草 白芍 川芎 羌活 党参 白术 牛膝 细辛 天麻 全蝎 白芷 蔓荆子 麦芽 蒺藜 谷精子
0.977984 0.407801 0.51728 0.516223 0.321123 0.519729 0.393216 0.350583 0.318789
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌

------Score: precision: 0.444444, recall: 0.266667, error: 0.555556
58. 
patient tongue id: 03291716395055_4_7_1
label yaofang:
甘草 连翘 党参 黄芪 丹参 浙贝母 郁金 天麻 瓜蒌皮 鳖甲 王不留行 皂角刺 蜈蚣 白花蛇舌 半枝莲 红豆杉 猫爪草
0.550658 0.366436 0.546832 0.412879 0.384702 0.301354
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝

------Score: precision: 0.500000, recall: 0.176471, error: 0.500000
59. 
patient tongue id: 04241857222519_1
label yaofang:
枳壳 牛蒡子 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶 独脚金
0.419662 0.302369 0.544987 0.39656
predicted yaofang:
甘草 白芍 党参 白术

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
60. 
patient tongue id: 04112357492654_6
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.31091 0.306 0.573289 0.370261 0.456706
predicted yaofang:
党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
61. 
patient tongue id: 03021404368281_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.338371 0.613396 0.489409 0.380521 0.645654 0.562454 0.64716 0.503638 0.586194 0.541934 0.622464 0.55488 0.610105 0.589591 0.632235
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
62. 
patient tongue id: 05221851055511_7
label yaofang:
甘草 金银花 蒲公英 栀子 泽泻 车前子 大黄 瞿麦 萹蓄 黑枣 广金钱草 车前草 路路通
0.51414 0.352969 0.337819 0.428391 0.612521 0.638533 0.303465 0.327996 0.419129 0.373184 0.383252 0.406934
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.083333, recall: 0.076923, error: 0.916667
63. 
patient tongue id: 03290719094144_3_7_4
label yaofang:
黄芪 白术 熟地黄 浙贝母 牡丹皮 附子 山茱萸 砂仁 瓜蒌皮 益智 两头尖 桑枝 骨碎补 土鳖虫 红豆杉
0.703657 0.399272 0.34419 0.476377 0.56987 0.70557 0.391944 0.436438 0.403447 0.342066 0.315176 0.387598
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 莪术 鸡内金 北沙参

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
64. 
patient tongue id: 05092239303884_1_2_6
label yaofang:
茯苓 龙齿 党参 白术 海螵蛸 砂仁 柿蒂 金樱子 鸡内金 北沙参 紫苏梗 红豆杉 合欢皮 墨旱莲
0.336253 0.302203 0.430135 0.430433 0.449212 0.311429 0.388466 0.331336 0.341824 0.37698 0.430092 0.517049
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
65. 
patient tongue id: 05221852115440_1
label yaofang:
川芎 陈皮 半夏 薏苡仁 丹参 槟榔 乌药 大腹皮 山楂 莱菔子 菟丝子 三七 火麻仁 鸡内金 麦芽 佛手 紫苏梗
0.541629 0.390931 0.440519 0.426187 0.56422 0.320675
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 砂仁

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
66. 
patient tongue id: 01312125396810_1_6_4
label yaofang:
甘草 陈皮 法半夏 大枣 茯苓 远志 党参 酸枣仁 天麻 桑寄生 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲 姜黄
0.961323 0.476404 0.644652 0.486656 0.337307 0.575389 0.490521 0.489833 0.386811 0.421725 0.41795
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.529412, error: 0.181818
67. 
patient tongue id: 03111737223806_6_4
label yaofang:
甘草 白芍 陈皮 法半夏 防风 羌活 独活 桃仁 白术 红花 钩藤 天麻 蒺藜
0.987632 0.5048 0.647749 0.45042 0.350212 0.642483 0.578653 0.547017 0.466836 0.489371 0.465839
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
68. 
patient tongue id: 04151237196063_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.45905 0.891985 0.36752 0.981143 0.529043 0.689721 0.361846 0.465758 0.428373 0.964945 0.96296 0.944296 0.972877 0.460556 0.983361 0.431429 0.316827 0.457808 0.586119 0.890324
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.750000, error: 0.400000
69. 
patient tongue id: 03012314378396_6_1
label yaofang:
甘草 薏苡仁 太子参 五味子 延胡索 细辛 厚朴 天麻 鳖甲 补骨脂 莪术 苦杏仁 蜈蚣 白花蛇舌 天山雪莲
0.837069 0.44932 0.546443 0.32315 0.527289 0.316179 0.306159 0.301727
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 天麻 蜈蚣

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
70. 
patient tongue id: 03180103486846_2_1_7
label yaofang:
龙骨 黄芪 白术 丹参 厚朴 三七 桑寄生 淫羊藿 柿蒂 鸡内金 仙茅 首乌藤 紫苏梗 合欢皮
0.564453 0.387595 0.350287 0.476154 0.601082 0.695352 0.355197 0.414885 0.372653 0.347771 0.380879
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
71. 
patient tongue id: 06190143179084_1_3
label yaofang:
甘草 茯苓 党参 黄芪 枸杞子 白术 山楂 砂仁 麦芽 谷芽 紫苏梗 广藿香 麸炒枳壳
0.992146 0.524224 0.662534 0.471836 0.382824 0.672031 0.615113 0.593449 0.503209 0.531417 0.505148
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
72. 
patient tongue id: 06071207423721_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.455783 0.314099 0.4759 0.540984 0.407839 0.517677 0.451066 0.517622 0.346337 0.468929 0.416058 0.470792 0.471653 0.461717 0.44794 0.472319
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.687500, recall: 0.916667, error: 0.312500
73. 
patient tongue id: 05140630081675_7_6
label yaofang:
甘草 柴胡 白芍 川芎 枳壳 当归 桃仁 党参 生地黄 红花 川楝子 菟丝子 五灵脂 益母草
0.997068 0.53181 0.717068 0.4704 0.385729 0.778969 0.697896 0.680666 0.577722 0.629621 0.627029
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
74. 
patient tongue id: 04131857403040_2
label yaofang:
甘草 白芍 枳壳 茯苓 薏苡仁 白术 海螵蛸 川楝子 郁金 白茅根 泽泻 车前子 厚朴 北沙参 土鳖虫 姜黄 预知子 蛇舌草
0.518732 0.400715 0.449147 0.474314 0.561063 0.328334 0.325639 0.313814
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.625000, recall: 0.277778, error: 0.375000
75. 
patient tongue id: 05290741555504_6_2_4
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 远志 枸杞子 白术 杜仲 牛膝 天麻 桑寄生 补骨脂 首乌藤 天山雪莲 广金钱草
0.98089 0.516347 0.641383 0.503189 0.368334 0.568366 0.525432 0.532935 0.409026 0.439179 0.414566
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
76. 
patient tongue id: 02231829161766_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.402754 0.805493 0.39454 0.917269 0.437474 0.581045 0.382738 0.383696 0.375717 0.871328 0.864666 0.848602 0.89158 0.471083 0.933666 0.331363 0.379737 0.547278 0.787962
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
77. 
patient tongue id: 04121847345684_6
label yaofang:
柴胡 白芍 黄芩 当归 茯苓 薄荷 枸杞子 白术 淡豆豉 炙甘草 百合 合欢皮
0.756621 0.383271 0.557431 0.567432
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
78. 
patient tongue id: 05251934206841_2_6
label yaofang:
茯苓 桔梗 薏苡仁 黄芪 白术 黄连 山药 砂仁 白扁豆 炙甘草 紫苏叶 合欢皮 蛇舌草
0.527939 0.429682 0.340232 0.404933 0.511725 0.396268
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
79. 
patient tongue id: 02260652202101_5
label yaofang:
甘草 陈皮 枳壳 黄芩 法半夏 茯苓 桔梗 党参 浙贝母 桑白皮 款冬花 苦杏仁 广藿香
0.924796 0.310938 0.472575 0.574257 0.478193 0.399955 0.343916 0.371153
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
80. 
patient tongue id: 05172114290997_6_4
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 天麻 菟丝子 鳖甲 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲
0.980398 0.508581 0.64229 0.437338 0.374481 0.658965 0.583491 0.532487 0.480509 0.499005 0.481845
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
81. 
patient tongue id: 02281216141083_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.852183 0.452376 0.589356 0.413322 0.302937 0.462716
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
82. 
patient tongue id: 01121856118080_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.389802 0.892251 0.309232 0.97526 0.442382 0.661418 0.305467 0.379227 0.333436 0.954586 0.950844 0.93448 0.969392 0.402055 0.97809 0.354459 0.376869 0.604796 0.871878
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.875000, error: 0.263158
83. 
patient tongue id: 02142200252756_6_4
label yaofang:
甘草 川芎 党参 丹参 栀子 苍术 天麻 全蝎 磁石 白芷 蔓荆子 麦芽 首乌藤 谷精子
0.990694 0.514008 0.68054 0.478644 0.303758 0.394869 0.694543 0.616384 0.599904 0.503181 0.545116 0.52948
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
84. 
patient tongue id: 04291458220299_6_7_1
label yaofang:
甘草 川芎 防风 羌活 党参 黄芪 牛膝 细辛 天麻 全蝎 白芷 鳖甲 粉葛 白花蛇舌 天山雪莲 半枝莲
0.956317 0.493894 0.625266 0.476941 0.341541 0.5402 0.471808 0.460437 0.365558 0.394109 0.369775
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
85. 
patient tongue id: 02271254434362_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.396491 0.306361 0.485083 0.335738 0.361255
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
86. 
patient tongue id: 04151230343744_1_3
label yaofang:
茯苓 防风 钩藤 荆芥穗 白芷 香薷 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.392019 0.64058 0.467191 0.703396 0.401178 0.471384 0.417493 0.38811 0.377891 0.31007 0.654277 0.646395 0.652436 0.671679 0.485554 0.800622 0.315091 0.370406 0.479372 0.637474
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.416667, error: 0.750000
87. 
patient tongue id: 01182139361636_2_6
label yaofang:
甘草 酸枣仁 浙贝母 杜仲 山药 白茅根 地黄 天麻 桑寄生 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.990976 0.51112 0.683857 0.486318 0.393674 0.699312 0.622124 0.601148 0.504143 0.559065 0.546465
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
88. 
patient tongue id: 01050634009190_5_7
label yaofang:
甘草 羌活 独活 党参 白术 红花 延胡索 泽泻 补骨脂 忍冬藤 续断 威灵仙 狗脊 牛大力
0.985642 0.50783 0.656075 0.46777 0.375197 0.677989 0.619505 0.58111 0.510877 0.539282 0.519543
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
89. 
patient tongue id: 01070835398907_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.628417 0.382431 0.52536 0.48963 0.538161
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
90. 
patient tongue id: 01101804468373_1
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 款冬花 紫菀 百部 炙甘草 辛夷 广藿香 炒白扁豆 炒苍耳子 炒六神曲
0.389991 0.613398 0.364176 0.795401 0.413508 0.531361 0.336763 0.3808 0.372904 0.327442 0.73368 0.750537 0.708241 0.788292 0.350415 0.840187 0.375938 0.311733 0.407072 0.451288 0.631913
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.523810, recall: 0.785714, error: 0.476190
91. 
patient tongue id: 05182201004368_2
label yaofang:
甘草 茯苓 葛根 麦冬 玉竹 玄参 生地黄 赤芍 牡丹皮 北沙参 百合 炒六神曲 布渣叶 干石斛
0.427626 0.831345 0.414019 0.930962 0.469771 0.569425 0.418482 0.446991 0.444471 0.895095 0.892508 0.875202 0.907906 0.500924 0.956502 0.348041 0.389966 0.564754 0.834615
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.105263, recall: 0.142857, error: 0.894737
92. 
patient tongue id: 04202032314874_1_7_4
label yaofang:
柴胡 白芍 陈皮 当归 党参 黄芪 白术 牛膝 车前子 升麻 炙甘草
0.532687 0.360272 0.517881 0.333809 0.501695
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.272727, error: 0.400000
93. 
patient tongue id: 02182209018216_4_7_6
label yaofang:
甘草 枳壳 牛蒡子 党参 白术 浙贝母 郁金 天麻 天花粉 鳖甲 莪术 夏枯草 蜈蚣 白花蛇舌 红豆杉 有瓜石斛
0.973133 0.327864 0.514232 0.582987 0.449007 0.319262 0.480993 0.459819 0.42934 0.346269 0.341234
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
94. 
patient tongue id: 05251929477886_4_7
label yaofang:
枳壳 茯苓 薏苡仁 黄芪 白术 生地黄 胆南星 浙贝母 牡丹皮 杜仲 郁金 厚朴 生半夏 僵蚕 天竺黄 蜈蚣
0.475268 0.383771 0.411202 0.507154 0.551377 0.312326 0.358162
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
95. 
patient tongue id: 04182145431436_2
label yaofang:
甘草 黄芩 桔梗 芦根 太子参 浙贝母 乌梅 天花粉 鳖甲 麦芽 白花蛇舌 蜂房 岗梅根 四季青
0.988929 0.519267 0.671098 0.455695 0.385666 0.676339 0.588765 0.547258 0.475052 0.517562 0.495235
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
96. 
patient tongue id: 06190814404475_7_6
label yaofang:
甘草 白芍 川芎 茯苓 羌活 酸枣仁 赤芍 牛膝 天麻 全蝎 白芷 蔓荆子 麦芽 合欢花
0.395845 0.318748 0.451299 0.309033 0.448504
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
97. 
patient tongue id: 02211901277018_6
label yaofang:
甘草 黄芩 砂仁 百合 紫苏叶
0.368163 0.307645 0.388398 0.438065 0.45341 0.344658 0.491293
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.200000, error: 0.857143
98. 
patient tongue id: 02251232411241_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 广藿香
0.405134 0.778141 0.444863 0.868096 0.422574 0.527896 0.414163 0.408426 0.390421 0.818952 0.812654 0.797369 0.829197 0.509153 0.917127 0.370517 0.531349 0.761996
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.692308, error: 0.500000
99. 
patient tongue id: 03292022251262_1_7
label yaofang:
甘草 枳壳 半夏 黄芪 丹参 牡丹皮 钩藤 白茅根 泽泻 厚朴 砂仁 茯苓皮 苏木 北沙参 赭石
0.503333 0.355943 0.49181 0.451921 0.397885 0.310889
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
100. 
patient tongue id: 02171810004872_1_6
label yaofang:
川芎 大枣 当归 党参 太子参 黄芪 枸杞子 熟地黄 郁金 干姜 北柴胡 炙甘草 续断 盐菟丝子 墨旱莲 干益母草 红参
0.40661 0.406554 0.306558 0.301276 0.329432 0.537226
predicted yaofang:
法半夏 茯苓 防风 黄芪 北沙参 炙甘草

------Score: precision: 0.333333, recall: 0.117647, error: 0.666667
101. 
patient tongue id: 05182022500326_1_4_6
label yaofang:
牡蛎 黄芪 白术 牛膝 厚朴 砂仁 火麻仁 莪术 北沙参 红豆杉 土茯苓 合欢皮 墨旱莲 山慈菇
0.50997 0.338082 0.438224 0.566018 0.701456 0.346152 0.321722 0.403079 0.382213 0.316468 0.312511
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
102. 
patient tongue id: 04102047028892_1_6
label yaofang:
当归 木香 牛蒡子 党参 黄芪 鸡血藤 白术 柏子仁 炙甘草 百合 紫苏叶 覆盆子 山慈菇
0.400665 0.331875 0.439237 0.507178 0.409159 0.36519
predicted yaofang:
甘草 柴胡 白芍 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
103. 
patient tongue id: 06190648385281_6_7_4
label yaofang:
甘草 茯苓 木香 党参 白术 酸枣仁 牡丹皮 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红曲
0.984173 0.497023 0.670757 0.463178 0.364542 0.703412 0.613736 0.594665 0.50777 0.541448 0.551812
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
104. 
patient tongue id: 02222334070377_6_5
label yaofang:
茯苓 薏苡仁 玉竹 党参 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 山药 当归尾 砂仁 菟丝子 巴戟天 桑寄生 芡实 鸡内金 莲子 北沙参 百合 红豆杉 合欢皮 山慈菇
0.31959 0.346865 0.440328 0.441586
predicted yaofang:
党参 黄芪 白术 炙甘草

------Score: precision: 0.750000, recall: 0.125000, error: 0.250000
105. 
patient tongue id: 05042105441117_4
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.304155 0.388441 0.382852 0.411616 0.30493 0.401223 0.590388
predicted yaofang:
柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.200000, error: 0.714286
106. 
patient tongue id: 03242119036671_1
label yaofang:
桂枝 白芍 当归 茯苓 龙骨 牡蛎 牛蒡子 党参 黄芪 白术 炙甘草 浮小麦
0.321645 0.407062 0.452639 0.408163 0.341031 0.489062
predicted yaofang:
柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
107. 
patient tongue id: 03222007285542_4
label yaofang:
大枣 党参 海藻 苍术 泽泻 荷叶 决明子 紫苏叶 焦山楂 广藿香
0.395428 0.360582 0.510545 0.438591 0.357243
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
108. 
patient tongue id: 06182229164094_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 砂仁 白扁豆 紫苏梗 广藿香 稻芽 火炭母 手参
0.851511 0.426093 0.550988 0.558117 0.357087
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
109. 
patient tongue id: 03192246526398_6_1
label yaofang:
甘草 枳壳 法半夏 薏苡仁 牛膝 郁金 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.994117 0.531639 0.677556 0.425368 0.370127 0.697541 0.623367 0.567768 0.496395 0.521619 0.492576
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
110. 
patient tongue id: 03231253299190_1_6
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 党参 山药 砂仁 天麻 鳖甲 麦芽 建曲 蜈蚣 白花蛇舌 天山雪莲
0.921215 0.444583 0.620607 0.49263 0.529147 0.411862 0.451146 0.341466 0.344191
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.777778, recall: 0.466667, error: 0.222222
111. 
patient tongue id: 04210650146115_6
label yaofang:
甘草 龙骨 白术 酸枣仁 生地黄 知母 山茱萸 天麻 地骨皮 糯稻根 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.990441 0.501768 0.696202 0.421784 0.32996 0.377989 0.764733 0.621703 0.587141 0.517943 0.557361 0.568569
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
112. 
patient tongue id: 03231130264975_2_7_6
label yaofang:
甘草 党参 白术 酸枣仁 生地黄 红花 赤芍 天麻 鳖甲 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.730946 0.475801 0.477692 0.307861 0.383862
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
113. 
patient tongue id: 01031824153244_5
label yaofang:
防风 钩藤 荆芥穗 白芷 炙甘草 首乌藤 广藿香 威灵仙 香薰 炒六神曲 炒蔓荆子 棉萆薢 醋香附
0.422376 0.765811 0.412566 0.900167 0.457071 0.586724 0.381652 0.413919 0.397241 0.308124 0.853856 0.849173 0.823658 0.881269 0.445419 0.924566 0.38603 0.300128 0.420846 0.530517 0.771235
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.190476, recall: 0.307692, error: 0.809524
114. 
patient tongue id: 04142235021638_1_2_6
label yaofang:
甘草 白芍 陈皮 茯苓 党参 白术 黄连 延胡索 熟地黄 槟榔 乌梅 山药 茜草 砂仁 鸡内金 麦芽
0.966867 0.500741 0.612126 0.433036 0.346937 0.571865 0.503567 0.466912 0.412093 0.429272 0.404292
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
115. 
patient tongue id: 06190941028380_1_6
label yaofang:
甘草 远志 党参 白术 熟附子 杜仲 天麻 桑寄生 鳖甲 淫羊藿 仙茅 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.967643 0.489674 0.629447 0.441931 0.309946 0.561004 0.446623 0.432046 0.334982 0.374955 0.366316
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
116. 
patient tongue id: 04071922199692_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.585624 0.450397 0.442353 0.404052 0.393412 0.334006
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
117. 
patient tongue id: 05172106598638_1_2_6
label yaofang:
甘草 龙骨 远志 党参 酸枣仁 生地黄 知母 山药 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.960469 0.502022 0.638537 0.436186 0.376204 0.617528 0.500394 0.453513 0.40419 0.434212 0.412339
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
118. 
patient tongue id: 05270627363363_1_6
label yaofang:
甘草 白芍 枳壳 薏苡仁 白术 肉苁蓉 瓜蒌皮 鳖甲 火麻仁 莪术 苦杏仁 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.995896 0.529204 0.696529 0.439536 0.380684 0.743035 0.665716 0.617761 0.545511 0.581403 0.557366
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
119. 
patient tongue id: 03021128578741_1_2
label yaofang:
桂枝 葛根 桃仁 延胡索 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草
0.40878 0.501804 0.335864 0.339126
predicted yaofang:
甘草 党参 牛膝 天麻

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
120. 
patient tongue id: 02120806384943_1_4
label yaofang:
甘草 白芍 木香 党参 鸡血藤 山药 车前子 天麻 赤石脂 鳖甲 补骨脂 建曲 蜈蚣 天山雪莲 半枝莲
0.934474 0.466147 0.610416 0.383873 0.325064 0.56908 0.340823
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲

------Score: precision: 0.714286, recall: 0.333333, error: 0.285714
121. 
patient tongue id: 04062139041956_1_3_4
label yaofang:
柴胡 黄芩 生地黄 红花 牛膝 茵陈 淡竹叶 补骨脂 夏枯草 地龙 蜈蚣 红豆杉 炒莱菔子 鹰不泊
0.56925 0.386681 0.501059 0.461419 0.487101
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
122. 
patient tongue id: 01180614395208_1_6
label yaofang:
甘草 法半夏 茯苓 党参 白术 黄连 赤芍 川楝子 郁金 砂仁 麦芽 佛手 合欢花 鱼古 瓦楞子
0.970378 0.499407 0.647073 0.467467 0.318812 0.377199 0.650071 0.571215 0.548973 0.483246 0.503978 0.506688
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
123. 
patient tongue id: 03282208032654_6_4
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 厚朴 款冬花 苦杏仁 紫苏子 炙麻黄
0.841139 0.439576 0.582959 0.351391 0.490811
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
124. 
patient tongue id: 05102150507876_1
label yaofang:
法半夏 前胡 防风 白芷 款冬花 紫菀 白前 百部 豆蔻 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.381655 0.843071 0.423932 0.903404 0.417525 0.591889 0.361541 0.377273 0.341455 0.853483 0.854244 0.829334 0.8678 0.452987 0.958066 0.363061 0.486532 0.811022
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.733333, error: 0.388889
125. 
patient tongue id: 02242340085717_5_6_7
label yaofang:
甘草 陈皮 茯苓 半夏 党参 何首乌 白术 赤芍 浙贝母 僵蚕 苍耳子 猫爪草
0.542969 0.388815 0.47071 0.478333 0.473199
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
126. 
patient tongue id: 02271836001035_2_1
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄 炒苍耳子
0.418168 0.761605 0.406969 0.889068 0.433312 0.550882 0.402587 0.402392 0.383408 0.839284 0.838371 0.818021 0.865046 0.494994 0.928649 0.338888 0.385012 0.5376 0.772301
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
127. 
patient tongue id: 06091947529847_5
label yaofang:
甘草 前胡 桔梗 连翘 薄荷 芦根 牛蒡子 浙贝母 桑叶 菊花 桑白皮 白前 苦杏仁 辛夷 龙脷叶 紫苑 东风桔
0.506736 0.407567 0.45195 0.362346 0.480877
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.058824, error: 0.800000
128. 
patient tongue id: 03211948506700_1
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.420353 0.519635 0.440583 0.317385 0.410076 0.460291 0.36916 0.33692 0.624109 0.681222 0.318966
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.181818, recall: 0.200000, error: 0.818182
129. 
patient tongue id: 01040319436005_6_2
label yaofang:
甘草 白芍 陈皮 法半夏 茯苓 薏苡仁 远志 党参 赤芍 山药 豆蔻 川木瓜 宽筋藤
0.933731 0.476684 0.576572 0.372741 0.306225 0.502025 0.31377
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
130. 
patient tongue id: 04221908136790_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.380391 0.708063 0.446846 0.781247 0.410676 0.484109 0.408958 0.405513 0.405798 0.748472 0.739094 0.738643 0.76102 0.46735 0.88087 0.303811 0.363843 0.52225 0.725588
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
131. 
patient tongue id: 02181558053229_5
label yaofang:
甘草 川芎 黄芩 桔梗 金银花 浙贝母 细辛 白芷 蔓荆子 辛夷 广藿香 苍耳子
0.984769 0.518713 0.640068 0.477415 0.371823 0.607528 0.57334 0.55292 0.464103 0.478194 0.453731
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.083333, error: 0.909091
132. 
patient tongue id: 04282030496500_5
label yaofang:
甘草 白芍 茯苓 党参 生地黄 延胡索 杜仲 菟丝子 桑寄生 金樱子 蛇床子 忍冬藤 威灵仙 覆盆子
0.881721 0.324104 0.428154 0.581236 0.477858 0.335206
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
133. 
patient tongue id: 04282226353920_5
label yaofang:
甘草 黄芩 桔梗 芦根 牛蒡子 黄连 浙贝母 天花粉 鳖甲 诃子 板蓝根 白花蛇舌 蜂房 四季青 广升麻
0.991725 0.528017 0.660075 0.456281 0.373658 0.668028 0.612802 0.575105 0.50061 0.526508 0.494227
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
134. 
patient tongue id: 02231903278259_4
label yaofang:
陈皮 法半夏 茯苓 党参 海螵蛸 干姜 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 炙黄芪 甘松
0.393238 0.317292 0.587795 0.475178 0.588675 0.357208 0.394666 0.329487 0.321856 0.541469 0.493264 0.476723 0.470704 0.379236 0.577579 0.31555 0.424207
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.294118, recall: 0.384615, error: 0.705882
135. 
patient tongue id: 02211430590842_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.367844 0.343266 0.432896 0.320467 0.600227 0.615184 0.329881 0.405863 0.357152 0.399583 0.481905
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
136. 
patient tongue id: 02150738158983_1_4_7
label yaofang:
甘草 薏苡仁 麦冬 太子参 枸杞子 丹参 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 黄精 三七粉
0.365299 0.366406 0.395035 0.449708 0.347463
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
137. 
patient tongue id: 03012031030916_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.300091 0.544473 0.463451 0.49166 0.341169 0.422444 0.349644 0.309524 0.455551 0.429293 0.472778 0.456062 0.394258 0.661511 0.315247 0.350271 0.456296
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.928571, error: 0.235294
138. 
patient tongue id: 01041841399491_1_2
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香
0.448817 0.829241 0.417379 0.943465 0.474327 0.5893 0.403116 0.435663 0.410173 0.903379 0.90053 0.871929 0.918405 0.490106 0.950175 0.368696 0.416951 0.56228 0.816222
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.714286, error: 0.473684
139. 
patient tongue id: 03231413372451_1_2
label yaofang:
甘草 白芍 当归 茯苓 党参 黄芪 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲 红豆杉
0.874142 0.439895 0.593151 0.521622 0.409087 0.333671 0.410157
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 1.000000, recall: 0.500000, error: 0.000000
140. 
patient tongue id: 03040901036714_2_1
label yaofang:
甘草 白芍 茯苓 玉竹 党参 太子参 丹参 山药 砂仁 扁豆花 北沙参 女贞子 黄精
0.846561 0.446812 0.555866 0.45719 0.363713
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
141. 
patient tongue id: 04122203019282_2_6
label yaofang:
甘草 白芍 茯苓 龙骨 党参 酸枣仁 生地黄 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.949559 0.492763 0.651896 0.502015 0.376991 0.613514 0.571861 0.554011 0.463485 0.502036 0.495368
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
142. 
patient tongue id: 04150843040441
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.459066 0.325321 0.510047 0.504376 0.459897 0.302426
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
143. 
patient tongue id: 04111954484446_1_4_7
label yaofang:
甘草 枳壳 半夏 牛蒡子 薏苡仁 黄芪 枸杞子 赤芍 海螵蛸 杜仲 黄柏 牛膝 山药 厚朴 鳖甲 北沙参 紫苏梗 黑枣 骨碎补 红豆杉 蛇舌草 稻芽
0.519164 0.34124 0.410284 0.428383 0.659382 0.713026 0.344829 0.377615 0.483943 0.423165 0.444517 0.442026 0.335269
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.538462, recall: 0.318182, error: 0.461538
144. 
patient tongue id: 04101902372169_4
label yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.460798 0.89538 0.345056 0.98358 0.52188 0.692817 0.355725 0.463917 0.425316 0.966358 0.965754 0.948474 0.975769 0.438805 0.982962 0.438345 0.301223 0.460184 0.596014 0.891501
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 1.000000, error: 0.400000
145. 
patient tongue id: 05081759003586_1
label yaofang:
柴胡 白芍 川芎 陈皮 枳壳 麦冬 郁金 瓜蒌皮 炙甘草 醋香附 合欢皮
0.508999 0.336098 0.49654 0.387356
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
146. 
patient tongue id: 01172231285116_3_6
label yaofang:
桂枝 甘草 法半夏 茯苓 前胡 党参 酸枣仁 五味子 郁金 细辛 鳖甲 麦芽 紫苏子 白花蛇舌 天山雪莲
0.963357 0.498375 0.632417 0.466874 0.359248 0.567586 0.500413 0.472654 0.398509 0.422051 0.397258
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
147. 
patient tongue id: 01211310480827_4
label yaofang:
柴胡 白芍 当归 茯苓 薄荷 白术 栀子 淡豆豉 秦艽 炙甘草 嫩桑枝 丝瓜络 首乌藤 威灵仙
0.509896 0.519488 0.373236
predicted yaofang:
甘草 党参 白术

------Score: precision: 0.333333, recall: 0.071429, error: 0.666667
148. 
patient tongue id: 04122201154543_6_4
label yaofang:
甘草 柴胡 白芍 党参 延胡索 牡丹皮 山药 车前子 荆芥穗 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.99453 0.512209 0.699336 0.47938 0.324351 0.390352 0.776235 0.69791 0.692075 0.586085 0.636399 0.6495
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.529412, error: 0.250000
149. 
patient tongue id: 06181835371604_6_2
label yaofang:
甘草 茯苓 龙骨 党参 白术 酸枣仁 栀子 黄柏 山药 山茱萸 女贞子 粉葛 浮小麦 百合 墨旱莲
0.997351 0.535517 0.726383 0.460634 0.308875 0.399338 0.784785 0.690873 0.666752 0.567799 0.624907 0.615306
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
150. 
patient tongue id: 04012004092485_2_5
label yaofang:
桔梗 荆芥 防风 牛蒡子 薏苡仁 酸枣仁 乳香 没药 苦杏仁 炙甘草 浮小麦 木棉花 东风桔 咸竹蜂
0.365418 0.663506 0.461192 0.726085 0.396249 0.439266 0.394581 0.392594 0.356761 0.681845 0.662695 0.660801 0.669517 0.480547 0.799319 0.340081 0.455911 0.641624
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.166667, recall: 0.214286, error: 0.833333
151. 
patient tongue id: 05102010299083_1_2
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草
0.372056 0.822059 0.444037 0.86678 0.412173 0.559958 0.39526 0.385038 0.38298 0.809092 0.813161 0.792377 0.817991 0.467304 0.948045 0.364158 0.474063 0.767823
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
152. 
patient tongue id: 03291630117153_1_2
label yaofang:
甘草 陈皮 法半夏 当归 茯苓 桃仁 远志 党参 黄连 厚朴 天花粉 款冬花 苦杏仁 丝瓜络 紫苏梗
0.971532 0.49875 0.655915 0.468748 0.315854 0.378704 0.647637 0.531221 0.514553 0.433076 0.47611 0.479911
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
153. 
patient tongue id: 05231939082258_1_2
label yaofang:
甘草 葛根 防风 麦冬 玉竹 黄芪 玄参 细辛 荷叶 白芷 北沙参 辛夷 广藿香 炒苍耳子
0.456544 0.914476 0.387887 0.985046 0.525762 0.678516 0.37753 0.448204 0.416166 0.969744 0.967957 0.954009 0.976249 0.505009 0.988901 0.366881 0.423162 0.608537 0.914258
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.263158, recall: 0.357143, error: 0.736842
154. 
patient tongue id: 06070043282206_4_7_1
label yaofang:
甘草 法半夏 茯苓 薏苡仁 远志 白术 酸枣仁 黄连 红花 天麻 僵蚕 紫草 忍冬藤 蒺藜 首乌藤
0.988528 0.506094 0.639077 0.427986 0.346487 0.666039 0.591885 0.554823 0.486069 0.503288 0.477484
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
155. 
patient tongue id: 02142340280552_1_2_7
label yaofang:
甘草 川芎 葛根 黄芪 枸杞子 天麻 白花蛇舌草 地龙 蒺藜 首乌藤 蜈蚣 半枝莲 醋鳖甲 酒女贞子 墨旱莲
0.987909 0.500388 0.673632 0.525788 0.305777 0.389911 0.701385 0.657604 0.660859 0.551519 0.582932 0.599769
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
156. 
patient tongue id: 03012131157992_2_5_1
label yaofang:
甘草 茯苓 薏苡仁 白术 酸枣仁 熟附子 天麻 鳖甲 莪术 败酱草 蒺藜 浮小麦 蜈蚣 天山雪莲 半枝莲 红豆杉
0.975727 0.506862 0.645796 0.488203 0.377782 0.581897 0.529009 0.508731 0.420498 0.451345 0.414443
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
157. 
patient tongue id: 04201449199635_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.325621 0.536384 0.456768 0.489148 0.572842 0.421106 0.559021 0.418866 0.513898 0.428942 0.510104 0.345673 0.495155 0.497041 0.507708
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
158. 
patient tongue id: 05022023535253_6_4
label yaofang:
甘草 柴胡 白芍 茯苓 党参 延胡索 川楝子 天麻 五灵脂 鳖甲 麦芽 蜈蚣 天山雪莲 半枝莲 红豆杉
0.974982 0.504692 0.634293 0.446241 0.364328 0.610337 0.526642 0.485867 0.427726 0.454361 0.428583
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
159. 
patient tongue id: 03020730260303_6
label yaofang:
桂枝 甘草 黄芩 茯苓 桔梗 桃仁 青皮 浙贝母 牡丹皮 郁金 蔓荆子 益母草 辛夷 炒苍耳子
0.983828 0.497469 0.668502 0.521968 0.379596 0.655143 0.624456 0.624123 0.504865 0.544707 0.53281
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
160. 
patient tongue id: 05092051183077_6_4
label yaofang:
柴胡 大枣 茯苓 防风 连翘 太子参 昆布 海藻 乌梅 石斛 白花蛇舌草 猫爪草 山慈菇
0.355703 0.446475 0.344636 0.447241 0.429722 0.462852 0.574418
predicted yaofang:
柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
161. 
patient tongue id: 05032258200734_2_6
label yaofang:
甘草 白术 玄参 生地黄 钩藤 厚朴 天麻 地骨皮 肉苁蓉 火麻仁 决明子 瓜蒌子 浮小麦
0.852957 0.445059 0.557901 0.443488 0.368554
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
162. 
patient tongue id: 01012048352078_1_5
label yaofang:
甘草 当归 茯苓 木香 党参 黄芪 酸枣仁 丹参 郁金 浮小麦 首乌藤 制远志
0.594837 0.389551 0.536944 0.434863 0.421823
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
163. 
patient tongue id: 03032011488364_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 细辛 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.449116 0.873092 0.350971 0.970824 0.494495 0.66602 0.361285 0.437599 0.408383 0.945621 0.946347 0.92375 0.959628 0.434132 0.974051 0.414454 0.449272 0.581384 0.862981
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.785714, error: 0.421053
164. 
patient tongue id: 02130442450613_2_1_6
label yaofang:
甘草 枳壳 茯苓 远志 党参 酸枣仁 生地黄 天麻 地榆 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986987 0.522535 0.665786 0.470743 0.387931 0.671031 0.611449 0.570425 0.48843 0.519798 0.498781
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
165. 
patient tongue id: 02211419567915_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.450563 0.498669 0.501061 0.501468
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
166. 
patient tongue id: 02212223393659_4_7
label yaofang:
独活 薏苡仁 党参 白术 红花 延胡索 黄柏 苍术 桑寄生 锁阳 续断 威灵仙 牛大力
0.975037 0.508194 0.622002 0.452008 0.358116 0.570203 0.518172 0.480644 0.411779 0.425335 0.394922
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
167. 
patient tongue id: 01250628409091_1_6
label yaofang:
甘草 柴胡 白芍 法半夏 龙骨 远志 党参 酸枣仁 天麻 白花蛇舌草 麦芽 首乌藤 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.975305 0.500235 0.631226 0.45283 0.36621 0.602783 0.51645 0.462281 0.406882 0.428624 0.407574
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
168. 
patient tongue id: 03021846577205_5_7_1
label yaofang:
甘草 薏苡仁 桃仁 黄芪 白术 浙贝母 杜仲 生半夏 砂仁 地榆 槐花 鸡内金 土鳖虫 红豆杉 蛇舌草
0.33847 0.385847 0.328682 0.461484 0.306857 0.402147 0.314126
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
169. 
patient tongue id: 04250817536434_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.515287 0.342286 0.307766 0.506681 0.492757 0.373194 0.340081 0.371323
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
170. 
patient tongue id: 05312146451705_7_2_1
label yaofang:
甘草 薏苡仁 党参 白术 熟附子 红花 天麻 鳖甲 补骨脂 败酱草 续断 蜈蚣 天山雪莲 半枝莲
0.988915 0.518243 0.674138 0.461203 0.378877 0.685843 0.611341 0.57467 0.500394 0.538596 0.518316
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
171. 
patient tongue id: 05182111457598_4
label yaofang:
玉竹 牛膝 大黄 萆薢 天山雪莲 土茯苓
0.356273 0.407296 0.350868 0.307655 0.386478 0.489393 0.420989 0.525484 0.64596 0.309797 0.309476
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶 紫苏梗

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
172. 
patient tongue id: 03090754552358_6_4
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 杜仲 山药 桑寄生 鳖甲 麦芽 首乌藤 合欢花 土鳖虫 鹿衔草
0.961997 0.473902 0.626478 0.56418 0.365115 0.527674 0.497252 0.577988 0.368033 0.410121 0.408196
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
173. 
patient tongue id: 03231846164081_2_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 威灵仙 蜜麻黄
0.397182 0.743265 0.402067 0.872582 0.416397 0.572091 0.374255 0.371601 0.361656 0.81308 0.805384 0.790376 0.843902 0.45153 0.909892 0.345795 0.386851 0.498769 0.732908
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.733333, error: 0.421053
174. 
patient tongue id: 03161311579397_4
label yaofang:
法半夏 前胡 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 广藿香 蜜麻黄 炒苍耳子
0.380828 0.678365 0.436244 0.804359 0.389662 0.513814 0.387221 0.355281 0.333044 0.742548 0.725198 0.728229 0.770799 0.500541 0.85696 0.310249 0.357933 0.496296 0.68758
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.714286, error: 0.473684
175. 
patient tongue id: 01132319507389_6_7
label yaofang:
桂枝 柴胡 白芍 黄芩 大枣 党参 杜仲 苍术 秦艽 姜半夏 炙甘草 续断 首乌藤
0.54969 0.333736 0.320214 0.48252 0.515907
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
176. 
patient tongue id: 05131451395188_2_6
label yaofang:
甘草 白芍 太子参 生地黄 浙贝母 乌梅 山药 山茱萸 鳖甲 北沙参 百合 白花蛇舌 蜂房 岗梅根 四季青
0.989293 0.513534 0.656445 0.450578 0.357329 0.660253 0.583651 0.54282 0.472418 0.502372 0.480248
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
177. 
patient tongue id: 01312129035283_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 白术 厚朴 豆蔻 麦芽 丝瓜络 紫苏梗 广藿香 麸炒枳壳
0.984806 0.505428 0.63451 0.481247 0.3556 0.595392 0.534969 0.518025 0.420259 0.446799 0.427376
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
178. 
patient tongue id: 05261945508635_1_4_7
label yaofang:
甘草 陈皮 半夏 黄芪 白术 海螵蛸 杜仲 牛膝 山药 厚朴 僵蚕 桑寄生 鸡内金 紫苏梗 蜈蚣 红豆杉
0.63706 0.384807 0.523149 0.500618 0.610089 0.313408 0.306417
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
179. 
patient tongue id: 03242140505960_4
label yaofang:
柴胡 白芍 香附 枳壳 丹参 海螵蛸 浙贝母 豆蔻 姜半夏 紫苏梗
0.30994 0.479251 0.32663 0.368667
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
180. 
patient tongue id: 03181805202709_2_6
label yaofang:
甘草 茯苓 太子参 白术 五味子 浙贝母 郁金 山药 山茱萸 天麻 鳖甲 淫羊藿 补骨脂 蜈蚣 白花蛇舌 天山雪莲 川加皮
0.934699 0.457882 0.674179 0.542957 0.360933 0.590772 0.457584 0.492397 0.335992 0.406043 0.406943
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.529412, error: 0.181818
181. 
patient tongue id: 04052109590585_5_1
label yaofang:
茯苓 半夏 薏苡仁 白术 车前子 厚朴 僵蚕 赤小豆 火麻仁 豆蔻 决明子 地龙 广藿香 木棉花
0.54074 0.376558 0.502522 0.346959 0.471023
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
182. 
patient tongue id: 04112215261003_6_2
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 佛手 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.971696 0.481398 0.666297 0.476304 0.351282 0.618068 0.521625 0.509906 0.409857 0.451652 0.448207
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
183. 
patient tongue id: 04112351041774_7_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 白芷 蔓荆子 炙甘草 百合 紫苏叶
0.397204 0.315919 0.462375 0.465835 0.37597
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
184. 
patient tongue id: 06132200268113_6_4
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 白花蛇舌草 炙甘草 百合 紫苏叶 山慈菇
0.339584 0.331465 0.416433 0.484986 0.484295 0.339465 0.453626
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
185. 
patient tongue id: 04182149490929_6
label yaofang:
甘草 茯苓 党参 白术 延胡索 牡丹皮 杜仲 山药 桑寄生 补骨脂 王不留行 麦芽 威灵仙 合欢花
0.98808 0.512921 0.677221 0.476239 0.382781 0.674156 0.585734 0.562249 0.469239 0.516391 0.492795
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
186. 
patient tongue id: 05232159081194_1_6
label yaofang:
白芍 川芎 法半夏 当归 茯苓 木香 丹参 川楝子 郁金 北柴胡 炙甘草 麸炒白术 醋香附 麸炒枳壳
0.376513 0.470418 0.419317 0.617891 0.347115 0.388506 0.352057 0.318879 0.556099 0.544506 0.544584 0.622826 0.494219 0.721187 0.306313 0.466418
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

------Score: precision: 0.187500, recall: 0.214286, error: 0.812500
187. 
patient tongue id: 04200629521828_1
label yaofang:
甘草 白芍 独活 党参 白术 生地黄 红花 延胡索 桑寄生 补骨脂 锁阳 续断 牛大力 千斤拔
0.683949 0.399452 0.510592 0.478934
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.214286, error: 0.250000
188. 
patient tongue id: 04122149059520_1_4
label yaofang:
甘草 白芍 赤芍 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜 宽筋藤 田七末
0.984664 0.495592 0.701579 0.559853 0.391288 0.698875 0.650752 0.668619 0.520609 0.588789 0.595546
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
189. 
patient tongue id: 06181844151612_4_6_1
label yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 延胡索 浙贝母 郁金 山药 细辛 天麻 鳖甲 莪术 粉葛 蜈蚣 白花蛇舌 天山雪莲
0.934307 0.342801 0.442239 0.618095 0.474346 0.437954 0.325148 0.377473
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.352941, error: 0.250000
190. 
patient tongue id: 03012212494887_2_5_6
label yaofang:
甘草 香附 黄芩 茯苓 连翘 党参 白术 酸枣仁 丹参 生地黄 山药 地骨皮 白芷 菟丝子 益母草 皂角刺
0.953131 0.487668 0.615498 0.451474 0.336237 0.546825 0.479874 0.448299 0.377309 0.400027 0.371459
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
191. 
patient tongue id: 04141827283444_5_1
label yaofang:
荆芥 薄荷 浙贝母 僵蚕 苦杏仁 紫苏子 蝉蜕 紫苏叶 木蝴蝶 龙脷叶 紫苑
0.646369 0.402078 0.480638 0.481869 0.635637 0.314884 0.343961 0.346829
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
192. 
patient tongue id: 01050649249746_7_4
label yaofang:
甘草 川芎 法半夏 茯苓 枸杞子 白术 牛膝 石菖蒲 天麻 僵蚕 蒺藜 粉葛 首乌藤
0.942507 0.475652 0.605519 0.502144 0.352601 0.491338 0.407636 0.447632 0.326276 0.306501
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
193. 
patient tongue id: 05232002187688_1
label yaofang:
桂枝 甘草 白芍 陈皮 茯苓 半夏 薏苡仁 黄芪 白术 杜仲 厚朴 僵蚕 肉苁蓉 巴戟天 补骨脂 续断 粉葛 紫苏叶 五指毛桃
0.514957 0.36273 0.465049 0.534802 0.493909 0.303036 0.314706 0.324334 0.30271
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝 厚朴 鸡内金 北沙参

------Score: precision: 0.555556, recall: 0.263158, error: 0.444444
194. 
patient tongue id: 04210038371795_2_1_7
label yaofang:
甘草 龙骨 党参 酸枣仁 牡丹皮 地黄 青蒿 天麻 地骨皮 胡黄连 白花蛇舌草 浮小麦 醋龟甲 蜈蚣 半枝莲 醋鳖甲
0.987154 0.515002 0.674106 0.450143 0.360087 0.695678 0.597178 0.555589 0.484053 0.522843 0.508861
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
195. 
patient tongue id: 05131629477984_6_1
label yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 麦芽 粉葛 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986682 0.501177 0.686492 0.471023 0.323926 0.384098 0.732745 0.647147 0.622956 0.545435 0.591932 0.598243
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
196. 
patient tongue id: 05251954568370_4_7
label yaofang:
甘草 牡蛎 薏苡仁 黄芪 白术 浙贝母 莪术 鸡内金 北沙参 橘络 合欢皮 墨旱莲
0.347732 0.400741 0.308634 0.347768 0.392363
predicted yaofang:
甘草 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
197. 
patient tongue id: 03151339340493_4
label yaofang:
甘草 前胡 桔梗 防风 薄荷 荆芥穗 白芷 紫菀 百部 辛夷 紫苏梗 广藿香
0.401014 0.77396 0.398784 0.906663 0.439482 0.580841 0.372695 0.397021 0.379961 0.858234 0.856894 0.83747 0.883509 0.446797 0.921867 0.372609 0.404496 0.517123 0.761088
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.368421, recall: 0.583333, error: 0.631579
198. 
patient tongue id: 04222055319770_9
label yaofang:
陈皮 防风 党参 钩藤 砂仁 天麻 白芷 石决明 炙甘草 首乌藤 广藿香 麸炒白术 炙黄芪 甘松 炒蔓荆子 棉萆薢
0.470702 0.916729 0.348993 0.990426 0.556489 0.716879 0.350422 0.479804 0.438769 0.979711 0.977712 0.965667 0.984988 0.455311 0.989174 0.456628 0.322357 0.471773 0.607261 0.914299
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
199. 
patient tongue id: 04122337368778_6_4
label yaofang:
甘草 茯苓 薏苡仁 白术 郁金 山药 厚朴 鳖甲 扁豆花 莪术 粉葛 白花蛇舌 天山雪莲
0.958818 0.455491 0.636227 0.58482 0.349886 0.50471 0.461223 0.557154 0.330589 0.387695 0.375805
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.538462, error: 0.363636
200. 
patient tongue id: 05311938383347_1_6
label yaofang:
柴胡 香附 麦冬 黄芪 白术 酸枣仁 五味子 决明子 珍珠母 北沙参 合欢皮
0.773614 0.416017 0.528006 0.452872 0.64111 0.333013 0.30708 0.331695 0.342592 0.320587 0.362998
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 山药 厚朴 砂仁 莪术 蜈蚣

------Score: precision: 0.181818, recall: 0.181818, error: 0.818182
201. 
patient tongue id: 02182148324994_2_6
label yaofang:
甘草 党参 生地黄 郁金 山药 山茱萸 泽泻 车前子 海金沙 鸡内金 王不留行 川木瓜 广金钱草 土茯苓 石苇
0.995912 0.522026 0.69506 0.460946 0.302309 0.386474 0.736211 0.648134 0.614601 0.528668 0.574669 0.558353
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
202. 
patient tongue id: 01250641411603_6_1_7
label yaofang:
甘草 柴胡 白芍 党参 酸枣仁 丹参 砂仁 天麻 鳖甲 柿蒂 佛手 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.9847 0.498857 0.621452 0.490284 0.350251 0.576392 0.556919 0.540274 0.430724 0.453329 0.413811
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
203. 
patient tongue id: 05290752497715_5_6
label yaofang:
甘草 法半夏 前胡 桔梗 桃仁 远志 浙贝母 天麻 鳖甲 炙甘草 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.985716 0.514543 0.679928 0.485699 0.384758 0.65839 0.580916 0.555204 0.470664 0.519477 0.504911
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
204. 
patient tongue id: 05252014335896_4_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 豆蔻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.377794 0.316346 0.415317 0.499418 0.474324 0.40651
predicted yaofang:
甘草 柴胡 白芍 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
205. 
patient tongue id: 02141843293517_4
label yaofang:
陈皮 法半夏 前胡 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄 炒六神曲
0.329134 0.505266 0.431208 0.584279 0.335258 0.413453 0.333006 0.302096 0.515262 0.493035 0.533962 0.573509 0.433358 0.660285 0.301101 0.351679 0.443958
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.705882, recall: 0.800000, error: 0.294118
206. 
patient tongue id: 04142212255112_5_6_7
label yaofang:
薏苡仁 黄芪 白术 赤芍 浙贝母 山药 生半夏 砂仁 补骨脂 土鳖虫 红豆杉 山慈菇 预知子 蛇舌草 石榴皮
0.314165 0.369772 0.310067 0.415747 0.338319 0.303447 0.515531 0.548631
predicted yaofang:
陈皮 茯苓 半夏 黄芪 白术 百部 北沙参 炙甘草

------Score: precision: 0.250000, recall: 0.133333, error: 0.750000
207. 
patient tongue id: 03271333097677_4
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 防风 细辛 款冬花 紫菀 白前 百部 蜜麻黄
0.39361 0.659376 0.437422 0.776565 0.409595 0.511861 0.396183 0.38188 0.362667 0.300858 0.720114 0.713168 0.701212 0.747009 0.479775 0.837929 0.336236 0.382174 0.488211 0.667772
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.916667, error: 0.450000
208. 
patient tongue id: 02212032021886_1
label yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 红花 延胡索 山茱萸 桑寄生 补骨脂 沙苑子 姜黄 牛大力 千斤拔
0.957377 0.441981 0.627029 0.489425 0.498737 0.370006 0.410798
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
209. 
patient tongue id: 02141955547297_1
label yaofang:
麻黄 桂枝 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.411704 0.312818 0.405214 0.303807 0.48886 0.422922 0.404202
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
210. 
patient tongue id: 04051856191728_4
label yaofang:
法半夏 前胡 防风 薄荷 荆芥穗 白芷 北柴胡 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.441378 0.942214 0.374156 0.988239 0.510543 0.687153 0.394178 0.462042 0.437961 0.97371 0.974189 0.959746 0.9782 0.511934 0.993267 0.345877 0.403174 0.60989 0.930765
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.714286, error: 0.473684
211. 
patient tongue id: 03211950166651_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗
0.662814 0.410125 0.535644 0.399034 0.491964
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
212. 
patient tongue id: 04112353136101_5
label yaofang:
柴胡 白芍 香附 枳壳 蒲公英 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.322374 0.377925 0.429709 0.454474 0.36261 0.384908 0.524107
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.714286, recall: 0.416667, error: 0.285714
213. 
patient tongue id: 02151816080847_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.353113 0.482789 0.326119
predicted yaofang:
党参 黄芪 丹参

------Score: precision: 0.666667, recall: 0.153846, error: 0.333333
214. 
patient tongue id: 03291356426592_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 桃仁 丹参 赤芍 青皮 栀子 牡丹皮 郁金 天花粉 瓜蒌皮 王不留行
0.976597 0.506512 0.638525 0.456384 0.344039 0.57405 0.494071 0.468226 0.385794 0.406438 0.380615
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
215. 
patient tongue id: 06070022342291_1_6
label yaofang:
甘草 柴胡 白芍 茯苓 木香 党参 酸枣仁 槟榔 山药 桑叶 厚朴 砂仁 五灵脂 浮小麦 合欢花
0.978038 0.496565 0.672668 0.458728 0.345128 0.63325 0.517458 0.488112 0.40361 0.45386 0.443693
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
216. 
patient tongue id: 05160621245319_5
label yaofang:
陈皮 茯苓 半夏 薏苡仁 延胡索 浙贝母 牛膝 白茅根 厚朴 砂仁 土茯苓 山慈菇 蛇舌草 鲜龙葵果
0.413394 0.392552 0.366841 0.445131 0.373394 0.342831
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
217. 
patient tongue id: 03081839403859_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.318138 0.640478 0.447259 0.704855 0.37976 0.507197 0.32744 0.310038 0.32084 0.664568 0.60231 0.665759 0.685257 0.41197 0.780181 0.304953 0.343217 0.417811 0.577711
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
218. 
patient tongue id: 03171112566406_1_3
label yaofang:
黄芩 桃仁 丹参 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.575455 0.445177 0.351862 0.578726 0.528972 0.600578 0.511079 0.569073 0.562219 0.603659 0.417138 0.597848 0.557038 0.641331
predicted yaofang:
桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.785714, recall: 0.916667, error: 0.214286
219. 
patient tongue id: 02260421436767_6_1_5
label yaofang:
甘草 白芍 酸枣仁 牡丹皮 山药 地黄 天麻 紫菀 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲 化橘红
0.944295 0.484299 0.611882 0.425588 0.33012 0.552807 0.420065 0.402092 0.312636 0.336344 0.302757
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
220. 
patient tongue id: 02211902445582_6_4
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.34875 0.417029 0.351861 0.302678 0.370901 0.490709 0.422983 0.331901 0.551332 0.691661 0.315827 0.34127
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶 紫苏梗

------Score: precision: 0.666667, recall: 0.727273, error: 0.333333
221. 
patient tongue id: 04241931050225_1
label yaofang:
白芍 木香 桃仁 麦冬 玉竹 太子参 丹参 玄参 赤芍 枳实 地黄 车前子 厚朴 莱菔子 火麻仁 北沙参 苦杏仁
0.764359 0.400025 0.542387 0.32367 0.577877 0.319432
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
222. 
patient tongue id: 05140736422531_6_5
label yaofang:
甘草 白芍 茯苓 党参 白术 黄连 延胡索 乌梅 山药 蒲黄 砂仁 五灵脂 建曲 醋香附 合欢花
0.98715 0.512291 0.678958 0.469638 0.387902 0.683721 0.595429 0.563482 0.480883 0.528553 0.510992
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
223. 
patient tongue id: 01120050012119_5
label yaofang:
陈皮 黄芩 竹茹 砂仁 冬瓜皮 辛夷 广藿香 苍耳子
0.698388 0.334494 0.446227 0.448124 0.340901
predicted yaofang:
甘草 法半夏 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
224. 
patient tongue id: 06071941569092_1_4
label yaofang:
甘草 薏苡仁 党参 鸡血藤 白术 生地黄 赤芍 杜仲 天麻 鳖甲 桑枝 蜈蚣 天山雪莲 半枝莲 红豆杉
0.978214 0.497039 0.650289 0.453976 0.361851 0.632244 0.528168 0.503361 0.427836 0.461441 0.449573
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
225. 
patient tongue id: 05092142560025_6
label yaofang:
甘草 川芎 党参 白术 丹参 牡丹皮 牛膝 决明子 地龙 蒺藜 女贞子 首乌藤 合欢花 墨旱莲
0.978298 0.50966 0.650959 0.477641 0.301792 0.395398 0.62626 0.551479 0.536271 0.449036 0.48816 0.460861
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
226. 
patient tongue id: 01092331195871_1_2
label yaofang:
当归 茯苓 党参 枸杞子 白术 生地黄 黄柏 牛膝 知母 炙甘草 续断 玉米须 狗脊 龟甲
0.58055 0.393805 0.46211 0.528851 0.60613 0.304685 0.355795 0.331379 0.307284 0.360084
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
227. 
patient tongue id: 02141954379112_1
label yaofang:
乌药 金樱子 益智 覆盆子
0.811384 0.411003 0.518581 0.444205
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
228. 
patient tongue id: 01070832228124_1_4_7
label yaofang:
人参 当归 黄芪 乌药 山药 肉苁蓉 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.409495 0.38809 0.438103 0.356243 0.377661 0.304856 0.356864 0.357888
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝 钩藤 天麻

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
229. 
patient tongue id: 03151853495905_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.375405 0.727499 0.444684 0.778327 0.398982 0.517999 0.398531 0.377229 0.38298 0.307607 0.719273 0.715324 0.713949 0.736885 0.456371 0.887135 0.36271 0.467823 0.690327
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
230. 
patient tongue id: 03041422455844_3_5_6
label yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 酸枣仁 丹参 熟附子 山茱萸 桑白皮 大黄 荆芥穗 菟丝子 益母草 款冬花
0.985469 0.514072 0.681457 0.448428 0.32359 0.401353 0.701317 0.612568 0.56305 0.506055 0.547122 0.52767
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
231. 
patient tongue id: 03301244159472_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.454161 0.929022 0.306062 0.993642 0.543205 0.748798 0.312322 0.450747 0.395344 0.983404 0.982583 0.970145 0.989172 0.395409 0.990363 0.465688 0.470345 0.603807 0.922105
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
232. 
patient tongue id: 04061349068885_5_6
label yaofang:
甘草 枳壳 黄芩 牡蛎 薏苡仁 杜仲 牛膝 钩藤 泽泻 天麻 桑寄生 豆蔻 麦芽
0.974496 0.503238 0.629099 0.450785 0.345336 0.576242 0.514349 0.47742 0.409174 0.429392 0.400662
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
233. 
patient tongue id: 03301924065599_2
label yaofang:
陈皮 法半夏 前胡 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.341677 0.525178 0.464536 0.46779 0.316704 0.36316 0.418098 0.381567 0.391365 0.387413 0.385703 0.569163 0.31094
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.769231, recall: 0.666667, error: 0.230769
234. 
patient tongue id: 05262204569733_1_2_7
label yaofang:
甘草 太子参 黄芪 鸡血藤 枸杞子 白术 酸枣仁 生地黄 山药 天麻 地龙 女贞子 沙苑子 威灵仙 灯盏细辛
0.923072 0.464929 0.621242 0.535326 0.333097 0.442936 0.363378 0.42962
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
235. 
patient tongue id: 03081813185383_6
label yaofang:
白芍 香附 枳壳 法半夏 党参 延胡索 海螵蛸 北柴胡 麦芽 炙甘草 紫苏梗
0.357601 0.338649 0.417834 0.352876 0.424002 0.340612
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
236. 
patient tongue id: 05171921103234_5_1
label yaofang:
甘草 法半夏 茯苓 前胡 防风 鱼腥草 党参 黄芪 白术 五味子 浙贝母 桑白皮 地骨皮 补骨脂 紫菀 丝瓜络
0.981714 0.511489 0.659474 0.441347 0.376208 0.649313 0.541735 0.493792 0.434402 0.470059 0.451812
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
237. 
patient tongue id: 01032113495681_6_7_2
label yaofang:
甘草 白芍 当归 茯苓 鱼腥草 党参 黄芪 鸡血藤 丹参 黄连 生地黄 白茅根 补骨脂 麦芽
0.987081 0.509072 0.660614 0.473668 0.361493 0.618207 0.540401 0.514111 0.435745 0.461834 0.438841
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
238. 
patient tongue id: 06091958062357_1_4_7
label yaofang:
陈皮 当归 茯苓 半夏 远志 党参 黄芪 白术 杜仲 牛膝 郁金 厚朴 桑寄生 莪术 紫苏叶 蜈蚣 姜黄 素馨花
0.537355 0.35754 0.497229 0.549205 0.507134 0.300752
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.833333, recall: 0.277778, error: 0.166667
239. 
patient tongue id: 04210705088673_2_4
label yaofang:
甘草 半夏 薏苡仁 麦冬 玄参 僵蚕 瓜蒌皮 射干 百部 苦杏仁 瓜蒌子 百合 青果
0.782183 0.450562 0.509782 0.318235 0.469238
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
240. 
patient tongue id: 03062143384824_1_7_3
label yaofang:
荆芥 防风 金银花 连翘 厚朴 火麻仁 枇杷叶 北沙参 辛夷 紫苏叶
0.527987 0.390752 0.31311 0.428885 0.500236 0.621589 0.360496 0.366645 0.353257
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.222222, recall: 0.200000, error: 0.777778
241. 
patient tongue id: 04131917035559_2_1_7
label yaofang:
枳壳 薏苡仁 蒲公英 黄芪 黄连 赤芍 牡丹皮 小蓟 厚朴 槐花 莪术 北沙参 赭石 紫苏叶 姜黄 鸭脚艾
0.529202 0.39728 0.392564 0.4087 0.577773 0.635532 0.318158 0.409824 0.366223 0.355248 0.458711
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
242. 
patient tongue id: 02182254352178_6_2
label yaofang:
甘草 独活 红花 延胡索 山药 山茱萸 地黄 天麻 巴戟天 桑寄生 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 乌梢蛇 宽筋藤
0.978251 0.511802 0.611643 0.463926 0.320677 0.475322 0.426271 0.399094 0.30893 0.319338
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
243. 
patient tongue id: 01051851221081_1_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 白芷 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.419465 0.863467 0.405217 0.94911 0.45914 0.622165 0.383006 0.419478 0.389528 0.911686 0.910565 0.883198 0.924336 0.476669 0.966042 0.342088 0.404295 0.549257 0.835142
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.642857, error: 0.526316
244. 
patient tongue id: 05231936055821_1_2
label yaofang:
法半夏 茯苓 葛根 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.388383 0.604975 0.469648 0.703139 0.413515 0.462499 0.404832 0.390286 0.378019 0.300372 0.671913 0.645802 0.657064 0.684236 0.486192 0.781185 0.322476 0.308951 0.372441 0.468709 0.635207
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.866667, error: 0.380952
245. 
patient tongue id: 05181048192694_1_2_4
label yaofang:
甘草 茯苓 党参 白术 赤芍 山药 天麻 鳖甲 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜 土茯苓
0.998047 0.519257 0.737841 0.456493 0.33113 0.389358 0.831861 0.74199 0.734983 0.631877 0.684274 0.700645
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.733333, error: 0.083333
246. 
patient tongue id: 04112042173492_6_5
label yaofang:
甘草 柴胡 白芍 木香 薏苡仁 白及 党参 白术 黄连 山药 益智仁 桑螵蛸 佛手 麸炒枳壳
0.96776 0.497824 0.605745 0.444398 0.351727 0.557298 0.457237 0.428576 0.359843 0.382012 0.352403
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
247. 
patient tongue id: 02122216213472_5
label yaofang:
甘草 法半夏 当归 茯苓 前胡 黄连 黄柏 牛膝 石膏 细辛 砂仁 白芷 款冬花 麦芽 苦杏仁 广升麻
0.982641 0.500395 0.669823 0.477156 0.375911 0.661642 0.568806 0.534638 0.459912 0.502291 0.49436
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
248. 
patient tongue id: 02272236348704_6_1
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.426004 0.51856 0.456908 0.322545 0.391537 0.450658 0.394862 0.330353 0.684558 0.723287 0.301691
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
249. 
patient tongue id: 02120759266715_2
label yaofang:
甘草 茯苓 生地黄 牡丹皮 山药 山茱萸 泽泻 菟丝子 益母草 猪苓 泽兰
0.968221 0.490052 0.631848 0.419719 0.3267 0.609644 0.47398 0.434772 0.370423 0.394369 0.388821
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.272727, error: 0.727273
250. 
patient tongue id: 03021405472602_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.415798 0.451494 0.4883 0.476277 0.518509 0.341785 0.516237 0.320042 0.421207 0.333219 0.384932 0.360819 0.369774 0.381987 0.388647
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
251. 
patient tongue id: 04121325248611_4
label yaofang:
法半夏 前胡 桔梗 麦冬 玉竹 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.362168 0.659264 0.458564 0.670628 0.368365 0.479473 0.39396 0.36514 0.365921 0.313404 0.612639 0.611387 0.609316 0.614058 0.46017 0.823186 0.359928 0.397488 0.586151
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
252. 
patient tongue id: 04291619273312_5
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 桑白皮 款冬花 紫菀 苦杏仁 紫苏梗
0.96375 0.492388 0.645644 0.397944 0.313755 0.358682 0.682321 0.514576 0.456284 0.412338 0.449803 0.439027
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
253. 
patient tongue id: 04282018217183_4_6
label yaofang:
甘草 法半夏 大枣 茯苓 党参 白术 丹参 黄连 赤芍 胆南星 砂仁 天麻 粉葛 建曲
0.972283 0.499307 0.632601 0.447597 0.375089 0.61269 0.504502 0.459921 0.404229 0.423081 0.403611
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
254. 
patient tongue id: 05131430279805_1_2_4
label yaofang:
甘草 党参 酸枣仁 山药 砂仁 天麻 鳖甲 茵陈 麦芽 白扁豆 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.9905 0.522534 0.689296 0.396706 0.30926 0.367627 0.735374 0.57583 0.511762 0.466141 0.50609 0.496785
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.625000, error: 0.166667
255. 
patient tongue id: 01090005503064_4_7
label yaofang:
白芍 三七 鳖甲 北沙参 广金钱草 猫爪草 风栗壳
0.503555 0.329181 0.500458 0.416675 0.498734
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
256. 
patient tongue id: 05172118379077_6_7
label yaofang:
甘草 川芎 茯苓 枸杞子 白术 生地黄 牡丹皮 杜仲 山药 山茱萸 天麻 桑寄生 麦芽 地龙
0.754968 0.398535 0.571319 0.331356 0.341558 0.31493 0.50358
predicted yaofang:
甘草 茯苓 党参 白术 丹参 牛膝 天麻

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
257. 
patient tongue id: 03022122048853_5_1
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 丹参 赤芍 厚朴 鸡内金 北沙参 冬凌草 两面针
0.393408 0.340917 0.404019 0.543774 0.536485 0.302928 0.315912 0.30811
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.875000, recall: 0.583333, error: 0.125000
258. 
patient tongue id: 03291336094351_6_2
label yaofang:
甘草 柴胡 白芍 枳壳 党参 白术 酸枣仁 延胡索 杜仲 砂仁 五灵脂 桑寄生 淫羊藿 麦芽 续断 合欢花
0.961392 0.48476 0.642853 0.475142 0.333873 0.530276 0.437234 0.420219 0.330449 0.356468 0.338831
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
259. 
patient tongue id: 03282228490063_7_4
label yaofang:
柴胡 黄芩 桃仁 党参 白术 泽泻 天麻 姜半夏 炙甘草 续断
0.318206 0.305185 0.38088 0.446506 0.414071 0.31006 0.436119
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.714286, recall: 0.500000, error: 0.285714
260. 
patient tongue id: 04122115432454_4_6
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 桃仁 远志 浙贝母 细辛 款冬花 苦杏仁 蜜麻黄
0.663404 0.385354 0.520113 0.504695 0.667829 0.324634 0.335009 0.329503
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
261. 
patient tongue id: 01312120493005_1_5_2
label yaofang:
甘草 当归 连翘 党参 黄芪 丹参 生地黄 天麻 鳖甲 皂角刺 蜈蚣 白花蛇舌 龙葵果 广升麻
0.907232 0.471579 0.58947 0.502401 0.337856 0.370993 0.332254
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
262. 
patient tongue id: 01132122138549_6_7_1
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 丹参 赤芍 山药 益母草 鳖甲 麦芽 首乌藤 黄精 土鳖虫
0.975277 0.492474 0.630995 0.506664 0.384799 0.648336 0.611373 0.606138 0.511297 0.534185 0.536514
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
263. 
patient tongue id: 01100740200901_1_7
label yaofang:
甘草 玉竹 赤芍 胆南星 牡丹皮 地龙 嫩桑枝 土鳖虫 乌梢蛇 宽筋藤 三七粉 络石藤
0.560654 0.340842 0.545924 0.417054
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
264. 
patient tongue id: 04052143472082_1_4_6
label yaofang:
甘草 前胡 牛蒡子 厚朴 淡豆豉 扁豆花 紫菀 枇杷叶 蝉蜕 木蝴蝶 木棉花 岗梅 东风桔
0.534237 0.38517 0.465889 0.447249 0.628772 0.328591 0.701403 0.361003 0.409519 0.4939 0.440377 0.354486 0.33613 0.431753 0.473419 0.371448 0.314428 0.361881
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 枸杞子 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 鸡内金 北沙参 合欢皮 预知子 蛇舌草

------Score: precision: 0.111111, recall: 0.153846, error: 0.888889
265. 
patient tongue id: 03012144084205_5_2
label yaofang:
甘草 黄芩 黄连 生地黄 延胡索 牛膝 钩藤 细辛 天麻 白芷 桑寄生 决明子 女贞子 广升麻
0.991681 0.521972 0.681885 0.44919 0.378337 0.698919 0.616271 0.592162 0.50101 0.535518 0.528394
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
266. 
patient tongue id: 03242126139426_6_4
label yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 枳实 豆蔻 姜半夏 炙甘草 紫苏梗
0.562439 0.375502 0.314214 0.463106 0.463446 0.333111
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.272727, error: 0.500000
267. 
patient tongue id: 02120827111167_6_4
label yaofang:
甘草 茯苓 桔梗 酸枣仁 丹参 浙贝母 栀子 郁金 天麻 鳖甲 皂角刺 蜈蚣 白花蛇舌 天山雪莲 红豆杉 猫爪草
0.986608 0.503821 0.643778 0.475394 0.354081 0.618438 0.549227 0.521369 0.42789 0.454946 0.435086
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
268. 
patient tongue id: 05162053411112_2_6
label yaofang:
甘草 茯苓 芦根 玄参 生地黄 浙贝母 厚朴 天麻 鳖甲 火麻仁 北沙参 苦杏仁 蜈蚣 白花蛇舌 蜂房 四季青
0.990565 0.524925 0.685125 0.482123 0.377205 0.659206 0.580774 0.555701 0.457815 0.499385 0.475678
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
269. 
patient tongue id: 04241829425144_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 海螵蛸 炙甘草 百合 紫苏叶
0.756879 0.437198 0.565585 0.454878 0.371145
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
270. 
patient tongue id: 04262001503857_4
label yaofang:
麻黄 桂枝 白芍 前胡 半夏 太子参 五味子 细辛 干姜 紫菀 白前 北沙参 紫苏子 炙甘草
0.460966 0.955377 0.334011 0.994574 0.548417 0.726146 0.35624 0.464726 0.434261 0.986988 0.986358 0.977475 0.990259 0.472732 0.99634 0.371695 0.420113 0.633599 0.950207
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.421053, recall: 0.571429, error: 0.578947
271. 
patient tongue id: 03302310576239_5
label yaofang:
甘草 枳壳 茯苓 半夏 薏苡仁 黄芪 白术 黄连 赤芍 浙贝母 郁金 厚朴 莪术 麦芽 合欢皮 预知子 冬凌草
0.421707 0.324954 0.403298 0.58418 0.572539 0.375404 0.319197 0.370798 0.352212
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.555556, recall: 0.294118, error: 0.444444
272. 
patient tongue id: 02271846411124_2_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.31223 0.425687 0.420268 0.366593 0.301896 0.316892 0.31763 0.375505 0.359276 0.371518 0.407033 0.67815
predicted yaofang:
陈皮 法半夏 茯苓 前胡 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
273. 
patient tongue id: 01192231472924_1_4_7
label yaofang:
甘草 川芎 薏苡仁 党参 白术 天麻 僵蚕 鳖甲 补骨脂 蜈蚣 白花蛇舌 天山雪莲 半枝莲 乌梢蛇
0.949611 0.502389 0.625191 0.46813 0.381383 0.560701 0.497459 0.467288 0.399535 0.429422 0.398987
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
274. 
patient tongue id: 02201755030112_1_4
label yaofang:
陈皮 法半夏 茯苓 党参 海螵蛸 干姜 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 炙黄芪 炒六神曲 甘松
0.39808 0.735741 0.409484 0.862572 0.416021 0.560506 0.372364 0.39233 0.36445 0.307459 0.806555 0.799936 0.777321 0.831751 0.427678 0.878854 0.362642 0.395561 0.51363 0.716283
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.428571, error: 0.700000
275. 
patient tongue id: 04291451206044_1_7
label yaofang:
甘草 川芎 法半夏 葛根 羌活 白术 牛膝 细辛 荷叶 天麻 僵蚕 磁石 白芷 地龙
0.954076 0.489699 0.647503 0.535754 0.383344 0.590324 0.542661 0.568406 0.42662 0.481461 0.468313
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
276. 
patient tongue id: 03011855154941_4_1
label yaofang:
法半夏 前胡 防风 钩藤 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子
0.412908 0.762458 0.418646 0.875165 0.442912 0.565206 0.389393 0.405386 0.386057 0.30462 0.822022 0.818909 0.797078 0.845278 0.447616 0.913031 0.359305 0.399882 0.524627 0.75709
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
277. 
patient tongue id: 02020947100958_6_1
label yaofang:
甘草 柴胡 法半夏 茯苓 木香 蒲公英 白及 党参 白术 黄连 延胡索 五灵脂 旋覆花 鱼古 煅瓦楞子
0.835386 0.460972 0.567223 0.311316 0.313868 0.314124 0.51661
predicted yaofang:
甘草 茯苓 党参 白术 丹参 山药 天麻

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
278. 
patient tongue id: 03091835522321_2_1
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.452766 0.917915 0.412989 0.974725 0.486564 0.629901 0.424418 0.451064 0.440841 0.951392 0.95171 0.934657 0.956389 0.531252 0.987101 0.313796 0.380598 0.589417 0.904059
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
279. 
patient tongue id: 04200622388500_6_2
label yaofang:
甘草 川芎 枸杞子 白术 酸枣仁 杜仲 牛膝 泽泻 天麻 桑寄生 麦芽 女贞子 墨旱莲
0.991618 0.518366 0.700475 0.440742 0.306258 0.377773 0.724138 0.60292 0.561655 0.490377 0.545948 0.53579
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
280. 
patient tongue id: 04171746097637_6_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.310299 0.361506 0.481472 0.342459 0.458854 0.479255 0.304351 0.466978 0.599284 0.30299
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.700000, recall: 0.636364, error: 0.300000
281. 
patient tongue id: 05242105405556_2_5
label yaofang:
甘草 龙骨 党参 白术 酸枣仁 生地黄 知母 菟丝子 糯稻根 益母草 淫羊藿 仙茅 女贞子 龟甲
0.99549 0.521028 0.717394 0.468473 0.39105 0.740603 0.640438 0.609971 0.513692 0.569792 0.558614
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
282. 
patient tongue id: 04131623210544_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.428715 0.333537 0.347831 0.47768 0.449522 0.379131 0.389528
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
283. 
patient tongue id: 03011100254762_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.30474 0.360128 0.466791 0.461977 0.312238 0.436844
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.500000, recall: 0.300000, error: 0.500000
284. 
patient tongue id: 01070833432642_1_2_7
label yaofang:
桂枝 茯苓 党参 黄芪 丹参 山药 高良姜 肉苁蓉 淫羊藿 仙茅 花椒
0.406516 0.368022 0.44797 0.395232 0.390125 0.320313 0.326822 0.310829
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝 钩藤 天麻

------Score: precision: 0.500000, recall: 0.363636, error: 0.500000
285. 
patient tongue id: 05080850451593_3_1_4
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 五味子 熟地黄 火麻仁 苦参 炙甘草 黑枣
0.460392 0.3329 0.444914 0.30061 0.510559 0.452768 0.491581 0.380779 0.477745 0.339487 0.427274 0.353159 0.419853 0.404534 0.411485 0.409868 0.425409
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.117647, recall: 0.181818, error: 0.882353
286. 
patient tongue id: 03311615410420_5
label yaofang:
荆芥 防风 金银花 连翘 党参 枇杷叶 北沙参 蝉蜕 辛夷 东风桔 咸竹蜂
0.424289 0.340523 0.45245 0.49459 0.482646
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
287. 
patient tongue id: 05102210148233_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 炒紫苏子
0.449816 0.938035 0.363808 0.988907 0.522654 0.699194 0.375129 0.454316 0.427141 0.976145 0.97605 0.963065 0.981134 0.493752 0.993267 0.364668 0.413771 0.612922 0.930185
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
288. 
patient tongue id: 03092055230617_5_6
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 芦根 牛蒡子 浙贝母 细辛 瓜蒌皮 款冬花 板蓝根 紫苏梗
0.854059 0.431091 0.5519 0.45683 0.383016 0.309062
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
289. 
patient tongue id: 01100102320913_7_4
label yaofang:
甘草 白芍 胆南星 牛膝 钩藤 苏木 地龙 嫩桑枝 丝瓜络 豨莶草 宽筋藤 海风藤 徐长卿 三七粉
0.347517 0.300163 0.445229 0.418724 0.354515 0.369289
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
290. 
patient tongue id: 03312044594120_4_7
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 独活 浙贝母 杜仲 细辛 桑寄生 款冬花 白前 牛大力
0.998365 0.552818 0.717217 0.438266 0.389452 0.767185 0.698712 0.655252 0.566654 0.60711 0.571168
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
291. 
patient tongue id: 01180616588908_2
label yaofang:
甘草 桔梗 芦根 麦冬 太子参 浙贝母 泽泻 鳖甲 北沙参 苍耳子 白花蛇舌 蜂房 四季青 龙胆
0.990622 0.505022 0.648579 0.4558 0.595733 0.518013 0.494147 0.383734 0.407388 0.3797
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
292. 
patient tongue id: 06091833266197_2
label yaofang:
柴胡 川芎 黄芩 法半夏 麦冬 党参 郁金 灯心草 石菖蒲 天麻 琥珀 磁石 白芷 炙甘草
0.384481 0.327202 0.418774 0.481452 0.47226 0.322323 0.446605
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
293. 
patient tongue id: 03081822513459_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.349975 0.443752 0.430571 0.533604 0.314518 0.392164 0.337681 0.349494 0.46713 0.450883 0.477585 0.534643 0.496795 0.657825 0.408284
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.733333, recall: 0.733333, error: 0.266667
294. 
patient tongue id: 03231605061969_1_4
label yaofang:
法半夏 前胡 桔梗 防风 黄芪 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 麸炒白术
0.418271 0.744258 0.400809 0.875955 0.443018 0.553557 0.364268 0.403057 0.363978 0.825455 0.820372 0.787846 0.844358 0.422546 0.897746 0.340116 0.391608 0.496015 0.74304
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.785714, error: 0.421053
295. 
patient tongue id: 03041050001243_4
label yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.465074 0.987286 0.999201 0.572771 0.842192 0.439778 0.371671 0.997346 0.997698 0.994315 0.998308 0.434798 0.999502 0.363641 0.479053 0.666446 0.979167
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.928571, error: 0.235294
296. 
patient tongue id: 06031047394681_1_2_7
label yaofang:
甘草 白芍 木香 薏苡仁 党参 牡丹皮 郁金 山药 鳖甲 莪术 虎杖 蜈蚣 白花蛇舌 天山雪莲 龙葵果
0.99565 0.532982 0.701657 0.43783 0.377507 0.747268 0.655162 0.606604 0.535862 0.58098 0.559707
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
297. 
patient tongue id: 01172254417525_2_1
label yaofang:
甘草 大枣 茯苓 木香 党参 鸡血藤 白术 丹参 生地黄 红花 赤芍 熟地黄 山茱萸 补骨脂
0.969449 0.500397 0.638326 0.486036 0.374878 0.585523 0.515962 0.49974 0.408979 0.441061 0.424431
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
298. 
patient tongue id: 02202228066799_1_6
label yaofang:
甘草 茯苓 远志 党参 白术 五味子 杜仲 山茱萸 车前子 菟丝子 巴戟天 金樱子 蛇床子 覆盆子
0.98517 0.492225 0.65501 0.478521 0.339825 0.648744 0.558298 0.536978 0.440427 0.478211 0.467066
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
299. 
patient tongue id: 04141254070450_4_2
label yaofang:
白芍 川芎 茯苓 防风 丹参 钩藤 菊花 天麻 白芷 石决明 炙甘草 首乌藤 炒蔓荆子 棉萆薢
0.422694 0.737568 0.421872 0.88801 0.450219 0.562829 0.379638 0.406389 0.36583 0.839634 0.832202 0.809107 0.863127 0.480726 0.908203 0.364571 0.398563 0.515986 0.755644
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.157895, recall: 0.214286, error: 0.842105
300. 
patient tongue id: 05260629544638_4
label yaofang:
甘草 柴胡 连翘 薏苡仁 黄连 红花 赤芍 牡丹皮 石膏 苍术 荆芥穗 白芷 火麻仁 麦芽 苦参 白鲜皮 地肤子 龙胆
0.531133 0.356806 0.442682 0.434577
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.055556, error: 0.750000
301. 
patient tongue id: 03230837233667_3_6
label yaofang:
甘草 龙骨 牡蛎 远志 党参 酸枣仁 熟地黄 天麻 淫羊藿 仙茅 白花蛇舌草 麦芽 蜈蚣 合欢花 半枝莲 醋鳖甲
0.994842 0.526785 0.69711 0.440125 0.309656 0.383804 0.742843 0.64628 0.606368 0.529303 0.567877 0.556041
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
302. 
patient tongue id: 02231816526293_4
label yaofang:
麻黄 前胡 半夏 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷
0.392875 0.838233 0.358248 0.959381 0.474245 0.634938 0.324266 0.394193 0.366627 0.932141 0.920251 0.90722 0.94721 0.401238 0.954387 0.365607 0.417357 0.551537 0.832979
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.714286, error: 0.473684
303. 
patient tongue id: 03282220338637_1_4
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 牛膝 天麻 磁石 麦芽 浮小麦 龟甲
0.335859 0.333405 0.418053 0.440249 0.46396 0.303595 0.382312 0.506587
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
304. 
patient tongue id: 03292049293244_4_1
label yaofang:
白芍 川芎 茯苓 防风 钩藤 天麻 白芷 石决明 炙甘草 首乌藤 广藿香 炒六神曲 炒蔓荆子 棉萆薢
0.349561 0.599562 0.436485 0.667521 0.385313 0.492621 0.357064 0.342467 0.341512 0.304398 0.604199 0.598943 0.597319 0.632714 0.406313 0.772828 0.313245 0.368074 0.405837 0.563243
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.285714, error: 0.800000
305. 
patient tongue id: 02231827583142_4_2
label yaofang:
麻黄 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 香薷 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子
0.49026 0.389472 0.318884 0.405861 0.486339 0.583298 0.338827 0.336518 0.361123
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
306. 
patient tongue id: 05181055194141_6_1
label yaofang:
甘草 麦冬 酸枣仁 杜仲 牛膝 地黄 天麻 菟丝子 益母草 淡竹叶 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.988426 0.490278 0.696738 0.511042 0.305112 0.382927 0.723149 0.657817 0.660207 0.544736 0.589209 0.608772
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
307. 
patient tongue id: 01130624285005_1_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 牛蒡子 浙贝母 天麻 白花蛇舌草 麦芽 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.983204 0.501891 0.679936 0.491216 0.300143 0.387931 0.664754 0.532308 0.525029 0.407455 0.462215 0.449971
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
308. 
patient tongue id: 04102112264740_5
label yaofang:
甘草 桔梗 连翘 薄荷 芦根 牛蒡子 浙贝母 桑叶 菊花 射干 百部 苦杏仁 木蝴蝶 青果
0.492509 0.559794 0.360569
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.333333, recall: 0.071429, error: 0.666667
309. 
patient tongue id: 05162126216181_7_2_6
label yaofang:
甘草 党参 生地黄 延胡索 天麻 五灵脂 桑寄生 鳖甲 麦芽 威灵仙 蜈蚣 天山雪莲 半枝莲 骨碎补 红豆杉
0.989752 0.518464 0.681393 0.438995 0.367827 0.707665 0.592953 0.54949 0.479622 0.524875 0.511947
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
310. 
patient tongue id: 03111519137493_6_4
label yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 郁金 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.992192 0.506869 0.701297 0.503684 0.365449 0.694279 0.602978 0.589267 0.46298 0.514476 0.504426
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
311. 
patient tongue id: 02281930294808_6
label yaofang:
柴胡 白芍 香附 枳壳 丹参 海螵蛸 浙贝母 砂仁 豆蔻 姜半夏 炙甘草 紫苏梗
0.337753 0.423782 0.326685 0.38748 0.430992 0.32785 0.311937 0.491687 0.654041 0.307676
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.700000, recall: 0.583333, error: 0.300000
312. 
patient tongue id: 05251930261857_2
label yaofang:
甘草 蒲公英 浙贝母 郁金 生半夏 僵蚕 莪术 柿蒂 北沙参 赭石 蜈蚣 红豆杉 预知子 冬凌草
0.425842 0.318927 0.422301 0.4711 0.453047 0.477035 0.332034 0.469399 0.305151 0.388268 0.312036 0.361975 0.351437 0.346295 0.365717 0.346463
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.062500, recall: 0.071429, error: 0.937500
313. 
patient tongue id: 02010317519707_2_5_6
label yaofang:
甘草 连翘 丹参 生地黄 牡丹皮 黄柏 山茱萸 泽泻 天麻 白芷 鳖甲 皂角刺 白鲜皮 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.984728 0.493342 0.655819 0.390053 0.311482 0.638812 0.420362 0.3791 0.307606 0.338093 0.324598
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.411765, error: 0.363636
314. 
patient tongue id: 03021414223639_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.479962 0.300542 0.411178 0.568454 0.333543 0.453119 0.412847 0.46723 0.362149 0.358771 0.327348 0.493745 0.313207
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 制何首乌

------Score: precision: 0.692308, recall: 0.750000, error: 0.307692
315. 
patient tongue id: 02020949142167_5_6
label yaofang:
甘草 紫花地丁 党参 生地黄 延胡索 浙贝母 天麻 白芷 鳖甲 麦芽 皂角刺 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.924838 0.453806 0.635841 0.366432 0.329255 0.630439 0.317091
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
316. 
patient tongue id: 03261602182967_2
label yaofang:
甘草 白芍 龙骨 牡蛎 芦根 麦冬 玉竹 太子参 枸杞子 酸枣仁 黄连 肉桂 山药 山茱萸 菊花 菟丝子 珍珠母 北沙参 女贞子
0.425342 0.305632 0.506533 0.457556
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.052632, error: 0.750000
317. 
patient tongue id: 02231839524609_4
label yaofang:
法半夏 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.397295 0.523117 0.385585 0.722436 0.38798 0.474304 0.346357 0.343504 0.334323 0.659046 0.67038 0.642616 0.729291 0.402556 0.767551 0.355337 0.312157 0.376166 0.412765 0.561135
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
318. 
patient tongue id: 01190646126717_3_5_6
label yaofang:
甘草 白芍 茯苓 薏苡仁 党参 熟附子 郁金 山药 天麻 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲 红豆杉
0.978699 0.506081 0.64031 0.460555 0.372847 0.610902 0.524007 0.50103 0.423265 0.444563 0.433229
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
319. 
patient tongue id: 03021140296916_1_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 泽泻 干姜
0.570686 0.349704 0.371902 0.531701 0.328284 0.442199 0.357486 0.403441 0.339968 0.350246 0.50546 0.302231
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 莱菔子 天麻 决明子

------Score: precision: 0.416667, recall: 0.416667, error: 0.583333
320. 
patient tongue id: 03290230492353_2
label yaofang:
甘草 桔梗 芦根 白及 麦冬 太子参 生地黄 浙贝母 乌梅 郁金 山药 北沙参 白花蛇舌 四季青
0.988907 0.522716 0.665945 0.462268 0.388376 0.671977 0.605483 0.570968 0.497826 0.529063 0.507118
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
321. 
patient tongue id: 02272152545725_1_6
label yaofang:
甘草 白芍 川芎 独活 丹参 牛膝 细辛 干姜 天麻 蜈蚣 姜黄 海桐皮 鹿衔草
0.305651 0.380229 0.371845 0.425907 0.351685 0.441122 0.637711
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
322. 
patient tongue id: 04072023027706_1_4
label yaofang:
牡蛎 黄芪 白术 延胡索 海螵蛸 浙贝母 砂仁 瓜蒌皮 莪术 鸡内金 枇杷叶 北沙参 蜈蚣 山慈菇 蛇舌草 鲜龙葵果
0.620579 0.38495 0.459802 0.439105 0.633085 0.314164 0.334301
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.428571, recall: 0.187500, error: 0.571429
323. 
patient tongue id: 03111444342291_6
label yaofang:
甘草 柴胡 白芍 龙骨 牡蛎 延胡索 薤白 砂仁 瓜蒌皮 佛手 浮小麦 合欢花 麸炒枳壳
0.884505 0.470073 0.577947 0.462353 0.331223 0.401418 0.317833
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
324. 
patient tongue id: 04252326004989_2_6
label yaofang:
甘草 黄芩 桔梗 芦根 麦冬 太子参 五味子 浙贝母 乌梅 天花粉 白花蛇舌草 蜂房 醋鳖甲 岗梅
0.871081 0.322439 0.453818 0.553984 0.429886 0.412129 0.302256
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
325. 
patient tongue id: 05092105052300_6_4
label yaofang:
枳壳 牛蒡子 太子参 白术 海螵蛸 神曲 山楂 麦芽 百合 紫苏叶
0.375533 0.355198 0.301931 0.479652 0.378781 0.373393
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.100000, error: 0.833333
326. 
patient tongue id: 03091858558729_6_4_7
label yaofang:
甘草 黄芩 桔梗 牛蒡子 桃仁 远志 浙贝母 细辛 天麻 款冬花 枇杷叶 白花蛇舌草 苦杏仁 蜈蚣 半枝莲 醋鳖甲
0.785048 0.303426 0.385553 0.577492 0.421935 0.421315
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
327. 
patient tongue id: 03062141268431_6_4
label yaofang:
甘草 茯苓 半夏 龙骨 白术 黄连 肉桂 砂仁 磁石 枇杷叶 首乌藤 合欢皮
0.506032 0.413173 0.417413 0.359912 0.539385 0.596791 0.349674 0.337768 0.472378
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.555556, recall: 0.416667, error: 0.444444
328. 
patient tongue id: 01192225448529_4_7
label yaofang:
桂枝 甘草 川芎 防风 羌活 白术 红花 赤芍 牛膝 知母 细辛 白芷 桑枝 威灵仙 乌梢蛇
0.976539 0.501473 0.625078 0.48421 0.37849 0.594926 0.530709 0.504537 0.43119 0.447656 0.429185
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
329. 
patient tongue id: 03311626104365_1_2_3
label yaofang:
牡蛎 玉竹 黄芪 白术 海螵蛸 乌梅 杜仲 附子 山茱萸 厚朴 砂仁 肉苁蓉 火麻仁 北沙参 猫爪草 冬凌草
0.38069 0.341332 0.435435 0.36927 0.355606
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
330. 
patient tongue id: 05191953551582_2_5
label yaofang:
甘草 黄芩 芦根 牛蒡子 浙贝母 栀子 乌梅 黄柏 天花粉 白花蛇舌草 北沙参 蜂房 醋鳖甲 岗梅
0.982739 0.501966 0.654348 0.448822 0.355494 0.6478 0.558088 0.524163 0.453902 0.489784 0.473591
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
331. 
patient tongue id: 02151907478188_2
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 北柴胡 紫菀 白前 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.428039 0.852172 0.339567 0.966442 0.491876 0.670238 0.335035 0.425317 0.38334 0.302155 0.936876 0.937733 0.908672 0.956505 0.396823 0.966316 0.437457 0.302423 0.437644 0.568947 0.850109
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
332. 
patient tongue id: 04201506500775_1_2_7
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 延胡索 枳实 竹茹 胆南星 厚朴
0.682678 0.425907 0.529667 0.398439 0.359049 0.317131
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
333. 
patient tongue id: 06031119493858_2_6
label yaofang:
甘草 白芍 木香 党参 白术 黄连 延胡索 薤白 厚朴 砂仁 五灵脂 瓜蒌皮 麦芽 降香 鱼古
0.974552 0.510158 0.625619 0.448902 0.380637 0.616616 0.540069 0.501348 0.440205 0.46533 0.439893
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
334. 
patient tongue id: 05131620525084_1_2_7
label yaofang:
甘草 桃仁 党参 白术 酸枣仁 柏子仁 天麻 肉苁蓉 鳖甲 火麻仁 补骨脂 蜈蚣 天山雪莲 半枝莲 红豆杉
0.994805 0.506106 0.715955 0.477126 0.334615 0.387533 0.792729 0.692771 0.687571 0.58204 0.640394 0.664415
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
335. 
patient tongue id: 05222126049930_1_4_6
label yaofang:
甘草 茯苓 半夏 橘红 黄芪 白术 厚朴 磁石 芡实 金樱子 枇杷叶 北沙参 木蝴蝶
0.528876 0.372596 0.323941 0.442304 0.553306 0.665606 0.318847 0.330534 0.401702 0.376005 0.324828 0.341623
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.583333, recall: 0.538462, error: 0.416667
336. 
patient tongue id: 04282203431596_5
label yaofang:
甘草 川芎 党参 黄连 栀子 牛膝 石膏 苍术 山药 细辛 白芷 天花粉 广升麻
0.994589 0.527604 0.685028 0.463727 0.368861 0.708517 0.636409 0.61038 0.515797 0.556871 0.538593
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
337. 
patient tongue id: 01101810569556_1
label yaofang:
麻黄 前胡 半夏 防风 细辛 干姜 款冬花 紫菀 百部 紫苏子 炙甘草 辛夷 紫苏梗 苍耳子
0.394302 0.754365 0.399791 0.8695 0.429012 0.558902 0.370505 0.395204 0.376401 0.816636 0.807509 0.788475 0.84043 0.423093 0.904247 0.345091 0.391048 0.51965 0.744224
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.642857, error: 0.526316
338. 
patient tongue id: 03151843219295_1_2
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 牛膝 茵陈 麦芽 赭石 龟甲
0.473415 0.336563 0.526643 0.34022 0.419417
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
339. 
patient tongue id: 03091432407273_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.725866 0.420727 0.530809 0.392197 0.535019
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
340. 
patient tongue id: 05032319152610_1_2_5
label yaofang:
甘草 白芍 枳壳 防风 薏苡仁 蒲公英 白术 天麻 地榆 槐花 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.974745 0.501294 0.661397 0.478862 0.349787 0.630597 0.535917 0.514239 0.421496 0.467488 0.458417
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
341. 
patient tongue id: 03020818016684_6_1
label yaofang:
甘草 柴胡 白芍 大枣 党参 酸枣仁 延胡索 川楝子 郁金 山药 补骨脂 鸡内金 浮小麦 合欢花
0.975923 0.507048 0.634943 0.469518 0.363682 0.638964 0.579075 0.564496 0.475292 0.50781 0.497855
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
342. 
patient tongue id: 04282225230864_6_5_1
label yaofang:
甘草 白芍 陈皮 木香 防风 党参 白术 黄连 延胡索 乌梅 山药 干姜 巴戟天 五灵脂 佛手 建曲
0.973463 0.49755 0.642171 0.447216 0.36799 0.627136 0.544875 0.511012 0.450355 0.475844 0.463756
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
343. 
patient tongue id: 03151903550326_6_4
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 白花蛇舌草 白扁豆
0.447797 0.543637 0.503178 0.336142 0.39273 0.418452 0.330422 0.406446 0.341539 0.690855 0.743682 0.315688
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.166667, recall: 0.200000, error: 0.833333
344. 
patient tongue id: 02211857272771_1_7
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.402874 0.359809 0.337133 0.451529 0.396933 0.444246
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
345. 
patient tongue id: 01182100105017_6_2_5
label yaofang:
甘草 川芎 枳壳 茯苓 党参 牛膝 山药 厚朴 天麻 鳖甲 火麻仁 茵陈 苦杏仁 蜈蚣 白花蛇舌 天山雪莲
0.951041 0.473173 0.605156 0.490391 0.457348 0.365632 0.371527
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.857143, recall: 0.375000, error: 0.142857
346. 
patient tongue id: 02231923340976_4_1
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.426058 0.842851 0.400921 0.947638 0.465145 0.605097 0.391122 0.424642 0.402886 0.911196 0.908637 0.886581 0.925904 0.476379 0.961638 0.355162 0.400262 0.566269 0.839233
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.842105, recall: 1.000000, error: 0.157895
347. 
patient tongue id: 04111850211540_4
label yaofang:
麻黄 甘草 前胡 桔梗 半夏 防风 细辛 干姜 白芷 紫菀 白前 百部 辛夷 紫苏梗 广藿香 苍耳子
0.425495 0.869851 0.338651 0.972299 0.521619 0.660634 0.305685 0.454834 0.440561 0.304255 0.956366 0.954493 0.928611 0.962454 0.329203 0.979383 0.410671 0.341574 0.450909 0.435233 0.84589
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.571429, recall: 0.750000, error: 0.428571
348. 
patient tongue id: 01130654133756_2_1_6
label yaofang:
甘草 桔梗 龙骨 桃仁 党参 酸枣仁 浙贝母 山茱萸 天麻 糯稻根 鳖甲 白花蛇舌 天山雪莲 半枝莲
0.990386 0.5186 0.662774 0.452983 0.315919 0.390063 0.708049 0.61422 0.574746 0.511004 0.549672 0.542399
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
349. 
patient tongue id: 06062238057646_1_2
label yaofang:
甘草 川芎 茯苓 党参 白术 生地黄 赤芍 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.962365 0.500196 0.585869 0.461375 0.348808 0.522096 0.473955 0.453001 0.362305 0.372956 0.339207
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
350. 
patient tongue id: 02211830317758_6_7
label yaofang:
白芍 香附 枳壳 柏子仁 海螵蛸 白芷 茵陈 豆蔻 姜半夏 炙甘草 紫苏梗
0.964309 0.472527 0.658411 0.393318 0.351437 0.663483 0.449109 0.392741 0.332434 0.376345 0.356069
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
351. 
patient tongue id: 01040102132409_1_4_7
label yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 红花 延胡索 赤芍 牛膝 桑寄生 补骨脂 续断 威灵仙
0.997694 0.539035 0.709605 0.468386 0.383962 0.753506 0.680994 0.654021 0.556236 0.599262 0.585479
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
352. 
patient tongue id: 03151846551731_6_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.376019 0.367805 0.448878 0.321036 0.40757 0.641951
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.666667, recall: 0.363636, error: 0.333333
353. 
patient tongue id: 06132020191763_1_4_6
label yaofang:
甘草 陈皮 半夏 黄芪 白术 杜仲 郁金 厚朴 菟丝子 莪术 北沙参 苦杏仁 紫苏子 紫苏叶 半枝莲 蛇舌草
0.725886 0.411364 0.543848 0.392608 0.542237
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
354. 
patient tongue id: 02142134047254_1_2
label yaofang:
麻黄 陈皮 茯苓 前胡 半夏 防风 钩藤 款冬花 紫菀 白前 百部 紫苏子 蝉蜕 炙甘草
0.37945 0.651131 0.431525 0.78261 0.38914 0.493601 0.380445 0.353342 0.315575 0.7192 0.7099 0.6992 0.748631 0.491977 0.825905 0.3019 0.361249 0.480881 0.659859
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.642857, error: 0.526316
355. 
patient tongue id: 04272328115879_3
label yaofang:
牛蒡子 党参 黄芪 白术 附子 车前子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.358976 0.402002 0.507422 0.390465 0.36527 0.578929
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.272727, error: 0.500000
356. 
patient tongue id: 02182143560802_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 桑白皮 款冬花 白前 苦杏仁 蜜麻黄
0.972117 0.468541 0.628934 0.501014 0.505855 0.438598 0.450256 0.319106 0.340508 0.33187
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
357. 
patient tongue id: 03171006116646_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.561585 0.349133 0.511661 0.512228 0.389641 0.31351 0.337657
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 牛膝

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
358. 
patient tongue id: 04081600238870_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.658574 0.401824 0.508356 0.513414 0.605927 0.303429 0.320876 0.307744
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
359. 
patient tongue id: 06190801496976_4_6
label yaofang:
甘草 薏苡仁 党参 鸡血藤 白术 苍术 厚朴 天麻 火麻仁 决明子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.803452 0.388824 0.566036 0.49386 0.35977 0.302486
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
360. 
patient tongue id: 02190543097042_5_7_6
label yaofang:
甘草 薏苡仁 党参 枸杞子 白术 山药 天麻 鳖甲 扁豆花 麦芽 蒺藜 蜈蚣 白花蛇舌 天山雪莲 半枝莲 龙葵果
0.994658 0.51483 0.701125 0.483335 0.38712 0.748262 0.670692 0.649238 0.548483 0.599389 0.582404
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.625000, error: 0.090909
361. 
patient tongue id: 04121847359621_4_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 木贼
0.360409 0.434158 0.397623 0.596888 0.344028 0.369253 0.315277 0.314665 0.53507 0.516935 0.494843 0.605394 0.477414 0.690383 0.413838
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.733333, recall: 0.733333, error: 0.266667
362. 
patient tongue id: 05100801390725_1_3
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.469137 0.36015 0.483159 0.538908 0.471815
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
363. 
patient tongue id: 06022244281710_1_4_7
label yaofang:
甘草 茯苓 党参 枸杞子 白术 杜仲 桑白皮 僵蚕 菟丝子 补骨脂 百部 苦杏仁 紫苏子 紫苏叶 蜈蚣 骨碎补 紫苑
0.529062 0.383533 0.342771 0.459267 0.538449 0.641743 0.326928 0.332769 0.407458 0.386081 0.335847 0.358303 0.302396
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.384615, recall: 0.294118, error: 0.615385
364. 
patient tongue id: 03081842263801_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.457179 0.912407 0.346793 0.983977 0.503991 0.703127 0.36893 0.435858 0.407773 0.964732 0.965345 0.947376 0.974715 0.466775 0.988127 0.398167 0.443625 0.598682 0.90402
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.812500, error: 0.315789
365. 
patient tongue id: 03312103237908_1_6
label yaofang:
甘草 法半夏 茯苓 桔梗 桃仁 远志 党参 酸枣仁 丹参 黄连 竹茹 浙贝母 厚朴 紫苏梗 合欢花
0.995866 0.536097 0.708087 0.47737 0.384115 0.702262 0.615182 0.585951 0.480487 0.532237 0.495778
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
366. 
patient tongue id: 04300854066741_4_3
label yaofang:
甘草 枳壳 法半夏 党参 郁金 山药 薤白 石菖蒲 水蛭 补骨脂 莪术 益智 鹿角霜 瓜蒌子 土萆薢
0.771637 0.418873 0.512592 0.311023 0.572429 0.305458
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
367. 
patient tongue id: 02120932548764_5_6
label yaofang:
甘草 白芍 陈皮 葛根 党参 白术 黄连 苍术 山药 车前子 厚朴 莱菔子 豆蔻 建曲
0.989851 0.518861 0.658509 0.455241 0.356974 0.623036 0.557482 0.505311 0.434453 0.457684 0.430106
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
368. 
patient tongue id: 02191638388173_6_4_7
label yaofang:
甘草 陈皮 黄芩 法半夏 大枣 薏苡仁 桃仁 葶苈子 郁金 桑白皮 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 红豆杉
0.951926 0.48279 0.59085 0.428534 0.460138 0.325413 0.331405
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
369. 
patient tongue id: 02190455537238_2_6
label yaofang:
甘草 酸枣仁 生地黄 牡丹皮 黄柏 山药 山茱萸 泽泻 砂仁 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 半枝莲
0.992369 0.501213 0.687138 0.486589 0.380637 0.712939 0.657463 0.628712 0.543566 0.580678 0.580528
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
370. 
patient tongue id: 05140445268646_6_4
label yaofang:
甘草 法半夏 茯苓 党参 酸枣仁 栀子 牡丹皮 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.994016 0.501493 0.690565 0.45966 0.311822 0.372422 0.768627 0.683933 0.67617 0.583085 0.622553 0.638663
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
371. 
patient tongue id: 01192124343401_2_1
label yaofang:
甘草 黄芩 芦根 麦冬 太子参 浙贝母 乌梅 鳖甲 诃子 北沙参 苍耳子 白花蛇舌 蜂房 四季青
0.989927 0.508981 0.690235 0.484887 0.313849 0.392057 0.720609 0.638748 0.623846 0.529011 0.569402 0.576851
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
372. 
patient tongue id: 05242237165905_5_1_6
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 桃仁 远志 浙贝母 车前子 天麻 射干 白花蛇舌草 苦杏仁 蜈蚣 醋鳖甲
0.756609 0.41142 0.540964 0.323969 0.33375 0.31206 0.477667
predicted yaofang:
甘草 茯苓 党参 白术 丹参 牛膝 天麻

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
373. 
patient tongue id: 03022214309911_7_6_4
label yaofang:
甘草 川芎 薏苡仁 太子参 酸枣仁 生地黄 知母 天麻 鳖甲 莪术 浮小麦 首乌藤 蜈蚣 白花蛇舌 龙葵果
0.802933 0.326384 0.409949 0.59321 0.411497 0.481679
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
374. 
patient tongue id: 03101912393386_1
label yaofang:
柴胡 白芍 香附 枳壳 丹参 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗
0.482712 0.352258 0.480455 0.369802 0.495803
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
375. 
patient tongue id: 01052108101213_2_6_7
label yaofang:
柴胡 白芍 黄芩 茯苓 龙骨 牡蛎 丹参 玄参 枳实 石膏 干姜 大黄 生地 法夏
0.892189 0.472106 0.554063 0.537776 0.323677 0.346208 0.340044 0.418904
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.125000, recall: 0.071429, error: 0.875000
376. 
patient tongue id: 02141941523676_6
label yaofang:
海螵蛸 肉桂 干姜 附片
0.311604 0.368787 0.47209 0.393042 0.32028 0.320695 0.396595
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 车前子 炙甘草

------Score: precision: 0.142857, recall: 0.250000, error: 0.857143
377. 
patient tongue id: 03301944353853_5
label yaofang:
桂枝 柴胡 葛根 麦冬 玉竹 党参 黄芪 蒺藜
0.368899 0.324392 0.449662 0.385847 0.387528
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.125000, error: 0.800000
378. 
patient tongue id: 06062238593233_1_4
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 党参 白术 浙贝母 鳖甲 麦芽 苦杏仁 白花蛇舌 天山雪莲
0.997051 0.533317 0.712251 0.431856 0.316562 0.386812 0.781916 0.673385 0.636137 0.556005 0.603493 0.592451
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
379. 
patient tongue id: 01070840338288_1_4
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.490682 0.333313 0.399392 0.535819 0.436574 0.470809 0.33462 0.464242 0.30182 0.372559 0.315231 0.332638 0.388123 0.325244 0.319276 0.321587
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.250000, error: 0.812500
380. 
patient tongue id: 01040651054435_6_7_2
label yaofang:
甘草 白芍 川芎 羌活 酸枣仁 柏子仁 赤芍 牛膝 细辛 天麻 全蝎 白芷 蔓荆子
0.951373 0.491116 0.652101 0.429588 0.342259 0.310402 0.388428 0.647057 0.440151 0.405246 0.349088 0.397863 0.38481
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
381. 
patient tongue id: 05191923074655_1_6_7
label yaofang:
甘草 木香 薏苡仁 党参 浙贝母 郁金 山药 天麻 鳖甲 首乌藤 黄精 蜈蚣 白花蛇舌 天山雪莲 土鳖虫 红豆杉
0.981771 0.527714 0.625497 0.451641 0.362419 0.584556 0.531369 0.492193 0.418529 0.439021 0.394623
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
382. 
patient tongue id: 06080019530821_1_5
label yaofang:
甘草 防风 蒲公英 党参 玄参 红花 黄柏 水牛角 天麻 白花蛇舌草 麦芽 忍冬藤 地肤子 蜈蚣 半枝莲 醋鳖甲
0.975958 0.485376 0.641341 0.431398 0.31188 0.358132 0.677132 0.558769 0.527623 0.464249 0.494805 0.500798
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
383. 
patient tongue id: 02241416153591_5_6
label yaofang:
甘草 香附 茯苓 蒲公英 党参 白术 延胡索 海螵蛸 紫苏梗 瓦楞子 猫爪草
0.312974 0.417012 0.401325 0.374041 0.442088 0.624533
predicted yaofang:
柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
384. 
patient tongue id: 05171925157265_5_6
label yaofang:
甘草 茯苓 薏苡仁 党参 鸡血藤 白术 山药 天麻 白花蛇舌草 白扁豆 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.97399 0.505292 0.626747 0.454973 0.342764 0.554853 0.488713 0.45819 0.385766 0.400805 0.373261
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
385. 
patient tongue id: 02122217192544_2_1
label yaofang:
甘草 柴胡 黄芩 法半夏 桔梗 薏苡仁 浙贝母 牡丹皮 青蒿 天麻 鳖甲 莪术 建曲 蜈蚣 白花蛇舌 天山雪莲
0.957502 0.500144 0.598993 0.470861 0.346391 0.509905 0.4567 0.443275 0.355478 0.376252 0.346734
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
386. 
patient tongue id: 06031124393072_5_1
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 莱菔子 天麻 滑石 鳖甲 豆蔻 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.980988 0.515334 0.647653 0.424392 0.361425 0.645143 0.557079 0.508683 0.456347 0.481723 0.45657
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.687500, error: 0.000000
387. 
patient tongue id: 04291504543648_7_2_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 桔梗 防风 玉竹 党参 浙贝母 款冬花 麦芽 北沙参 百合 大青叶
0.95877 0.481493 0.624707 0.48607 0.354421 0.58653 0.52632 0.506664 0.421512 0.450596 0.439179
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
388. 
patient tongue id: 05042013167688_3_1_5
label yaofang:
黄芪 白术 浙贝母 当归尾 小茴香 地龙 丝瓜络 玉米须 半枝莲 土茯苓 山慈菇 鲜龙葵果 土萆薢 毛冬青
0.359026 0.337572 0.524244 0.610988 0.358301 0.358528 0.355798
predicted yaofang:
甘草 党参 黄芪 白术 海螵蛸 厚朴 砂仁

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
389. 
patient tongue id: 02231814092958_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子
0.408266 0.744446 0.394238 0.889521 0.449364 0.572855 0.361058 0.403496 0.373245 0.300471 0.305776 0.836851 0.830333 0.802824 0.864166 0.410577 0.901553 0.379397 0.410424 0.513495 0.742706
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
390. 
patient tongue id: 04211804461324_5
label yaofang:
黄芩 连翘 薄荷 薏苡仁 玄参 浙贝母 石菖蒲 茵陈 射干 豆蔻 马勃 广藿香 木蝴蝶
0.817284 0.441783 0.494619 0.502825
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
391. 
patient tongue id: 02161844419121_1
label yaofang:
甘草 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 紫菀 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.433747 0.882023 0.315765 0.982325 0.523922 0.727572 0.30934 0.423955 0.38769 0.330196 0.963812 0.962826 0.942171 0.975721 0.371834 0.974904 0.486786 0.308493 0.483535 0.576346 0.873386
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.476190, recall: 0.714286, error: 0.523810
392. 
patient tongue id: 02141932024839_6
label yaofang:
柴胡 香附 枳壳 柏子仁 海螵蛸 浙贝母 鸡内金 豆蔻 姜半夏 炙甘草 紫苏梗
0.86972 0.410434 0.582534 0.475795 0.352041
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
393. 
patient tongue id: 03041248185883_1_5_6
label yaofang:
甘草 薏苡仁 党参 白术 酸枣仁 砂仁 天麻 鳖甲 柿蒂 豆蔻 麦芽 蜈蚣 半枝莲 红豆杉 瓦楞子 稻芽
0.621816 0.369285 0.431915 0.383244 0.354177
predicted yaofang:
甘草 法半夏 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
394. 
patient tongue id: 05160612230021_1_6_4
label yaofang:
桂枝 白芍 枳壳 龙齿 砂仁 桑寄生 鸡内金 炙甘草 续断 赭石 辛夷 首乌藤 黑枣 合欢皮
0.510658 0.3502 0.546991 0.373749 0.656903 0.761208 0.372637 0.431303 0.544597 0.486425 0.386767 0.335136 0.458214 0.496209 0.456057 0.367003 0.364339
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 鸡内金 北沙参 合欢皮 预知子 蛇舌草

------Score: precision: 0.176471, recall: 0.214286, error: 0.823529
395. 
patient tongue id: 03301922299848_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.444599 0.843337 0.363294 0.962076 0.492686 0.642717 0.36156 0.434196 0.408445 0.93157 0.929147 0.905661 0.950182 0.429587 0.96446 0.415608 0.306766 0.420912 0.561588 0.847867
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
396. 
patient tongue id: 05091907553770_1_2
label yaofang:
白芍 川芎 当归 茯苓 太子参 黄芪 枸杞子 熟地黄 郁金 北柴胡 炙甘草 续断 盐菟丝子 酒女贞子 墨旱莲 干益母草
0.429188 0.789024 0.431206 0.897119 0.462208 0.57068 0.402367 0.422666 0.402463 0.305605 0.850149 0.848943 0.822117 0.868225 0.475538 0.928329 0.357449 0.30218 0.40632 0.526058 0.777935
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.142857, recall: 0.187500, error: 0.857143
397. 
patient tongue id: 05261948353491_1_4_6
label yaofang:
陈皮 半夏 木香 远志 黄芪 白术 海螵蛸 杜仲 牛膝 郁金 山药 桑寄生 莪术 鸡内金 紫苏梗 蜈蚣 红豆杉 素馨花
0.801859 0.421348 0.544539 0.416754 0.621736 0.309442 0.307532 0.303485 0.319871 0.357303
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 山药 厚朴 砂仁 蜈蚣

------Score: precision: 0.500000, recall: 0.277778, error: 0.500000
398. 
patient tongue id: 05232016078681_5_2
label yaofang:
甘草 半夏 黄芪 白术 赤芍 海螵蛸 牡丹皮 杜仲 厚朴 水牛角 僵蚕 莪术 紫苏叶 蜈蚣 预知子 蛇舌草
0.570171 0.374541 0.423541 0.433928 0.575424 0.70662 0.328057 0.3778 0.448883 0.429199 0.306728 0.316753 0.360225 0.420682 0.336122
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 鸡内金 北沙参 合欢皮

------Score: precision: 0.600000, recall: 0.562500, error: 0.400000
399. 
patient tongue id: 05140852520557_6_4
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 赤芍 山药 天麻 鳖甲 补骨脂 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.998154 0.537848 0.743048 0.463236 0.315207 0.400374 0.802953 0.700628 0.669701 0.570533 0.636815 0.629031
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.733333, error: 0.083333
400. 
patient tongue id: 05111917526207_5_6
label yaofang:
甘草 半夏 蒲公英 黄芪 白术 赤芍 海螵蛸 郁金 莪术 佛手 合欢皮 姜黄 山慈菇 预知子 蛇舌草 稻芽 鸡骨草
0.425689 0.348986 0.550075 0.63168 0.754662 0.303107 0.322458 0.46001 0.437719 0.331822 0.365606 0.559045 0.35893
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 鸡内金 北沙参 合欢皮

------Score: precision: 0.461538, recall: 0.352941, error: 0.538462
401. 
patient tongue id: 03011832383913_1_4
label yaofang:
甘草 茯苓 葛根 桔梗 防风 麦冬 玄参 赤芍 白芷 北沙参 辛夷 广藿香 人参叶 炒六神曲 醋香附
0.30381 0.57144 0.436487 0.590804 0.322931 0.448215 0.351408 0.525073 0.500485 0.549409 0.563346 0.427618 0.754052 0.301033 0.379168 0.500598
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.312500, recall: 0.333333, error: 0.687500
402. 
patient tongue id: 06190658291704_1
label yaofang:
甘草 白芍 川芎 茯苓 龙骨 远志 党参 酸枣仁 生地黄 栀子 知母 地骨皮 女贞子 合欢花 墨旱莲
0.997105 0.534358 0.719547 0.49621 0.300307 0.404832 0.787044 0.723674 0.72068 0.599868 0.661968 0.653889
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
403. 
patient tongue id: 02202324079714_5_2
label yaofang:
甘草 黄芩 鱼腥草 海螵蛸 僵蚕 川贝母 紫菀 鸡内金 枇杷叶 地龙 北沙参 苦杏仁 炙麻黄 紫苏梗
0.401963 0.408012 0.366112 0.51144 0.470843 0.496732
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
404. 
patient tongue id: 01032111288998_6_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 天麻 鳖甲 款冬花 苦杏仁 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.979981 0.491225 0.650757 0.487589 0.366695 0.620017 0.546229 0.524217 0.436794 0.475298 0.456668
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
405. 
patient tongue id: 03091422535613_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.365458 0.596833 0.501394 0.380127 0.637482 0.565895 0.618712 0.532658 0.601665 0.54989 0.635171 0.541802 0.636099 0.608344 0.656534
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
406. 
patient tongue id: 03192249074227_6_4
label yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 黄连 竹茹 胆南星 栀子 淡豆豉 浮小麦 麸炒枳壳
0.988444 0.512061 0.673882 0.444593 0.300935 0.379078 0.70732 0.609256 0.571701 0.504423 0.546733 0.533006
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
407. 
patient tongue id: 03041414524833_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 党参 黄连 砂仁 瓜蒌皮 柿蒂 麦芽 佛手 紫苏梗 合欢花
0.955079 0.486279 0.655367 0.454916 0.348399 0.540958 0.362442 0.35316
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
408. 
patient tongue id: 05221932388752_1
label yaofang:
甘草 当归 茯苓 党参 白术 海螵蛸 枳实 干姜 仙鹤草 补骨脂 浮小麦 瓦楞子
0.404092 0.501905 0.439376 0.306308 0.377753 0.408828 0.370856 0.342394 0.644496 0.720777 0.308793
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.363636, recall: 0.333333, error: 0.636364
409. 
patient tongue id: 06162156301016_1_2
label yaofang:
甘草 陈皮 茯苓 葛根 麦冬 菊花 佩兰 北沙参 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶
0.373559 0.34084 0.420113 0.362223
predicted yaofang:
甘草 茯苓 党参 炙甘草

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
410. 
patient tongue id: 02181952033834_7_4
label yaofang:
甘草 桔梗 金银花 桃仁 党参 生地黄 浙贝母 干姜 菟丝子 桑寄生 益母草 诃子 板蓝根 蝉蜕 紫苏梗 威灵仙
0.99192 0.515634 0.661128 0.457028 0.339853 0.633619 0.563408 0.531315 0.441121 0.470566 0.443211
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
411. 
patient tongue id: 06191335260928_1_5
label yaofang:
甘草 白芍 陈皮 茯苓 木香 防风 党参 白术 黄连 天麻 鳖甲 粉葛 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.985728 0.51165 0.665902 0.445838 0.370742 0.662997 0.569671 0.533173 0.465429 0.498842 0.485133
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.555556, error: 0.090909
412. 
patient tongue id: 05032259231494_5
label yaofang:
甘草 黄芩 法半夏 桔梗 牛蒡子 桃仁 鱼腥草 浙贝母 桑白皮 款冬花 紫菀 苇茎 苦杏仁 瓜蒌子 炙麻黄
0.966833 0.482467 0.65127 0.477551 0.332247 0.300426 0.38701 0.65249 0.574762 0.547264 0.480431 0.51489 0.523193
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.076923, recall: 0.066667, error: 0.923077
413. 
patient tongue id: 03101952083939_1_3
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.424661 0.858698 0.347745 0.952286 0.454175 0.633648 0.390485 0.424829 0.418185 0.920338 0.929892 0.904363 0.937509 0.446998 0.97102 0.36755 0.431092 0.543826 0.832052
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
414. 
patient tongue id: 06131959589605_3
label yaofang:
桂枝 茯苓 半夏 黄芪 白术 熟地黄 海螵蛸 牡丹皮 杜仲 附子 山药 山茱萸 泽泻 砂仁 麦芽 紫苏叶 预知子
0.829068 0.428803 0.534423 0.443039 0.668251 0.334005 0.308728 0.32212 0.354598 0.327164 0.391231
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 山药 厚朴 砂仁 莪术 蜈蚣

------Score: precision: 0.545455, recall: 0.352941, error: 0.454545
415. 
patient tongue id: 06181837424625_4_6_1
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桃仁 远志 浙贝母 细辛 款冬花 紫菀 苦杏仁 紫苏子 女贞子 炙麻黄 墨旱莲
0.977151 0.503827 0.650122 0.422525 0.363032 0.634975 0.506295 0.452074 0.400777 0.434742 0.409022
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
416. 
patient tongue id: 03230717337546_1_6_4
label yaofang:
甘草 香附 薏苡仁 丹参 生地黄 延胡索 郁金 青蒿 天麻 地骨皮 鳖甲 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲
0.962263 0.474812 0.663933 0.555728 0.376742 0.547511 0.461421 0.51476 0.341299 0.395453 0.383337
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
417. 
patient tongue id: 02260658219119_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 浙贝母 细辛 桑白皮 款冬花 苦杏仁 炙麻黄
0.982497 0.508925 0.656322 0.479882 0.38629 0.667508 0.600503 0.582384 0.498378 0.532625 0.530639
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.181818, error: 0.818182
418. 
patient tongue id: 02212003017639_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗
0.327867 0.33129 0.450924 0.492786 0.304732 0.427353
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
419. 
patient tongue id: 05311932090801_1
label yaofang:
陈皮 茯苓 党参 黄芪 白术 乌药 山药 砂仁 虎杖 紫苏子
0.392051 0.313657 0.408249 0.491877 0.644581 0.386917 0.320615 0.350591
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁

------Score: precision: 0.625000, recall: 0.500000, error: 0.375000
420. 
patient tongue id: 03231038150851_1_2_7
label yaofang:
甘草 白芍 茯苓 党参 白术 丹参 菟丝子 益母草 醋香附 醋鳖甲 酒女贞子 墨旱莲 酒黄精 鹿衔草
0.983987 0.499163 0.661241 0.467048 0.33637 0.619542 0.53905 0.519037 0.418368 0.450981 0.434148
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
421. 
patient tongue id: 06031121379310_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 酸枣仁 丹参 黄连 生地黄 延胡索 川楝子 粉葛
0.896014 0.432152 0.626745 0.34988 0.31263 0.318869 0.633306
predicted yaofang:
甘草 茯苓 党参 白术 丹参 山药 天麻

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
422. 
patient tongue id: 01180600520674_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 栀子 牡丹皮 山药 山茱萸 补骨脂 麦芽 百合
0.978277 0.50291 0.654074 0.463513 0.362374 0.638298 0.534745 0.501388 0.42292 0.463024 0.453981
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
423. 
patient tongue id: 03171206353723_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.354901 0.60027 0.486513 0.39239 0.654765 0.5563 0.636174 0.540234 0.619585 0.535539 0.64343 0.554491 0.64221 0.621556 0.661326
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
424. 
patient tongue id: 05310822302530_1_3
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.332343 0.313718 0.412091 0.330116 0.396002 0.33356
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
425. 
patient tongue id: 04171811296364_1
label yaofang:
陈皮 桔梗 海螵蛸 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.302779 0.384892 0.454632 0.450677 0.306235 0.332741 0.487862
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
426. 
patient tongue id: 03222027457809_1_2
label yaofang:
当归 木香 党参 黄芪 鸡血藤 白术 柏子仁 枳实 炙甘草 百合 紫苏叶
0.46626 0.345364 0.453947 0.334811 0.510665
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.272727, error: 0.400000
427. 
patient tongue id: 04291614491486_1_2_6
label yaofang:
茯苓 党参 白术 酸枣仁 生地黄 天麻 菟丝子 益母草 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.703374 0.417892 0.506545 0.36588 0.544637
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
428. 
patient tongue id: 03271541493500_6
label yaofang:
麻黄 桂枝 柴胡 白芍 黄芩 法半夏 当归 葛根 桃仁 熟地黄 栀子 白茅根 水蛭 三七 旋覆花 炙甘草 赭石 红参
0.864672 0.456205 0.556252 0.438475 0.371103
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
429. 
patient tongue id: 05242229206751_2_1_6
label yaofang:
甘草 党参 白术 生地黄 杜仲 天麻 鳖甲 续断 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.992343 0.522428 0.67786 0.490555 0.3909 0.691818 0.64262 0.614114 0.515119 0.551039 0.531811
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
430. 
patient tongue id: 03211938048953_6_4
label yaofang:
甘草 川芎 陈皮 枳壳 茯苓 龙骨 牡蛎 牛蒡子 远志 酸枣仁 柏子仁 竹茹 姜半夏
0.318313 0.32875 0.415106 0.474071 0.403391 0.358773 0.463454
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
431. 
patient tongue id: 04150831489518_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.554587 0.335717 0.343613 0.526198 0.425969 0.426486 0.416324 0.369578
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
432. 
patient tongue id: 04062239225694_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.738323 0.391419 0.518541 0.529617 0.699694 0.344662 0.369273 0.362959 0.317213 0.332343 0.305343
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 莪术 北沙参 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
433. 
patient tongue id: 04200637018914_2_6
label yaofang:
甘草 白芍 茯苓 龙骨 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.957029 0.491529 0.604316 0.430516 0.328733 0.538909 0.445853 0.418685 0.354919 0.37079 0.348518
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
434. 
patient tongue id: 02170748338173_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.56908 0.346404 0.51237 0.583671 0.556209 0.305303
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
435. 
patient tongue id: 04142215390079_1_2
label yaofang:
甘草 法半夏 茯苓 橘红 木香 太子参 五味子 生地黄 乌梅 山药 山茱萸 山楂 款冬花 紫菀 苦杏仁
0.98003 0.497254 0.661443 0.451584 0.360076 0.664514 0.556171 0.52089 0.452908 0.48994 0.491222
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
436. 
patient tongue id: 01172353579679_1_3
label yaofang:
桂枝 甘草 茯苓 半夏 黄芪 白术 附子 干姜 厚朴 砂仁 磁石 淫羊藿 款冬花 枇杷叶
0.770437 0.432155 0.545402 0.34359 0.559289 0.306517
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
437. 
patient tongue id: 06070635311245_2_5
label yaofang:
甘草 白芍 枳壳 连翘 冬瓜仁 党参 太子参 丹参 赤芍 槟榔 山药 莱菔子 僵蚕 麦芽 黄精 白花蛇舌
0.508843 0.339959 0.309924 0.522256 0.515037
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
438. 
patient tongue id: 03062151385994_1_4
label yaofang:
当归 半夏 太子参 黄芪 鸡血藤 白术 海螵蛸 厚朴 砂仁 石斛 火麻仁 莪术 柿蒂 鸡内金 北沙参 紫苏梗 红豆杉 蛇舌草 稻芽
0.507473 0.390062 0.415732 0.530016 0.574367 0.321094 0.312948 0.361184
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.625000, recall: 0.263158, error: 0.375000
439. 
patient tongue id: 04192353596075_1
label yaofang:
甘草 枳壳 茯苓 木香 党参 白术 酸枣仁 郁金 天麻 桑寄生 虎杖 麦芽 合欢花
0.955678 0.471273 0.654498 0.472607 0.325725 0.576883 0.450859 0.441559 0.332595 0.37671 0.365529
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
440. 
patient tongue id: 04221856495412_9
label yaofang:
茯苓 防风 钩藤 荆芥穗 白芷 香薷 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.307612 0.337827 0.353957 0.43672 0.391827 0.305403 0.307739 0.311935 0.38426 0.348659 0.343191 0.341616 0.40045 0.487446 0.561843
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 半夏 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
441. 
patient tongue id: 04260652227646_4_7
label yaofang:
甘草 川芎 法半夏 桃仁 白术 红花 细辛 天麻 全蝎 僵蚕 麦芽 蒺藜
0.99284 0.527848 0.691655 0.471334 0.316222 0.400893 0.719636 0.635205 0.606737 0.522664 0.574233 0.559918
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.250000, error: 0.750000
442. 
patient tongue id: 01032107079482_6_4
label yaofang:
甘草 茯苓 酸枣仁 车前子 天麻 猪苓 鳖甲 麦芽 鹿角霜 蜈蚣 天山雪莲 半枝莲 骨碎补 土鳖虫 泽兰
0.996614 0.533493 0.727682 0.543898 0.391079 0.721505 0.666544 0.675341 0.509242 0.572267 0.562843
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
443. 
patient tongue id: 01312252100004_1_5_6
label yaofang:
甘草 茯苓 薏苡仁 党参 鸡血藤 丹参 赤芍 山药 砂仁 天麻 鳖甲 茵陈 扁豆花 虎杖 蜈蚣 天山雪莲 半枝莲
0.985179 0.508184 0.676955 0.437457 0.369767 0.65971 0.49452 0.442653 0.374473 0.414598 0.387352
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.529412, error: 0.181818
444. 
patient tongue id: 01061614245637_7_6_5
label yaofang:
甘草 白芍 川芎 黄芩 羌活 桃仁 白术 酸枣仁 红花 赤芍 牛膝 细辛 天麻 全蝎 僵蚕 白芷
0.983147 0.485564 0.655075 0.486433 0.311835 0.572726 0.492748 0.49367 0.373426 0.411123 0.391565
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
445. 
patient tongue id: 02190942068008_6_7_2
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991679 0.510788 0.700455 0.49436 0.377656 0.71923 0.632202 0.61397 0.504088 0.554628 0.545261
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.785714, error: 0.000000
446. 
patient tongue id: 03311653023131_4_6
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 柿蒂 豆蔻 姜半夏 炙甘草 紫苏梗
0.353675 0.33528 0.436036 0.480468 0.435972 0.353172 0.461475
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
447. 
patient tongue id: 06190657284873_5_6
label yaofang:
甘草 薏苡仁 远志 党参 白术 厚朴 天麻 鳖甲 豆蔻 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989515 0.506691 0.654568 0.45754 0.370471 0.699079 0.632777 0.605285 0.526201 0.555512 0.543445
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
448. 
patient tongue id: 02272233112543_3
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 砂仁 菟丝子 巴戟天 桑寄生 鹿角霜 续断 制何首乌 艾叶
0.37535 0.308971 0.312264 0.452055 0.305714 0.484819 0.30063 0.371457
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
449. 
patient tongue id: 05260640396904_6_2
label yaofang:
甘草 茯苓 党参 山药 砂仁 天麻 鳖甲 麦芽 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 牛大力
0.996991 0.517838 0.700866 0.482293 0.313069 0.396499 0.785564 0.707023 0.702186 0.59045 0.637272 0.642924
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
450. 
patient tongue id: 01190638119164_6_4_2
label yaofang:
甘草 黄芩 桔梗 浙贝母 乌梅 白芷 蔓荆子 鳖甲 辛夷 白花蛇舌 天山雪莲 蜂房 岗梅根 四季青
0.954462 0.494542 0.614596 0.448458 0.376789 0.579918 0.483409 0.450786 0.390805 0.413869 0.394012
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
451. 
patient tongue id: 05221922303189_6_4
label yaofang:
白芍 川芎 当归 茯苓 党参 白术 熟地黄 萆薢 炙甘草
0.310511 0.348213 0.420449 0.305559 0.461779 0.472951 0.331829 0.386771 0.501986
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.444444, error: 0.555556
452. 
patient tongue id: 03231040313074_6_2
label yaofang:
甘草 白芍 党参 五味子 山药 山茱萸 天麻 赤石脂 鳖甲 补骨脂 豆蔻 五倍子 建曲 蜈蚣 天山雪莲 半枝莲 广升麻
0.991045 0.515215 0.688101 0.457056 0.3714 0.707789 0.610789 0.574381 0.489532 0.533136 0.521628
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.470588, error: 0.272727
453. 
patient tongue id: 04142015568840_4_7_1
label yaofang:
甘草 川芎 法半夏 茯苓 党参 黄芪 白术 红花 天麻 僵蚕 麦芽 地龙 制白附子
0.944175 0.469118 0.612514 0.444407 0.310288 0.526353 0.404778 0.40014 0.304123 0.331451 0.325454
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
454. 
patient tongue id: 05191839384617_6
label yaofang:
桂枝 白芍 法半夏 大枣 茯苓 葛根 羌活 鸡血藤 白术 竹茹 苍术 泽泻 三七 炙甘草 威灵仙
0.966428 0.495498 0.611102 0.451713 0.306623 0.539409 0.464282 0.439503 0.347933 0.372711 0.343748
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
455. 
patient tongue id: 02191633221377_1_2_6
label yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 天麻 蔓荆子 鳖甲 苦杏仁 紫苏子 辛夷 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.994458 0.516688 0.679348 0.486133 0.357563 0.691709 0.640691 0.630383 0.517634 0.554519 0.53973
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
456. 
patient tongue id: 05290814157274_5_6_1
label yaofang:
甘草 柴胡 白芍 法半夏 木香 白及 浙贝母 郁金 白茅根 茜草 天麻 菟丝子 白花蛇舌草 蜈蚣 醋鳖甲 麸炒枳壳
0.978945 0.515982 0.639767 0.438141 0.371123 0.61716 0.536854 0.488196 0.433527 0.460538 0.426306
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
457. 
patient tongue id: 02111316314212_1_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.436064 0.330692 0.457107 0.308669 0.494161 0.304071
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
458. 
patient tongue id: 03012157371345_2_7_6
label yaofang:
桂枝 甘草 茯苓 桃仁 玄参 生地黄 牡丹皮 乌药 郁金 山药 山茱萸 泽泻 莪术 浮小麦
0.922652 0.473743 0.61409 0.482037 0.350965 0.498023 0.415697 0.432615 0.321311 0.352375 0.336033
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
459. 
patient tongue id: 03012140128412_6_1_2
label yaofang:
甘草 白芍 木香 薏苡仁 党参 黄连 山茱萸 天麻 赤石脂 鳖甲 补骨脂 莪术 豆蔻 建曲 蜈蚣 白花蛇舌 天山雪莲
0.95348 0.493026 0.639203 0.447635 0.359786 0.570411 0.453825 0.418984 0.357268 0.385923 0.365374
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.411765, error: 0.363636
460. 
patient tongue id: 04300855364928_1_6
label yaofang:
桂枝 甘草 陈皮 茯苓 党参 白术 车前子 天麻 鳖甲 鹿角霜 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986484 0.495666 0.680648 0.471295 0.303626 0.374671 0.720665 0.63595 0.612817 0.528483 0.568718 0.574333
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
461. 
patient tongue id: 04252008249604_1_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 麦芽 炙甘草 百合 紫苏叶 覆盆子
0.354898 0.438165 0.326262 0.432145 0.481718 0.358824 0.434659 0.554353
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
462. 
patient tongue id: 01120058437211_2_1
label yaofang:
柴胡 白芍 大枣 当归 茯苓 薄荷 白术 炙甘草 嫩桑枝 丝瓜络 浮小麦 首乌藤 海风藤
0.613595 0.365273 0.333308 0.517957 0.424457
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
463. 
patient tongue id: 05251951592413_2_5
label yaofang:
甘草 枳壳 蒲公英 麦冬 枸杞子 玄参 黄连 赤芍 牡丹皮 厚朴 水牛角 僵蚕 补骨脂 北沙参 百合 木蝴蝶 冬凌草 山豆根
0.499928 0.368863 0.451983 0.557755 0.619342 0.306136 0.37072 0.3436 0.331335 0.337367
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.300000, recall: 0.166667, error: 0.700000
464. 
patient tongue id: 04210737102446_1_4_7
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 鸡血藤 丹参 延胡索 枳实 竹茹 胆南星 厚朴
0.466226 0.37937 0.496193 0.371507 0.34117 0.327041 0.325815
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
465. 
patient tongue id: 02150703267307_1_7
label yaofang:
甘草 丹参 生地黄 延胡索 牡丹皮 天麻 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲 骨碎补 宽筋藤
0.955683 0.472286 0.632388 0.5151 0.358496 0.537134 0.45156 0.475955 0.336901 0.365152 0.347543
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
466. 
patient tongue id: 03032100258435_1_7_4
label yaofang:
甘草 桃仁 黄芪 何首乌 白术 杜仲 砂仁 磁石 桑寄生 土鳖虫 红豆杉 姜黄 墨旱莲
0.497533 0.360089 0.461835 0.584061 0.597584 0.36028 0.3103 0.351968 0.321677
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
467. 
patient tongue id: 05252158078901_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 紫菀 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.387951 0.76482 0.456008 0.845744 0.416828 0.539624 0.405034 0.391462 0.397653 0.796602 0.78067 0.780617 0.806862 0.493422 0.919339 0.309011 0.375162 0.487233 0.730258
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.785714, error: 0.421053
468. 
patient tongue id: 01140827116311_6_2
label yaofang:
甘草 独活 党参 鸡血藤 白术 酸枣仁 红花 苍术 地黄 天麻 白花蛇舌草 威灵仙 蜈蚣 半枝莲 醋鳖甲
0.970956 0.48546 0.607309 0.455094 0.314229 0.55205 0.463445 0.458536 0.361091 0.369502 0.361269
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
469. 
patient tongue id: 04271414465637_2_1_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 郁金 浮小麦 首乌藤 百合 制远志
0.454696 0.328425 0.440363 0.538561 0.394463 0.477888 0.408329 0.482742 0.304176 0.413404 0.379158 0.386106 0.453253 0.381829 0.367108 0.393064
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.250000, recall: 0.333333, error: 0.750000
470. 
patient tongue id: 01100623133085_4_5
label yaofang:
麻黄 黄芩 桑白皮 款冬花 苦杏仁 姜半夏 炙甘草 紫苏梗
0.494297 0.380522 0.446735 0.328769 0.43862
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
471. 
patient tongue id: 03021154022283_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.398828 0.350078 0.430905 0.469142 0.476378
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
472. 
patient tongue id: 02260703487425_1_6
label yaofang:
甘草 薏苡仁 桃仁 党参 牡丹皮 青蒿 天麻 地骨皮 鳖甲 莪术 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲
0.982814 0.492458 0.659231 0.460294 0.578844 0.485365 0.465073 0.353436 0.390467 0.36928
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.466667, error: 0.300000
473. 
patient tongue id: 03101751257177_2
label yaofang:
甘草 法半夏 葛根 前胡 桔梗 麦冬 玉竹 太子参 款冬花 紫菀 北沙参 人参叶
0.434311 0.355076 0.42007 0.511088 0.416776 0.310683
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
474. 
patient tongue id: 04182008173944_6_1
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 龙骨 桃仁 柏子仁 生地黄 红花 赤芍 牛膝 姜半夏 合欢皮
0.384616 0.329042 0.396498 0.514253 0.437885 0.347876
predicted yaofang:
甘草 柴胡 白芍 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
475. 
patient tongue id: 05182014464275_1_2
label yaofang:
麦冬 枸杞子 生地黄 赤芍 当归尾 砂仁 珍珠母 北沙参 土鳖虫 红豆杉 合欢皮 山慈菇 预知子 蛇舌草
0.318185 0.315798 0.401928 0.341971
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
476. 
patient tongue id: 01172348352426_1
label yaofang:
当归 黄芪 白术 延胡索 海螵蛸 砂仁 桑寄生 鸡内金 麦芽 首乌藤 桑枝 狗脊
0.43528 0.80068 0.968221 0.496693 0.670096 0.310128 0.390382 0.349662 0.304773 0.943554 0.942542 0.916761 0.96615 0.379052 0.953598 0.48414 0.448226 0.574834 0.830591
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
477. 
patient tongue id: 02211430188255_1_4_7
label yaofang:
川芎 陈皮 法半夏 当归 防风 乳香 胆南星 藿香 荆芥穗 白芷 辛夷 苍耳子 芥子 醋没药
0.314426 0.304793 0.442347 0.414964 0.429871
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
478. 
patient tongue id: 03311620517282_1_4_6
label yaofang:
蒲公英 太子参 黄芪 白术 当归尾 砂仁 磁石 菟丝子 桑寄生 鸡内金 首乌藤 红豆杉 合欢皮
0.534062 0.360877 0.424906 0.430825 0.637026 0.709052 0.348701 0.401662 0.495332 0.433837 0.304288 0.441975 0.43922 0.37981
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 鸡内金 北沙参 合欢皮

------Score: precision: 0.357143, recall: 0.384615, error: 0.642857
479. 
patient tongue id: 04020817477376_6_4
label yaofang:
甘草 柴胡 茯苓 党参 丹参 青皮 浙贝母 郁金 山药 瓜蒌皮 王不留行 麦芽 鹿角霜 合欢花
0.964635 0.496365 0.6231 0.438735 0.347802 0.581892 0.487145 0.438754 0.386629 0.411461 0.389059
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
480. 
patient tongue id: 04211323581650_2_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄
0.334977 0.590333 0.451878 0.58137 0.352791 0.432333 0.359603 0.31969 0.325214 0.527897 0.515855 0.536223 0.535066 0.429939 0.740019 0.315655 0.36921 0.505148
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.733333, error: 0.388889
481. 
patient tongue id: 02170810266165_1_6
label yaofang:
甘草 柴胡 白芍 当归 茯苓 薄荷 薏苡仁 白术 黄连 栀子 牡丹皮 肉桂 菊花 淡竹叶
0.486961 0.352069 0.458483 0.557857 0.6055 0.330316 0.302652 0.304874
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
482. 
patient tongue id: 02221235069382_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.565094 0.303661 0.346513 0.499212 0.374623
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
483. 
patient tongue id: 02120746203658_6_5
label yaofang:
甘草 柴胡 黄芩 半夏 党参 郁金 巴戟天 瓜蒌皮 鸡内金 珍珠母 麦芽 首乌藤 黑枣
0.5047 0.371118 0.312722 0.43422 0.538334 0.576126 0.387833 0.348018 0.359594 0.375798
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
484. 
patient tongue id: 03141255185738_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.516556 0.367961 0.552547 0.335224 0.389663 0.35354
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
485. 
patient tongue id: 03020653574126_6_2_7
label yaofang:
甘草 黄连 生地黄 延胡索 细辛 天麻 白芷 鳖甲 女贞子 浮小麦 蜈蚣 白花蛇舌 半枝莲
0.99621 0.535193 0.687231 0.489962 0.393185 0.703986 0.669191 0.637664 0.541465 0.578068 0.545943
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
486. 
patient tongue id: 04121903312842_6_2
label yaofang:
当归 木香 远志 党参 黄芪 枸杞子 白术 酸枣仁 龙眼肉 炙甘草 百合 合欢花 素馨花
0.433654 0.380639 0.413198 0.377829 0.417387 0.30938
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
487. 
patient tongue id: 01122349239866_1_4_7
label yaofang:
甘草 白芍 枳壳 茯苓 木香 白术 槟榔 山药 大腹皮 天麻 桑寄生 火麻仁 决明子 续断 天山雪莲
0.992751 0.527848 0.679802 0.506634 0.386442 0.66801 0.619026 0.602667 0.498055 0.529271 0.515324
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
488. 
patient tongue id: 04130620382864_2_7
label yaofang:
桂枝 甘草 白芍 木香 白术 生地黄 延胡索 赤芍 砂仁 五灵脂 桑枝 川木瓜 宽筋藤 田七末
0.998474 0.551215 0.735921 0.451526 0.399399 0.787409 0.693109 0.660147 0.559408 0.619275 0.598958
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
489. 
patient tongue id: 04182209416725_1_4
label yaofang:
甘草 茯苓 太子参 黄芪 白术 延胡索 海螵蛸 当归尾 砂仁 僵蚕 枇杷叶 北沙参 山慈菇 蛇舌草
0.932545 0.480963 0.609035 0.56657 0.368138 0.483166 0.418555 0.572291 0.343968 0.335976
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
490. 
patient tongue id: 05232030150711_6_4
label yaofang:
大枣 当归 茯苓 木香 远志 党参 白术 柏子仁 海螵蛸 仙鹤草 炙甘草
0.448968 0.407453 0.552789 0.449401 0.406067 0.500469 0.385645 0.430985 0.503916 0.30672 0.328336
predicted yaofang:
甘草 桃仁 党参 丹参 红花 牛膝 泽泻 车前子 天麻 决明子 制何首乌

------Score: precision: 0.090909, recall: 0.090909, error: 0.909091
491. 
patient tongue id: 03020750593522_1_6
label yaofang:
甘草 白芍 党参 白术 酸枣仁 生地黄 郁金 天麻 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.708794 0.392326 0.532602 0.310807 0.554532
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
492. 
patient tongue id: 04121322469100_4
label yaofang:
麻黄 茯苓 前胡 半夏 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 苍耳子
0.443411 0.900108 0.321153 0.985839 0.530837 0.735911 0.317331 0.437813 0.375562 0.316287 0.969396 0.970053 0.949013 0.978987 0.400198 0.979612 0.486077 0.481742 0.579661 0.87986
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
493. 
patient tongue id: 02171818015881_4
label yaofang:
白芍 法半夏 茯苓 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.410396 0.788429 0.393519 0.911632 0.446643 0.604415 0.363178 0.405427 0.375176 0.310254 0.304528 0.8633 0.857904 0.832718 0.885816 0.421812 0.920216 0.385629 0.418677 0.526201 0.769546
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
494. 
patient tongue id: 04131823197680_5
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 薏苡仁 桃仁 浙贝母 细辛 款冬花 苇茎 苦杏仁 蜜麻黄
0.966062 0.318115 0.515867 0.587143 0.44112 0.332362 0.490553 0.454057 0.417968 0.346841 0.351903 0.302379
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
495. 
patient tongue id: 04260656467623_2_6
label yaofang:
甘草 杜仲 乌药 肉桂 山茱萸 地黄 天麻 白花蛇舌草 续断 蜈蚣 醋香附 半枝莲 醋鳖甲 艾叶
0.989461 0.520629 0.65204 0.449828 0.371012 0.665262 0.599708 0.559823 0.49343 0.521923 0.493956
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
496. 
patient tongue id: 06070645125326_1_2_7
label yaofang:
甘草 党参 白术 红花 赤芍 杜仲 天麻 菟丝子 益母草 鳖甲 续断 蜈蚣 天山雪莲 半枝莲
0.996098 0.536536 0.690706 0.440527 0.386576 0.73992 0.663668 0.629004 0.545008 0.583829 0.55963
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
497. 
patient tongue id: 02271247302107_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.506452 0.39063 0.440272 0.536836 0.462004 0.335182
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
498. 
patient tongue id: 06191202211024_2_5
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 白术 生地黄 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 龙葵果
0.974459 0.487782 0.675861 0.430559 0.336606 0.670293 0.503164 0.460007 0.397154 0.445294 0.447131
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
499. 
patient tongue id: 03081821162172_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.365312 0.556386 0.421191 0.650004 0.38388 0.462612 0.346055 0.327069 0.303974 0.60195 0.575922 0.561204 0.624899 0.426658 0.698561 0.313753 0.347235 0.366615 0.528624
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
------Average Score: average precision: 0.450247, average recall: 0.352885, error: 0.549753