8512/8539 [============================>.] - ETA: 0s - loss: 0.1642Epoch 00000: val_loss improved from inf to 0.08311, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 68s - loss: 0.1639 - val_loss: 0.0831
Epoch 2/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0985Epoch 00001: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0985 - val_loss: 0.0833
Epoch 3/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0916Epoch 00002: val_loss improved from 0.08311 to 0.07907, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0916 - val_loss: 0.0791
Epoch 4/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0887Epoch 00003: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0887 - val_loss: 0.0792
Epoch 5/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0859Epoch 00004: val_loss improved from 0.07907 to 0.07559, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0859 - val_loss: 0.0756
Epoch 6/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0845Epoch 00005: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0845 - val_loss: 0.0785
Epoch 7/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0833Epoch 00006: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0833 - val_loss: 0.0761
Epoch 8/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0820Epoch 00007: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0820 - val_loss: 0.0758
Epoch 9/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0816Epoch 00008: val_loss improved from 0.07559 to 0.07471, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0816 - val_loss: 0.0747
Epoch 10/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0804Epoch 00009: val_loss improved from 0.07471 to 0.07345, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0804 - val_loss: 0.0734
Epoch 11/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0796Epoch 00010: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0797 - val_loss: 0.0741
Epoch 12/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0794Epoch 00011: val_loss improved from 0.07345 to 0.07303, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0794 - val_loss: 0.0730
Epoch 13/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0791Epoch 00012: val_loss improved from 0.07303 to 0.07252, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0791 - val_loss: 0.0725
Epoch 14/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0783Epoch 00013: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0782 - val_loss: 0.0736
Epoch 15/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0782Epoch 00014: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0782 - val_loss: 0.0733
Epoch 16/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0777Epoch 00015: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0777 - val_loss: 0.0726
Epoch 17/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0771Epoch 00016: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0771 - val_loss: 0.0733
Epoch 18/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0768Epoch 00017: val_loss improved from 0.07252 to 0.07193, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0768 - val_loss: 0.0719
Epoch 19/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0763Epoch 00018: val_loss improved from 0.07193 to 0.07153, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0763 - val_loss: 0.0715
Epoch 20/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0760Epoch 00019: val_loss did not improve
8539/8539 [==============================] - 68s - loss: 0.0760 - val_loss: 0.0716
Epoch 21/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0756Epoch 00020: val_loss improved from 0.07153 to 0.07144, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 67s - loss: 0.0756 - val_loss: 0.0714
Epoch 22/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0755Epoch 00021: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0755 - val_loss: 0.0720
Epoch 23/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0749Epoch 00022: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0749 - val_loss: 0.0725
Epoch 24/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0747Epoch 00023: val_loss improved from 0.07144 to 0.07108, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0747 - val_loss: 0.0711
Epoch 25/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0742Epoch 00024: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0742 - val_loss: 0.0713
Epoch 26/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0742Epoch 00025: val_loss improved from 0.07108 to 0.07095, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0742 - val_loss: 0.0709
Epoch 27/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0736Epoch 00026: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0736 - val_loss: 0.0718
Epoch 28/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0734Epoch 00027: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0735 - val_loss: 0.0712
Epoch 29/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0734Epoch 00028: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0733 - val_loss: 0.0713
Epoch 30/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0728Epoch 00029: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0728 - val_loss: 0.0715
Epoch 31/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0724Epoch 00030: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0724 - val_loss: 0.0719
Epoch 32/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0723Epoch 00031: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0723 - val_loss: 0.0728
Epoch 33/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0722Epoch 00032: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0722 - val_loss: 0.0714
Epoch 34/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0720Epoch 00033: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0719 - val_loss: 0.0710
Epoch 35/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0717Epoch 00034: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0717 - val_loss: 0.0715
Epoch 36/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0713Epoch 00035: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0713 - val_loss: 0.0718
Epoch 37/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0713Epoch 00036: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0713 - val_loss: 0.0715
Epoch 38/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0710Epoch 00037: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0710 - val_loss: 0.0715
Epoch 39/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0707Epoch 00038: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0706 - val_loss: 0.0715
Epoch 40/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0703Epoch 00039: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0703 - val_loss: 0.0719
Epoch 41/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0702Epoch 00040: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0702 - val_loss: 0.0717
Epoch 42/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0701Epoch 00041: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0701 - val_loss: 0.0718
Epoch 43/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0696Epoch 00042: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0696 - val_loss: 0.0718
Epoch 44/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0698Epoch 00043: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0697 - val_loss: 0.0716
Epoch 45/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0694Epoch 00044: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0694 - val_loss: 0.0720
Epoch 46/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0690Epoch 00045: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0690 - val_loss: 0.0770
Epoch 47/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0688Epoch 00046: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0688 - val_loss: 0.0730
Epoch 48/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0686Epoch 00047: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0686 - val_loss: 0.0722
Epoch 49/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0684Epoch 00048: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0684 - val_loss: 0.0718
Epoch 50/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0681Epoch 00049: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0681 - val_loss: 0.0726
Epoch 51/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0678Epoch 00050: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0678 - val_loss: 0.0725
Epoch 52/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0678Epoch 00051: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0678 - val_loss: 0.0726
Epoch 53/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0675Epoch 00052: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0675 - val_loss: 0.0736
Epoch 54/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0673Epoch 00053: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0673 - val_loss: 0.0729
Epoch 55/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0669Epoch 00054: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0669 - val_loss: 0.0728
Epoch 56/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0666Epoch 00055: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0666 - val_loss: 0.0733
Epoch 57/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0666Epoch 00056: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0666 - val_loss: 0.0731
Epoch 58/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0661Epoch 00057: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0661 - val_loss: 0.0739
Epoch 59/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00058: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0660 - val_loss: 0.0732
Epoch 60/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0658Epoch 00059: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0658 - val_loss: 0.0735
Epoch 61/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0654Epoch 00060: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0655 - val_loss: 0.0729
Epoch 62/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0650Epoch 00061: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0650 - val_loss: 0.0736
Epoch 63/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0648Epoch 00062: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0648 - val_loss: 0.0742
Epoch 64/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0645Epoch 00063: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0645 - val_loss: 0.0737
Epoch 65/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0643Epoch 00064: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0643 - val_loss: 0.0738
Epoch 66/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0642Epoch 00065: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0642 - val_loss: 0.0742
Epoch 67/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0640Epoch 00066: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0640 - val_loss: 0.0745
Epoch 68/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0637Epoch 00067: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0638 - val_loss: 0.0746
Epoch 69/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0635Epoch 00068: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0635 - val_loss: 0.0750
Epoch 70/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0633Epoch 00069: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0633 - val_loss: 0.0744
Epoch 71/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0631Epoch 00070: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0631 - val_loss: 0.0748
Epoch 72/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0629Epoch 00071: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0629 - val_loss: 0.0754
Epoch 73/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0626Epoch 00072: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0626 - val_loss: 0.0754
Epoch 74/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0624Epoch 00073: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0624 - val_loss: 0.0750
Epoch 75/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0622Epoch 00074: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0622 - val_loss: 0.0754
Epoch 76/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0619Epoch 00075: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0619 - val_loss: 0.0760
Epoch 77/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0618Epoch 00076: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0618 - val_loss: 0.0754
Epoch 78/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0616Epoch 00077: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0616 - val_loss: 0.0758
Epoch 79/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0614Epoch 00078: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0614 - val_loss: 0.0758
Epoch 80/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0613Epoch 00079: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0613 - val_loss: 0.0761
history: [(0.16394089827221747, None, 0.083106007222290876, None), (0.098507916211684032, None, 0.083312526672751033, None), (0.091586956620174492, None, 0.079073231503531169, None), (0.088720654214324762, None, 0.079237306374551619, None), (0.085938427465095196, None, 0.075592853101618562, None), (0.084489502587730539, None, 0.078527480609469361, None), (0.083311310820416748, None, 0.076075676937788828, None), (0.082032184112070597, None, 0.075809405304682567, None), (0.081571414384396301, None, 0.074712379593333919, None), (0.080423145570120078, None, 0.07344985447632961, None), (0.079657123058193224, None, 0.074057137573158349, None), (0.079439235332664421, None, 0.073030764107411592, None), (0.079096314941521681, None, 0.072519380094367508, None), (0.078249775373219518, None, 0.073623504980907334, None), (0.078205608094111298, None, 0.073288975890739502, None), (0.077689147502313052, None, 0.072622019251733477, None), (0.077062034323534062, None, 0.073264023077575277, None), (0.076761390416610162, None, 0.071930886515767581, None), (0.076312441709086548, None, 0.071531140010108005, None), (0.076001144066105711, None, 0.071576875221707442, None), (0.075585152208281561, None, 0.07144167551245445, None), (0.075518539789438052, None, 0.071955215581607473, None), (0.074887666211277334, None, 0.072507068214617373, None), (0.074690756871502326, None, 0.071083955548621791, None), (0.07419493331561143, None, 0.071288669024740819, None), (0.074156282585459324, None, 0.070948548683207546, None), (0.073638784835148449, None, 0.071752713986368843, None), (0.073450481033755177, None, 0.071208048789274128, None), (0.073344961581820411, None, 0.071299145414388226, None), (0.072837270500509449, None, 0.071520301857929083, None), (0.072396733495862162, None, 0.071867188909551599, None), (0.072302451404144222, None, 0.072810119707069118, None), (0.072203323192696386, None, 0.071410528537663789, None), (0.071946477671706269, None, 0.070982541602391466, None), (0.071733180630268484, None, 0.071540203900673449, None), (0.071256447627500011, None, 0.071785687240379634, None), (0.071300243928946488, None, 0.071468009971655339, None), (0.070975395922276072, None, 0.071532021512042035, None), (0.070643538643394094, None, 0.071473026614049417, None), (0.070336969146363865, None, 0.071891405370645908, None), (0.070230945676917678, None, 0.071692539003742478, None), (0.070065958451360572, None, 0.07176125437130422, None), (0.069629034856147826, None, 0.07175722482167321, None), (0.069741899608546612, None, 0.071614007428015547, None), (0.069444124268513818, None, 0.071952823945235861, None), (0.068955662277584845, None, 0.076972457515451065, None), (0.068816605402611086, None, 0.072956327881131849, None), (0.068590884784151263, None, 0.072222047127210171, None), (0.068400510429414599, None, 0.071833805723504701, None), (0.068108039026741174, None, 0.072636968732535181, None), (0.067813879089886522, None, 0.072527949544754652, None), (0.067843153547495164, None, 0.072598971044405908, None), (0.067477542703262547, None, 0.073598404316020105, None), (0.067276324852140579, None, 0.072901901894764143, None), (0.066922740708233425, None, 0.072770208120346069, None), (0.066585599902342377, None, 0.073300426314165307, None), (0.066556784863465848, None, 0.073113322776534179, None), (0.066149331239252915, None, 0.073860404637707017, None), (0.065991223649818645, None, 0.073164691855182581, None), (0.065803263113487234, None, 0.073492653913550324, None), (0.065465216117534003, None, 0.072870450660640934, None), (0.065014401743270736, None, 0.073647955070921783, None), (0.064822313888930991, None, 0.07421344892555104, None), (0.064529279883222823, None, 0.073715144324870335, None), (0.064317233728739848, None, 0.073779685211268972, None), (0.064196063754206473, None, 0.074235487783893994, None), (0.063976156412647714, None, 0.074493920887673731, None), (0.063773241792354496, None, 0.074596173597342802, None), (0.063522375334808534, None, 0.07499302866367194, None), (0.063305423412324119, None, 0.074406759779313547, None), (0.063093696903367136, None, 0.074832278430025226, None), (0.062883232407937611, None, 0.075427210893168117, None), (0.062645045706016533, None, 0.075415217123188813, None), (0.062374433114931002, None, 0.074982276643479701, None), (0.062160967209081153, None, 0.075372298258346515, None), (0.06188561869906254, None, 0.07595196262602405, None), (0.061781360066154131, None, 0.075399751519108868, None), (0.0615867098023593, None, 0.075796317977783009, None), (0.061396247814083871, None, 0.075754476445061822, None), (0.061280281078460862, None, 0.076135453287061755, None)]
0. 
patient tongue id: 05100745112850_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.55455 0.364897 0.348122 0.451541 0.377296 0.358624 0.300653 0.370128
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 泽泻 天麻

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
1. 
patient tongue id: 01051857204053_4
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.386777 0.894796 0.344263 0.934793 0.448247 0.607185 0.381657 0.498602 0.444872 0.887058 0.922958 0.87758 0.911944 0.414435 0.97194 0.406601 0.317888 0.402497 0.572591 0.826502
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
2. 
patient tongue id: 05241940056489_4_6
label yaofang:
甘草 法半夏 茯苓 龙骨 牡蛎 远志 党参 白术 酸枣仁 知母 砂仁 首乌藤 建曲 合欢花
0.892894 0.387814 0.420711 0.488997 0.336166 0.455993 0.347424 0.420942 0.308554
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
3. 
patient tongue id: 04281837391158_5
label yaofang:
甘草 桔梗 荆芥 芦根 薏苡仁 瓜蒌皮 紫菀 百部 地龙 苦杏仁 蝉蜕 蜜麻黄 蒸陈皮
0.337134 0.457337
predicted yaofang:
黄芪 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
4. 
patient tongue id: 03101757071025_4_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.370202 0.710816 0.392946 0.780618 0.384598 0.503427 0.395765 0.39237 0.334502 0.711195 0.741259 0.699536 0.765709 0.492492 0.804606 0.384383 0.378555 0.49886 0.664636
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
5. 
patient tongue id: 03291953364807_5_2_7
label yaofang:
甘草 桃仁 丹参 赤芍 牡丹皮 厚朴 射干 柿蒂 北沙参 苦杏仁 赭石 木蝴蝶 山豆根 岗梅
0.74799 0.403088 0.309873 0.513424 0.353337 0.332906 0.452
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 天麻

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
6. 
patient tongue id: 04222142282904_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.371902 0.898725 0.331279 0.942637 0.424574 0.615806 0.371565 0.47244 0.410732 0.894782 0.932344 0.884899 0.919287 0.418848 0.973958 0.395681 0.302773 0.394428 0.568124 0.843916
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
7. 
patient tongue id: 03291954460128_2_5
label yaofang:
甘草 半夏 牛蒡子 枸杞子 白术 玄参 浙贝母 杜仲 僵蚕 补骨脂 射干 北沙参 蝉蜕 百合 蜈蚣 木蝴蝶 冬凌草 山豆根 岗梅
0.575324 0.370832 0.380889 0.474763 0.432178 0.338696
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.105263, error: 0.666667
8. 
patient tongue id: 04081707176344_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.431467 0.304608 0.364712 0.515259 0.357334 0.337772
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
9. 
patient tongue id: 03312110476682_5
label yaofang:
甘草 茯苓 连翘 丹参 牡丹皮 黄柏 知母 山药 山茱萸 地黄 泽泻 白芷 麦芽 皂角刺
0.97699 0.32277 0.509711 0.568818 0.332242 0.592604 0.548376 0.582344 0.478414 0.476551 0.517816
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
10. 
patient tongue id: 01111908317862_1
label yaofang:
甘草 陈皮 茯苓 防风 白术 苍术 神曲 佩兰 麦芽 白扁豆 广藿香 布渣叶 稻芽
0.361912 0.330924 0.508719 0.423974 0.508487 0.338979 0.365291 0.355581 0.316679 0.327679 0.458834 0.488219 0.443778 0.485205 0.415936 0.548601 0.304891 0.301449 0.304725 0.414576
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.384615, error: 0.750000
11. 
patient tongue id: 05242233148828_6_4_2
label yaofang:
白芍 陈皮 木香 防风 白术 黄连 天麻 赤石脂 糯稻根 鳖甲 补骨脂 豆蔻 建曲 蜈蚣 天山雪莲 半枝莲
0.961109 0.322732 0.314501 0.494529 0.544787 0.322191 0.574223 0.531965 0.550009 0.467017 0.460627 0.470545
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
12. 
patient tongue id: 03231304165875_1_2
label yaofang:
甘草 白芍 桃仁 白术 柏子仁 天麻 肉苁蓉 鳖甲 火麻仁 补骨脂 浮小麦 蜈蚣 天山雪莲 半枝莲
0.987984 0.308825 0.474192 0.587705 0.323144 0.315187 0.665438 0.554294 0.619217 0.465614 0.484177 0.573832
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
13. 
patient tongue id: 05092017387395_1_6
label yaofang:
甘草 香附 茯苓 葛根 牛蒡子 党参 白术 海螵蛸 桑螵蛸 益智 紫苏梗 覆盆子 瓦楞子 猫爪草
0.315348 0.393051 0.307041 0.389073 0.384303 0.30345 0.450849
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
14. 
patient tongue id: 03152037588709_1_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 白术 五味子 熟附子 车前子 干姜 鸡内金
0.614634 0.417804 0.385457 0.531509 0.52626 0.325179 0.467376 0.349082 0.339507 0.365127 0.317615
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.454545, recall: 0.416667, error: 0.545455
15. 
patient tongue id: 06191333198312_2_5
label yaofang:
甘草 黄芩 茯苓 桔梗 太子参 白术 浙贝母 黄柏 山药 白花蛇舌草 北沙参 蜂房 醋鳖甲 岗梅
0.912401 0.307947 0.314916 0.482201 0.50393 0.37284 0.463156 0.392206 0.470322 0.323732 0.321422 0.333844
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
16. 
patient tongue id: 04142004310967_6
label yaofang:
甘草 茯苓 太子参 赤芍 浙贝母 郁金 天麻 鳖甲 佛手 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.992679 0.535913 0.606044 0.302158 0.325198 0.678584 0.612991 0.643714 0.530275 0.528231 0.580342
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
17. 
patient tongue id: 01122348252149_1_6
label yaofang:
甘草 桔梗 薏苡仁 远志 浙贝母 郁金 天麻 鳖甲 麦芽 苦杏仁 佛手 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.990669 0.524505 0.605072 0.311427 0.316564 0.664248 0.597185 0.631612 0.509644 0.508849 0.551892
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
18. 
patient tongue id: 03012212494887_2_5_6
label yaofang:
甘草 香附 黄芩 茯苓 连翘 党参 白术 酸枣仁 丹参 生地黄 山药 地骨皮 白芷 菟丝子 益母草 皂角刺
0.963694 0.303971 0.308686 0.485186 0.527274 0.338853 0.572194 0.500231 0.558191 0.432612 0.434224 0.464928
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
19. 
patient tongue id: 05312158139754_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 桃仁 党参 生地黄 山药 泽泻 菟丝子 益母草 茵陈 王不留行
0.814321 0.375993 0.374115 0.48358 0.346811 0.378972 0.326164
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
20. 
patient tongue id: 01201302183388_2_5
label yaofang:
甘草 桔梗 枸杞子 浙贝母 钩藤 天麻 鳖甲 火麻仁 女贞子 辛夷 蜈蚣 白花蛇舌 蜂房 岗梅根 四季青 墨旱莲
0.814059 0.405445 0.496916 0.392264
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.500000, recall: 0.125000, error: 0.500000
21. 
patient tongue id: 05080845513695_1_3_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.500787 0.329695 0.442356 0.323231 0.454439 0.480717 0.448317 0.399126 0.386523 0.336684 0.410105 0.359205 0.417982 0.371705 0.362574 0.367623 0.378835
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.705882, recall: 1.000000, error: 0.294118
22. 
patient tongue id: 05092108299408_5_1_6
label yaofang:
甘草 陈皮 枳壳 茯苓 薏苡仁 蒲公英 白术 黄连 黄柏 苍术 荆芥穗 天麻 槐花 百部 苦参 五倍子
0.978644 0.514403 0.55549 0.325854 0.586958 0.536526 0.570584 0.461837 0.45833 0.498376
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
23. 
patient tongue id: 04300921020223_1_2
label yaofang:
甘草 法半夏 茯苓 前胡 党参 黄芪 白术 浙贝母 黄柏 山药 桑白皮 地骨皮 补骨脂 紫菀 桑螵蛸 丝瓜络
0.899723 0.46381 0.50958 0.418713 0.392132 0.333042
predicted yaofang:
甘草 法半夏 茯苓 党参 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
24. 
patient tongue id: 04011953317462_2
label yaofang:
甘草 川芎 桔梗 荆芥 防风 芦根 牛蒡子 桑叶 菊花 紫苏叶 黑枣 木蝴蝶 四季青
0.741508 0.417968 0.438406 0.388396
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
25. 
patient tongue id: 04071254186242_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.360921 0.921997 0.320138 0.958091 0.435072 0.618848 0.370836 0.462509 0.408488 0.917443 0.947442 0.912775 0.937568 0.433224 0.979994 0.381835 0.376411 0.592118 0.868843
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
26. 
patient tongue id: 03291858263740_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.400887 0.526173 0.356931 0.338115 0.303987 0.323426 0.51917 0.59152
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
27. 
patient tongue id: 03221949248449_6_1_2
label yaofang:
甘草 党参 鸡血藤 郁金 山药 天麻 益母草 瓜蒌皮 王不留行 白花蛇舌草 白扁豆 蜈蚣 半枝莲 醋鳖甲
0.983893 0.504601 0.5725 0.31056 0.61961 0.555911 0.59611 0.476178 0.475021 0.513643
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
28. 
patient tongue id: 06121803043895_5
label yaofang:
甘草 桔梗 薄荷 芦根 牛蒡子 桑叶 菊花 射干 苦杏仁 野马追 东风桔
0.51698 0.355703 0.33781 0.437453 0.492464 0.330003
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
29. 
patient tongue id: 03232047507844_2_6
label yaofang:
甘草 独活 白术 熟地黄 杜仲 山药 山茱萸 天麻 桑寄生 白花蛇舌草 续断 蜈蚣 半枝莲 醋鳖甲
0.983877 0.309 0.510197 0.570952 0.32423 0.615423 0.568687 0.609375 0.495231 0.489988 0.532532
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
30. 
patient tongue id: 05242111474718_6_7_2
label yaofang:
桂枝 甘草 柴胡 白芍 茯苓 羌活 酸枣仁 延胡索 牡丹皮 天麻 鳖甲 补骨脂 莪术 蜈蚣 天山雪莲 半枝莲
0.981057 0.315686 0.506981 0.569669 0.30916 0.617467 0.557473 0.580483 0.48531 0.47683 0.51019
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
31. 
patient tongue id: 03192238272841_1_4
label yaofang:
甘草 川芎 法半夏 茯苓 枸杞子 白术 酸枣仁 杜仲 牛膝 天麻 桑寄生 益母草 麦芽 蒺藜
0.76794 0.413586 0.479024 0.3322 0.411732 0.335212
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
32. 
patient tongue id: 01211256352872_2_1
label yaofang:
甘草 茯苓 玉竹 赤芍 牡丹皮 车前子 秦艽 地龙 嫩桑枝 紫苏叶 宽筋藤 鹿衔草 三七粉 络石藤
0.451857 0.336384 0.335082 0.378552 0.355913 0.424315 0.315942
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
33. 
patient tongue id: 03231106409765_2
label yaofang:
甘草 陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 广藿香 炒紫苏子 蜜麻黄
0.334857 0.509768 0.399968 0.475252 0.320003 0.356353 0.341243 0.350584 0.418624 0.490058 0.43047 0.473317 0.436679 0.609352 0.370515
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.666667, recall: 0.625000, error: 0.333333
34. 
patient tongue id: 06131956397110_6
label yaofang:
甘草 半夏 黄芪 酸枣仁 黄连 海螵蛸 淡豆豉 砂仁 莪术 柿蒂 北沙参 紫苏叶 合欢皮 蛇舌草
0.81486 0.442299 0.447256 0.322789 0.465822 0.313742 0.397504
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
35. 
patient tongue id: 04301125556084_6_1
label yaofang:
甘草 茯苓 党参 酸枣仁 黄连 浙贝母 砂仁 鳖甲 枇杷叶 麦芽 紫苏梗 广藿香 白花蛇舌 天山雪莲 合欢花
0.990669 0.53102 0.593209 0.303168 0.654897 0.594067 0.630827 0.508874 0.498657 0.536725
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.400000, error: 0.400000
36. 
patient tongue id: 05080848357997_1_3
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.44746 0.34317 0.379025 0.330091 0.42491 0.507067 0.392427 0.354437 0.307851 0.355936 0.310843 0.34112 0.336812 0.321218 0.328216
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.133333, recall: 0.166667, error: 0.866667
37. 
patient tongue id: 01211234484870_7_4_5
label yaofang:
甘草 桔梗 蒲公英 紫花地丁 知母 僵蚕 蝉蜕 姜黄
0.347956 0.351038 0.308456 0.324689 0.539077
predicted yaofang:
法半夏 茯苓 黄芪 紫菀 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
38. 
patient tongue id: 04182145431436_2
label yaofang:
甘草 黄芩 桔梗 芦根 太子参 浙贝母 乌梅 天花粉 鳖甲 麦芽 白花蛇舌 蜂房 岗梅根 四季青
0.981387 0.320343 0.499361 0.5756 0.315073 0.301872 0.638915 0.563263 0.596696 0.490196 0.485045 0.530196
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
39. 
patient tongue id: 02212043269290_6_4
label yaofang:
甘草 白芍 党参 白术 生地黄 山茱萸 天麻 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲 广金钱草 车前草
0.922696 0.335461 0.474207 0.51405 0.363779 0.509083 0.415865 0.487231 0.345046 0.353413 0.368691
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
40. 
patient tongue id: 02142134156207_1_2
label yaofang:
甘草 茯苓 鸡血藤 白术 酸枣仁 赤芍 山药 山茱萸 地黄 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.982931 0.493547 0.562488 0.351855 0.301343 0.620999 0.563051 0.603278 0.48028 0.481723 0.543326
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
41. 
patient tongue id: 04202209073596_6
label yaofang:
甘草 茯苓 党参 鸡血藤 酸枣仁 生地黄 杜仲 天麻 鳖甲 续断 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.905501 0.446234 0.493961 0.416175 0.406092 0.422779
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.312500, error: 0.166667
42. 
patient tongue id: 03101935570478_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.371281 0.893798 0.330725 0.93618 0.429089 0.611509 0.362096 0.457793 0.396224 0.882107 0.921779 0.879523 0.913192 0.40859 0.969666 0.392823 0.380528 0.564511 0.834812
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.785714, error: 0.421053
43. 
patient tongue id: 04251837548905_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.378697 0.836729 0.374032 0.896242 0.410929 0.556336 0.394456 0.442445 0.371166 0.841897 0.87823 0.819424 0.871077 0.470484 0.927992 0.389131 0.376498 0.545682 0.777525
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.842105, recall: 1.000000, error: 0.157895
44. 
patient tongue id: 02161948344560_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 郁金 鸡内金 豆蔻 姜半夏 炙甘草 紫苏梗
0.813412 0.351756 0.394311 0.483661 0.325564 0.394758 0.32916
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
45. 
patient tongue id: 04061838468395_4_1
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.369161 0.849936 0.361061 0.898883 0.42571 0.539413 0.374129 0.447534 0.382643 0.835356 0.87641 0.815317 0.865613 0.417227 0.931962 0.354236 0.362656 0.512517 0.770719
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
46. 
patient tongue id: 04132033179956_2_5_7
label yaofang:
甘草 柴胡 白芍 枳壳 桔梗 太子参 浙贝母 砂仁 天花粉 五灵脂 鳖甲 北沙参 鹿角霜 白花蛇舌 蜂房 四季青
0.824986 0.328132 0.419084 0.496702 0.349622 0.38969 0.342276
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.125000, error: 0.714286
47. 
patient tongue id: 04300923133554_6_4_7
label yaofang:
甘草 法半夏 当归 桃仁 党参 黄芪 鸡血藤 酸枣仁 生地黄 赤芍 郁金 补骨脂 虎杖 豆蔻
0.978695 0.313357 0.497333 0.574787 0.334735 0.618643 0.54677 0.589118 0.47578 0.47173 0.518348
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
48. 
patient tongue id: 06190649376376_1
label yaofang:
甘草 茯苓 党参 黄芪 黄连 熟地黄 地黄 天麻 糯稻根 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.87334 0.336572 0.421427 0.493495 0.384813 0.431448 0.317245 0.410227
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
49. 
patient tongue id: 05131655594782_6_2
label yaofang:
甘草 茯苓 羌活 党参 白术 酸枣仁 山药 细辛 天麻 白芷 鳖甲 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.979653 0.335229 0.473111 0.551048 0.339791 0.60805 0.53164 0.592916 0.460667 0.468135 0.533227
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.625000, error: 0.090909
50. 
patient tongue id: 02191235515942_6_5
label yaofang:
甘草 法半夏 茯苓 桔梗 牛蒡子 白术 栀子 牡丹皮 桑叶 鳖甲 白花蛇舌草 天山雪莲 贯众
0.971143 0.485756 0.555017 0.350473 0.310934 0.579135 0.492659 0.552712 0.417637 0.425529 0.476882
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
51. 
patient tongue id: 04192235441841_1_2_4
label yaofang:
甘草 薏苡仁 党参 白术 生地黄 天麻 鳖甲 莪术 续断 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 牛大力
0.974189 0.318501 0.50264 0.56787 0.336132 0.322355 0.304481 0.615903 0.561216 0.59397 0.493673 0.488164 0.526863
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.533333, error: 0.384615
52. 
patient tongue id: 03221632159824_5_7
label yaofang:
半夏 薏苡仁 桃仁 黄芪 白术 砂仁 桑寄生 王不留行 橘核 土鳖虫 红豆杉 墨旱莲 山慈菇 蛇舌草
0.694693 0.42764 0.35159 0.341596 0.412645
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
53. 
patient tongue id: 03292035477734_1_4
label yaofang:
法半夏 前胡 防风 麦冬 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.352087 0.720161 0.412862 0.765414 0.406642 0.447268 0.376569 0.409979 0.363647 0.698365 0.73773 0.6636 0.727465 0.420894 0.810217 0.322218 0.300663 0.350902 0.449502 0.638873
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
54. 
patient tongue id: 03101914511801_3
label yaofang:
桂枝 牛蒡子 党参 白术 附子 车前子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.538856 0.3527 0.334785 0.368113 0.427976
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
55. 
patient tongue id: 05251953177126_2
label yaofang:
甘草 枸杞子 赤芍 浙贝母 牡丹皮 山茱萸 水蛭 厚朴 僵蚕 莪术 北沙参 女贞子 辛夷 紫苏叶 蜈蚣 土鳖虫 合欢皮
0.483757 0.366053 0.450764 0.498493 0.349551 0.30346
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 砂仁

------Score: precision: 0.333333, recall: 0.117647, error: 0.666667
56. 
patient tongue id: 05242246480904_5_6
label yaofang:
甘草 法半夏 前胡 桔梗 鱼腥草 浙贝母 细辛 天麻 鳖甲 款冬花 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.967797 0.31805 0.503083 0.56158 0.334956 0.322672 0.602398 0.536945 0.566222 0.475736 0.468238 0.504178
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
57. 
patient tongue id: 04272326183583_6_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.346675 0.31441 0.374075 0.377266 0.475689
predicted yaofang:
白芍 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.600000, recall: 0.300000, error: 0.400000
58. 
patient tongue id: 05182117323801_4_6
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 补骨脂 豆蔻 姜半夏 炙甘草 紫苏梗
0.489946 0.340925 0.332104 0.520013 0.52331 0.316027 0.430752 0.327212
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁

------Score: precision: 0.125000, recall: 0.083333, error: 0.875000
59. 
patient tongue id: 04121925515437_2_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 栀子 天麻 鳖甲 佛手 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.911774 0.471924 0.48304 0.421235 0.399241 0.439513
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
60. 
patient tongue id: 01061623430389_1_2_6
label yaofang:
甘草 茯苓 党参 酸枣仁 郁金 地黄 天麻 白花蛇舌草 佛手 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.987112 0.51786 0.58633 0.314041 0.314396 0.654112 0.587797 0.623878 0.5153 0.506589 0.55075
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
61. 
patient tongue id: 02260709320621_5_1_6
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 桔梗 党参 浙贝母 细辛 砂仁 鳖甲 款冬花 苦杏仁 炙麻黄 白花蛇舌 四季青
0.919943 0.336593 0.464523 0.505431 0.38123 0.513771 0.411021 0.489774 0.338666 0.350828 0.389859
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
62. 
patient tongue id: 02150731549245_1_2
label yaofang:
甘草 法半夏 茯苓 桔梗 橘红 金银花 桃仁 党参 黄芪 丹参 枳实 竹茹 厚朴
0.422141 0.451132 0.468394 0.426494 0.463252 0.37703 0.389514 0.324508 0.441003 0.416292 0.407018 0.345449 0.409855 0.367784 0.430398
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.333333, recall: 0.384615, error: 0.666667
63. 
patient tongue id: 04151218075798_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.335402 0.620163 0.345414 0.626148 0.340608 0.414019 0.338891 0.370869 0.375423 0.543255 0.71055 0.570965 0.633728 0.365794 0.826156 0.308821 0.345347 0.338906 0.540459
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
64. 
patient tongue id: 01130647343298_6_4
label yaofang:
甘草 柴胡 白芍 白术 苍术 山药 车前子 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.993382 0.541572 0.615791 0.314925 0.683635 0.619906 0.653152 0.533764 0.532262 0.580486
predicted yaofang:
甘草 茯苓 党参 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.466667, error: 0.300000
65. 
patient tongue id: 03230708316571_5_2
label yaofang:
甘草 法半夏 茯苓 葛根 连翘 党参 白术 牡丹皮 苍术 山茱萸 佩兰 莱菔子 天花粉
0.988423 0.519858 0.585947 0.327843 0.309958 0.626309 0.556233 0.604717 0.473998 0.478951 0.532598
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
66. 
patient tongue id: 03171354538015_2
label yaofang:
白芍 茯苓 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 炙甘草 制远志 酒女贞子 煅龙骨 炒酸枣仁
0.345589 0.870573 0.342345 0.918855 0.399104 0.5632 0.360004 0.440301 0.362896 0.855667 0.90225 0.845967 0.8933 0.408351 0.94953 0.385981 0.355318 0.531707 0.806707
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.210526, recall: 0.285714, error: 0.789474
67. 
patient tongue id: 04122037540621_1_2_4
label yaofang:
甘草 茯苓 桔梗 桃仁 党参 浙贝母 天麻 天花粉 鳖甲 诃子 蜈蚣 木蝴蝶 白花蛇舌 天山雪莲 半枝莲
0.977839 0.317053 0.473426 0.54876 0.344989 0.585466 0.506043 0.569918 0.429847 0.440882 0.506626
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
68. 
patient tongue id: 01122320493067_6_2
label yaofang:
甘草 川芎 羌活 党参 白术 酸枣仁 赤芍 牛膝 细辛 天麻 全蝎 白花蛇舌草 半枝莲 醋鳖甲
0.99228 0.519427 0.604532 0.310916 0.304722 0.680603 0.608758 0.651245 0.529734 0.520918 0.579624
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
69. 
patient tongue id: 02182254352178_6_2
label yaofang:
甘草 独活 红花 延胡索 山药 山茱萸 地黄 天麻 巴戟天 桑寄生 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 乌梢蛇 宽筋藤
0.983344 0.504616 0.574779 0.327968 0.302786 0.628229 0.569001 0.608037 0.488446 0.496542 0.53939
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
70. 
patient tongue id: 02141948495689_1_6
label yaofang:
甘草 肉桂 干姜 附片
0.548717 0.348436 0.349092 0.394155 0.339384
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
71. 
patient tongue id: 02212002549775_1_6
label yaofang:
甘草 茯苓 党参 黄芪 白术 山药 干姜 砂仁 天麻 鳖甲 豆蔻 白扁豆 蜈蚣 天山雪莲 半枝莲
0.949861 0.314618 0.480598 0.523724 0.395898 0.313442 0.310612 0.538097 0.475678 0.552763 0.416636 0.422508 0.478813
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.666667, error: 0.230769
72. 
patient tongue id: 06132202214822_6_4
label yaofang:
甘草 香附 茯苓 党参 白术 海螵蛸 莪术 柿蒂 紫苏梗 瓦楞子 猫爪草
0.433197 0.571199 0.409725 0.369054 0.342979 0.616531 0.702726 0.30966
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.375000, recall: 0.272727, error: 0.625000
73. 
patient tongue id: 04271824466548_2
label yaofang:
甘草 白芍 半夏 薏苡仁 黄芪 海螵蛸 杜仲 神曲 厚朴 砂仁 巴戟天 莪术 麦芽 女贞子 紫苏叶 蜈蚣 墨旱莲 蛇舌草
0.472822 0.387289 0.319243 0.395271 0.397677 0.302291
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.111111, error: 0.666667
74. 
patient tongue id: 05161940495927_3
label yaofang:
白芍 川芎 当归 独活 党参 黄芪 细辛 防己 桑寄生 木瓜 川牛膝 炙甘草 续断 威灵仙 盐菟丝子
0.346164 0.514409 0.406582 0.526102 0.321019 0.371732 0.348621 0.352818 0.466308 0.51963 0.478071 0.526686 0.482662 0.613871 0.403402
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.133333, recall: 0.133333, error: 0.866667
75. 
patient tongue id: 03041055583592_4
label yaofang:
白芍 川芎 大枣 当归 党参 太子参 黄芪 枸杞子 熟地黄 肉桂 煅牡蛎 山萸肉 炙甘草 续断 酒女贞子 煅龙骨
0.376451 0.863029 0.354011 0.916089 0.426616 0.589143 0.373818 0.425252 0.37826 0.855516 0.894385 0.852202 0.892534 0.442123 0.948626 0.396304 0.382637 0.55147 0.808182
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.105263, recall: 0.125000, error: 0.894737
76. 
patient tongue id: 03022137597482_6
label yaofang:
柴胡 陈皮 当归 龙骨 党参 黄芪 白术 车前子 砂仁 升麻 炙甘草
0.672894 0.329615 0.386947 0.459235 0.362276 0.336826
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
77. 
patient tongue id: 04282231092623_5_6
label yaofang:
甘草 荆芥 防风 金银花 连翘 蒲公英 白术 丹参 地黄 白芷 麦芽 皂角刺 白鲜皮
0.992551 0.533213 0.599357 0.306082 0.326234 0.300309 0.678068 0.620319 0.654796 0.537637 0.533208 0.587184
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
78. 
patient tongue id: 03290705187173_5_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 金银花 连翘 党参 白术 丹参 栀子 牡丹皮 山药 白芷 皂角刺
0.975573 0.507404 0.575444 0.347875 0.319427 0.605091 0.55269 0.587776 0.475989 0.480212 0.512562
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
79. 
patient tongue id: 03291929425188_5_2
label yaofang:
甘草 枳壳 黄芩 黄连 红花 赤芍 牡丹皮 石膏 厚朴 北沙参 赭石 土茯苓 预知子 蛇舌草 龙胆
0.477408 0.313733 0.337556 0.389479 0.331972 0.377863
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.166667, recall: 0.066667, error: 0.833333
80. 
patient tongue id: 05130656261672_5_1_6
label yaofang:
甘草 法半夏 茯苓 龙骨 牡蛎 远志 党参 酸枣仁 丹参 黄连 郁金 山药 合欢花
0.956388 0.302473 0.496261 0.548456 0.364062 0.314328 0.300979 0.563206 0.512463 0.541318 0.438131 0.438441 0.459606
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.384615, error: 0.615385
81. 
patient tongue id: 02151742445560_1_7_2
label yaofang:
甘草 黄芪 白术 海螵蛸 杜仲 泽泻 生半夏 砂仁 石斛 鸡内金 北沙参 红豆杉 山慈菇 蛇舌草 红景天
0.428703 0.353361 0.328392 0.559422 0.35079 0.38261 0.381671
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
82. 
patient tongue id: 06111025399712_3_4
label yaofang:
甘草 白芍 川芎 香附 黄芩 当归 党参 丹参 杜仲 菟丝子 桑寄生 淫羊藿 仙茅
0.989794 0.536738 0.590778 0.307065 0.32021 0.663653 0.607712 0.642534 0.526879 0.525211 0.5686
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
83. 
patient tongue id: 05290750503091_6_2_4
label yaofang:
甘草 川芎 法半夏 茯苓 白术 酸枣仁 牡丹皮 川楝子 杜仲 牛膝 天麻 桑寄生 蒺藜
0.967821 0.303525 0.472547 0.546071 0.3289 0.570951 0.472943 0.534736 0.392299 0.393531 0.425327
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
84. 
patient tongue id: 04112006166540_2_1_6
label yaofang:
甘草 川芎 葛根 太子参 黄连 山茱萸 地黄 砂仁 天麻 天花粉 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.980539 0.516675 0.593377 0.353288 0.344773 0.30589 0.632507 0.544546 0.600464 0.461994 0.475495 0.518181
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
85. 
patient tongue id: 04241911025061_4_3
label yaofang:
甘草 白芍 薏苡仁 延胡索 干姜 厚朴 地榆 槐花 补骨脂 吴茱萸 广藿香 黑枣 萎凌菜
0.382324 0.32888 0.309227 0.321369 0.391223 0.337764 0.372793
predicted yaofang:
甘草 白芍 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
86. 
patient tongue id: 04101915294867_4
label yaofang:
川芎 独活 党参 黄芪 细辛 防己 木瓜 豆蔻 川牛膝 炙甘草 续断 首乌藤 威灵仙 盐菟丝子
0.369272 0.824464 0.374449 0.885597 0.428089 0.555681 0.394044 0.437097 0.38895 0.835454 0.872922 0.812887 0.859213 0.471482 0.919257 0.382014 0.313477 0.396363 0.545219 0.768573
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.142857, error: 0.900000
87. 
patient tongue id: 04141248234842_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄 炒苍耳子
0.362727 0.91612 0.336381 0.956687 0.446358 0.609913 0.3698 0.471365 0.406624 0.917226 0.946902 0.90009 0.937621 0.41993 0.97837 0.373213 0.301517 0.378495 0.574158 0.85733
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.833333, error: 0.500000
88. 
patient tongue id: 06022219240417_1_4_7
label yaofang:
陈皮 茯苓 半夏 党参 阿胶 枸杞子 海螵蛸 杜仲 牛膝 山药 厚朴 僵蚕 菟丝子 紫苏子 紫苏叶 木蝴蝶 骨碎补 红豆杉
0.77662 0.430765 0.421691 0.340858 0.428781 0.309941
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.333333, recall: 0.111111, error: 0.666667
89. 
patient tongue id: 01180415541807_2
label yaofang:
甘草 茯苓 前胡 太子参 白术 天花粉 川贝母 紫菀 白前 枇杷叶 北沙参 木蝴蝶
0.758397 0.42422 0.400278 0.330861 0.313658 0.343712
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
90. 
patient tongue id: 03141256460545_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.346201 0.300799 0.358362 0.37019 0.404505
predicted yaofang:
甘草 法半夏 茯苓 黄芪 炙甘草

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
91. 
patient tongue id: 03022128075146_6_2
label yaofang:
黄芩 茯苓 栀子 杜仲 牛膝 钩藤 天麻 石决明 桑寄生 首乌藤 玉米须
0.424028 0.313125 0.419731 0.309271 0.361293 0.354105 0.43798
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
92. 
patient tongue id: 04211939347865_4_7_6
label yaofang:
黄芪 白术 丹参 延胡索 杜仲 郁金 厚朴 砂仁 鸡内金 北沙参 首乌藤 广金钱草
0.356582 0.356496 0.381214 0.316323 0.32389
predicted yaofang:
甘草 党参 黄芪 白术 炙甘草

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
93. 
patient tongue id: 03230717337546_1_6_4
label yaofang:
甘草 香附 薏苡仁 丹参 生地黄 延胡索 郁金 青蒿 天麻 地骨皮 鳖甲 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲
0.876287 0.456896 0.456962 0.415644 0.344078 0.39434
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
94. 
patient tongue id: 03292031353328_4
label yaofang:
麻黄 甘草 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 香薷 辛夷 紫苏梗 广藿香 炒苍耳子 木贼
0.358053 0.801527 0.36709 0.850991 0.424095 0.540406 0.361085 0.434503 0.378394 0.779885 0.821735 0.767751 0.825774 0.360427 0.896249 0.41078 0.390534 0.49471 0.727383
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.315789, recall: 0.400000, error: 0.684211
95. 
patient tongue id: 02251238316858_4
label yaofang:
法半夏 前胡 防风 细辛 款冬花 白前 百部 炙甘草 广藿香 炒紫苏子 炒苍耳子
0.354951 0.624472 0.401965 0.663545 0.359118 0.425058 0.366808 0.340238 0.303518 0.592184 0.632185 0.575594 0.645374 0.456866 0.685808 0.331893 0.334691 0.406118 0.547237
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.909091, error: 0.473684
96. 
patient tongue id: 01031826203635_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 炒苍耳子
0.407485 0.378188 0.401546 0.322403 0.3074 0.443917
predicted yaofang:
甘草 法半夏 茯苓 黄芪 紫菀 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
97. 
patient tongue id: 06191213367631_4_6
label yaofang:
甘草 陈皮 茯苓 前胡 牛蒡子 桃仁 远志 天麻 鳖甲 川贝母 苦杏仁 紫苏子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.962538 0.331717 0.345276 0.502043 0.535321 0.308244 0.569092 0.528602 0.541226 0.457877 0.450898 0.462146
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
98. 
patient tongue id: 06031128334657_5_1
label yaofang:
法半夏 茯苓 桔梗 金银花 连翘 薄荷 芦根 党参 玄参 浙贝母 鳖甲 皂角刺 板蓝根 白花蛇舌 岗梅根 四季青 广升麻
0.878648 0.342933 0.360841 0.48351 0.48642 0.334777 0.438875 0.371405 0.442244 0.31466 0.301225
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 半枝莲

------Score: precision: 0.454545, recall: 0.294118, error: 0.545455
99. 
patient tongue id: 05022016103916_6
label yaofang:
甘草 川芎 茯苓 党参 酸枣仁 黄柏 牛膝 细辛 天麻 全蝎 白芷 菟丝子 女贞子 浮小麦 墨旱莲
0.975696 0.301148 0.512896 0.562241 0.330471 0.30206 0.599382 0.555809 0.582507 0.47798 0.47577 0.50694
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
100. 
patient tongue id: 04112059353325_3_1_5
label yaofang:
牡蛎 黄芪 白术 酸枣仁 海螵蛸 白茅根 当归尾 砂仁 鸡内金 首乌藤 合欢皮 山慈菇 石上柏 稻芽 鲜龙葵果
0.474692 0.365235 0.375836 0.566873 0.551669 0.502573 0.366243 0.32536 0.443279 0.366327
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
101. 
patient tongue id: 03111448100551_7_6
label yaofang:
甘草 白芍 川芎 生地黄 赤芍 牛膝 天麻 全蝎 白芷 淡竹叶 麦芽 川木通
0.900692 0.455307 0.444948 0.432833 0.338266 0.422216
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
102. 
patient tongue id: 05242114524473_6_4_2
label yaofang:
甘草 当归 茯苓 党参 黄连 浙贝母 白芷 菟丝子 天花粉 益母草 鳖甲 续断 白花蛇舌 蜂房 四季青 红豆杉
0.989981 0.528214 0.589783 0.307186 0.643287 0.593708 0.627452 0.514393 0.50931 0.545812
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.312500, error: 0.500000
103. 
patient tongue id: 03161323096291_4_1
label yaofang:
法半夏 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.344354 0.613536 0.40672 0.657089 0.359907 0.417479 0.365024 0.333605 0.588616 0.639231 0.580421 0.652571 0.433151 0.712978 0.311335 0.324302 0.400131 0.562953
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.800000, error: 0.333333
104. 
patient tongue id: 01100307014357_4_1
label yaofang:
桂枝 白芍 大枣 葛根 党参 延胡索 全蝎 炙甘草 蜈蚣
0.688474 0.333907 0.418899 0.424697 0.351262
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.222222, error: 0.600000
105. 
patient tongue id: 02021014574530_6_7
label yaofang:
龙骨 太子参 白术 酸枣仁 砂仁 僵蚕 糯稻根 王不留行 珍珠母 桑椹 首乌藤 百合 合欢皮 墨旱莲
0.887603 0.438537 0.446329 0.439986 0.358363 0.433326
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
106. 
patient tongue id: 06012001292120_1_2_6
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 地黄 天麻 菟丝子 益母草 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.983363 0.315834 0.463339 0.573544 0.330043 0.302965 0.614762 0.488068 0.558165 0.401125 0.424854 0.501881
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
107. 
patient tongue id: 03020752023074_6_7_1
label yaofang:
桂枝 甘草 白芍 大枣 桃仁 葶苈子 五味子 细辛 大腹皮 桑白皮 补骨脂 麦芽 紫苏子 川加皮
0.988122 0.336698 0.485424 0.568528 0.323785 0.640238 0.563045 0.622139 0.485825 0.490869 0.576876
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
108. 
patient tongue id: 02191636266781_5_6
label yaofang:
甘草 枳壳 法半夏 木香 连翘 党参 白术 槟榔 砂仁 莱菔子 款冬花 莪术 麦芽 建曲 独脚金
0.9731 0.30626 0.492269 0.542367 0.338934 0.575295 0.529577 0.573304 0.461442 0.452191 0.487491
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
109. 
patient tongue id: 02110737425536_1_3_2
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 知母 山药 天花粉 北沙参 玉米须
0.408395 0.305936 0.381353 0.330533 0.303981
predicted yaofang:
甘草 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
110. 
patient tongue id: 02272235373251_6_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 天花粉 麦芽 百合 紫苏叶 独脚金
0.462511 0.369648 0.468807 0.318189 0.388935 0.332633 0.318096 0.42728
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.083333, error: 0.875000
111. 
patient tongue id: 01190621199806_2_1_6
label yaofang:
甘草 白芍 茯苓 远志 党参 枸杞子 牡丹皮 黄柏 山药 山茱萸 泽泻 菟丝子 金樱子 蛇床子 沙苑子 合欢花
0.995038 0.530604 0.617439 0.306693 0.698954 0.625533 0.668846 0.529676 0.533178 0.590822
predicted yaofang:
甘草 茯苓 党参 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.187500, error: 0.700000
112. 
patient tongue id: 06080153395109_2
label yaofang:
甘草 白芍 金银花 连翘 丹参 生地黄 栀子 牡丹皮 石膏 淡竹叶 广藿香 黄精 天山雪莲 木贼 有瓜石斛 谷精子
0.993744 0.317057 0.491182 0.592404 0.306383 0.690737 0.592314 0.655787 0.510963 0.516242 0.610257
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
113. 
patient tongue id: 01042342160471_1_2_6
label yaofang:
甘草 茯苓 薏苡仁 杜仲 牛膝 天麻 桑寄生 扁豆花 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲 乌梢蛇
0.981194 0.315374 0.484772 0.561709 0.332041 0.314941 0.300186 0.634811 0.580149 0.619958 0.510531 0.513851 0.568206
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
114. 
patient tongue id: 03012056043088_1_7_4
label yaofang:
甘草 茯苓 桃仁 黄芪 白术 红花 延胡索 薤白 天麻 高良姜 瓜蒌皮 地龙 首乌藤 麸炒枳壳
0.7153 0.338673 0.399094 0.434377 0.350403
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
115. 
patient tongue id: 03222035515458_1_7_4
label yaofang:
黄芪 白术 杜仲 山药 当归尾 砂仁 桑寄生 补骨脂 芡实 金樱子 鸡内金 益智 首乌藤
0.387293 0.373924 0.300505 0.354296 0.328495 0.40101
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
116. 
patient tongue id: 05162147413915_1_7
label yaofang:
甘草 枳壳 茯苓 桃仁 麦冬 党参 丹参 五味子 红花 山茱萸 补骨脂 鹿角霜 川加皮
0.985551 0.318263 0.526153 0.581341 0.305002 0.648169 0.590115 0.603822 0.501181 0.496593 0.521341
predicted yaofang:
甘草 法半夏 茯苓 党参 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
117. 
patient tongue id: 03141248099589_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.673871 0.327766 0.352273 0.43938 0.366137
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
118. 
patient tongue id: 04101911255745_4
label yaofang:
茯苓 防风 白术 钩藤 荆芥穗 白芷 芡实 炙甘草 首乌藤 广藿香 威灵仙 炒六神曲 棉萆薢
0.313209 0.584606 0.401841 0.575689 0.314912 0.358723 0.325808 0.302225 0.499825 0.562954 0.496022 0.561106 0.443355 0.685183 0.425734
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
119. 
patient tongue id: 03242144586725_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 细辛 干姜 白芷 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.569683 0.345809 0.471317 0.309095 0.395267 0.330413 0.351888
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
120. 
patient tongue id: 06050837381660_1_3_7
label yaofang:
桂枝 白芍 当归 党参 黄芪 熟附子 乌药 山药 干姜 淫羊藿 仙茅 益智 鹿角霜
0.559108 0.366042 0.359735 0.485518 0.508786 0.426171 0.332764 0.310216
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
121. 
patient tongue id: 03022216261981_5_6
label yaofang:
甘草 白术 生地黄 延胡索 天麻 五灵脂 鳖甲 忍冬藤 桑枝 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.979263 0.317668 0.498342 0.573285 0.321933 0.305104 0.615781 0.547665 0.580836 0.475019 0.474725 0.514368
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
122. 
patient tongue id: 03290702293897_6_2
label yaofang:
甘草 白芍 当归 白术 黄连 生地黄 茜草 赤石脂 鳖甲 火麻仁 蜈蚣 天山雪莲 半枝莲
0.959577 0.505069 0.551498 0.328506 0.324279 0.590403 0.46305 0.520962 0.383164 0.393443 0.417572
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
123. 
patient tongue id: 05201459047007_1_2_6
label yaofang:
甘草 防风 金银花 黄芪 酸枣仁 红花 荆芥穗 天麻 鳖甲 白鲜皮 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红条紫草
0.852937 0.351732 0.407116 0.481781 0.455983 0.3338 0.40908 0.315931 0.410254
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.444444, recall: 0.250000, error: 0.555556
124. 
patient tongue id: 02020954233530_1_4
label yaofang:
甘草 白芍 川芎 法半夏 党参 白术 赤芍 钩藤 天麻 木瓜 决明子 地龙 首乌藤 沙苑子 宽筋藤
0.945485 0.344813 0.446443 0.534462 0.35187 0.520647 0.394889 0.494315 0.325129 0.332941 0.369303
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
125. 
patient tongue id: 02021008074132_2_5
label yaofang:
甘草 橘红 麦冬 黄芪 白术 浙贝母 侧柏叶 桑白皮 厚朴 仙鹤草 火麻仁 枇杷叶 北沙参 蛤壳 冬凌草
0.369324 0.535786 0.402837 0.530883 0.38021 0.432161 0.374751 0.339387 0.385177 0.375302 0.333452 0.489737 0.589045 0.49844 0.543946 0.410243 0.680861 0.339275 0.347283 0.372749 0.355659 0.465086
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.090909, recall: 0.133333, error: 0.909091
126. 
patient tongue id: 01040644032083_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 橘红 金银花 芦根 浙贝母 莱菔子 白前 紫苏子
0.969863 0.320111 0.307548 0.521632 0.564815 0.328299 0.324429 0.308861 0.599934 0.537885 0.566707 0.470761 0.462672 0.494164
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.214286, recall: 0.230769, error: 0.785714
127. 
patient tongue id: 02190817004069_1_2_7
label yaofang:
甘草 茯苓 党参 黄芪 生地黄 牡丹皮 黄柏 山药 山茱萸 白茅根 泽泻 茜草 桑寄生 女贞子 墨旱莲
0.986022 0.324449 0.489475 0.579656 0.329836 0.320501 0.651177 0.570017 0.614845 0.493951 0.500201 0.57065
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
128. 
patient tongue id: 03020651485405_6_2_7
label yaofang:
甘草 白芍 党参 酸枣仁 丹参 生地黄 浙贝母 白芷 鳖甲 皂角刺 鹿角霜 首乌藤 白花蛇舌 天山雪莲
0.979999 0.321702 0.514518 0.577899 0.329109 0.319646 0.303594 0.627062 0.575307 0.606723 0.508479 0.502105 0.541978
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
129. 
patient tongue id: 03101802096959_1_4
label yaofang:
白芍 川芎 当归 党参 太子参 黄芪 枸杞子 熟地黄 郁金 干姜 北柴胡 炙甘草 续断 盐菟丝子 酒女贞子
0.325684 0.341936 0.419162 0.45545 0.476539
predicted yaofang:
法半夏 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
130. 
patient tongue id: 05290818271347_2_1_5
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 天麻 菟丝子 糯稻根 益母草 鳖甲 女贞子 蜈蚣 天山雪莲 半枝莲 墨旱莲
0.943776 0.342657 0.467338 0.536996 0.355539 0.544779 0.472328 0.515682 0.410213 0.414003 0.441592
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
131. 
patient tongue id: 02241840065207_2
label yaofang:
法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.362398 0.754495 0.357073 0.814673 0.403034 0.52827 0.372876 0.40089 0.362898 0.736815 0.796339 0.748574 0.793152 0.430989 0.871672 0.381097 0.378388 0.500174 0.705828
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.875000, error: 0.263158
132. 
patient tongue id: 03272237452032_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.495685 0.313307 0.308245 0.451929 0.358313 0.32128 0.320363
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 天麻

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
133. 
patient tongue id: 05222105422188_1_4
label yaofang:
当归 党参 黄芪 白术 海螵蛸 浙贝母 杜仲 砂仁 鸡内金 北沙参 合欢皮 稻芽
0.437205 0.365365 0.47507 0.437616 0.345887 0.370458
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 北沙参

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
134. 
patient tongue id: 05262220138816_1_5
label yaofang:
甘草 枳壳 茯苓 党参 白术 山药 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 稻芽
0.994922 0.546243 0.613023 0.321649 0.700939 0.646223 0.679491 0.56238 0.55567 0.612918
predicted yaofang:
甘草 茯苓 党参 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.642857, error: 0.100000
135. 
patient tongue id: 03311626104365_1_2_3
label yaofang:
牡蛎 玉竹 黄芪 白术 海螵蛸 乌梅 杜仲 附子 山茱萸 厚朴 砂仁 肉苁蓉 火麻仁 北沙参 猫爪草 冬凌草
0.341427 0.379838 0.305933 0.349858 0.312269 0.500605
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
136. 
patient tongue id: 05201450448481_4_6
label yaofang:
甘草 法半夏 茯苓 桃仁 蒲公英 党参 白术 黄连 熟附子 山药 干姜 厚朴 紫苏梗 威灵仙 川木瓜
0.985137 0.335435 0.493222 0.574894 0.324868 0.303119 0.63866 0.567873 0.616918 0.499677 0.498486 0.561011
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
137. 
patient tongue id: 03311819282012_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香
0.366765 0.78793 0.381279 0.847417 0.413878 0.53316 0.383555 0.435071 0.381898 0.7867 0.831253 0.771695 0.826713 0.441495 0.890139 0.389222 0.308987 0.39659 0.517299 0.731972
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
138. 
patient tongue id: 06190941028380_1_6
label yaofang:
甘草 远志 党参 白术 熟附子 杜仲 天麻 桑寄生 鳖甲 淫羊藿 仙茅 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.962171 0.430594 0.516866 0.350591 0.457791 0.336864 0.438347 0.310116
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.875000, recall: 0.437500, error: 0.125000
139. 
patient tongue id: 02142344282102_2_7
label yaofang:
甘草 龙骨 延胡索 山药 山茱萸 地黄 天麻 白花蛇舌草 麦芽 忍冬藤 续断 蜈蚣 半枝莲 醋鳖甲 骨碎补 络石藤
0.967475 0.327688 0.481978 0.556082 0.371818 0.346414 0.306472 0.320098 0.611816 0.544324 0.595414 0.476559 0.487902 0.562057
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.312500, error: 0.642857
140. 
patient tongue id: 05232043293154_1_4_7
label yaofang:
甘草 陈皮 当归 茯苓 半夏 党参 枸杞子 白术 杜仲 牛膝 山药 厚朴 菟丝子 鸡内金 紫苏叶 骨碎补 红豆杉
0.685042 0.386731 0.423763 0.364326 0.385366
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.235294, error: 0.200000
141. 
patient tongue id: 05092118240753_3_4
label yaofang:
甘草 香附 法半夏 茯苓 党参 丹参 黄连 熟附子 红花 郁金 车前子 瓜蒌皮 莪术 鹿角霜 玉米须
0.950479 0.315786 0.477249 0.533655 0.371743 0.516584 0.452053 0.522471 0.375335 0.38317 0.415787
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
142. 
patient tongue id: 02182221458479_1_5_7
label yaofang:
甘草 薏苡仁 党参 黄连 山药 天麻 鳖甲 莪术 吴茱萸 蜈蚣 白花蛇舌 天山雪莲 红豆杉 瓦楞子
0.972447 0.32163 0.490547 0.559182 0.356549 0.315392 0.316552 0.613321 0.55252 0.607799 0.49145 0.487298 0.544272
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
143. 
patient tongue id: 01110250424161_6
label yaofang:
柴胡 白芍 当归 茯苓 葛根 防风 薄荷 白术 炙甘草
0.349857 0.362117 0.359285 0.324977 0.330649 0.303446 0.383787
predicted yaofang:
甘草 白芍 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.428571, recall: 0.333333, error: 0.571429
144. 
patient tongue id: 03221301248881_1_2_6
label yaofang:
甘草 玉竹 太子参 山药 天麻 天花粉 鳖甲 北沙参 白扁豆 蜈蚣 白花蛇舌 天山雪莲 合欢花 红豆杉 猫爪草
0.980453 0.302886 0.516262 0.56538 0.3154 0.304252 0.61704 0.57949 0.606195 0.506386 0.500564 0.526572
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
145. 
patient tongue id: 04071248000353_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.357511 0.874 0.346588 0.926242 0.395337 0.575161 0.388003 0.430608 0.357814 0.868679 0.899001 0.855049 0.90361 0.491672 0.943428 0.398386 0.371977 0.570277 0.816709
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
146. 
patient tongue id: 05182040268841_1
label yaofang:
甘草 川芎 陈皮 枳壳 茯苓 龙骨 牡蛎 远志 酸枣仁 竹茹 姜半夏
0.30615 0.439185 0.351379 0.311068 0.367718 0.663411 0.307428
predicted yaofang:
柴胡 白芍 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
147. 
patient tongue id: 03111717214324_6_7
label yaofang:
甘草 薏苡仁 党参 酸枣仁 牡丹皮 郁金 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.989535 0.505512 0.579257 0.309045 0.626991 0.577812 0.62734 0.497541 0.490959 0.541066
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
148. 
patient tongue id: 04061910090044_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.825703 0.39493 0.456991 0.376446 0.303317
predicted yaofang:
甘草 法半夏 茯苓 党参 天麻

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
149. 
patient tongue id: 02202310125396_1_2
label yaofang:
甘草 当归 茯苓 党参 黄芪 鸡血藤 白术 砂仁 赤石脂 鳖甲 北沙参 黄精 蜈蚣 白花蛇舌 天山雪莲
0.952484 0.318876 0.302137 0.486887 0.527581 0.340989 0.538384 0.469347 0.535409 0.39919 0.396957 0.417688
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
150. 
patient tongue id: 02201305074808_6_4
label yaofang:
甘草 柴胡 白芍 香附 枳壳 龙骨 柏子仁 海螵蛸 浙贝母 肉桂 豆蔻 制川乌 姜半夏 炙甘草 紫苏梗
0.343403 0.384375 0.362599 0.75747 0.310076
predicted yaofang:
白芍 干姜 紫菀 炙甘草 紫苏梗

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
151. 
patient tongue id: 05231925462449_1_2
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.36601 0.715516 0.399443 0.780521 0.395732 0.507652 0.384129 0.394232 0.338848 0.305002 0.717232 0.760955 0.692443 0.75766 0.468385 0.8185 0.385335 0.305011 0.37947 0.479244 0.665559
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
152. 
patient tongue id: 02212222303733_5
label yaofang:
麻黄 桂枝 甘草 茯苓 前胡 桔梗 防风 独活 金银花 浙贝母 桑白皮 荆芥穗 苦杏仁 贯众
0.974002 0.3152 0.30042 0.510288 0.559091 0.328494 0.583149 0.547723 0.577708 0.483403 0.471714 0.503849
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
153. 
patient tongue id: 01092337478772_4
label yaofang:
桂枝 白芍 大枣 茯苓 附子 苍术 炙甘草
0.362898 0.352693 0.369314 0.339544 0.373841 0.337476 0.356726
predicted yaofang:
甘草 白芍 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.285714, recall: 0.285714, error: 0.714286
154. 
patient tongue id: 04282308231656_2_6
label yaofang:
甘草 白芍 茯苓 太子参 酸枣仁 知母 地黄 天麻 白花蛇舌草 浮小麦 首乌藤 建曲 蜈蚣 半枝莲 醋鳖甲
0.929423 0.338247 0.465758 0.535074 0.366269 0.503178 0.443307 0.50771 0.377677 0.382387 0.40312
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
155. 
patient tongue id: 06082042297182_5
label yaofang:
甘草 连翘 薏苡仁 蒲公英 黄连 赤芍 浙贝母 牡丹皮 水蛭 僵蚕 莪术 北沙参 忍冬藤 蜂房 猫爪草 姜黄 山慈菇 冬凌草
0.534168 0.386937 0.305135 0.434499 0.477417 0.333136 0.303666
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.111111, error: 0.714286
156. 
patient tongue id: 01312135531440_1_6
label yaofang:
甘草 党参 生地黄 杜仲 砂仁 天麻 桑寄生 鳖甲 补骨脂 扁豆花 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.976864 0.316516 0.50468 0.573491 0.330705 0.309497 0.604416 0.544707 0.584352 0.469175 0.468198 0.506411
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
157. 
patient tongue id: 03282244217415_7_4
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 莪术 白扁豆 广藿香
0.444899 0.396311 0.365973 0.354563 0.372062
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.272727, error: 0.400000
158. 
patient tongue id: 06031649134171_1_2
label yaofang:
茯苓 防风 钩藤 荆芥穗 白芷 香薷 炙甘草 首乌藤 紫苏梗 广藿香 威灵仙 炒蔓荆子
0.343474 0.626316 0.37125 0.657817 0.345858 0.432287 0.34368 0.319903 0.306579 0.570732 0.672022 0.585422 0.653134 0.442644 0.769432 0.3138 0.314373 0.35564 0.540133
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.210526, recall: 0.333333, error: 0.789474
159. 
patient tongue id: 02182315244472_3_6
label yaofang:
甘草 川芎 陈皮 法半夏 茯苓 党参 枸杞子 熟附子 赤芍 干姜 天麻 全蝎 益智 女贞子 沙苑子
0.981891 0.304827 0.510949 0.573509 0.312115 0.616277 0.5655 0.595745 0.495208 0.489431 0.520481
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
160. 
patient tongue id: 01041835008275_1_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.423793 0.39348 0.409151 0.316222 0.304862 0.302217 0.402506
predicted yaofang:
甘草 法半夏 茯苓 黄芪 紫菀 北沙参 炙甘草

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
161. 
patient tongue id: 05192005215361_1_2_4
label yaofang:
甘草 川芎 茯苓 薏苡仁 党参 黄连 生地黄 赤芍 山药 桑寄生 补骨脂 白花蛇舌 土鳖虫 牛大力
0.971568 0.327669 0.490779 0.535338 0.314455 0.527008 0.468614 0.521564 0.392115 0.385274 0.400717
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
162. 
patient tongue id: 03242117063212_2_1
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 牛膝 茵陈 麦芽 赭石 浮小麦 龟甲
0.397235 0.518928 0.349792 0.329609 0.309682 0.332584 0.329721 0.490142 0.62994 0.318357
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.100000, recall: 0.076923, error: 0.900000
163. 
patient tongue id: 06191327578966_1
label yaofang:
甘草 茯苓 党参 白术 山药 干姜 天麻 鳖甲 麦芽 佛手 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.971126 0.307856 0.30805 0.515804 0.571393 0.324085 0.319174 0.302011 0.606015 0.553202 0.567704 0.476066 0.47733 0.496165
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.714286, recall: 0.714286, error: 0.285714
164. 
patient tongue id: 05242003317502_2_7
label yaofang:
甘草 茯苓 党参 玄参 浙贝母 牡丹皮 郁金 山药 山茱萸 地黄 天麻 白花蛇舌草 蜈蚣 醋鳖甲
0.971599 0.331804 0.487162 0.55398 0.31733 0.581654 0.517422 0.559168 0.447264 0.446144 0.475891
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
165. 
patient tongue id: 05032318024074_5_2
label yaofang:
甘草 法半夏 茯苓 桔梗 金银花 牛蒡子 浙贝母 杜仲 天麻 款冬花 扁豆花 决明子 麦芽 首乌藤
0.950047 0.304127 0.440496 0.516297 0.367969 0.468759 0.354177 0.456616 0.300034 0.346903
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
166. 
patient tongue id: 03141544521724_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.43976 0.324557 0.367423 0.424133 0.477041 0.379729 0.331842 0.338757 0.300003
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻 车前子

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
167. 
patient tongue id: 01041850181715_4
label yaofang:
柴胡 白芍 黄芩 当归 玄参 石膏 细辛 干姜 大黄 厚朴 滑石 法夏 北杏 制枳实
0.694436 0.394717 0.393731 0.404325 0.358275 0.303487
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
168. 
patient tongue id: 05191836060471_5
label yaofang:
当归 荆芥 牛蒡子 知母 石膏 苍术 通草 地黄 火麻仁 蝉蜕 苦参 蜂房
0.476742 0.373623 0.490764 0.375792 0.349238 0.317501 0.337702 0.472012
predicted yaofang:
甘草 柴胡 白芍 党参 白术 浙贝母 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
169. 
patient tongue id: 03231453046121_4
label yaofang:
法半夏 茯苓 前胡 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.369497 0.841742 0.365778 0.89134 0.416325 0.53612 0.375692 0.446103 0.386773 0.829651 0.872554 0.809467 0.862566 0.424156 0.93383 0.354151 0.365891 0.520223 0.768699
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 1.000000, error: 0.368421
170. 
patient tongue id: 03170925189826_1_4_7
label yaofang:
薏苡仁 桃仁 鸡血藤 赤芍 牡丹皮 苍术 泽泻 萹蓄 炙甘草 威灵仙 土茯苓
0.392213 0.389886 0.465406
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
171. 
patient tongue id: 02260835060493_5_7
label yaofang:
甘草 党参 黄柏 苍术 天麻 补骨脂 白花蛇舌草 麦芽 忍冬藤 续断 蜈蚣 半枝莲 醋鳖甲 三七粉
0.970073 0.346386 0.478332 0.538499 0.343702 0.590261 0.489406 0.556156 0.42399 0.427608 0.500851
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
172. 
patient tongue id: 06132011445371_5_2
label yaofang:
甘草 半夏 太子参 枸杞子 生地黄 赤芍 海螵蛸 牡丹皮 郁金 莪术 北沙参 赭石 蜈蚣 半枝莲 山慈菇 鸭脚艾
0.610284 0.402242 0.342781 0.353569 0.525522 0.559422 0.351311 0.487756 0.357293 0.301559 0.401428 0.338447
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
173. 
patient tongue id: 03282250569541_1
label yaofang:
甘草 黄芪 海螵蛸 肉桂 干姜 砂仁 附片 辛夷
0.300746 0.434572 0.544364 0.400215 0.320701 0.345288 0.32392 0.358909 0.324188 0.552841 0.626371 0.319773
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.250000, recall: 0.375000, error: 0.750000
174. 
patient tongue id: 01070845425061_1_4_7
label yaofang:
甘草 橘红 木香 党参 丹参 厚朴 莱菔子 鸡内金 草豆蔻 麦芽 六神曲 牡荆子
0.366252 0.754015 0.40188 0.805805 0.399224 0.512553 0.383934 0.409313 0.347994 0.73523 0.766986 0.712653 0.770419 0.434987 0.85074 0.404239 0.306841 0.386747 0.521053 0.68973
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
175. 
patient tongue id: 03312132522417_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 芦根 浙贝母 细辛 桑白皮 款冬花 紫菀 苦杏仁 炙麻黄
0.953704 0.350107 0.489279 0.546652 0.349866 0.300224 0.548273 0.499762 0.533478 0.437163 0.436853 0.459826
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
176. 
patient tongue id: 05092136143168_5_6
label yaofang:
甘草 白芍 茯苓 薏苡仁 党参 丹参 苍术 山药 泽泻 厚朴 砂仁 茵陈 扁豆花 虎杖 麦芽
0.981212 0.302748 0.499713 0.573516 0.333749 0.302461 0.604632 0.533725 0.57733 0.455923 0.459803 0.50053
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
177. 
patient tongue id: 01132331390212_4_3
label yaofang:
柴胡 黄芩 大枣 党参 神曲 大腹皮 山楂 鸡内金 麦芽 姜半夏 炙甘草
0.346048 0.336847 0.330125 0.407407
predicted yaofang:
甘草 茯苓 黄芪 炙甘草

------Score: precision: 0.250000, recall: 0.090909, error: 0.750000
178. 
patient tongue id: 02190504547687_6_2
label yaofang:
甘草 白芍 川芎 茯苓 龙骨 党参 何首乌 酸枣仁 牛膝 知母 天麻 桑寄生 地龙 首乌藤 合欢花 谷精子
0.973985 0.312105 0.51008 0.572519 0.340099 0.338031 0.308925 0.614979 0.556891 0.590774 0.485486 0.488847 0.52303
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.375000, error: 0.538462
179. 
patient tongue id: 03261602571237_4_3
label yaofang:
桂枝 陈皮 枳壳 半夏 芦根 薏苡仁 麦冬 石菖蒲 厚朴 瓜蒌皮 炙甘草 广藿香 土茯苓 芥子 青果
0.472378 0.35305 0.368228 0.422471 0.397773
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
180. 
patient tongue id: 03061820504062_1_4
label yaofang:
甘草 柴胡 白芍 党参 延胡索 川楝子 山药 天麻 茵陈 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.95488 0.316064 0.497942 0.534172 0.33086 0.568331 0.494558 0.532262 0.434712 0.425537 0.451181
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
181. 
patient tongue id: 06072254240635_1_4_7
label yaofang:
甘草 柴胡 薏苡仁 党参 赤芍 郁金 山药 天麻 菟丝子 益母草 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 红豆杉
0.937142 0.320612 0.406869 0.524003 0.338576 0.450728 0.305677 0.401143
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.312500, error: 0.375000
182. 
patient tongue id: 05022124494123_2_7_6
label yaofang:
甘草 白芍 陈皮 茯苓 党参 白术 延胡索 赤芍 山药 天麻 五灵脂 鳖甲 蜈蚣 天山雪莲 半枝莲
0.990121 0.300621 0.525609 0.589071 0.316109 0.324488 0.668942 0.612874 0.641441 0.53638 0.528369 0.579263
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
183. 
patient tongue id: 02161851439473_4
label yaofang:
白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.376645 0.372374 0.331156 0.395575 0.331245 0.57738
predicted yaofang:
法半夏 茯苓 黄芪 紫菀 北沙参 炙甘草

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
184. 
patient tongue id: 05290807051922_2_4
label yaofang:
甘草 法半夏 茯苓 桃仁 党参 五味子 山药 厚朴 款冬花 补骨脂 苦杏仁 紫苏梗 威灵仙
0.99 0.528916 0.589936 0.308269 0.313542 0.660031 0.604817 0.633822 0.523398 0.518553 0.560701
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
185. 
patient tongue id: 05222052079645_1_4
label yaofang:
甘草 陈皮 茯苓 党参 白术 五味子 厚朴 生半夏 僵蚕 诃子 枇杷叶 地龙 北沙参
0.82123 0.447808 0.445644 0.323405 0.44838 0.32118 0.386534
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
186. 
patient tongue id: 05140637361075_6_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 延胡索 川楝子 天麻 菟丝子 益母草 蜈蚣 合欢花 半枝莲 醋鳖甲
0.988041 0.503113 0.591573 0.338896 0.323429 0.634077 0.55763 0.614686 0.475778 0.487427 0.561252
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
187. 
patient tongue id: 02120811327690_4_1
label yaofang:
甘草 羌活 独活 薏苡仁 党参 白术 杜仲 牛膝 天麻 金樱子 桑螵蛸 粉葛 威灵仙 川木瓜 土茯苓
0.95671 0.321325 0.333467 0.50823 0.554498 0.33278 0.304033 0.564489 0.526225 0.542935 0.459069 0.451941 0.461038
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
188. 
patient tongue id: 03101838511953_1_2
label yaofang:
当归 黄芪 鸡血藤 白术 厚朴 砂仁 补骨脂 鸡内金 女贞子 骨碎补 稻芽
0.470233 0.340565 0.397139 0.327987 0.430867 0.510446 0.41655 0.326005 0.363378 0.369137 0.304723 0.352867 0.315231 0.343487 0.328614 0.319736
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.062500, recall: 0.090909, error: 0.937500
189. 
patient tongue id: 06132026496071_1_4_7
label yaofang:
桂枝 川芎 当归 龙眼肉 赤芍 附子 山药 山茱萸 芡实 莲子
0.648905 0.424414 0.40189 0.404832 0.481483 0.340586 0.301977 0.31973
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
190. 
patient tongue id: 05140957086338_4_6
label yaofang:
甘草 柴胡 当归 茯苓 黄芪 白术 酸枣仁 杜仲 桑寄生 桑螵蛸 益智 紫苏梗 广藿香
0.962847 0.304136 0.479268 0.541364 0.316002 0.542911 0.4512 0.510319 0.369014 0.364756 0.383306
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
191. 
patient tongue id: 01211235237934_2_1
label yaofang:
当归 茯苓 党参 鸡血藤 枸杞子 白术 黄柏 知母 炙甘草 续断 土鳖虫 狗脊 龟甲
0.332614 0.385203 0.369728 0.306641 0.406767
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
192. 
patient tongue id: 05090818132346_1_4_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.524968 0.301374 0.492336 0.315661 0.479368 0.501604 0.491571 0.44293 0.410016 0.354186 0.457935 0.381055 0.495026 0.416183 0.407389 0.435348 0.432695
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.294118, recall: 0.416667, error: 0.705882
193. 
patient tongue id: 04120719446605_5_7
label yaofang:
甘草 白芍 独活 党参 生地黄 延胡索 杜仲 细辛 桑寄生 忍冬藤 首乌藤 牛大力 千斤拔
0.989653 0.520092 0.602252 0.309405 0.32271 0.66774 0.592683 0.625728 0.501221 0.510327 0.552535
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
194. 
patient tongue id: 03032006079647_1_7_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子
0.358472 0.80899 0.356027 0.870894 0.38912 0.539122 0.372738 0.420934 0.351482 0.804728 0.848404 0.785778 0.852375 0.449609 0.906329 0.345064 0.369794 0.51589 0.749617
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
195. 
patient tongue id: 05182116326559_1_4
label yaofang:
桂枝 甘草 白芍 川芎 独活 牛膝 细辛 干姜 补骨脂 蜈蚣 姜黄 海桐皮 鹿衔草
0.442275 0.575105 0.434686 0.326791 0.304641 0.413154 0.390395 0.324022 0.639092 0.72838 0.354064
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 豆蔻 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
196. 
patient tongue id: 01202004249571_3_2_6
label yaofang:
半夏 龙骨 太子参 枸杞子 白术 海螵蛸 山药 砂仁 北沙参 桑枝 紫苏梗 土鳖虫 夏天无
0.484078 0.378865 0.438394 0.378411 0.315672 0.362371
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 北沙参

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
197. 
patient tongue id: 04201853124129_9
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.378307 0.887243 0.357142 0.931536 0.424007 0.588521 0.36996 0.457481 0.398032 0.881362 0.915399 0.861668 0.906966 0.447691 0.962574 0.384907 0.382749 0.559574 0.820571
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.923077, error: 0.368421
198. 
patient tongue id: 03240559184418_1
label yaofang:
桂枝 甘草 法半夏 大枣 茯苓 龙骨 牡蛎 黄芪 白术 泽泻 干姜 滑石 糯稻根 猪苓
0.617537 0.397879 0.357903
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.666667, recall: 0.142857, error: 0.333333
199. 
patient tongue id: 03311615410420_5
label yaofang:
荆芥 防风 金银花 连翘 党参 枇杷叶 北沙参 蝉蜕 辛夷 东风桔 咸竹蜂
0.35728 0.352927 0.328322 0.375286 0.513412
predicted yaofang:
白芍 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
200. 
patient tongue id: 03292133154570_1
label yaofang:
甘草 枳壳 茯苓 牡蛎 党参 太子参 酸枣仁 丹参 生地黄 竹茹 浙贝母 郁金 扁豆花 麦芽
0.993812 0.518158 0.604705 0.689298 0.620857 0.658769 0.539705 0.53461 0.590658
predicted yaofang:
甘草 茯苓 党参 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.214286, error: 0.666667
201. 
patient tongue id: 03020812029207_6
label yaofang:
甘草 柴胡 香附 枳壳 法半夏 茯苓 酸枣仁 青皮 郁金 扁豆花 王不留行 续断 天山雪莲 木棉花
0.986069 0.316377 0.474105 0.575577 0.318369 0.635395 0.537174 0.586924 0.448727 0.466264 0.536899
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
202. 
patient tongue id: 03020742579548_1_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 干姜 鸡内金
0.411368 0.308127 0.365421 0.492848 0.333885 0.318997
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.833333, recall: 0.416667, error: 0.166667
203. 
patient tongue id: 03022120000643_1_4_7
label yaofang:
薏苡仁 黄芪 枸杞子 白术 浙贝母 厚朴 砂仁 北沙参 首乌藤 蜈蚣 红豆杉 预知子
0.437565 0.306758 0.314815 0.374964 0.532121 0.325421 0.303637
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 厚朴

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
204. 
patient tongue id: 06072127345717_1_4
label yaofang:
甘草 枳壳 独活 党参 山茱萸 天麻 菟丝子 桑寄生 鳖甲 补骨脂 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.933362 0.355986 0.417692 0.511721 0.326474 0.499149 0.361853 0.454838 0.309967 0.346427
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.437500, error: 0.300000
205. 
patient tongue id: 06072116185055_4
label yaofang:
甘草 陈皮 薏苡仁 远志 党参 白术 牛膝 苍术 厚朴 佩兰 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.828356 0.398134 0.412617 0.488135 0.365303 0.393288 0.334408
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
206. 
patient tongue id: 03091856563127_1_6_2
label yaofang:
甘草 茯苓 葛根 党参 黄芪 黄连 石膏 苍术 白芷 蔓荆子 皂角刺 辛夷 炒苍耳子 合欢花
0.971593 0.346455 0.46003 0.522613 0.328522 0.551237 0.481569 0.543086 0.412193 0.411245 0.465791
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
207. 
patient tongue id: 03091906502111_1_2
label yaofang:
甘草 川芎 党参 黄芪 枸杞子 酸枣仁 石菖蒲 天麻 地龙 蒺藜 女贞子 粉葛 首乌藤
0.944534 0.397971 0.397023 0.516375 0.316356 0.497318 0.340757 0.435652 0.322534
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
208. 
patient tongue id: 03192240356696_6_4
label yaofang:
甘草 白芍 茯苓 党参 酸枣仁 玄参 柏子仁 黄连 生地黄 山茱萸 厚朴 火麻仁 麦芽 郁李仁 合欢花
0.898601 0.469062 0.488955 0.383713 0.402749 0.408981
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
209. 
patient tongue id: 02190547182585_2_7_6
label yaofang:
甘草 党参 酸枣仁 丹参 生地黄 延胡索 郁金 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲 红豆杉
0.87075 0.316438 0.452386 0.49928 0.373522 0.48546 0.34369 0.440115 0.328886
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.666667, recall: 0.375000, error: 0.333333
210. 
patient tongue id: 04102107280674_3
label yaofang:
川芎 陈皮 桃仁 太子参 黄芪 丹参 红花 水蛭 升麻 三七 决明子 益智
0.789971 0.394823 0.437281 0.427384 0.306519 0.319372
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
211. 
patient tongue id: 03020740302209_6_4
label yaofang:
甘草 法半夏 茯苓 桔梗 木香 连翘 党参 白术 浙贝母 山药 砂仁 莱菔子 麦芽 紫苏梗 广藿香 稻芽
0.938811 0.35335 0.418882 0.493458 0.340759 0.436207 0.329682 0.440785
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
212. 
patient tongue id: 03012255584283_7_4_6
label yaofang:
甘草 独活 薏苡仁 红花 杜仲 黄柏 苍术 山药 僵蚕 桑寄生 续断 威灵仙 乌梢蛇 牛大力 千斤拔
0.944323 0.486372 0.546947 0.360499 0.533132 0.439323 0.502658 0.351275 0.366724 0.385952
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.066667, error: 0.900000
213. 
patient tongue id: 05140653362992_2_6
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 柏子仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.970902 0.304858 0.306528 0.513565 0.555536 0.326502 0.306387 0.310039 0.59626 0.558461 0.581563 0.48581 0.48515 0.503278
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.714286, recall: 0.714286, error: 0.285714
214. 
patient tongue id: 04072012325713_1_2
label yaofang:
甘草 茯苓 橘红 牡蛎 麦冬 玉竹 党参 黄芪 白术 浙贝母 山药 生半夏 砂仁 全蝎 芡实 莲子 枇杷叶 北沙参 百合 猫爪草 合欢皮 冬凌草
0.414217 0.317415 0.34633 0.408869 0.447261 0.353544 0.309006
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴

------Score: precision: 0.714286, recall: 0.227273, error: 0.285714
215. 
patient tongue id: 05162146419364_2_5
label yaofang:
白芍 茯苓 生地黄 牡丹皮 黄柏 知母 山药 山茱萸 白茅根 小蓟 泽泻 车前子 白花蛇舌 鹿衔草
0.939988 0.491192 0.532417 0.370542 0.31698 0.306919 0.543727 0.461114 0.531785 0.391252 0.398829 0.425429
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
216. 
patient tongue id: 05140703045838_1_4
label yaofang:
甘草 白芍 陈皮 法半夏 茯苓 党参 山药 仙鹤草 茜草 天麻 赤石脂 鳖甲 蜈蚣 天山雪莲 半枝莲 红豆杉
0.949506 0.339808 0.322113 0.4908 0.528696 0.330428 0.522265 0.495926 0.51703 0.431471 0.423068 0.422944
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.625000, error: 0.166667
217. 
patient tongue id: 05252215319386_1_4_2
label yaofang:
法半夏 茯苓 葛根 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 人参叶
0.35981 0.900246 0.336577 0.943075 0.448466 0.595849 0.373866 0.465 0.41641 0.89997 0.934042 0.891664 0.918493 0.417888 0.972955 0.369008 0.381905 0.554789 0.841442
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.785714, error: 0.421053
218. 
patient tongue id: 06190147384190_3_4
label yaofang:
甘草 茯苓 党参 杜仲 肉桂 山茱萸 泽泻 干姜 桑寄生 淫羊藿 王不留行 仙茅 沙苑子 覆盆子 酒女贞子 墨旱莲 艾叶
0.990422 0.530906 0.593157 0.302999 0.305682 0.654025 0.603506 0.632001 0.519032 0.518177 0.552727
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.176471, error: 0.727273
219. 
patient tongue id: 02111328575441_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.526541 0.391488 0.386415 0.311908 0.561634 0.567584 0.324381 0.340935 0.516434 0.389964 0.36279 0.432992 0.393759
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
220. 
patient tongue id: 01312049250652_1_3
label yaofang:
茯苓 桃仁 太子参 白术 厚朴 白芷 肉苁蓉 火麻仁 北沙参 辛夷 紫苏叶 苍耳子 骨碎补 土鳖虫 狗脊
0.649138 0.356389 0.434433
predicted yaofang:
甘草 法半夏 茯苓

------Score: precision: 0.333333, recall: 0.066667, error: 0.666667
221. 
patient tongue id: 01052137548111_1_2
label yaofang:
甘草 川芎 党参 白术 生地黄 赤芍 天麻 鳖甲 忍冬藤 桑枝 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.98036 0.32087 0.481902 0.564648 0.338107 0.310718 0.625226 0.545885 0.600371 0.474949 0.480273 0.546998
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
222. 
patient tongue id: 04200207109391_6_4
label yaofang:
甘草 法半夏 茯苓 党参 白术 黄连 砂仁 天麻 鳖甲 麦芽 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.910042 0.469676 0.521515 0.411132 0.304817 0.310807 0.478015 0.35004 0.476041 0.303648 0.327911
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
223. 
patient tongue id: 04112044339466_6
label yaofang:
甘草 川芎 法半夏 茯苓 党参 白术 生地黄 牛膝 天麻 扁豆花 麦芽 益智 首乌藤
0.981242 0.300294 0.522756 0.577843 0.328901 0.317152 0.300973 0.630618 0.578674 0.606884 0.506785 0.501321 0.532103
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.461538, error: 0.538462
224. 
patient tongue id: 01172226295780_1_2_4
label yaofang:
甘草 法半夏 茯苓 桔梗 桃仁 党参 鸡血藤 浙贝母 山药 鳖甲 诃子 紫苏梗 白花蛇舌 天山雪莲 蜂房 岗梅根
0.789767 0.455666 0.463116 0.320635
predicted yaofang:
甘草 法半夏 茯苓 党参

------Score: precision: 1.000000, recall: 0.250000, error: 0.000000
225. 
patient tongue id: 01140803113088_4_6_1
label yaofang:
甘草 黄芩 法半夏 桔梗 浙贝母 天麻 天花粉 槐花 鳖甲 火麻仁 诃子 蜈蚣 白花蛇舌 蜂房 四季青
0.868987 0.388678 0.498999 0.334449 0.433892 0.343322
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
226. 
patient tongue id: 05252151193279_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.364315 0.668497 0.390884 0.721213 0.378615 0.462364 0.387961 0.371781 0.355475 0.661377 0.719148 0.663847 0.71612 0.471507 0.787657 0.344883 0.310165 0.364874 0.443439 0.622077
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
227. 
patient tongue id: 02191626355080_6_7
label yaofang:
桂枝 甘草 白芍 川芎 防风 桃仁 鸡血藤 酸枣仁 生地黄 红花 赤芍 牡丹皮 吴茱萸 麦芽 地龙
0.916931 0.449228 0.501492 0.34431 0.448024 0.303937 0.411139
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.142857, recall: 0.066667, error: 0.857143
228. 
patient tongue id: 01042331106423_1_6
label yaofang:
甘草 薏苡仁 丹参 山药 天麻 鳖甲 茵陈 莪术 虎杖 麦芽 蜈蚣 白花蛇舌 天山雪莲
0.995675 0.505584 0.614757 0.310331 0.333211 0.725968 0.628624 0.693891 0.53638 0.55282 0.660746
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
229. 
patient tongue id: 01101820477482_1_4
label yaofang:
川芎 法半夏 前胡 木香 太子参 郁金 北柴胡 白前 百部 豆蔻 北沙参 炙甘草 麸炒白术 甘松 麸炒枳壳 姜厚朴
0.367672 0.66408 0.391061 0.703708 0.40846 0.481406 0.372036 0.411252 0.374652 0.31065 0.639281 0.698866 0.635045 0.68401 0.402877 0.784016 0.36599 0.333624 0.37739 0.431307 0.600077
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.333333, recall: 0.437500, error: 0.666667
230. 
patient tongue id: 01182125572738_2_4_6
label yaofang:
甘草 枳壳 茯苓 连翘 党参 白术 浙贝母 郁金 山药 砂仁 鳖甲 火麻仁 鸡内金 苦杏仁 白花蛇舌 天山雪莲
0.902193 0.305821 0.453061 0.511736 0.383253 0.304416 0.501621 0.380209 0.478245 0.307491 0.316176 0.341504
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
231. 
patient tongue id: 06191321271345_1_7
label yaofang:
甘草 陈皮 茯苓 薏苡仁 桃仁 党参 红花 浙贝母 山药 天麻 鳖甲 白扁豆 丝瓜络 蜈蚣 白花蛇舌 天山雪莲
0.961609 0.308747 0.504454 0.556594 0.36022 0.330991 0.309287 0.583076 0.542401 0.570453 0.474624 0.474874 0.494386
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.562500, error: 0.307692
232. 
patient tongue id: 04131859043930_2_5
label yaofang:
甘草 柴胡 黄芩 麦冬 丹参 赤芍 牡丹皮 僵蚕 麦芽 百合 紫苏叶 黑枣 合欢皮 预知子
0.63069 0.403774 0.346372 0.418539 0.45883 0.318928
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
233. 
patient tongue id: 03011102469277_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.364466 0.335925 0.457494 0.334173 0.336245 0.304189 0.362661 0.507684
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
234. 
patient tongue id: 01172240231385_2_4_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 延胡索 赤芍 杜仲 天麻 五灵脂 桑寄生 补骨脂 桑枝 威灵仙 罗布麻
0.981708 0.508855 0.571807 0.334318 0.315286 0.633582 0.577949 0.622559 0.510894 0.5014 0.548734
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
235. 
patient tongue id: 03012334427796_6
label yaofang:
茯苓 党参 酸枣仁 栀子 牡丹皮 山药 山茱萸 地黄 泽泻 桑寄生 桑螵蛸 炙甘草 浮小麦 首乌藤 合欢花
0.971336 0.508573 0.565857 0.359864 0.317568 0.302994 0.593154 0.536418 0.595619 0.462321 0.468944 0.511787
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
236. 
patient tongue id: 03311828582555_4_1
label yaofang:
桂枝 白芍 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 紫菀 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.366396 0.763117 0.376339 0.833119 0.407156 0.526212 0.392994 0.41861 0.371552 0.304482 0.775894 0.81746 0.7491 0.804234 0.46749 0.877001 0.373893 0.322479 0.395317 0.514347 0.71552
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.523810, recall: 0.733333, error: 0.476190
237. 
patient tongue id: 06111034471979_2_1_6
label yaofang:
甘草 太子参 酸枣仁 生地黄 山药 天麻 鳖甲 北沙参 蜈蚣 白花蛇舌 天山雪莲 蜂房 岗梅根 四季青
0.984932 0.30152 0.526265 0.580516 0.31212 0.31353 0.636525 0.585204 0.612866 0.506082 0.49998 0.540605
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
238. 
patient tongue id: 03012203260906_1_2
label yaofang:
甘草 茯苓 党参 白术 生地黄 栀子 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.98707 0.520783 0.582277 0.325984 0.311223 0.301933 0.652272 0.58251 0.62948 0.503968 0.496632 0.542374
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
239. 
patient tongue id: 05032146365840_4_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.529413 0.305064 0.331322 0.463587 0.308597
predicted yaofang:
甘草 白芍 茯苓 党参 天麻

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
240. 
patient tongue id: 03111449141949_6
label yaofang:
甘草 柴胡 白芍 川芎 茯苓 葛根 黄芪 酸枣仁 赤芍 牛膝 天麻 全蝎 木瓜 浮小麦 宽筋藤
0.985306 0.312449 0.497901 0.580701 0.334961 0.305691 0.636446 0.567601 0.616443 0.4962 0.494644 0.557378
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
241. 
patient tongue id: 02251129516936_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.348104 0.679397 0.418827 0.728071 0.386196 0.471175 0.366386 0.396737 0.348806 0.667638 0.716193 0.636877 0.706204 0.428359 0.77851 0.365568 0.306156 0.376387 0.461948 0.632416
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
242. 
patient tongue id: 04282228485198_2_4
label yaofang:
甘草 茯苓 前胡 党参 浙贝母 鳖甲 款冬花 紫菀 诃子 枇杷叶 北沙参 苦杏仁 白花蛇舌 蜂房 四季青
0.986222 0.523762 0.581238 0.319691 0.309446 0.302091 0.634815 0.586639 0.616384 0.509214 0.503032 0.543529
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
243. 
patient tongue id: 04020808231942_5_2_6
label yaofang:
甘草 黄芩 法半夏 大枣 茯苓 薏苡仁 桃仁 葶苈子 细辛 桑白皮 厚朴 莱菔子 款冬花 苇茎 紫苏子
0.90394 0.347865 0.468641 0.513517 0.367975 0.468303 0.405611 0.46255 0.340871 0.338046 0.338327
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
244. 
patient tongue id: 03291335116635_6_1
label yaofang:
甘草 柴胡 白芍 川芎 黄芩 法半夏 茯苓 桔梗 党参 浙贝母 山药 荆芥穗 虎杖 建曲 贯众
0.975828 0.314131 0.492198 0.554165 0.323932 0.608163 0.54175 0.578996 0.475004 0.467999 0.501208
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
245. 
patient tongue id: 05270747509341_1_4_7
label yaofang:
枳壳 茯苓 桃仁 党参 黄芪 海螵蛸 牛膝 泽泻 车前子 厚朴 炙甘草 土茯苓 粉萆薢
0.445697 0.34253 0.356476 0.525087 0.358362 0.347463
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
246. 
patient tongue id: 01130644230738_6_4_1
label yaofang:
甘草 茯苓 木香 白术 黄连 山药 天麻 鳖甲 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.984034 0.494329 0.591262 0.327243 0.312139 0.305028 0.615809 0.525666 0.587192 0.427668 0.44823 0.491772
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
247. 
patient tongue id: 06031116549851_6
label yaofang:
甘草 川芎 茯苓 远志 党参 枸杞子 酸枣仁 生地黄 牡丹皮 牛膝 蔓荆子 女贞子 浮小麦 墨旱莲
0.993078 0.53846 0.60023 0.304496 0.671438 0.619067 0.651708 0.542683 0.529741 0.579005
predicted yaofang:
甘草 茯苓 党参 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
248. 
patient tongue id: 01110254011062_4_2_3
label yaofang:
当归 茯苓 党参 枸杞子 白术 生地黄 黄柏 牛膝 知母 炙甘草 续断 玉米须 狗脊 龟甲
0.422195 0.344677 0.327994 0.523744 0.391778 0.362502 0.322088
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
249. 
patient tongue id: 03081805229731_7
label yaofang:
当归 桃仁 党参 黄芪 白术 丹参 生地黄 猪苓 鳖甲 虎杖 白花蛇舌草 瓦楞子
0.413288 0.342722 0.310368 0.395209 0.325089
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
250. 
patient tongue id: 04020755337352_2_7_6
label yaofang:
甘草 白芍 茯苓 党参 酸枣仁 丹参 黄连 生地黄 山茱萸 益母草 北沙参 粉葛
0.977396 0.305129 0.51417 0.5689 0.335616 0.330886 0.30009 0.614317 0.5641 0.60296 0.494257 0.495465 0.539776
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.416667, error: 0.615385
251. 
patient tongue id: 02161844419121_1
label yaofang:
甘草 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 紫菀 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.331232 0.906794 0.317521 0.943465 0.421609 0.624834 0.338702 0.453791 0.379176 0.887989 0.927776 0.886671 0.919533 0.36204 0.974955 0.421979 0.378043 0.55794 0.84505
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.421053, recall: 0.571429, error: 0.578947
252. 
patient tongue id: 04142010222300_6_2
label yaofang:
甘草 龙骨 党参 枸杞子 生地黄 天麻 鳖甲 女贞子 粉葛 沙苑子 蜈蚣 白花蛇舌 天山雪莲 墨旱莲
0.957188 0.337087 0.317492 0.489575 0.543747 0.332677 0.563118 0.507706 0.543362 0.443962 0.436531 0.454955
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
253. 
patient tongue id: 05032229113666_2_6
label yaofang:
甘草 茯苓 党参 黄芪 白术 酸枣仁 天麻 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.965757 0.361997 0.456249 0.54799 0.343004 0.562905 0.461487 0.529681 0.393184 0.400936 0.459967
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
254. 
patient tongue id: 05130651155924_4_6
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 酸枣仁 丹参 生地黄 天麻 全蝎 鳖甲 浮小麦 首乌藤 白花蛇舌 红豆杉
0.952975 0.314252 0.477229 0.546331 0.359317 0.303697 0.554009 0.477923 0.52277 0.40303 0.414136 0.436304
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
255. 
patient tongue id: 02181634142968_1_7
label yaofang:
桂枝 甘草 川芎 茯苓 羌活 党参 鸡血藤 白术 生地黄 红花 天麻 益母草 粉葛 天山雪莲 乌梢蛇
0.964407 0.485986 0.519002 0.342113 0.550727 0.477749 0.553576 0.403924 0.404312 0.445665
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.400000, error: 0.400000
256. 
patient tongue id: 06190152201086_2_3
label yaofang:
甘草 茯苓 党参 黄连 熟附子 赤芍 熟地黄 牡丹皮 肉桂 山药 山茱萸 泽泻 粉葛
0.963117 0.505556 0.563724 0.591754 0.484905 0.493035 0.390871 0.401531 0.392314
predicted yaofang:
甘草 茯苓 党参 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
257. 
patient tongue id: 04201901250307_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 芡实 北沙参 炙甘草 炒紫苏子
0.359851 0.767016 0.388782 0.834582 0.385814 0.514479 0.374086 0.390805 0.333697 0.767736 0.814882 0.734977 0.810075 0.481577 0.867439 0.367292 0.369625 0.49837 0.709457
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
258. 
patient tongue id: 05272329338201_6_2_7
label yaofang:
甘草 枳壳 牡蛎 黄芪 白术 丹参 郁金 厚朴 火麻仁 柿蒂 鸡内金 苍耳子
0.646913 0.305018 0.500784 0.335352 0.304218 0.344934
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
259. 
patient tongue id: 01050659559265_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 枸杞子 白术 牛膝 山药 砂仁 天麻 决明子 蒺藜 沙苑子 木贼
0.979445 0.327581 0.485514 0.560226 0.34051 0.308099 0.303251 0.619361 0.553841 0.601707 0.482477 0.485223 0.549454
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.375000, error: 0.538462
260. 
patient tongue id: 04062003304008_5
label yaofang:
黄芩 防风 金银花 蒲公英 紫花地丁 牡丹皮 菊花 天花粉 蝉蜕 辛夷
0.375663 0.389568 0.381041 0.300476
predicted yaofang:
甘草 党参 黄芪 丹参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
261. 
patient tongue id: 06082039086320_5
label yaofang:
甘草 蒲公英 黄连 砂仁 北沙参 赭石 紫苏叶 蜈蚣 土鳖虫 红豆杉 预知子 冬凌草
0.42804 0.357727 0.458776 0.40104
predicted yaofang:
甘草 茯苓 黄芪 白术

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
262. 
patient tongue id: 05232112099092_1_7
label yaofang:
陈皮 茯苓 半夏 牛蒡子 党参 枸杞子 白术 海螵蛸 杜仲 牛膝 厚朴 僵蚕 莪术 鸡内金 紫苏子 紫苏叶 骨碎补 红豆杉
0.762556 0.397639 0.387748 0.323409 0.458063
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.166667, error: 0.400000
263. 
patient tongue id: 05091932579472_2_4
label yaofang:
茯苓 防风 麦冬 钩藤 荆芥穗 白芷 豆蔻 北沙参 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.367319 0.799643 0.375941 0.870599 0.39727 0.548036 0.384444 0.415022 0.348047 0.805781 0.838548 0.786123 0.843656 0.481972 0.893019 0.390618 0.384384 0.527116 0.75138
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.263158, recall: 0.357143, error: 0.736842
264. 
patient tongue id: 02161943417027_1_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 柏子仁 海螵蛸 肉桂 白芷 附片 辛夷 紫苏梗 瓦楞子
0.702753 0.389433 0.436354 0.324132 0.332318
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
265. 
patient tongue id: 04062009404521_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.434452 0.562383 0.425977 0.324657 0.309784 0.300973 0.388639 0.352307 0.30795 0.61059 0.689249 0.338548
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 豆蔻 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
266. 
patient tongue id: 05262157348249_1_2_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 芦根 牛蒡子 党参 黄连 熟附子 天花粉 鳖甲 白花蛇舌 蜂房 四季青 广升麻
0.960306 0.485446 0.521949 0.32986 0.516362 0.450747 0.5185 0.376877 0.377965 0.405199
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.312500, error: 0.500000
267. 
patient tongue id: 04182033523404_4_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 浮小麦 紫苏梗
0.412738 0.53043 0.380984 0.311656 0.308196 0.318622 0.386682 0.319652 0.567539 0.65657 0.310526
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.727273, recall: 0.727273, error: 0.272727
268. 
patient tongue id: 05161915383921_1
label yaofang:
茯苓 防风 太子参 黄芪 钩藤 白芷 北沙参 炙甘草 首乌藤 广藿香 威灵仙 麸炒白术 炒蔓荆子 棉萆薢
0.321988 0.575167 0.417376 0.591283 0.324199 0.360913 0.340393 0.524326 0.548149 0.496117 0.570291 0.451967 0.64096 0.454492
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.357143, recall: 0.357143, error: 0.642857
269. 
patient tongue id: 04202213572291_1_6
label yaofang:
甘草 茯苓 远志 党参 青蒿 天麻 地骨皮 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲 龟甲
0.945149 0.322305 0.466122 0.514666 0.350338 0.485614 0.396677 0.487737 0.324206 0.3395 0.375327
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
270. 
patient tongue id: 04200617324629_2_1_4
label yaofang:
甘草 桔梗 党参 红花 浙贝母 车前子 天麻 猪苓 鳖甲 诃子 鹿角霜 蜈蚣 木蝴蝶 天山雪莲 半枝莲
0.958918 0.34253 0.473149 0.544784 0.342822 0.573032 0.50607 0.554448 0.447967 0.449535 0.488732
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
271. 
patient tongue id: 03151931535160_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.339889 0.417891 0.399667 0.467875 0.425219 0.303928 0.356724 0.310092 0.407741 0.404585 0.378715 0.376458 0.358008 0.406506
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.785714, recall: 0.916667, error: 0.214286
272. 
patient tongue id: 02211900061224_6
label yaofang:
木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.319404 0.370993 0.488512 0.332224 0.320065 0.31145 0.416754 0.547991
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
273. 
patient tongue id: 04121333145860_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.363976 0.818455 0.382956 0.877986 0.405205 0.538426 0.375677 0.432633 0.357754 0.819739 0.858455 0.787333 0.847392 0.453563 0.912304 0.373985 0.37696 0.517227 0.750451
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
274. 
patient tongue id: 05261926540414_4
label yaofang:
薏苡仁 鸡血藤 赤芍 黄柏 泽泻 天麻 升麻 茵陈 蝉蜕 苦参 五倍子 白鲜皮 土茯苓 五指毛桃 灯盏细辛 羚羊骨
0.866812 0.45169 0.478379 0.37437 0.39066 0.412355
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.062500, error: 0.833333
275. 
patient tongue id: 03192248029764_5_6
label yaofang:
甘草 薏苡仁 酸枣仁 牡丹皮 杜仲 黄柏 厚朴 天麻 桑寄生 鳖甲 豆蔻 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.945492 0.472753 0.55089 0.337903 0.545466 0.371569 0.451893 0.305294 0.31853
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.375000, error: 0.333333
276. 
patient tongue id: 03020819058545_1_2
label yaofang:
甘草 木香 党参 太子参 山药 砂仁 麦芽 北沙参 白扁豆 女贞子 粉葛 建曲 墨旱莲 木棉花
0.9889 0.308335 0.483266 0.57416 0.337121 0.304054 0.645583 0.576836 0.632886 0.493385 0.506203 0.589853
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
277. 
patient tongue id: 02120807425567_6
label yaofang:
桂枝 甘草 柴胡 白芍 龙骨 防风 党参 黄芪 白术 五味子 黄连 山茱萸 干姜 补骨脂 建曲 川木瓜
0.995107 0.523445 0.595381 0.300255 0.694979 0.636827 0.679168 0.549158 0.543663 0.6182
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.187500, error: 0.700000
278. 
patient tongue id: 04202055410215_4
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 砂仁 升麻 益母草 白花蛇舌草 炙甘草 覆盆子 墨旱莲
0.3289 0.392038 0.518201 0.309457 0.323089 0.30308 0.44647 0.604009
predicted yaofang:
甘草 柴胡 白芍 香附 党参 干姜 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
279. 
patient tongue id: 06082012305238_1_2
label yaofang:
甘草 薏苡仁 枸杞子 白术 赤芍 海螵蛸 牡丹皮 杜仲 郁金 厚朴 莪术 蜈蚣 土鳖虫 预知子 荔枝核
0.6141 0.412944 0.356948 0.460524 0.484958 0.394239 0.3139 0.337012
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
280. 
patient tongue id: 04291500458045_1_2_6
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 山药 山茱萸 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.985522 0.308893 0.503063 0.566864 0.3416 0.313061 0.301285 0.637871 0.582414 0.631983 0.510213 0.513819 0.580343
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
281. 
patient tongue id: 04121904079039_7
label yaofang:
甘草 枳壳 黄芪 枸杞子 白术 赤芍 牡丹皮 杜仲 山茱萸 水蛭 厚朴 桑寄生 麦芽 地龙 续断
0.570111 0.362517 0.368921 0.470331 0.405104 0.382671 0.30656 0.3112 0.340266 0.390253
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 天麻

------Score: precision: 0.200000, recall: 0.133333, error: 0.800000
282. 
patient tongue id: 03021141467808_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.390024 0.334602 0.4379 0.344515 0.369724 0.311868 0.306988 0.44424
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
283. 
patient tongue id: 05191941044539_7_2
label yaofang:
甘草 白芍 川芎 龙骨 桃仁 生地黄 红花 赤芍 山药 山茱萸 补骨脂 浮小麦 首乌藤 川木瓜
0.961705 0.497064 0.527555 0.336758 0.55462 0.49685 0.554174 0.419014 0.419433 0.442262
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.071429, error: 0.900000
284. 
patient tongue id: 03271542283845_7
label yaofang:
桂枝 柴胡 白芍 黄芩 当归 茯苓 龙骨 黄芪 白术 黄连 熟地黄 胆南星 黄柏 白茅根 干姜 鸡内金 姜半夏 浮小麦 淡附片
0.781625 0.341383 0.391773 0.456644 0.356011 0.302635
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.500000, recall: 0.157895, error: 0.500000
285. 
patient tongue id: 03302010244226_5
label yaofang:
甘草 枳壳 薏苡仁 桃仁 蒲公英 赤芍 牡丹皮 厚朴 石韦 北沙参 蜈蚣 土鳖虫 蛇舌草 冬凌草 鸭脚艾
0.615033 0.358391 0.461058 0.300479 0.337208
predicted yaofang:
甘草 茯苓 党参 黄芪 天麻

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
286. 
patient tongue id: 04142232323334_1_4
label yaofang:
桂枝 甘草 茯苓 党参 黄芪 白术 熟附子 泽泻 天麻 鳖甲 败酱草 建曲 蜈蚣 天山雪莲 半枝莲
0.971729 0.320306 0.477195 0.560923 0.306381 0.56869 0.493185 0.529995 0.416595 0.409606 0.432544
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
287. 
patient tongue id: 06050802305263_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.534446 0.377762 0.378244 0.479457 0.433365 0.364679
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
288. 
patient tongue id: 03020740287195_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.573287 0.3502 0.307355 0.30123 0.317694
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
289. 
patient tongue id: 03242124433797_4
label yaofang:
甘草 牛蒡子 肉桂 干姜 砂仁 紫菀 附片 辛夷
0.396685 0.3445 0.453663 0.3022 0.371284 0.334591 0.34858 0.483472
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.125000, error: 0.875000
290. 
patient tongue id: 05182255463550_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 麸炒白术 木贼
0.359971 0.725453 0.381713 0.790185 0.411009 0.534591 0.382196 0.409958 0.368853 0.315817 0.721303 0.77245 0.719579 0.766151 0.440304 0.841042 0.41358 0.324373 0.403717 0.498111 0.687624
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.812500, error: 0.380952
291. 
patient tongue id: 05172126065300_1_7
label yaofang:
甘草 茯苓 党参 白术 红花 山药 地黄 天麻 磁石 白花蛇舌草 佛手 蜈蚣 合欢花 半枝莲 醋鳖甲
0.94561 0.385069 0.397418 0.510481 0.324414 0.464265 0.311336 0.425465
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.400000, error: 0.250000
292. 
patient tongue id: 02271856063865_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄
0.799104 0.3223 0.323373 0.472125 0.3145 0.467359 0.397584 0.306134 0.312104 0.404632 0.331588 0.419315
predicted yaofang:
甘草 白芍 法半夏 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
293. 
patient tongue id: 03021142565277_1_4_7
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 五味子 熟地黄 补骨脂 吴茱萸 草豆蔻 炙甘草 黑枣
0.368122 0.42114 0.413142 0.46765 0.415833 0.320083 0.374433 0.316482 0.416857 0.392133 0.360937 0.345538 0.333175 0.37601
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.071429, recall: 0.083333, error: 0.928571
294. 
patient tongue id: 03240623345822_5_1
label yaofang:
薏苡仁 桃仁 太子参 黄芪 白术 浙贝母 杜仲 生半夏 砂仁 芡实 土鳖虫 合欢皮 山慈菇 蛇舌草 鲜龙葵果
0.599999 0.398047 0.353399 0.521166 0.517329 0.43167 0.324649 0.374509
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
295. 
patient tongue id: 03231132255868_5_7
label yaofang:
甘草 黄芩 防风 金银花 黄芪 白术 五味子 生地黄 浙贝母 牡丹皮 茜草 荆芥穗 紫苏梗 贯众
0.949426 0.352394 0.415214 0.515864 0.341986 0.477247 0.335595 0.434136 0.314789
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.222222, recall: 0.142857, error: 0.777778
296. 
patient tongue id: 04192248048897_4_7
label yaofang:
甘草 白芍 党参 白术 生地黄 红花 延胡索 杜仲 细辛 桑寄生 补骨脂 浮小麦 威灵仙
0.953064 0.336308 0.483938 0.53495 0.334158 0.508499 0.443022 0.499001 0.376714 0.372592 0.391872
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
297. 
patient tongue id: 01122343534689_6_5
label yaofang:
桂枝 甘草 柴胡 白芍 茯苓 桃仁 白术 栀子 牡丹皮 郁金 地黄 菟丝子 益母草 麦芽
0.982857 0.326946 0.520992 0.555868 0.6231 0.571679 0.60094 0.502345 0.488003 0.515684
predicted yaofang:
甘草 法半夏 茯苓 党参 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
298. 
patient tongue id: 03142053002413_6
label yaofang:
陈皮 桔梗 海螵蛸 大腹皮 干姜 厚朴 砂仁 白芷 姜半夏 紫苏叶 广藿香
0.45622 0.401848 0.516311 0.331743 0.374874 0.343427 0.334705 0.301442 0.39253 0.491445
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.181818, error: 0.800000
299. 
patient tongue id: 05311933031883_4
label yaofang:
桂枝 陈皮 茯苓 牡蛎 神曲 山药 厚朴 佩兰 山楂 鸡内金 麦芽 炙甘草 浮小麦 广藿香 煅龙骨
0.622296 0.394697 0.39435 0.445483 0.419793 0.33025
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
300. 
patient tongue id: 05032111505126_4
label yaofang:
桂枝 甘草 白芍 香附 当归 防风 生地黄 荆芥穗 紫草 白花蛇舌草 蒺藜 制何首乌 徐长卿
0.435103 0.573174 0.405591 0.38183 0.366218 0.643754 0.734829 0.320838
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
301. 
patient tongue id: 02120825167029_1_4
label yaofang:
甘草 柴胡 白芍 陈皮 龙骨 防风 白术 天麻 糯稻根 白花蛇舌草 醋龟甲 蜈蚣 半枝莲 醋鳖甲
0.987654 0.31843 0.525683 0.584323 0.319807 0.312103 0.641018 0.585196 0.625311 0.515009 0.507127 0.566037
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
302. 
patient tongue id: 03312117577276_5
label yaofang:
甘草 法半夏 桔梗 金银花 连翘 芦根 牛蒡子 浙贝母 诃子 麦芽 苦杏仁 板蓝根 炙麻黄 四季青
0.981343 0.308114 0.480367 0.572738 0.327917 0.621993 0.545292 0.597575 0.468303 0.475723 0.531471
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
303. 
patient tongue id: 06031635553995_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.382067 0.890332 0.355659 0.932386 0.445915 0.600321 0.378861 0.471589 0.423339 0.885007 0.919225 0.874416 0.909127 0.423745 0.966618 0.400207 0.395593 0.568643 0.828064
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.687500, error: 0.421053
304. 
patient tongue id: 06031042369423_6_2
label yaofang:
甘草 茯苓 党参 鸡血藤 白术 山药 地黄 天麻 三七 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲
0.883866 0.338029 0.319808 0.46846 0.476106 0.333897 0.436004 0.352796 0.429303
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.666667, recall: 0.428571, error: 0.333333
305. 
patient tongue id: 05102009118590_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.369421 0.892436 0.342254 0.937301 0.437214 0.602217 0.371365 0.483429 0.409267 0.894869 0.929815 0.877898 0.915293 0.416185 0.970618 0.40422 0.30892 0.39278 0.568752 0.830113
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
306. 
patient tongue id: 05262210400938_5_7_1
label yaofang:
甘草 当归 金银花 紫花地丁 党参 黄芪 鸡血藤 白术 生地黄 红花 赤芍 牡丹皮 细辛 白芷 吴茱萸 麦芽 忍冬藤 白花蛇舌
0.844476 0.436688 0.512492 0.337475 0.45606 0.336022
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
307. 
patient tongue id: 01201715420540_6
label yaofang:
甘草 白芍 川芎 羌活 酸枣仁 赤芍 牛膝 细辛 天麻 全蝎 白芷
0.974527 0.307868 0.307572 0.510164 0.54737 0.586735 0.553753 0.579409 0.489868 0.479705 0.489096
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.272727, error: 0.727273
308. 
patient tongue id: 05251945253474_5
label yaofang:
甘草 柴胡 薏苡仁 桃仁 蒲公英 黄连 红花 赤芍 栀子 牡丹皮 郁金 麦芽 北沙参 百合 蜈蚣 合欢皮 预知子 稻芽
0.697841 0.3999 0.377172 0.457159 0.520395 0.395606
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.166667, recall: 0.055556, error: 0.833333
309. 
patient tongue id: 05262204569733_1_2_7
label yaofang:
甘草 太子参 黄芪 鸡血藤 枸杞子 白术 酸枣仁 生地黄 山药 天麻 地龙 女贞子 沙苑子 威灵仙 灯盏细辛
0.940031 0.502977 0.525782 0.367927 0.30182 0.313392 0.532402 0.488894 0.542552 0.429464 0.424503 0.455892
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
310. 
patient tongue id: 03221618540357_1_4
label yaofang:
甘草 薏苡仁 远志 党参 白术 牡丹皮 天麻 鳖甲 款冬花 补骨脂 莪术 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.984413 0.313989 0.496256 0.573232 0.307176 0.627202 0.553 0.600713 0.4775 0.472138 0.525967
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
311. 
patient tongue id: 02182144582851_4_6
label yaofang:
桂枝 甘草 陈皮 法半夏 茯苓 前胡 桔梗 党参 浙贝母 细辛 白前 苦杏仁 粉葛 炙麻黄 贯众
0.606072 0.474267 0.459454 0.375394 0.350073 0.320978 0.327444
predicted yaofang:
甘草 法半夏 茯苓 前胡 款冬花 紫菀 北沙参

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
312. 
patient tongue id: 06181840070430_1_2
label yaofang:
甘草 葛根 党参 黄连 赤芍 山药 山茱萸 天麻 白花蛇舌草 玉米须 蜈蚣 半枝莲 醋鳖甲 南杏仁
0.9923 0.518437 0.609929 0.323059 0.323008 0.681109 0.604203 0.657005 0.521895 0.521238 0.585721
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
313. 
patient tongue id: 06191154442697_2_6
label yaofang:
甘草 川芎 枳壳 法半夏 白术 酸枣仁 槟榔 杜仲 牛膝 砂仁 天麻 桑寄生 麦芽 合欢花
0.931897 0.349399 0.304574 0.466852 0.512973 0.329077 0.476575 0.408415 0.449382 0.333488 0.331674 0.334347
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
314. 
patient tongue id: 02190459031249_5_6
label yaofang:
甘草 防风 金银花 黄芪 白术 黄连 生地黄 红花 桑白皮 水牛角 荆芥穗 火麻仁 白鲜皮 地肤子 土茯苓 蛇蜕
0.634951 0.311406 0.425271 0.395042 0.343251
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
315. 
patient tongue id: 04241931404755_3
label yaofang:
大枣 当归 木香 茯神 远志 白术 酸枣仁 龙眼肉 熟地黄 山药 升麻 山萸肉 浮小麦 首乌藤 炙黄芪
0.74485 0.373378 0.416968 0.44936 0.391121 0.321472 0.315098
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.066667, error: 0.857143
316. 
patient tongue id: 01061607383470_6_4_7
label yaofang:
桂枝 甘草 党参 黄芪 何首乌 白术 生地黄 红花 赤芍 天麻 桑寄生 地龙 桑枝 骨碎补 土茯苓
0.932907 0.308699 0.46035 0.520381 0.349344 0.493571 0.402648 0.47123 0.322258 0.332862 0.351864
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
317. 
patient tongue id: 01190143040110_1_4_6
label yaofang:
甘草 枳壳 大枣 桔梗 葶苈子 党参 浙贝母 郁金 厚朴 鳖甲 莪术 诃子 白花蛇舌 天山雪莲 蜂房 红豆杉
0.938576 0.493266 0.307606 0.536551 0.383168 0.311978 0.304782 0.522011 0.437781 0.52341 0.350044 0.361109 0.389284
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
318. 
patient tongue id: 05260700431303_6_2
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 生地黄 知母 山药 女贞子 浮小麦 首乌藤 合欢花
0.968104 0.324013 0.456586 0.541562 0.351544 0.525395 0.441099 0.516693 0.364734 0.375833 0.427195
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
319. 
patient tongue id: 01041307169732_5
label yaofang:
桂枝 白芍 茯苓 桃仁 阿胶 海螵蛸 牡丹皮 茜草
0.321767 0.32467
predicted yaofang:
党参 车前子

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
320. 
patient tongue id: 04130632494196_2_7
label yaofang:
甘草 桃仁 党参 枸杞子 酸枣仁 丹参 生地黄 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991134 0.507986 0.594933 0.304015 0.67167 0.595169 0.635024 0.515766 0.513588 0.568028
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.571429, error: 0.200000
321. 
patient tongue id: 04291506135523_6_4_2
label yaofang:
甘草 茯苓 龙骨 远志 酸枣仁 知母 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.995801 0.501077 0.608001 0.310017 0.308956 0.708384 0.622392 0.683318 0.52769 0.540988 0.642543
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
322. 
patient tongue id: 03261702068428_3_2
label yaofang:
芦根 桃仁 麦冬 太子参 玄参 生地黄 乌药 决明子 珍珠母 百合 紫苏梗 合欢皮 青果 土牛膝
0.430062 0.324124 0.317606 0.34754 0.327867 0.387139 0.320186
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
323. 
patient tongue id: 02122118376482_2_6
label yaofang:
甘草 白芍 当归 枸杞子 白术 牛膝 山药 山茱萸 地黄 天麻 肉苁蓉 火麻仁 补骨脂 制何首乌
0.901759 0.318254 0.337639 0.482035 0.480503 0.385463 0.453667 0.38309 0.477511 0.328884 0.327317 0.353378
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
324. 
patient tongue id: 02190456571456_5_6
label yaofang:
甘草 柴胡 川芎 黄芩 桔梗 金银花 白术 浙贝母 白芷 皂角刺 辛夷 苍耳子 蜂房
0.957056 0.336279 0.481882 0.533977 0.347491 0.538559 0.481825 0.540758 0.419018 0.414328 0.450477
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
325. 
patient tongue id: 03291857372147_1
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.364961 0.319046 0.432009 0.335723 0.341148 0.303151 0.316917 0.458288
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
326. 
patient tongue id: 01192129410257_6_5_2
label yaofang:
甘草 枳壳 连翘 玉竹 太子参 山药 山茱萸 泽泻 茵陈 扁豆花 麦芽 北沙参 建曲 稻芽
0.700546 0.399544 0.450307 0.344874 0.388197 0.316053
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
327. 
patient tongue id: 05162033334007_1
label yaofang:
大枣 当归 茯苓 木香 牛蒡子 远志 党参 黄芪 白术 柏子仁 淫羊藿 仙茅 炙甘草
0.335404 0.454465 0.309827 0.301879 0.329549 0.393314 0.575611
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
328. 
patient tongue id: 05031849508342_1_3
label yaofang:
甘草 香附 茯苓 龙骨 牡蛎 何首乌 酸枣仁 熟地黄 山茱萸 磁石 菟丝子 珍珠母 浮小麦 黑枣 龟甲
0.43213 0.350154 0.307567 0.525959 0.505346 0.317593 0.455482 0.350999 0.300428 0.374655 0.322912
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
329. 
patient tongue id: 05190810194013_1_4_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.53014 0.341904 0.462198 0.324019 0.471379 0.447121 0.476097 0.409081 0.379059 0.380158 0.43069 0.374428 0.448705 0.437029 0.407712 0.408239 0.413395
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.294118, recall: 0.384615, error: 0.705882
330. 
patient tongue id: 06091952380161_1_4_7
label yaofang:
甘草 陈皮 茯苓 半夏 木香 党参 枸杞子 白术 杜仲 山药 厚朴 桑寄生 鸡内金 紫苏叶 广藿香
0.333796 0.378083 0.399039 0.337594 0.401668
predicted yaofang:
甘草 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
331. 
patient tongue id: 01211320313922_2_4
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 红花 牡丹皮 干姜 茜草 天花粉 旋覆花 炙甘草
0.404516 0.300029 0.372918 0.345511 0.316005
predicted yaofang:
甘草 白芍 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
332. 
patient tongue id: 03012047207357_6_2
label yaofang:
甘草 白芍 茯苓 桔梗 浙贝母 山茱萸 桑叶 荷叶 磁石 天花粉 白花蛇舌草 沙苑子 蜂房 醋鳖甲
0.939441 0.362007 0.468762 0.511652 0.341089 0.477947 0.41519 0.472953 0.352173 0.348077 0.367834
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
333. 
patient tongue id: 03221817596943_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.368419 0.850535 0.375788 0.903378 0.435659 0.554126 0.385675 0.444904 0.401849 0.847186 0.885273 0.829158 0.871265 0.43596 0.940232 0.371208 0.303467 0.387174 0.530015 0.784279
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
334. 
patient tongue id: 05252014335896_4_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 豆蔻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.434325 0.538387 0.418436 0.342824 0.329031 0.333525 0.40487 0.307577 0.358545 0.325628 0.589473 0.652855 0.345624
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 浙贝母 干姜 豆蔻 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
335. 
patient tongue id: 04101851509337_4
label yaofang:
甘草 法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.359402 0.952904 0.301431 0.978349 0.464536 0.656033 0.366641 0.514241 0.440925 0.953501 0.97319 0.944704 0.965523 0.398836 0.992464 0.399463 0.383447 0.615866 0.90191
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.642857, error: 0.526316
336. 
patient tongue id: 04020813015921_1_5_6
label yaofang:
甘草 法半夏 桃仁 生地黄 浙贝母 鳖甲 淡竹叶 瓜蒌子 蜈蚣 白花蛇舌 蜂房 四季青 川木通 红豆杉
0.995771 0.551531 0.627368 0.326983 0.711586 0.648589 0.686161 0.560742 0.557548 0.612941
predicted yaofang:
甘草 茯苓 党参 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
337. 
patient tongue id: 05092108072209_2_6
label yaofang:
桂枝 当归 枸杞子 熟地黄 杜仲 山药 山茱萸 菟丝子 制川乌 鹿角霜 覆盆子
0.63182 0.345725 0.393181 0.43087 0.332059
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
338. 
patient tongue id: 03240711434948_3_7
label yaofang:
茯苓 黄芪 白术 五味子 熟地黄 牡丹皮 杜仲 山药 山茱萸 石菖蒲 泽泻 砂仁 磁石
0.49485 0.37858 0.320327 0.51315 0.49645 0.42523 0.323057 0.372863
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
339. 
patient tongue id: 06062300403636_2_6
label yaofang:
甘草 茯苓 木香 龙骨 党参 太子参 酸枣仁 丹参 黄连 生地黄 山茱萸 火麻仁 补骨脂 浮小麦
0.947727 0.345842 0.474369 0.542056 0.359705 0.531671 0.480349 0.525 0.417274 0.416083 0.444165
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
340. 
patient tongue id: 05162038421755_6_2
label yaofang:
柴胡 白芍 当归 茯苓 熟地黄 栀子 牡丹皮 山药 泽泻 鳖甲 白花蛇舌草 酒萸肉
0.415126 0.547666 0.372487 0.317582 0.30413 0.346606 0.556715 0.625768
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.166667, error: 0.750000
341. 
patient tongue id: 01041642503947_4
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 升麻 炙甘草 覆盆子 广金钱草 徐长卿
0.422172 0.304672 0.313715 0.462995 0.47327 0.333594 0.342249
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
342. 
patient tongue id: 02191249286384_5_6
label yaofang:
甘草 当归 连翘 薏苡仁 蒲公英 杜仲 牛膝 钩藤 莱菔子 天麻 白芷 桑寄生 决明子 麦芽 首乌藤
0.969893 0.490317 0.554706 0.344301 0.313951 0.580254 0.488291 0.545179 0.419251 0.421055 0.47328
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
343. 
patient tongue id: 03231058256534_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 桃仁 酸枣仁 黄连 竹茹 浙贝母 牡丹皮 天花粉 威灵仙 合欢花
0.872002 0.437572 0.452982 0.460039 0.362118 0.440828
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
344. 
patient tongue id: 06091945367639_5
label yaofang:
甘草 金银花 赤芍 茵陈 香薷 板蓝根 白扁豆 土茯苓 羚羊骨
0.4352 0.319235 0.319506 0.566446 0.506014 0.323741 0.437998 0.316911
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁

------Score: precision: 0.125000, recall: 0.111111, error: 0.875000
345. 
patient tongue id: 05092051534023_1_4_6
label yaofang:
麻黄 桂枝 白芍 羌活 牛蒡子 五味子 浙贝母 细辛 干姜 荷叶 射干 紫菀 炙甘草
0.409316 0.526357 0.367486 0.311466 0.309541 0.331596 0.380193 0.349535 0.544793 0.650506 0.329352
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
346. 
patient tongue id: 02171830080765_4_1
label yaofang:
法半夏 前胡 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.371854 0.829902 0.354118 0.886194 0.430714 0.579283 0.359786 0.419773 0.366939 0.816899 0.857719 0.79905 0.857828 0.399834 0.924528 0.426019 0.300248 0.400254 0.525295 0.758021
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
347. 
patient tongue id: 03242120296952_1
label yaofang:
甘草 柴胡 白芍 香附 当归 茯苓 薄荷 白术 胆南星 白芷 蔓荆子 麦芽 广藿香 山慈菇
0.370846 0.323859 0.434176 0.339774 0.355038 0.307078 0.307135 0.481843
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
348. 
patient tongue id: 05092243531358_1_2
label yaofang:
黄芪 白术 熟地黄 浙贝母 牡丹皮 山茱萸 厚朴 砂仁 肉苁蓉 北沙参 桑枝 合欢皮 冬凌草
0.467696 0.338005 0.518947 0.659813 0.649674 0.353583 0.370672 0.620956 0.436536 0.329298 0.414224 0.524935 0.500473 0.302341 0.301785
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 鸡内金 北沙参 合欢皮 预知子 蛇舌草

------Score: precision: 0.400000, recall: 0.461538, error: 0.600000
349. 
patient tongue id: 03061806377584_5
label yaofang:
甘草 川芎 黄芩 桔梗 黄芪 浙贝母 石膏 白芷 蔓荆子 皂角刺 辛夷 广藿香 苍耳子
0.983955 0.497704 0.562642 0.321781 0.617472 0.5406 0.599436 0.461753 0.46624 0.519274
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.076923, error: 0.900000
350. 
patient tongue id: 05221859575912_1_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒苍耳子
0.370256 0.768435 0.391439 0.824819 0.408188 0.519333 0.381883 0.441838 0.378017 0.310998 0.764817 0.811304 0.742946 0.795984 0.425928 0.875735 0.381532 0.319691 0.386823 0.505117 0.70859
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
351. 
patient tongue id: 02211411418224_1_7_6
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.481347 0.351826 0.36812 0.529086 0.386958 0.367247 0.309612
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
352. 
patient tongue id: 03081807286240_1_6
label yaofang:
桂枝 白芍 川芎 法半夏 大枣 龙骨 麦冬 党参 柏子仁 牡丹皮 吴茱萸
0.426258 0.331929 0.436206 0.364316 0.379885 0.430322
predicted yaofang:
甘草 柴胡 白芍 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
353. 
patient tongue id: 01041316071294_4
label yaofang:
甘草 桔梗 阿胶 生地黄 红花 冬瓜子 人参叶
0.574404 0.419099 0.308276 0.309216 0.351525 0.3959 0.336855 0.66604 0.358983 0.363064 0.871803
predicted yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草

------Score: precision: 0.090909, recall: 0.142857, error: 0.909091
354. 
patient tongue id: 01130632137243_6_5
label yaofang:
甘草 茯苓 独活 薏苡仁 党参 白术 赤芍 山药 桑寄生 鳖甲 茵陈 虎杖 土鳖虫 牛大力 千斤拔 木棉花
0.892313 0.319715 0.31664 0.469909 0.494739 0.355437 0.466697 0.382674 0.439155 0.316131 0.318037 0.318292
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
355. 
patient tongue id: 02212011270440_2
label yaofang:
甘草 白芍 当归 白术 栀子 牡丹皮 牛膝 山药 山茱萸 地黄 天麻 肉苁蓉 火麻仁 珍珠母 浮小麦 制何首乌
0.960851 0.313891 0.486539 0.530635 0.336305 0.551677 0.485808 0.5434 0.421212 0.417331 0.45211
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
356. 
patient tongue id: 03161713206874_2
label yaofang:
前胡 桔梗 麦冬 太子参 荷叶 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子
0.377113 0.753718 0.372817 0.812809 0.406284 0.535984 0.380986 0.41819 0.376897 0.303932 0.742115 0.802777 0.733532 0.789744 0.424908 0.878625 0.380442 0.314458 0.396565 0.49768 0.701566
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.476190, recall: 0.833333, error: 0.523810
357. 
patient tongue id: 02281659408475_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.396886 0.309263 0.311411 0.375177 0.438295 0.332547
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
358. 
patient tongue id: 03012139128664_6_1
label yaofang:
甘草 茯苓 远志 党参 白术 山药 砂仁 天麻 赤石脂 鳖甲 建曲 蜈蚣 天山雪莲 半枝莲
0.969152 0.508907 0.57297 0.335635 0.330926 0.322716 0.603733 0.536726 0.557748 0.463116 0.468397 0.48103
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
359. 
patient tongue id: 01140806328188_5_6
label yaofang:
甘草 川芎 茯苓 党参 白术 丹参 赤芍 杜仲 牛膝 天麻 蔓荆子 桑寄生 地龙 蒺藜
0.935903 0.435517 0.502951 0.374426 0.498842 0.346003 0.474226 0.335577
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
360. 
patient tongue id: 03192301282720_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 金银花 牛蒡子 浙贝母 细辛 桑白皮 瓜蒌皮 款冬花 苦杏仁
0.938808 0.354289 0.457289 0.533279 0.356352 0.528261 0.459661 0.512221 0.400923 0.392073 0.417797
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
361. 
patient tongue id: 02281828451555_4_2
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.360624 0.746464 0.386995 0.800688 0.403714 0.515844 0.38273 0.419416 0.365388 0.730352 0.771241 0.722127 0.769655 0.423431 0.845083 0.389269 0.300291 0.380596 0.497485 0.684722
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
362. 
patient tongue id: 03021435064873_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.583254 0.351048 0.360411 0.453009 0.502749 0.366354 0.306444 0.342485
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
363. 
patient tongue id: 01200558357134_1_2_6
label yaofang:
甘草 龙骨 牡蛎 酸枣仁 山茱萸 地黄 天麻 火麻仁 白花蛇舌草 建曲 蜈蚣 半枝莲 醋鳖甲 五加皮
0.885693 0.423822 0.380006 0.476519 0.340169 0.372246 0.342194
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
364. 
patient tongue id: 04251951159999_1_4
label yaofang:
陈皮 桔梗 太子参 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.41794 0.320386 0.316965 0.404211 0.341128
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
365. 
patient tongue id: 04272308485765_6
label yaofang:
麻黄 桂枝 甘草 白芍 牡蛎 薏苡仁 桃仁 丹参 红花 赤芍 熟地黄 益母草 夏枯草 鹿角霜 姜炭 芥子
0.34635 0.394833 0.503445 0.32923 0.354556 0.33638 0.32569 0.316599 0.446442 0.560151 0.313676
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
366. 
patient tongue id: 02281255405354_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.412808 0.31446 0.386311 0.42495 0.432851 0.388398 0.307804 0.344873 0.369367 0.355582 0.324808 0.321682 0.332573
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 决明子 制何首乌

------Score: precision: 0.307692, recall: 0.307692, error: 0.692308
367. 
patient tongue id: 02221311493797_1_4_7
label yaofang:
甘草 枳壳 木香 太子参 丹参 海螵蛸 厚朴 莱菔子 高良姜 鸡内金 草豆蔻 六神曲
0.490297 0.32706 0.450588 0.324232 0.463745 0.441814 0.464405 0.399005 0.384465 0.361067 0.432916 0.38631 0.430956 0.394749 0.384646 0.379752 0.399274
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.176471, recall: 0.250000, error: 0.823529
368. 
patient tongue id: 05162106199672_2_6_7
label yaofang:
甘草 丹参 杜仲 郁金 天麻 桑寄生 鳖甲 莪术 诃子 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.981981 0.509575 0.590755 0.344976 0.320212 0.633825 0.554249 0.605 0.474348 0.484233 0.530846
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
369. 
patient tongue id: 05181825178638_6
label yaofang:
麦冬 酸枣仁 丹参 钩藤 灯心草 三七 煅牡蛎 煅龙骨 红景天 毛冬青
0.640592 0.378442 0.383428 0.340845 0.440163
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
370. 
patient tongue id: 06070641418291_6_2
label yaofang:
甘草 酸枣仁 生地黄 牡丹皮 山药 山茱萸 仙鹤草 天麻 槐花 鳖甲 五倍子 蜈蚣 天山雪莲 半枝莲
0.976637 0.307225 0.509628 0.567864 0.341327 0.312669 0.610719 0.561556 0.596969 0.489213 0.485981 0.522374
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
371. 
patient tongue id: 04192245499946_2_4_6
label yaofang:
甘草 法半夏 茯苓 党参 酸枣仁 牡丹皮 杜仲 山茱萸 佩兰 桑寄生 补骨脂 鹿角霜 蜈蚣 土茯苓
0.914863 0.3659 0.446891 0.518708 0.342605 0.472849 0.374172 0.428806 0.309433 0.320147 0.321292
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
372. 
patient tongue id: 02161924210806_4_7
label yaofang:
桂枝 薏苡仁 黄芪 白术 杜仲 水蛭 砂仁 红豆杉 穿破石 山慈菇 石上柏
0.365404 0.433364 0.416632 0.426669
predicted yaofang:
茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.250000, recall: 0.090909, error: 0.750000
373. 
patient tongue id: 03141951083772_3
label yaofang:
茯苓 前胡 桔梗 防风 薄荷 钩藤 荆芥穗 白芷 香薷 百部 炙甘草 首乌藤 广藿香 威灵仙
0.312862 0.611356 0.341806 0.572832 0.329997 0.399153 0.316472 0.328255 0.342477 0.476233 0.672254 0.528868 0.573432 0.339555 0.821131 0.305815 0.454641
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.411765, recall: 0.500000, error: 0.588235
374. 
patient tongue id: 06130818199397_1_2
label yaofang:
川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.468181 0.334272 0.33264 0.404988 0.334072
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
375. 
patient tongue id: 02181621581257_5_1_6
label yaofang:
甘草 香附 法半夏 茯苓 党参 白术 山药 薤白 厚朴 砂仁 瓜蒌皮 柿蒂 麦芽 佛手 鱼古 瓦楞子
0.987988 0.507049 0.578675 0.306767 0.652494 0.565205 0.597408 0.474995 0.476292 0.521933
predicted yaofang:
甘草 茯苓 党参 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.187500, error: 0.700000
376. 
patient tongue id: 02151810038457_1_4_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 高良姜 鸡内金 草豆蔻 六神曲
0.434983 0.450327 0.303711 0.448678 0.499076 0.455922 0.362047 0.393473 0.332985 0.43983 0.370301 0.434145 0.315157 0.411449 0.400526 0.420061
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.250000, recall: 0.333333, error: 0.750000
377. 
patient tongue id: 01012053145200_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.435336 0.390516 0.356788 0.404964 0.301443
predicted yaofang:
甘草 茯苓 党参 黄芪 北沙参

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
378. 
patient tongue id: 01061854494532_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.33064 0.571632 0.395755 0.588982 0.354311 0.404316 0.339 0.324911 0.529958 0.59167 0.506311 0.576353 0.40706 0.681328 0.322269 0.320321 0.315445 0.464871
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 0.933333, error: 0.222222
379. 
patient tongue id: 03311619563889_6_7
label yaofang:
甘草 半夏 橘红 牡蛎 薏苡仁 党参 白术 浙贝母 鸡内金 浮小麦 黑枣 合欢皮 墨旱莲
0.501327 0.344477 0.38483 0.365789 0.392984
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
380. 
patient tongue id: 01051903009901_1_5
label yaofang:
法半夏 前胡 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.366711 0.857211 0.346341 0.90632 0.435356 0.589675 0.370059 0.453796 0.405049 0.301774 0.841815 0.885106 0.842992 0.878692 0.384171 0.947757 0.425848 0.401013 0.544329 0.79343
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
381. 
patient tongue id: 05221927067473_4_6
label yaofang:
甘草 白芍 川芎 羌活 独活 牛膝 细辛 干姜 白芷 蜈蚣 姜黄 海桐皮 鹿衔草
0.446823 0.566259 0.422043 0.314964 0.312015 0.304906 0.379703 0.370782 0.311429 0.627208 0.681512 0.31835
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 豆蔻 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
382. 
patient tongue id: 02211954346969_1_2
label yaofang:
甘草 白芍 茯苓 党参 枸杞子 白术 生地黄 牡丹皮 牛膝 山药 山茱萸 白茅根 菟丝子 益母草 麦芽
0.921327 0.453548 0.53687 0.35325 0.317441 0.55751 0.427271 0.495648 0.356036 0.376098 0.41458
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
383. 
patient tongue id: 04122149059520_1_4
label yaofang:
甘草 白芍 赤芍 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜 宽筋藤 田七末
0.975637 0.482948 0.565874 0.376673 0.318368 0.607362 0.53624 0.606775 0.461603 0.475687 0.544297
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
384. 
patient tongue id: 05252221545381_1
label yaofang:
川芎 当归 茯苓 防风 党参 太子参 黄芪 枸杞子 熟地黄 白芷 炙甘草 续断 首乌藤 麸炒白术 盐菟丝子 酒女贞子
0.364131 0.794333 0.389973 0.845386 0.401953 0.508069 0.383642 0.433642 0.372219 0.780806 0.822308 0.758147 0.816999 0.435759 0.882239 0.365807 0.369592 0.506879 0.721475
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.210526, recall: 0.250000, error: 0.789474
385. 
patient tongue id: 04020819469960_1_4_6
label yaofang:
甘草 茯苓 薏苡仁 党参 郁金 仙鹤草 茜草 天麻 赤石脂 鳖甲 蜈蚣 半枝莲 艾叶
0.971726 0.31655 0.508485 0.563578 0.346351 0.318496 0.305154 0.597318 0.548581 0.579188 0.479714 0.475981 0.512692
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.538462, error: 0.461538
386. 
patient tongue id: 05040340157053_2_5
label yaofang:
甘草 茯苓 金银花 麦冬 党参 玄参 生地黄 白茅根 水牛角 白花蛇舌草 白扁豆 白鲜皮 女贞子 建曲 天山雪莲
0.348693 0.304676 0.318377 0.410452 0.374795 0.309152 0.351607
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
387. 
patient tongue id: 06191153252984_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 远志 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.906653 0.349283 0.465158 0.527196 0.357705 0.505991 0.438659 0.477563 0.378414 0.387542 0.403207
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.733333, error: 0.000000
388. 
patient tongue id: 03152024532951_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.47761 0.342795 0.378633 0.576841 0.364868 0.324964 0.393445 0.307198 0.33167
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 厚朴 鸡内金 北沙参

------Score: precision: 0.111111, recall: 0.083333, error: 0.888889
389. 
patient tongue id: 05260645141054_2_6
label yaofang:
甘草 枳壳 白术 玄参 生地黄 牛膝 天麻 肉苁蓉 鳖甲 火麻仁 补骨脂 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.998177 0.520482 0.631896 0.746986 0.650381 0.719532 0.551237 0.56043 0.671542
predicted yaofang:
甘草 茯苓 党参 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.777778, recall: 0.437500, error: 0.222222
390. 
patient tongue id: 01041810433628_3
label yaofang:
法半夏 茯苓 前胡 防风 荆芥穗 款冬花 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子 紫苑
0.361512 0.75439 0.375636 0.820667 0.388392 0.517381 0.385152 0.421644 0.356425 0.750586 0.800743 0.741965 0.802651 0.466135 0.852658 0.386764 0.373579 0.509116 0.716949
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.714286, error: 0.473684
391. 
patient tongue id: 05162129531434_1_4
label yaofang:
甘草 川芎 茯苓 党参 黄芪 白术 赤芍 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤
0.955917 0.333777 0.479559 0.554919 0.326022 0.305425 0.585609 0.498913 0.537879 0.436533 0.433432 0.464784
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
392. 
patient tongue id: 02211948551441_1
label yaofang:
甘草 太子参 白术 黄连 山药 白茅根 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 合欢花 红豆杉
0.89574 0.449651 0.532832 0.309251 0.540536 0.377639
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
393. 
patient tongue id: 06031110344577_1_2_4
label yaofang:
甘草 防风 薏苡仁 党参 黄芪 白术 五味子 厚朴 砂仁 补骨脂 扁豆花 麦芽 紫苏梗 木棉花
0.979961 0.516928 0.571434 0.333295 0.31354 0.30069 0.618772 0.578477 0.605605 0.504564 0.499842 0.526355
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
394. 
patient tongue id: 03231032101261_1_2
label yaofang:
甘草 白芍 川芎 茯苓 党参 枸杞子 白术 丹参 山药 地黄 菟丝子 浮小麦 合欢花
0.991462 0.518859 0.592023 0.302431 0.669294 0.602068 0.649564 0.520412 0.519962 0.568508
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
395. 
patient tongue id: 01202010470170_7_5
label yaofang:
桃仁 黄芪 白术 赤芍 浙贝母 杜仲 厚朴 砂仁 莪术 北沙参 土鳖虫 红豆杉 合欢皮 蛇舌草
0.527294 0.383405 0.302314 0.50156 0.518772 0.418672 0.320473 0.388338
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
396. 
patient tongue id: 04121310514640_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.333472 0.636418 0.36063 0.659186 0.353577 0.424092 0.337029 0.332464 0.324583 0.569737 0.679237 0.595282 0.648786 0.408074 0.785567 0.319276 0.341355 0.542388
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
397. 
patient tongue id: 03111508488463_2_1
label yaofang:
甘草 川芎 茯苓 麦冬 太子参 白术 五味子 牛膝 郁金 山药 补骨脂 莪术 浮小麦
0.981472 0.315595 0.519651 0.573463 0.336047 0.315576 0.6224 0.577312 0.610153 0.512112 0.502945 0.546995
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
398. 
patient tongue id: 04130019502437_1_6
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.959252 0.46552 0.523754 0.372755 0.525474 0.467812 0.541264 0.394127 0.403644 0.462838
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.692308, error: 0.100000
399. 
patient tongue id: 04300934023356_4_6
label yaofang:
甘草 茯苓 羌活 独活 薏苡仁 党参 郁金 天麻 鳖甲 补骨脂 粉葛 威灵仙 蜈蚣 白花蛇舌 天山雪莲
0.931441 0.354619 0.455633 0.514512 0.33525 0.481878 0.373043 0.448019 0.306108 0.302932 0.319634
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
400. 
patient tongue id: 04210650146115_6
label yaofang:
甘草 龙骨 白术 酸枣仁 生地黄 知母 山茱萸 天麻 地骨皮 糯稻根 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.994603 0.500202 0.608196 0.310376 0.330421 0.718168 0.620449 0.676253 0.529179 0.546397 0.644274
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
401. 
patient tongue id: 04202053147183_6
label yaofang:
甘草 柴胡 川芎 香附 防风 桃仁 白术 柏子仁 赤芍 荆芥穗 郁李仁 芥子
0.464305 0.327493 0.439601 0.389565 0.346626 0.345052
predicted yaofang:
甘草 柴胡 白芍 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
402. 
patient tongue id: 04260652227646_4_7
label yaofang:
甘草 川芎 法半夏 桃仁 白术 红花 细辛 天麻 全蝎 僵蚕 麦芽 蒺藜
0.99473 0.542014 0.613946 0.308047 0.693179 0.631306 0.66294 0.540779 0.534535 0.574903
predicted yaofang:
甘草 茯苓 党参 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.166667, error: 0.800000
403. 
patient tongue id: 03242127541579_6_4
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 白花蛇舌草 白扁豆 广藿香
0.377652 0.512045 0.315191 0.320444 0.371301 0.529424 0.619752
predicted yaofang:
柴胡 白芍 香附 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
404. 
patient tongue id: 04111859059501_1_4
label yaofang:
法半夏 前胡 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.381392 0.829978 0.370359 0.890883 0.416958 0.556508 0.379156 0.411955 0.371111 0.82834 0.864241 0.819689 0.869383 0.457657 0.929003 0.38461 0.385645 0.543013 0.776885
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.785714, error: 0.421053
405. 
patient tongue id: 03152048311128_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.397068 0.313397 0.414976 0.320874 0.421647 0.452203 0.430479 0.338925 0.356274 0.340644 0.391559 0.369078 0.384552 0.316694 0.381475 0.349659 0.401978
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.294118, recall: 0.384615, error: 0.705882
406. 
patient tongue id: 06111024184873_2_6
label yaofang:
甘草 柴胡 白芍 延胡索 郁金 天麻 鳖甲 鸡内金 虎杖 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 广金钱草
0.982358 0.33063 0.509412 0.569643 0.31046 0.60472 0.551224 0.585658 0.477729 0.474319 0.513818
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
407. 
patient tongue id: 03222002337521_1_7
label yaofang:
甘草 薏苡仁 党参 鸡血藤 黄连 生地黄 砂仁 天麻 鳖甲 补骨脂 麦芽 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.985079 0.501258 0.560649 0.316167 0.616026 0.555082 0.599927 0.474497 0.47222 0.515151
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.437500, error: 0.300000
408. 
patient tongue id: 03151853495905_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.361185 0.909722 0.312255 0.949753 0.442634 0.641685 0.36076 0.458188 0.417862 0.898439 0.938872 0.907125 0.92737 0.384342 0.979932 0.418073 0.391272 0.566381 0.857849
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
409. 
patient tongue id: 01132141507251_6_1
label yaofang:
甘草 党参 白术 酸枣仁 丹参 大腹皮 砂仁 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.920917 0.322659 0.453296 0.532993 0.37952 0.314756 0.518685 0.418507 0.49469 0.3439 0.371648 0.410453
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
410. 
patient tongue id: 01211317407833_3_7
label yaofang:
白芍 远志 太子参 天麻 三七 鳖甲
0.411598 0.351932 0.396143 0.310144
predicted yaofang:
甘草 白芍 党参 白术

------Score: precision: 0.250000, recall: 0.166667, error: 0.750000
411. 
patient tongue id: 02201310078907_2
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 金樱子 麦芽 百合 紫苏叶
0.364109 0.516296 0.355597 0.451725 0.672203 0.305703
predicted yaofang:
柴胡 白芍 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
412. 
patient tongue id: 04271535117913_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.391729 0.359324 0.450148 0.316918
predicted yaofang:
甘草 茯苓 黄芪 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
413. 
patient tongue id: 04061943587990_2_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 麦芽 百合 紫苏叶
0.81412 0.367593 0.395867 0.44654 0.366493 0.335352 0.328579
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.111111, error: 0.857143
414. 
patient tongue id: 02181617184194_4_7_6
label yaofang:
黄芪 白术 砂仁 莪术 鸡内金 珍珠母 麦芽 橘核 桑椹 首乌藤 红豆杉 合欢皮 墨旱莲
0.73533 0.420788 0.374793 0.35482 0.413496
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
415. 
patient tongue id: 02120926570077_1_6_5
label yaofang:
甘草 白芍 法半夏 茯苓 木香 防风 党参 白术 黄连 郁金 山药 厚朴 白花蛇舌草 醋鳖甲 麸炒枳壳
0.98646 0.309834 0.545428 0.586466 0.306842 0.323765 0.303353 0.637695 0.596469 0.617132 0.524597 0.511392 0.537364
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
416. 
patient tongue id: 01211241234361_1_7
label yaofang:
桂枝 柴胡 黄芩 桔梗 牡蛎 藕节 干姜 天花粉 苦杏仁 炙甘草 蜜枇杷叶 人参叶
0.358076 0.328216 0.313598 0.351501 0.384708
predicted yaofang:
甘草 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
417. 
patient tongue id: 02122232354163_2_5
label yaofang:
甘草 当归 牛蒡子 太子参 黄芪 鸡血藤 丹参 黄连 生地黄 鳖甲 补骨脂 虎杖 白花蛇舌 蜂房 广升麻
0.977175 0.318168 0.500236 0.562933 0.323374 0.586529 0.538134 0.57205 0.468579 0.462148 0.49386
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
418. 
patient tongue id: 01250658303561_6_2
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 桑白皮 款冬花 紫菀 苇茎 苦杏仁 板蓝根
0.95487 0.337467 0.309431 0.4941 0.526253 0.34119 0.500666 0.441599 0.492573 0.368189 0.364245 0.383714
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
419. 
patient tongue id: 01062340548391_1_4_7
label yaofang:
黄芩 金银花 牛蒡子 蒲公英 麦冬 细辛 山楂 蔓荆子 鸡内金 干鱼腥草 苍耳子 炒六神曲
0.454474 0.518602 0.434772 0.409053 0.369574 0.349103 0.308241 0.309597 0.317618 0.374918
predicted yaofang:
甘草 法半夏 茯苓 前胡 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
420. 
patient tongue id: 03291319498197_1_6
label yaofang:
柴胡 白芍 香附 枳壳 龙骨 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 浮小麦 紫苏梗
0.447446 0.596052 0.431576 0.311199 0.412165 0.391212 0.302487 0.70092 0.773618 0.328853
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 干姜 豆蔻 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.900000, recall: 0.750000, error: 0.100000
421. 
patient tongue id: 05112036489343_1_4_5
label yaofang:
枳壳 太子参 黄芪 白术 赤芍 海螵蛸 牛膝 厚朴 砂仁 鸡内金 红豆杉 土茯苓 山慈菇 稻芽
0.405736 0.301012 0.529159 0.509153 0.320558 0.409228
predicted yaofang:
甘草 茯苓 黄芪 白术 海螵蛸 厚朴

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
422. 
patient tongue id: 04121904528489_3
label yaofang:
枳壳 薏苡仁 黄芪 白术 海螵蛸 杜仲 牛膝 附子 泽泻 厚朴 桑寄生 麦芽 续断 紫苏叶 骨碎补 土鳖虫 狗脊
0.720252 0.449052 0.433319 0.36938 0.436957 0.305897
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.333333, recall: 0.117647, error: 0.666667
423. 
patient tongue id: 03062137564464_1_6
label yaofang:
甘草 茯苓 党参 白术 山药 砂仁 天麻 赤石脂 鳖甲 麦芽 紫苏梗 蜈蚣 天山雪莲 半枝莲
0.989402 0.526729 0.5932 0.313771 0.323769 0.659294 0.598911 0.63334 0.524243 0.521402 0.565729
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
424. 
patient tongue id: 04150748083599_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.428367 0.624554 0.398787 0.491797 0.532528 0.613192 0.554741 0.513865 0.525087 0.620836 0.530141 0.675503 0.442516 0.626014 0.635055 0.66206 0.373519
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 制远志

------Score: precision: 0.705882, recall: 1.000000, error: 0.294118
425. 
patient tongue id: 04131552072948_1_4_7
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.490222 0.361454 0.408044 0.416485
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
426. 
patient tongue id: 03261716512378
label yaofang:
陈皮 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 莱菔子 鸡内金 莲子 炙甘草 紫苏梗
0.506359 0.362329 0.308724 0.39948 0.396607
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
427. 
patient tongue id: 04122152532197_4_6
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 酸枣仁 栀子 天麻 鳖甲 扁豆花 首乌藤 蜈蚣 天山雪莲 半枝莲 红豆杉
0.881503 0.436198 0.479667 0.405491 0.409916 0.404898
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
428. 
patient tongue id: 05161918251176_4
label yaofang:
陈皮 前胡 半夏 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.35319 0.87085 0.368834 0.914377 0.430553 0.538677 0.373092 0.469222 0.412224 0.856479 0.904618 0.851924 0.885313 0.399066 0.955275 0.373105 0.36186 0.516282 0.794003
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
429. 
patient tongue id: 03101848314575_4
label yaofang:
陈皮 桔梗 牛蒡子 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.381568 0.506526 0.337029 0.367225 0.308259 0.543382 0.606189
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
430. 
patient tongue id: 05131312072449_2_1_6
label yaofang:
甘草 木香 黄连 浙贝母 天麻 赤石脂 糯稻根 鳖甲 补骨脂 豆蔻 粉葛 建曲 蜈蚣 天山雪莲 半枝莲 龟甲
0.975523 0.313697 0.315374 0.516691 0.560989 0.318098 0.315074 0.607139 0.555839 0.581596 0.490582 0.485413 0.513655
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.375000, error: 0.538462
431. 
patient tongue id: 05032240225166_1_4_7
label yaofang:
甘草 茯苓 赤芍 杜仲 车前子 天麻 桑寄生 鳖甲 鹿角霜 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫
0.968529 0.362743 0.436723 0.542303 0.319242 0.558795 0.440009 0.515993 0.36681 0.383821 0.430186
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
432. 
patient tongue id: 01040251058404_7_6_5
label yaofang:
甘草 薏苡仁 党参 白术 延胡索 细辛 天麻 鳖甲 补骨脂 三棱 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.96001 0.487787 0.56286 0.359029 0.334291 0.603174 0.51379 0.56893 0.448846 0.454512 0.505435
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
433. 
patient tongue id: 05022100069039_6_7
label yaofang:
甘草 茯苓 龙骨 党参 酸枣仁 牡丹皮 黄柏 菟丝子 益母草 淫羊藿 仙茅 浮小麦 酒女贞子 墨旱莲
0.991838 0.541304 0.598739 0.30193 0.310856 0.671576 0.618298 0.655531 0.536329 0.532394 0.579911
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
434. 
patient tongue id: 03221324312196_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子 木贼 素馨花
0.357211 0.634973 0.387855 0.672673 0.383203 0.446513 0.35276 0.333869 0.332431 0.594294 0.670422 0.589379 0.648759 0.42705 0.769758 0.337059 0.300613 0.337736 0.342688 0.514579
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.750000, error: 0.400000
435. 
patient tongue id: 03062132360335_2
label yaofang:
甘草 白芍 川芎 香附 枳壳 黄芩 党参 白术 丹参 生地黄 菟丝子 桑寄生
0.89439 0.346186 0.410897 0.504666 0.346556 0.402083 0.370047
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
436. 
patient tongue id: 01012049183656_1_3
label yaofang:
甘草 白芍 桔梗 金银花 连翘 薄荷 蒲公英 麦冬 玄参 生地黄 浙贝母 牡丹皮 败酱草
0.603336 0.365655 0.471144 0.344987 0.307602 0.387547
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 天麻

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
437. 
patient tongue id: 01250653068283_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 薏苡仁 党参 黄芪 白术 丹参 砂仁 五灵脂 黄精 白花蛇舌 合欢花
0.863975 0.35478 0.464657 0.515102 0.397735 0.322555 0.303606 0.306598 0.319637 0.491438 0.396245 0.468814 0.339919 0.354606 0.384093
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.400000, error: 0.600000
438. 
patient tongue id: 04291504543648_7_2_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 桔梗 防风 玉竹 党参 浙贝母 款冬花 麦芽 北沙参 百合 大青叶
0.983062 0.308731 0.476892 0.562956 0.336426 0.621206 0.554036 0.609259 0.478297 0.487062 0.558772
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
439. 
patient tongue id: 03290232393996_2
label yaofang:
甘草 柴胡 白芍 茯苓 党参 山药 天麻 鳖甲 扁豆花 佛手 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.984394 0.318105 0.514103 0.570146 0.3116 0.623259 0.572326 0.597451 0.500436 0.488644 0.525592
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
440. 
patient tongue id: 03151915350566_4
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 半枝莲 土茵陈
0.396968 0.31786 0.37209 0.429501
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
441. 
patient tongue id: 01052214499946_4
label yaofang:
丹参 三七 西洋参
0.530077 0.389076 0.468513 0.451015 0.352781 0.338752
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
442. 
patient tongue id: 03291355470417_1_2
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 丹参 生地黄 山药 桑叶 泽泻 地骨皮 糯稻根 胡黄连 淫羊藿 仙茅 龟甲
0.984235 0.309898 0.542769 0.56835 0.300131 0.311524 0.633869 0.576989 0.599108 0.499147 0.4864 0.525048
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
443. 
patient tongue id: 03302130480924_1_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 党参 浙贝母 莱菔子 天麻 莪术 紫菀 白花蛇舌草 蜈蚣 醋鳖甲
0.955053 0.48346 0.541013 0.372436 0.542132 0.46698 0.549572 0.378233 0.398092 0.432177
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
444. 
patient tongue id: 04102041194722_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗 广金钱草
0.404365 0.531149 0.344225 0.309073 0.324428 0.315274 0.522216 0.642741
predicted yaofang:
柴胡 白芍 香附 党参 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
445. 
patient tongue id: 01202007072002_3_1
label yaofang:
桂枝 当归 黄芪 白术 黄连 知母 附子 山茱萸 厚朴 补骨脂 鸡内金 玉米须 稻芽 积雪草
0.496566 0.415134 0.423637 0.326895 0.404958
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
446. 
patient tongue id: 03231218459984_4
label yaofang:
陈皮 法半夏 茯苓 党参 黄芪 海螵蛸 郁金 北柴胡 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 甘松
0.394133 0.726553 0.388556 0.791629 0.4315 0.536031 0.393794 0.426506 0.397447 0.336219 0.730003 0.775043 0.72625 0.775198 0.426375 0.858981 0.418643 0.33533 0.412999 0.503995 0.689902
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.238095, recall: 0.357143, error: 0.761905
447. 
patient tongue id: 06091943578110_5
label yaofang:
甘草 金银花 麦冬 玉竹 桑叶 荷叶 天花粉 火麻仁 茵陈 香薷 扁豆花 鸡内金 夏枯草 麦芽 北沙参 广藿香
0.479844 0.366683 0.358243 0.449246 0.381717 0.329242
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.166667, recall: 0.062500, error: 0.833333
448. 
patient tongue id: 05242115541267_1_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 五味子 细辛 天麻 鳖甲 款冬花 苦杏仁 炙麻黄 紫苏梗 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.987233 0.525864 0.586796 0.326594 0.325942 0.648316 0.597659 0.631957 0.521542 0.519281 0.563461
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
449. 
patient tongue id: 05221906133315_1_2_4
label yaofang:
葛根 玉竹 太子参 黄芪 枸杞子 柏子仁 山药 芡实 莲子 北沙参 百合 制远志 人参叶 干石斛
0.322732 0.534406 0.418995 0.529984 0.308748 0.34957 0.336263 0.32497 0.463817 0.495482 0.450425 0.508199 0.455141 0.57271 0.395937
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.200000, recall: 0.214286, error: 0.800000
450. 
patient tongue id: 02020850314113_4_6
label yaofang:
甘草 桔梗 白术 浙贝母 牛膝 天麻 桑寄生 鳖甲 款冬花 紫菀 苦杏仁 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.992296 0.306241 0.506275 0.589298 0.316999 0.313114 0.675662 0.599081 0.651948 0.519824 0.526651 0.603662
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
451. 
patient tongue id: 04102112264740_5
label yaofang:
甘草 桔梗 连翘 薄荷 芦根 牛蒡子 浙贝母 桑叶 菊花 射干 百部 苦杏仁 木蝴蝶 青果
0.88841 0.33667 0.464619 0.337885 0.318575
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
452. 
patient tongue id: 05201507280681_2_6_1
label yaofang:
甘草 枳壳 橘红 玉竹 太子参 砂仁 天麻 鳖甲 火麻仁 茵陈 苦杏仁 蜈蚣 白花蛇舌 天山雪莲
0.800393 0.337316 0.309946 0.477475 0.30943 0.475634 0.392025 0.30055 0.30759 0.407057 0.332081 0.418541
predicted yaofang:
甘草 白芍 法半夏 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
453. 
patient tongue id: 03151831550977_4
label yaofang:
茯苓 前胡 半夏 防风 神曲 白芷 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 苍耳子
0.321822 0.518149 0.401565 0.454108 0.314629 0.358912 0.317808 0.367378 0.39689 0.460415 0.403322 0.433017 0.430013 0.591848 0.315086
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.400000, recall: 0.461538, error: 0.600000
454. 
patient tongue id: 02021011368988_6_2_1
label yaofang:
牡蛎 党参 白术 牛膝 厚朴 砂仁 地榆 槐花 地龙 北沙参 橘络 首乌藤 合欢皮 墨旱莲
0.498626 0.364002 0.340816 0.456188 0.463275 0.361117 0.303138
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
455. 
patient tongue id: 02182159201703_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 桃仁 远志 浙贝母 细辛 干姜 厚朴 款冬花 苦杏仁 炙麻黄
0.859717 0.422627 0.407225 0.461199 0.330559 0.357961 0.359217
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.133333, error: 0.714286
456. 
patient tongue id: 02221227455801_1_3
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.441834 0.543552 0.366525 0.462021 0.511416 0.52625 0.441194 0.440794 0.415677 0.527932 0.441871 0.538877 0.375212 0.510833 0.519501 0.533065
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.250000, recall: 0.333333, error: 0.750000
457. 
patient tongue id: 03142013409163_6
label yaofang:
白芍 香附 黄芩 法半夏 大枣 党参 延胡索 海螵蛸 北柴胡 麦芽 炙甘草 紫苏梗
0.357623 0.393149 0.515561 0.31997 0.346238 0.315496 0.452019 0.569266
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
458. 
patient tongue id: 01041827451344_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.308158 0.43117 0.405312 0.362071 0.402186 0.304457 0.307181 0.311633 0.330206 0.453131 0.424819
predicted yaofang:
甘草 法半夏 茯苓 前胡 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
459. 
patient tongue id: 02120748346639_4
label yaofang:
甘草 茯苓 半夏 橘红 薏苡仁 太子参 白术 苍术 鸡内金 枇杷叶 辛夷 稻芽
0.367142 0.305734 0.482746 0.410884 0.429865 0.304449 0.321317 0.323599 0.380422 0.397776 0.378864 0.391632 0.385738 0.484776 0.300528
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
460. 
patient tongue id: 06141841599626_5
label yaofang:
甘草 桃仁 红花 赤芍 牡丹皮 杜仲 僵蚕 肉苁蓉 莪术 北沙参 蜈蚣 合欢皮 蛇舌草 鸭脚艾
0.747644 0.428194 0.425212 0.371331 0.330496
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
461. 
patient tongue id: 04112002415134_6_1
label yaofang:
甘草 党参 丹参 生地黄 延胡索 天麻 鳖甲 补骨脂 佛手 浮小麦 威灵仙 蜈蚣 半枝莲 红豆杉
0.988312 0.311382 0.512915 0.583204 0.311142 0.30774 0.657306 0.594565 0.634417 0.522635 0.518914 0.570718
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
462. 
patient tongue id: 02232010093512_1_4
label yaofang:
陈皮 法半夏 茯苓 防风 佩兰 荆芥穗 白芷 豆蔻 炙甘草 紫苏梗 广藿香 麸炒白术 炒六神曲 醋香附
0.367831 0.67779 0.413261 0.712909 0.410328 0.467104 0.374196 0.39599 0.365973 0.650473 0.697381 0.637679 0.684737 0.405371 0.789904 0.345591 0.312578 0.369966 0.420929 0.593865
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.500000, error: 0.650000
463. 
patient tongue id: 05032145036954_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.567915 0.415684 0.334619 0.375192 0.336678 0.346838
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
464. 
patient tongue id: 04131944088081_5
label yaofang:
甘草 桔梗 金银花 连翘 薄荷 牛蒡子 紫花地丁 淡豆豉 淡竹叶 四季青
0.306804 0.322309 0.467287 0.330473
predicted yaofang:
甘草 党参 黄芪 丹参

------Score: precision: 0.250000, recall: 0.100000, error: 0.750000
465. 
patient tongue id: 05222018064920_4_2
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 龙脷叶
0.421609 0.546712 0.398436 0.318649 0.305856 0.414863 0.364557 0.616299 0.713802 0.33306
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.800000, recall: 0.666667, error: 0.200000
466. 
patient tongue id: 01041635054330_6_1
label yaofang:
龙骨 牛蒡子 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 蜈蚣 合欢皮
0.586629 0.319454 0.442086 0.327636 0.406195 0.337152 0.303784
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
467. 
patient tongue id: 05032230145191_5
label yaofang:
甘草 黄芩 法半夏 桔梗 金银花 芦根 牛蒡子 浙贝母 桑白皮 天花粉 淡竹叶 款冬花 枇杷叶 苦杏仁
0.997186 0.504003 0.626844 0.300038 0.321428 0.735828 0.633239 0.700958 0.537615 0.558014 0.663434
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
468. 
patient tongue id: 04221926339968_2_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.371673 0.814178 0.373291 0.879422 0.41922 0.558847 0.393545 0.430749 0.375311 0.821506 0.855327 0.801368 0.852383 0.480522 0.9087 0.398631 0.303387 0.396373 0.539951 0.758599
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
469. 
patient tongue id: 04120002442167_7_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.35024 0.363862 0.485197 0.303801 0.336878 0.321887 0.304833 0.301288 0.418577 0.550223
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.600000, recall: 0.545455, error: 0.400000
470. 
patient tongue id: 03101855254948_1
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 车前子 砂仁 升麻 炙甘草 浮小麦
0.308171 0.357522 0.489372 0.307429 0.326494 0.352846 0.309411 0.455383 0.588715 0.30379
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.400000, recall: 0.363636, error: 0.600000
471. 
patient tongue id: 04182019209745_1
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.392799 0.400447 0.31646 0.362513 0.300862 0.438381
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
472. 
patient tongue id: 02222059261226_1_2
label yaofang:
陈皮 枳壳 当归 黄芪 白术 海螵蛸 浙贝母 厚朴 生半夏 火麻仁 鸡内金 北沙参 山慈菇 蛇舌草
0.384763 0.349141 0.475113 0.314443 0.336999
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
473. 
patient tongue id: 03081819332794_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.367451 0.759148 0.369156 0.806539 0.408193 0.515563 0.376615 0.405615 0.388764 0.727252 0.77545 0.75223 0.787414 0.425499 0.859937 0.392752 0.375426 0.522846 0.707226
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
474. 
patient tongue id: 05102016137759_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.326682 0.52233 0.38507 0.524606 0.309302 0.377017 0.341376 0.378562 0.448859 0.510931 0.486519 0.523097 0.483989 0.627441 0.412549
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.800000, recall: 0.750000, error: 0.200000
475. 
patient tongue id: 01200501306087_2_6
label yaofang:
甘草 川芎 葛根 枸杞子 酸枣仁 地黄 天麻 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲 酒女贞子 墨旱莲
0.492491 0.354857 0.477414 0.383052 0.331848 0.319462 0.411058
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
476. 
patient tongue id: 05162033021700_2
label yaofang:
桂枝 大枣 龙骨 党参 黄连 生地黄 干姜 淫羊藿 火麻仁 炙甘草 覆盆子
0.350489 0.376835 0.481252 0.312915 0.375399 0.322426 0.305698 0.425171 0.494771
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.181818, error: 0.777778
477. 
patient tongue id: 03141229351042_1_4_7
label yaofang:
甘草 白芍 桔梗 金银花 连翘 薄荷 蒲公英 麦冬 玄参 生地黄 鸡内金
0.539572 0.344153 0.391197 0.471573 0.310494
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
478. 
patient tongue id: 03151920512881_6_7
label yaofang:
柴胡 白芍 香附 枳壳 木香 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.424994 0.38211 0.354699 0.344661 0.388122
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
479. 
patient tongue id: 02270751520827_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.518232 0.408359 0.346705
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
480. 
patient tongue id: 03081826358732_1_4
label yaofang:
生姜 茯苓 防风 钩藤 荆芥穗 白芷 香薷 炙甘草 辛夷 首乌藤 紫苏梗 广藿香 威灵仙 麸炒白术 炒六神曲
0.363623 0.795943 0.353018 0.846074 0.415761 0.517455 0.380199 0.42262 0.39702 0.773467 0.828432 0.787431 0.826576 0.433225 0.902953 0.360884 0.367777 0.520881 0.7372
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.263158, recall: 0.333333, error: 0.736842
481. 
patient tongue id: 04181933476013_1_2
label yaofang:
甘草 法半夏 麦冬 太子参 黄连 砂仁 天麻 鳖甲 麦芽 北沙参 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.982387 0.315497 0.300327 0.504642 0.564984 0.330152 0.304142 0.628621 0.580762 0.615312 0.51562 0.508172 0.555467
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
482. 
patient tongue id: 02122221457940_5
label yaofang:
甘草 茯苓 薏苡仁 党参 黄连 生地黄 赤芍 牛膝 石膏 山药 山茱萸 细辛 白芷 粉葛 广升麻
0.919749 0.300967 0.470156 0.516566 0.385197 0.303041 0.513408 0.428376 0.510813 0.36169 0.36376 0.392672
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
483. 
patient tongue id: 02191450327385_6_4_2
label yaofang:
川芎 薏苡仁 党参 鸡血藤 白术 红花 赤芍 山药 地黄 天麻 白花蛇舌草 蜈蚣 醋鳖甲 乌梢蛇
0.932644 0.356657 0.481974 0.540173 0.366414 0.328163 0.302015 0.311645 0.548551 0.500189 0.53537 0.44371 0.451815 0.479516
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.357143, error: 0.642857
484. 
patient tongue id: 02281931253064_4
label yaofang:
大枣 党参 海藻 苍术 泽泻 荷叶 决明子 紫苏叶 焦山楂 芥子
0.458248 0.566792 0.429714 0.317822 0.402876 0.343512 0.649583 0.720693 0.316497
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
485. 
patient tongue id: 06091950127204_3
label yaofang:
当归 枸杞子 熟地黄 杜仲 附子 肉桂 山药 山茱萸 菟丝子 巴戟天 芡实 鹿角霜 广藿香 沙苑子
0.663027 0.376325 0.362186 0.37726 0.496363 0.305884
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
486. 
patient tongue id: 04300931383558_1_6
label yaofang:
甘草 白芍 陈皮 木香 防风 党参 白术 黄连 天麻 鳖甲 粉葛 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.973153 0.487588 0.552764 0.323313 0.601687 0.507629 0.570515 0.423349 0.431645 0.476814
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.562500, error: 0.100000
487. 
patient tongue id: 04260637226146_4
label yaofang:
甘草 茯苓 远志 党参 浙贝母 蔓荆子 鳖甲 广藿香 苍耳子 白花蛇舌 蜂房 岗梅根 四季青 红豆杉
0.983856 0.306717 0.499775 0.573149 0.326849 0.322537 0.302452 0.656257 0.588734 0.631185 0.521021 0.515271 0.577744
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
488. 
patient tongue id: 04071908376449_4_1
label yaofang:
甘草 陈皮 茯苓 前胡 半夏 防风 黄芪 白术 白芷 白前 百部 紫苏梗 广藿香
0.383219 0.801458 0.398408 0.863156 0.410029 0.546109 0.395651 0.42559 0.371028 0.801164 0.833123 0.777137 0.834771 0.473147 0.892382 0.406948 0.306906 0.39078 0.538824 0.737893
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.615385, error: 0.600000
489. 
patient tongue id: 05262051059841_1_6
label yaofang:
甘草 黄芩 法半夏 前胡 桔梗 浙贝母 细辛 桑白皮 天麻 鳖甲 款冬花 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.984353 0.481866 0.561741 0.334761 0.304101 0.613614 0.531592 0.588929 0.448384 0.461337 0.535355
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
490. 
patient tongue id: 03221956354977_1_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 延胡索 天麻 五灵脂 鳖甲 蜈蚣 天山雪莲 合欢花 半枝莲 姜黄
0.962063 0.320702 0.498364 0.552107 0.345088 0.332737 0.30141 0.316521 0.6031 0.552096 0.582561 0.486593 0.487248 0.520706
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.714286, recall: 0.666667, error: 0.285714
491. 
patient tongue id: 03111731563864_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 连翘 芦根 牛蒡子 浙贝母 栀子 牡丹皮 决明子 化橘红
0.952371 0.323128 0.48563 0.54167 0.329676 0.553952 0.49004 0.526981 0.425786 0.423723 0.442228
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
492. 
patient tongue id: 02182156019208_5
label yaofang:
甘草 枳壳 黄芩 茯苓 木香 党参 白术 黄连 槟榔 山药 砂仁 扁豆花 粉葛 建曲
0.888656 0.327121 0.449476 0.471269 0.359684 0.381605 0.389318
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
493. 
patient tongue id: 01211213086112_5
label yaofang:
白芍 当归 麦冬 党参 白术 五味子 熟地黄 杜仲 肉苁蓉 巴戟天 补骨脂
0.42067 0.356503 0.747044
predicted yaofang:
白芍 干姜 炙甘草

------Score: precision: 0.333333, recall: 0.090909, error: 0.666667
494. 
patient tongue id: 03311823203178_4
label yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.368376 0.814555 0.373133 0.871418 0.420712 0.550137 0.387071 0.451657 0.401841 0.317592 0.818974 0.865894 0.799785 0.843502 0.428237 0.925876 0.392415 0.335443 0.404761 0.529401 0.755547
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
495. 
patient tongue id: 03311621410847_5_4_7
label yaofang:
牡蛎 薏苡仁 桃仁 黄芪 白术 浙贝母 杜仲 牛膝 厚朴 砂仁 北沙参 土鳖虫 红豆杉 山慈菇 蛇舌草
0.886857 0.466376 0.444813 0.440543 0.347528 0.445922
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.066667, error: 0.833333
496. 
patient tongue id: 04211341312324_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.373478 0.732877 0.389628 0.791159 0.411923 0.512592 0.371795 0.432825 0.38348 0.309942 0.72872 0.784897 0.71587 0.774275 0.409277 0.854875 0.389932 0.321838 0.394517 0.495629 0.68014
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.812500, error: 0.380952
497. 
patient tongue id: 05262053546021_2_6
label yaofang:
甘草 白术 酸枣仁 生地黄 杜仲 天麻 糯稻根 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 田七末
0.992455 0.302813 0.490659 0.587807 0.323974 0.658777 0.575031 0.643776 0.495091 0.499206 0.586102
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
498. 
patient tongue id: 02020820063498_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 款冬花 紫菀 白前 苇茎 苦杏仁 蜜麻黄 化橘红
0.992767 0.304842 0.505131 0.582906 0.305673 0.306001 0.675667 0.603925 0.653972 0.522912 0.524706 0.596721
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
499. 
patient tongue id: 03161305353494_2
label yaofang:
麻黄 陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 紫苏子 炙甘草
0.370055 0.818847 0.38923 0.871557 0.428682 0.522637 0.384839 0.435098 0.37722 0.816066 0.848678 0.792695 0.840982 0.42891 0.906753 0.368454 0.373054 0.523304 0.741203
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
------Average Score: average precision: 0.428510, average recall: 0.339921, error: 0.571490