5472/20571 [======>.......................] - ETA: 126s - loss: 0.17622017-11-12 18:49:36.498413: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:247] PoolAllocator: After 33960 get requests, put_count=33959 evicted_count=1000 eviction_rate=0.0294473 and unsatisfied allocation rate=0.0324205
2017-11-12 18:49:36.498483: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
20544/20571 [============================>.] - ETA: 0s - loss: 0.1182Epoch 00000: val_loss improved from inf to 0.08671, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 167s - loss: 0.1182 - val_loss: 0.0867
Epoch 2/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0879Epoch 00001: val_loss improved from 0.08671 to 0.08003, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 164s - loss: 0.0879 - val_loss: 0.0800
Epoch 3/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0845Epoch 00002: val_loss improved from 0.08003 to 0.07787, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 164s - loss: 0.0845 - val_loss: 0.0779
Epoch 4/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0827Epoch 00003: val_loss improved from 0.07787 to 0.07674, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 164s - loss: 0.0827 - val_loss: 0.0767
Epoch 5/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0813Epoch 00004: val_loss improved from 0.07674 to 0.07547, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 164s - loss: 0.0813 - val_loss: 0.0755
Epoch 6/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0803Epoch 00005: val_loss improved from 0.07547 to 0.07474, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 164s - loss: 0.0803 - val_loss: 0.0747
Epoch 7/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0796Epoch 00006: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0796 - val_loss: 0.0751
Epoch 8/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0787Epoch 00007: val_loss improved from 0.07474 to 0.07451, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0788 - val_loss: 0.0745
Epoch 9/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0782Epoch 00008: val_loss improved from 0.07451 to 0.07337, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0782 - val_loss: 0.0734
Epoch 10/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0778Epoch 00009: val_loss improved from 0.07337 to 0.07334, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0778 - val_loss: 0.0733
Epoch 11/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0773Epoch 00010: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0773 - val_loss: 0.0740
Epoch 12/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0766Epoch 00011: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0766 - val_loss: 0.0740
Epoch 13/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0764Epoch 00012: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0764 - val_loss: 0.0734
Epoch 14/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0759Epoch 00013: val_loss improved from 0.07334 to 0.07309, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0759 - val_loss: 0.0731
Epoch 15/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0755Epoch 00014: val_loss improved from 0.07309 to 0.07296, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0755 - val_loss: 0.0730
Epoch 16/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0751Epoch 00015: val_loss improved from 0.07296 to 0.07295, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0751 - val_loss: 0.0729
Epoch 17/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0746Epoch 00016: val_loss improved from 0.07295 to 0.07242, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 164s - loss: 0.0746 - val_loss: 0.0724
Epoch 18/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0744Epoch 00017: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0744 - val_loss: 0.0726
Epoch 19/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0740Epoch 00018: val_loss improved from 0.07242 to 0.07163, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0740 - val_loss: 0.0716
Epoch 20/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0736Epoch 00019: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0736 - val_loss: 0.0725
Epoch 21/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0733Epoch 00020: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0733 - val_loss: 0.0720
Epoch 22/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0730Epoch 00021: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0730 - val_loss: 0.0721
Epoch 23/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0726Epoch 00022: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0726 - val_loss: 0.0722
Epoch 24/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0723Epoch 00023: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0723 - val_loss: 0.0719
Epoch 25/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0720Epoch 00024: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0720 - val_loss: 0.0720
Epoch 26/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0716Epoch 00025: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0716 - val_loss: 0.0727
Epoch 27/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0715Epoch 00026: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0715 - val_loss: 0.0726
Epoch 28/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0711Epoch 00027: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0711 - val_loss: 0.0720
Epoch 29/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0707Epoch 00028: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0707 - val_loss: 0.0718
Epoch 30/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0704Epoch 00029: val_loss improved from 0.07163 to 0.07137, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0704 - val_loss: 0.0714
Epoch 31/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0700Epoch 00030: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0700 - val_loss: 0.0725
Epoch 32/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0698Epoch 00031: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0698 - val_loss: 0.0720
Epoch 33/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0696Epoch 00032: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0696 - val_loss: 0.0719
Epoch 34/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0692Epoch 00033: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0692 - val_loss: 0.0725
Epoch 35/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0689Epoch 00034: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0689 - val_loss: 0.0725
Epoch 36/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0687Epoch 00035: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0687 - val_loss: 0.0721
Epoch 37/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0683Epoch 00036: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0683 - val_loss: 0.0728
Epoch 38/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0680Epoch 00037: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0680 - val_loss: 0.0721
Epoch 39/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0676Epoch 00038: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0676 - val_loss: 0.0720
Epoch 40/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0673Epoch 00039: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0673 - val_loss: 0.0726
Epoch 41/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0671Epoch 00040: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0671 - val_loss: 0.0722
Epoch 42/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0668Epoch 00041: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0668 - val_loss: 0.0725
Epoch 43/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0666Epoch 00042: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0666 - val_loss: 0.0725
Epoch 44/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0663Epoch 00043: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0663 - val_loss: 0.0730
Epoch 45/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00044: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0660 - val_loss: 0.0728
Epoch 46/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0657Epoch 00045: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0657 - val_loss: 0.0728
Epoch 47/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0653Epoch 00046: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0653 - val_loss: 0.0734
Epoch 48/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0651Epoch 00047: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0651 - val_loss: 0.0729
Epoch 49/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0646Epoch 00048: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0646 - val_loss: 0.0732
Epoch 50/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0643Epoch 00049: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0643 - val_loss: 0.0744
Epoch 51/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0641Epoch 00050: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0641 - val_loss: 0.0733
Epoch 52/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0638Epoch 00051: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0638 - val_loss: 0.0737
Epoch 53/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0636Epoch 00052: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0636 - val_loss: 0.0738
Epoch 54/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0632Epoch 00053: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0632 - val_loss: 0.0740
Epoch 55/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0630Epoch 00054: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0630 - val_loss: 0.0740
Epoch 56/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0627Epoch 00055: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0627 - val_loss: 0.0745
Epoch 57/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0625Epoch 00056: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0625 - val_loss: 0.0737
Epoch 58/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0621Epoch 00057: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0621 - val_loss: 0.0740
Epoch 59/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0619Epoch 00058: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0619 - val_loss: 0.0743
Epoch 60/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0617Epoch 00059: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0617 - val_loss: 0.0743
Epoch 61/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0615Epoch 00060: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0615 - val_loss: 0.0742
Epoch 62/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0612Epoch 00061: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0612 - val_loss: 0.0742
Epoch 63/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0611Epoch 00062: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0611 - val_loss: 0.0752
Epoch 64/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0609Epoch 00063: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0609 - val_loss: 0.0753
Epoch 65/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0607Epoch 00064: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0608 - val_loss: 0.0759
Epoch 66/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0603Epoch 00065: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0603 - val_loss: 0.0749
Epoch 67/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0602Epoch 00066: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0602 - val_loss: 0.0745
Epoch 68/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0600Epoch 00067: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0600 - val_loss: 0.0753
Epoch 69/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0598Epoch 00068: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0598 - val_loss: 0.0750
Epoch 70/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0597Epoch 00069: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0597 - val_loss: 0.0745
Epoch 71/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0595Epoch 00070: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0595 - val_loss: 0.0755
Epoch 72/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0592Epoch 00071: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0592 - val_loss: 0.0755
Epoch 73/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0592Epoch 00072: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0592 - val_loss: 0.0754
Epoch 74/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0588Epoch 00073: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0588 - val_loss: 0.0750
Epoch 75/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0587Epoch 00074: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0587 - val_loss: 0.0749
Epoch 76/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0585Epoch 00075: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0585 - val_loss: 0.0758
Epoch 77/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0583Epoch 00076: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0583 - val_loss: 0.0755
Epoch 78/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0582Epoch 00077: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0582 - val_loss: 0.0761
Epoch 79/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0579Epoch 00078: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0579 - val_loss: 0.0755
Epoch 80/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0578Epoch 00079: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0578 - val_loss: 0.0758
history: [(0.11819098405147015, None, 0.086710604040952946, None), (0.087899428067241644, None, 0.080030614609406234, None), (0.084484296471241255, None, 0.077868279222756215, None), (0.08271883083945214, None, 0.076737031952975543, None), (0.081271950092656878, None, 0.075465701486422052, None), (0.080342610126556746, None, 0.07473899671294737, None), (0.079585316877772844, None, 0.075123779940641455, None), (0.078752120824851349, None, 0.074510583968739538, None), (0.078159191393462807, None, 0.073370464157477541, None), (0.077766025699771063, None, 0.073343134452581768, None), (0.07727627825982708, None, 0.073962742357856423, None), (0.07664732403075665, None, 0.07399610496910014, None), (0.076449423482578466, None, 0.073391643606545903, None), (0.075907227214929068, None, 0.073092870516319797, None), (0.075526207423246075, None, 0.072962747951983681, None), (0.07507926154129993, None, 0.072948314056730343, None), (0.074607842077250894, None, 0.072419399789660666, None), (0.074417475438750796, None, 0.072610676855620004, None), (0.074020810730244274, None, 0.071627102168546244, None), (0.073618895312440064, None, 0.072540405292852106, None), (0.073310625811154218, None, 0.072041055598669038, None), (0.0729757010383313, None, 0.07214786275608899, None), (0.072588368500567255, None, 0.072183760379184503, None), (0.072340883557275859, None, 0.071874552824544399, None), (0.071971294587887952, None, 0.071950872727815779, None), (0.071628596684922399, None, 0.072680079626256833, None), (0.071471228979006041, None, 0.07258092817287648, None), (0.071118445819691359, None, 0.071989190156601338, None), (0.070746203503007296, None, 0.071770226982630553, None), (0.07036360874312092, None, 0.071365618179559345, None), (0.069969853904121998, None, 0.072450146373911353, None), (0.069806216216450695, None, 0.071967396947528309, None), (0.069564359023631742, None, 0.071945480786864982, None), (0.069233785694477995, None, 0.072480087705761698, None), (0.068867901357602596, None, 0.072497488701180238, None), (0.068656519489992768, None, 0.072074253866208013, None), (0.068287435203905122, None, 0.072785719526049938, None), (0.067992031879936396, None, 0.072095460917579526, None), (0.067565146381103627, None, 0.071967497354591639, None), (0.067290289831940353, None, 0.072555943336933174, None), (0.067090511729483604, None, 0.072211440839723903, None), (0.066780164042833365, None, 0.072483044077998063, None), (0.066555058903339154, None, 0.072485095108299313, None), (0.06627486359865338, None, 0.073043262600172965, None), (0.065954933516783693, None, 0.072752544324691984, None), (0.065662077999817353, None, 0.0728251808967946, None), (0.065320096906740149, None, 0.073422085000499737, None), (0.065084766905140354, None, 0.072875093266118421, None), (0.064616364230468862, None, 0.073231825568178838, None), (0.064288572005188338, None, 0.074390570413394974, None), (0.06407429921759461, None, 0.073304981480904002, None), (0.063764703586848978, None, 0.07371510654869326, None), (0.063614156142628359, None, 0.073773122473394487, None), (0.063238761442953886, None, 0.074016580230569187, None), (0.062986395152055799, None, 0.074030055529813607, None), (0.062729470368240572, None, 0.074476707879811116, None), (0.062467780157798379, None, 0.073657051840147827, None), (0.062073608392697537, None, 0.073991830263689412, None), (0.061902547852497887, None, 0.074340077794668696, None), (0.06170746654338722, None, 0.074307299073065436, None), (0.061528208800600809, None, 0.074164593305943396, None), (0.061231968929564375, None, 0.074237881163120994, None), (0.061096187620655308, None, 0.075195233367349457, None), (0.060884764751128861, None, 0.075308185405292105, None), (0.060755565311957284, None, 0.075878532725291353, None), (0.060309888339113361, None, 0.074871581937987333, None), (0.060224560279241425, None, 0.074488148524155168, None), (0.05997455289047627, None, 0.075314065977318642, None), (0.059807551575517752, None, 0.075041202740400714, None), (0.059706150532887234, None, 0.074461138321021553, None), (0.059478904214385626, None, 0.075453798679274875, None), (0.059227439804841742, None, 0.075501954061074156, None), (0.059194890645601426, None, 0.075396860945442498, None), (0.058835358498407486, None, 0.074989906456916847, None), (0.058719200905060928, None, 0.074931639843426157, None), (0.058483162620758825, None, 0.075802329956033643, None), (0.058292818419839208, None, 0.075488926204916554, None), (0.05816027994743151, None, 0.076058911882579058, None), (0.057886421904282961, None, 0.075527469056291305, None), (0.057793237430098614, None, 0.075775631962845855, None)]
0. 
patient tongue id: 02191625343230_4_6
label yaofang:
甘草 枳壳 法半夏 茯苓 前胡 桔梗 连翘 薏苡仁 浙贝母 莱菔子 款冬花 豆蔻 苦杏仁 紫苏子 贯众
0.838307 0.372295 0.497575 0.430857 0.363078
predicted yaofang:
甘草 法半夏 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
1. 
patient tongue id: 02231912360908_4
label yaofang:
法半夏 前胡 木香 麦冬 太子参 郁金 北柴胡 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子
0.39334 0.787414 0.433746 0.863156 0.420515 0.539648 0.402573 0.460729 0.447332 0.401511 0.80664 0.812929 0.775038 0.824362 0.421908 0.903941 0.407203 0.510149 0.570234 0.717124
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.733333, error: 0.450000
2. 
patient tongue id: 06082044196021_7_4
label yaofang:
甘草 茯苓 太子参 枸杞子 白术 生地黄 赤芍 胆南星 浙贝母 杜仲 郁金 泽泻 生半夏 僵蚕 莪术 地龙 北沙参 赭石 蜈蚣 姜黄
0.43651 0.3796 0.353761 0.341393 0.621627 0.662818 0.334496 0.431362 0.356579 0.319886 0.52246 0.364387
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
3. 
patient tongue id: 04251820144130_4
label yaofang:
麻黄 柴胡 茯苓 前胡 桔梗 半夏 防风 薄荷 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 苍耳子
0.367765 0.776661 0.428009 0.859645 0.390242 0.533765 0.363784 0.456059 0.440251 0.408153 0.797478 0.808035 0.780164 0.831222 0.379965 0.90991 0.407223 0.504114 0.55043 0.71259
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.625000, error: 0.500000
4. 
patient tongue id: 03312115247718_6_5_1
label yaofang:
甘草 柴胡 白芍 茯苓 木香 党参 白术 酸枣仁 黄连 延胡索 乌梅 山药 砂仁 建曲 合欢花
0.92499 0.49388 0.596585 0.512696 0.419881 0.368853 0.455758
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
5. 
patient tongue id: 02182313170546_1
label yaofang:
甘草 龙骨 牡蛎 党参 太子参 酸枣仁 丹参 黄连 牡丹皮 山药 山茱萸 地黄 补骨脂 麦芽 五加皮
0.929502 0.306802 0.495432 0.524759 0.42359 0.435846 0.30467 0.3443
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.133333, error: 0.750000
6. 
patient tongue id: 01041642503947_4
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 升麻 炙甘草 覆盆子 广金钱草 徐长卿
0.409065 0.302665 0.32724 0.398749 0.408191 0.55858 0.375929
predicted yaofang:
甘草 枳壳 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
7. 
patient tongue id: 03291332067563_6_4
label yaofang:
柴胡 白芍 法半夏 大枣 茯苓 牡蛎 党参 栀子 牡丹皮 乌梅 黄柏 大黄 淫羊藿 补骨脂 仙茅 炙甘草 浮小麦
0.947683 0.498718 0.572407 0.443007 0.496435 0.392121 0.411087 0.30134 0.316908
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.222222, recall: 0.117647, error: 0.777778
8. 
patient tongue id: 04112000388796_1_2_7
label yaofang:
甘草 柴胡 黄芩 半夏 荆芥 丹参 杜仲 牛膝 郁金 厚朴 砂仁 菟丝子 火麻仁 紫苏叶 合欢皮 预知子
0.489282 0.36603 0.399838 0.659314 0.649913 0.436154 0.346014 0.329653 0.510383 0.333032
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
9. 
patient tongue id: 01141830514473_6_4
label yaofang:
甘草 白芍 香附 生地黄 赤芍 山药 天麻 全蝎 菟丝子 益母草 佛手 浮小麦 百合 合欢花
0.834086 0.479558 0.519879 0.420845 0.378739 0.310733
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
10. 
patient tongue id: 04291612151459_3_4
label yaofang:
甘草 薏苡仁 党参 郁金 山药 砂仁 天麻 菟丝子 益母草 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 红豆杉
0.936468 0.301637 0.486951 0.570969 0.446482 0.502828 0.360713 0.40527 0.3004
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.666667, recall: 0.400000, error: 0.333333
11. 
patient tongue id: 06071932454762_2_5
label yaofang:
半夏 牡蛎 薏苡仁 党参 黄芪 白术 赤芍 海螵蛸 杜仲 郁金 茵陈 炙甘草 白鲜皮 合欢皮 预知子 蛇舌草 鸡骨草
0.474919 0.370973 0.366875 0.340857 0.675167 0.770437 0.360132 0.480651 0.407021 0.318179 0.534532 0.407263
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 莪术 北沙参 合欢皮

------Score: precision: 0.500000, recall: 0.352941, error: 0.500000
12. 
patient tongue id: 05032238237956_2_7
label yaofang:
甘草 茯苓 党参 郁金 山药 天麻 鳖甲 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 有瓜石斛
0.947273 0.49114 0.562971 0.423645 0.300592 0.311599 0.558754 0.37922 0.430902 0.332001
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.800000, recall: 0.571429, error: 0.200000
13. 
patient tongue id: 05092139064183_6_7_1
label yaofang:
甘草 白芍 川芎 茯苓 党参 酸枣仁 生地黄 地龙 女贞子 首乌藤 合欢花 墨旱莲
0.593344 0.400392 0.388464 0.410381 0.398478 0.317194
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
14. 
patient tongue id: 04062018066663_6_1
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗 猫爪草
0.50076 0.398404 0.429015 0.379772 0.500807
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
15. 
patient tongue id: 05112029187964_2_5
label yaofang:
甘草 茯苓 桔梗 黄芪 白术 五味子 郁金 生半夏 砂仁 天花粉 川贝母 北沙参 蛤壳 冬凌草
0.607446 0.384114 0.48185 0.457269 0.521398
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
16. 
patient tongue id: 04282310548770_3_4
label yaofang:
甘草 白芍 茯苓 党参 白术 黄连 乌梅 山药 车前子 干姜 白扁豆 建曲
0.935126 0.304083 0.513679 0.52245 0.428333 0.425128 0.347686 0.369894
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
17. 
patient tongue id: 04140835111389_1_2
label yaofang:
甘草 法半夏 桔梗 橘红 防风 金银花 薏苡仁 太子参 藿香 白前 鸡内金 蜜百部 干鱼腥草
0.420702 0.343128 0.376689 0.654361 0.57987 0.306905 0.429785 0.306703 0.34452 0.488166 0.318973
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
18. 
patient tongue id: 06162214557781_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 香薷 辛夷 紫苏梗 广藿香 炒苍耳子
0.333364 0.55791 0.416652 0.600337 0.335589 0.424627 0.31446 0.353952 0.368864 0.348051 0.532192 0.56133 0.514629 0.555727 0.355019 0.780388 0.323319 0.395169 0.301166 0.433196
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.500000, error: 0.650000
19. 
patient tongue id: 03232324378343_2_7
label yaofang:
桂枝 甘草 白芍 川芎 丹参 生地黄 红花 赤芍 牛膝 山药 山茱萸 天麻 补骨脂 吴茱萸 宽筋藤
0.988803 0.532694 0.621065 0.452006 0.322465 0.633602 0.566609 0.555904 0.442194 0.454754 0.480476
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
20. 
patient tongue id: 01061925031433_1
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.392462 0.322655 0.328911 0.421391
predicted yaofang:
茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.250000, recall: 0.062500, error: 0.750000
21. 
patient tongue id: 02182002082546_2_6
label yaofang:
甘草 茯苓 桔梗 麦冬 浙贝母 郁金 地黄 天麻 诃子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 猫爪草
0.991284 0.553358 0.605155 0.448765 0.619091 0.562387 0.55909 0.431256 0.43511 0.451187
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
22. 
patient tongue id: 01211250428855_4_3
label yaofang:
麻黄 桂枝 白芍 大枣 生石膏 蝉蜕 炙甘草 地肤子
0.724019 0.33553 0.434969 0.45997 0.428558
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.125000, error: 0.800000
23. 
patient tongue id: 04071400063437_1_2_7
label yaofang:
甘草 法半夏 前胡 桔梗 橘红 金银花 薏苡仁 藿香 白前 枇杷叶 苦杏仁 干鱼腥草
0.390356 0.387655 0.34465 0.386664 0.385063
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
24. 
patient tongue id: 03091831215493_1_4_5
label yaofang:
甘草 法半夏 葛根 前胡 桔梗 防风 薄荷 荷叶 荆芥穗 香薷 紫苏梗 广藿香
0.417684 0.919046 0.393139 0.967829 0.439463 0.625093 0.400637 0.525022 0.46339 0.409517 0.938574 0.94061 0.915464 0.949685 0.394773 0.977021 0.457177 0.60276 0.666693 0.861106
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.416667, error: 0.750000
25. 
patient tongue id: 03020829112646_6_4
label yaofang:
甘草 茯苓 龙骨 牡蛎 酸枣仁 丹参 生地黄 红花 山茱萸 天麻 鳖甲 白花蛇舌草 浮小麦 蜈蚣 天山雪莲 半枝莲
0.928383 0.342945 0.486532 0.529556 0.403355 0.413109 0.336202
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
26. 
patient tongue id: 05092144585401_4_1_6
label yaofang:
甘草 白芍 陈皮 防风 羌活 薏苡仁 白术 浙贝母 天麻 鳖甲 补骨脂 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.984095 0.530564 0.636489 0.452137 0.361169 0.311167 0.329078 0.655046 0.576117 0.563037 0.455392 0.477024 0.506717
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
27. 
patient tongue id: 03081755377384_1_4
label yaofang:
麻黄 桂枝 白芍 牛蒡子 太子参 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.330917 0.305586 0.323905 0.355494 0.304963 0.352429
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
28. 
patient tongue id: 04222116002959_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.397748 0.870746 0.42301 0.942413 0.445889 0.579493 0.395228 0.510061 0.474977 0.412483 0.896991 0.902273 0.875507 0.918806 0.387976 0.960162 0.441898 0.572075 0.621179 0.810116
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
29. 
patient tongue id: 05222127091348_1_4_6
label yaofang:
甘草 茯苓 半夏 橘红 黄芪 白术 厚朴 磁石 芡实 金樱子 枇杷叶 北沙参 木蝴蝶
0.504288 0.349423 0.314959 0.372198 0.681256 0.727317 0.323975 0.476688 0.393242 0.32518 0.506928 0.367952
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.583333, recall: 0.538462, error: 0.416667
30. 
patient tongue id: 03020729136700_6_4
label yaofang:
甘草 白芍 法半夏 葛根 木香 黄连 山药 大腹皮 天麻 白花蛇舌草 建曲 紫苏梗 广藿香 蜈蚣 半枝莲 醋鳖甲
0.981409 0.519896 0.646478 0.487317 0.373299 0.307667 0.34092 0.667532 0.612647 0.627887 0.490345 0.536236 0.585289
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
31. 
patient tongue id: 02171859232680_4
label yaofang:
陈皮 法半夏 前胡 防风 太子参 钩藤 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子
0.392668 0.880551 0.416244 0.93994 0.443078 0.577309 0.421408 0.489328 0.466021 0.397315 0.89751 0.903716 0.861799 0.907448 0.438343 0.960551 0.410881 0.542617 0.61337 0.800086
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
32. 
patient tongue id: 01180619216835_1_7
label yaofang:
桂枝 甘草 川芎 茯苓 鸡血藤 白术 酸枣仁 生地黄 赤芍 牛膝 天麻 桑寄生 桑枝 乌梢蛇
0.980246 0.5206 0.585026 0.459182 0.539266 0.493686 0.493928 0.370582 0.378944 0.395501
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
33. 
patient tongue id: 05182041306526_1_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 金樱子 桑螵蛸 炙甘草 百合 紫苏叶 覆盆子
0.336828 0.376825 0.509676 0.344672 0.345644 0.347116 0.417605 0.378826 0.491555 0.537812
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
34. 
patient tongue id: 03231209552995_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.378097 0.702228 0.449042 0.767286 0.403718 0.49744 0.386881 0.434092 0.415981 0.384994 0.708871 0.70765 0.673113 0.713796 0.398292 0.81157 0.382111 0.465059 0.485932 0.616095
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
35. 
patient tongue id: 03061449580324_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 紫菀 豆蔻 姜半夏 炙甘草 紫苏梗
0.427684 0.356524 0.410063 0.308617
predicted yaofang:
甘草 茯苓 党参 丹参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
36. 
patient tongue id: 04181954003347_6_4
label yaofang:
甘草 柴胡 白芍 香附 当归 茯苓 薄荷 枸杞子 白术 车前子 菟丝子 麦芽 续断 广藿香
0.392103 0.519013 0.410989 0.354981 0.377936 0.424551 0.30272 0.370404 0.572682 0.659043
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
37. 
patient tongue id: 01201319592474_5_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 天麻 鳖甲 诃子 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.996077 0.553586 0.672051 0.457619 0.367444 0.30067 0.322905 0.754578 0.648612 0.659252 0.504454 0.541202 0.600246
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
38. 
patient tongue id: 02181631561609_2_5_7
label yaofang:
甘草 柴胡 黄芩 茯苓 浙贝母 乌梅 牛膝 鳖甲 夏枯草 白花蛇舌 蜂房 岗梅根 四季青 有瓜石斛
0.888229 0.315768 0.503004 0.477995 0.412854 0.309266 0.302309
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
39. 
patient tongue id: 01201316433765_1_5_6
label yaofang:
甘草 白芍 当归 蒲公英 党参 黄芪 白术 仙鹤草 茜草 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲 红豆杉 艾叶
0.997853 0.55155 0.689074 0.476883 0.367314 0.301846 0.3007 0.769682 0.686272 0.70588 0.524734 0.569565 0.633784
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
40. 
patient tongue id: 04051840156048_1_2
label yaofang:
茯苓 半夏 薏苡仁 黄芪 枸杞子 白术 黄连 海螵蛸 杜仲 山茱萸 僵蚕 肉苁蓉 莲子 麦芽 白扁豆 赭石 紫苏叶 骨碎补 蛇舌草 谷精子
0.894171 0.45984 0.588424 0.509003 0.377071 0.373424
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.100000, error: 0.666667
41. 
patient tongue id: 05242058091549_1_2
label yaofang:
甘草 白芍 陈皮 防风 白术 杜仲 天麻 桑寄生 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.996902 0.556877 0.688731 0.465939 0.380833 0.316732 0.329452 0.762054 0.674242 0.672585 0.526611 0.570428 0.622413
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
42. 
patient tongue id: 02170944284366_1_4_7
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.44029 0.364549 0.424621 0.451044 0.304047
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
43. 
patient tongue id: 02251115261307_4
label yaofang:
法半夏 前胡 防风 白芷 木瓜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.797543 0.339072 0.504423 0.461635 0.391926
predicted yaofang:
甘草 法半夏 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
44. 
patient tongue id: 05232115170385_1_4
label yaofang:
陈皮 茯苓 半夏 黄芪 浙贝母 杜仲 牛膝 厚朴 僵蚕 菟丝子 百部 鸡内金 枇杷叶 北沙参 紫苏子 紫苏叶 紫苑
0.691208 0.412753 0.492119 0.319357 0.332284 0.327968
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.333333, recall: 0.117647, error: 0.666667
45. 
patient tongue id: 06082027497652_2
label yaofang:
甘草 枳壳 薏苡仁 桃仁 蒲公英 太子参 黄芪 白术 生地黄 牡丹皮 乌药 郁金 厚朴 僵蚕 莪术 蜈蚣 姜黄
0.430768 0.361897 0.415841 0.344061 0.668214 0.733389 0.398179 0.326034 0.479974 0.401706 0.319502 0.324623 0.539391 0.421816
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 莪术 鸡内金 北沙参 合欢皮

------Score: precision: 0.357143, recall: 0.294118, error: 0.642857
46. 
patient tongue id: 01200655104444_6_2_4
label yaofang:
甘草 蒲公英 黄连 牛膝 石膏 山茱萸 细辛 天麻 白芷 鳖甲 白花蛇舌草 麦芽 蜈蚣 天山雪莲 半枝莲 广升麻
0.926264 0.332072 0.474943 0.569373 0.42621 0.322463 0.302934 0.535091 0.378962 0.415183 0.319458
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
47. 
patient tongue id: 05132049598774_1_4_7
label yaofang:
甘草 羌活 独活 党参 鸡血藤 白术 生地黄 延胡索 天麻 桑寄生 鳖甲 桑枝 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.959486 0.513523 0.595908 0.457238 0.336891 0.308007 0.32514 0.575836 0.52782 0.523462 0.423649 0.44273 0.471051
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.625000, error: 0.230769
48. 
patient tongue id: 03142043243269_1_7
label yaofang:
甘草 香附 茯苓 桃仁 党参 白术 海螵蛸 干姜 紫苏梗 瓦楞子 猫爪草
0.421604 0.612493 0.484463 0.386056 0.348796 0.466566 0.370213 0.708904 0.73867
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.363636, error: 0.555556
49. 
patient tongue id: 02271851216516_4
label yaofang:
陈皮 前胡 防风 荆芥穗 百部 炙甘草 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术 炒六神曲 醋香附 姜厚朴
0.380996 0.893491 0.413004 0.951939 0.433538 0.590289 0.375322 0.50793 0.473998 0.403519 0.910258 0.919463 0.882591 0.926119 0.375025 0.968051 0.415787 0.561707 0.604964 0.815023
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.500000, error: 0.650000
50. 
patient tongue id: 01312056249169_1_6_4
label yaofang:
茯苓 半夏 黄芪 鸡血藤 白术 厚朴 磁石 火麻仁 橘核 丝瓜络 首乌藤 桑枝 合欢皮
0.494159 0.436776 0.360493 0.367919 0.378753 0.337007
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
51. 
patient tongue id: 03011107530990_6_4
label yaofang:
甘草 法半夏 浙贝母 牡丹皮 石膏 苍术 青蒿 升麻 银柴胡 淡竹叶 百合 紫苏叶 醋鳖甲 川木通
0.367235 0.508022 0.364236 0.339029 0.365769 0.423548 0.314739 0.535143 0.608804
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
52. 
patient tongue id: 03151930082023_7
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.394151 0.364508 0.35105 0.48334 0.543483 0.370827 0.312378 0.32038
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 北沙参

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
53. 
patient tongue id: 05191921572080_3_4
label yaofang:
甘草 法半夏 薏苡仁 桃仁 远志 党参 细辛 干姜 天麻 鳖甲 款冬花 地龙 苦杏仁 紫苏子 炙麻黄 蜈蚣 白花蛇舌 天山雪莲
0.991239 0.542603 0.66048 0.466386 0.375897 0.314446 0.339695 0.714218 0.644674 0.638956 0.512367 0.546673 0.588203
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.388889, error: 0.461538
54. 
patient tongue id: 04181954055243_7
label yaofang:
桂枝 甘草 川芎 茯苓 桃仁 鸡血藤 白术 红花 赤芍 车前子 桑寄生 益母草 吴茱萸
0.797089 0.46549 0.518988 0.420776 0.329032
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
55. 
patient tongue id: 04062233349153_1_2_7
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 延胡索 枳实 竹茹 胆南星 厚朴
0.849553 0.464022 0.532723 0.372842 0.582363 0.383632
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
56. 
patient tongue id: 02171945208672_5_7_6
label yaofang:
半夏 橘红 牡蛎 薏苡仁 党参 黄芪 枸杞子 白术 杜仲 山药 肉苁蓉 巴戟天 吴茱萸 芡实 莲子 北沙参 首乌藤 红豆杉 合欢皮 墨旱莲
0.458685 0.422317 0.337125 0.424448 0.405434 0.411666
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.200000, error: 0.333333
57. 
patient tongue id: 02171934369190_1_2_3
label yaofang:
玉竹 黄芪 白术 乌梅 附子 肉桂 山茱萸 厚朴 肉苁蓉 火麻仁 北沙参 辛夷 猫爪草 冬凌草
0.538334 0.407152 0.449063 0.445482 0.413667 0.312953
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
58. 
patient tongue id: 03312109382609_4_6
label yaofang:
甘草 茯苓 木香 龙骨 牡蛎 党参 枸杞子 白术 荷叶 砂仁 天麻 磁石 蜈蚣 半枝莲 醋鳖甲
0.998239 0.558387 0.71484 0.452934 0.412407 0.325642 0.343802 0.817159 0.698578 0.709101 0.546075 0.601502 0.669999
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
59. 
patient tongue id: 04252327050633_6_7_1
label yaofang:
甘草 白芍 川芎 茯苓 葛根 党参 白术 地黄 天麻 桑寄生 首乌藤 蜈蚣 酒女贞子 墨旱莲
0.991339 0.54051 0.641275 0.442336 0.355468 0.310985 0.321599 0.695986 0.610887 0.603382 0.486666 0.506283 0.548431
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
60. 
patient tongue id: 03312110476682_5
label yaofang:
甘草 茯苓 连翘 丹参 牡丹皮 黄柏 知母 山药 山茱萸 地黄 泽泻 白芷 麦芽 皂角刺
0.970772 0.519912 0.594847 0.427386 0.316186 0.565636 0.491909 0.473988 0.389237 0.388129 0.400936
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
61. 
patient tongue id: 03231215527335_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄 炒六神曲
0.380696 0.74209 0.418255 0.825981 0.382674 0.528649 0.374766 0.418683 0.416938 0.397424 0.760065 0.766077 0.744183 0.796406 0.406438 0.878938 0.404894 0.487519 0.541652 0.682882
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
62. 
patient tongue id: 03111710314464_1_4_6
label yaofang:
甘草 茯苓 独活 薏苡仁 党参 酸枣仁 山药 天麻 鳖甲 莪术 白扁豆 浮小麦 蜈蚣 半枝莲 骨碎补
0.935587 0.49459 0.557262 0.449386 0.4886 0.39512 0.413968 0.304528 0.307906
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.777778, recall: 0.466667, error: 0.222222
63. 
patient tongue id: 05231946058412_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 蜜麻黄 麸炒白术
0.375684 0.731118 0.437684 0.808375 0.401513 0.511657 0.372847 0.442887 0.432848 0.392114 0.747108 0.752996 0.720167 0.767534 0.381783 0.869085 0.384745 0.495431 0.51333 0.659176
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.812500, error: 0.350000
64. 
patient tongue id: 03242142357082_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 鹿衔草
0.386012 0.352978 0.48004 0.322783 0.302914 0.323601 0.348556 0.393781 0.322641 0.427676 0.545793
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.636364, recall: 0.636364, error: 0.363636
65. 
patient tongue id: 01092047464157_6_1
label yaofang:
甘草 当归 茯苓 远志 党参 黄芪 白术 酸枣仁 龙眼肉 珍珠母 首乌藤 合欢皮
0.415798 0.383118 0.332625 0.466991 0.508056 0.364444
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.833333, recall: 0.416667, error: 0.166667
66. 
patient tongue id: 03040904109658_2_4
label yaofang:
甘草 法半夏 茯苓 白术 五味子 生地黄 杜仲 山药 山茱萸 泽泻 天麻 款冬花 补骨脂 紫菀 桑螵蛸 益智
0.957517 0.518025 0.60989 0.539668 0.314872 0.47206 0.472895 0.556938 0.326349 0.358494 0.373895
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
67. 
patient tongue id: 03231432414359_4_2
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄 炒六神曲
0.350184 0.629877 0.403825 0.714695 0.351023 0.488081 0.350006 0.382357 0.410088 0.395146 0.634916 0.672233 0.650415 0.690929 0.366631 0.832384 0.379687 0.451627 0.453529 0.580134
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
68. 
patient tongue id: 05290813099031_1_2_6
label yaofang:
甘草 法半夏 茯苓 连翘 太子参 白术 浙贝母 砂仁 天麻 鳖甲 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.992016 0.538615 0.653196 0.483467 0.355488 0.304973 0.320276 0.680054 0.619074 0.618906 0.47849 0.522259 0.562042
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.562500, error: 0.307692
69. 
patient tongue id: 05111935313752_1_4
label yaofang:
桂枝 甘草 茯苓 半夏 薏苡仁 太子参 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 泽泻 厚朴 淡豆豉 麦芽 紫苏叶 蜈蚣 稻芽
0.449405 0.376166 0.30743 0.374001 0.600468 0.619153 0.309403 0.42023 0.34329 0.326882 0.478716 0.339568
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.583333, recall: 0.368421, error: 0.416667
70. 
patient tongue id: 03090818154829_6_1
label yaofang:
甘草 茯苓 党参 白术 蒲黄 砂仁 天麻 全蝎 五灵脂 白花蛇舌草 麦芽 佛手 半枝莲 醋鳖甲
0.996679 0.550147 0.665843 0.455484 0.356284 0.302868 0.769823 0.666015 0.689659 0.525504 0.55614 0.635354
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
71. 
patient tongue id: 04282309325809_6_5_1
label yaofang:
甘草 柴胡 白芍 薏苡仁 黄芪 山茱萸 天麻 鳖甲 莪术 虎杖 佛手 蜈蚣 白花蛇舌 合欢花 红豆杉 龙葵果
0.966593 0.518486 0.586836 0.430742 0.300965 0.552872 0.460123 0.452163 0.35117 0.359731 0.369101
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
72. 
patient tongue id: 04112111457761_1_4_7
label yaofang:
甘草 茯苓 党参 白术 浙贝母 杜仲 厚朴 砂仁 火麻仁 金樱子 北沙参 合欢皮 蛇舌草
0.501961 0.387643 0.365813 0.510961 0.587456 0.356308 0.303127 0.413141
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.875000, recall: 0.538462, error: 0.125000
73. 
patient tongue id: 05162146341754_9
label yaofang:
陈皮 前胡 桔梗 半夏 防风 黄芪 白术 款冬花 紫菀 白前 百部 炙甘草 广藿香
0.340551 0.469796 0.443096 0.524613 0.302733 0.369824 0.305329 0.452352 0.467484 0.45651 0.516554 0.391372 0.670574 0.312235 0.337235 0.374188
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.625000, recall: 0.769231, error: 0.375000
74. 
patient tongue id: 05221850202611_1
label yaofang:
甘草 柴胡 陈皮 党参 黄芪 鸡血藤 白术 知母 山药 升麻 虎杖 紫苏梗
0.48415 0.390552 0.384761 0.519775 0.567259 0.326543 0.395195
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
75. 
patient tongue id: 01061844362179_4
label yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.39678 0.87387 0.411652 0.936474 0.427417 0.58405 0.390084 0.485447 0.459935 0.403557 0.894423 0.898346 0.865026 0.910372 0.402358 0.955686 0.429124 0.555261 0.613321 0.802248
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
76. 
patient tongue id: 05261939019545_1_4_6
label yaofang:
陈皮 半夏 党参 黄芪 枸杞子 白术 杜仲 牛膝 郁金 厚朴 砂仁 巴戟天 鸡内金 紫苏叶 骨碎补 红豆杉 素馨花
0.531174 0.419159 0.408245 0.485574 0.550165 0.330838 0.396036
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.235294, error: 0.428571
77. 
patient tongue id: 04112352228436_6
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 砂仁 川牛膝 浮小麦 醋龟甲
0.313133 0.31767 0.322409 0.373272 0.482298 0.371189
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
78. 
patient tongue id: 03282202306064_1_4_7
label yaofang:
甘草 党参 白术 丹参 黄连 郁金 山药 砂仁 天麻 鳖甲 茵陈 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.960323 0.518922 0.576631 0.476415 0.304677 0.519927 0.509197 0.519775 0.399064 0.407274 0.419479
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.529412, error: 0.181818
79. 
patient tongue id: 04252016476939_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 海螵蛸 车前子 白花蛇舌草 紫苏梗 瓦楞子 猫爪草 山慈菇
0.425266 0.314732 0.403254 0.310705 0.316464 0.418362 0.395264 0.345612
predicted yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
80. 
patient tongue id: 04202229299390_2_5
label yaofang:
甘草 茯苓 桔梗 芦根 太子参 浙贝母 白茅根 天花粉 鳖甲 淡竹叶 北沙参 紫苏梗 白花蛇舌 蜂房
0.851971 0.476286 0.512861 0.41215 0.365263
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
81. 
patient tongue id: 02272234369788_1
label yaofang:
甘草 白芍 川芎 羌活 独活 牛膝 细辛 干姜 仙茅 蜈蚣 姜黄 海桐皮 鹿衔草
0.398483 0.536276 0.419027 0.384368 0.363038 0.490968 0.36023 0.642673 0.708458
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.153846, error: 0.777778
82. 
patient tongue id: 04291627449856_1_2_5
label yaofang:
甘草 远志 党参 酸枣仁 生地黄 山药 天麻 鳖甲 豆蔻 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.868561 0.478844 0.530467 0.477087 0.330896 0.36919
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
83. 
patient tongue id: 03231754488545_5_6
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桃仁 鱼腥草 远志 细辛 桑白皮 莱菔子 款冬花 诃子 苇茎 紫苏子 炙麻黄
0.915858 0.486492 0.556599 0.454496 0.303117 0.47583 0.363996 0.421086
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.125000, error: 0.750000
84. 
patient tongue id: 03171339313393_1_4
label yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.351267 0.664818 0.444946 0.728307 0.357376 0.464675 0.347516 0.376946 0.370819 0.348312 0.655203 0.659379 0.643281 0.693531 0.386348 0.810401 0.348006 0.427317 0.454472 0.584726
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
85. 
patient tongue id: 02212013505031_6_4
label yaofang:
甘草 柴胡 白芍 陈皮 茯苓 鱼腥草 白术 酸枣仁 苍术 山药 荆芥穗 桑寄生 浮小麦 合欢花
0.943894 0.31745 0.487517 0.562661 0.440925 0.471189 0.355401 0.38546
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
86. 
patient tongue id: 04171957447292_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.362976 0.744655 0.446669 0.815154 0.395627 0.515856 0.361052 0.44265 0.426871 0.396014 0.753119 0.761429 0.726155 0.773125 0.375807 0.875702 0.379683 0.482883 0.51139 0.663257
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
87. 
patient tongue id: 05181100161499_5
label yaofang:
甘草 柴胡 黄芩 法半夏 茯苓 葛根 前胡 鱼腥草 石膏 淡竹叶 款冬花 苦杏仁 紫苏子 蜜麻黄 大青叶
0.993603 0.531874 0.673188 0.460451 0.369384 0.305989 0.758412 0.614009 0.643794 0.470071 0.537197 0.618446
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
88. 
patient tongue id: 03152113188369_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.345195 0.614648 0.308979 0.432935 0.451455 0.627407 0.548079 0.534067 0.571405 0.601208 0.608069 0.653834 0.41296 0.62204 0.647384 0.686635
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
89. 
patient tongue id: 02281252446124_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.64628 0.373508 0.391534 0.652222 0.581681 0.605123 0.549566 0.624205 0.611861 0.626231 0.458211 0.618659 0.627646 0.643819
predicted yaofang:
桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.142857, recall: 0.153846, error: 0.857143
90. 
patient tongue id: 04112250457998_6_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.424514 0.592246 0.463196 0.380977 0.364906 0.450603 0.369311 0.670489 0.710421
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.777778, recall: 0.636364, error: 0.222222
91. 
patient tongue id: 04251812331682_1_3
label yaofang:
白芍 川芎 茯苓 防风 太子参 丹参 钩藤 荆芥穗 天麻 白芷 石决明 炙甘草 首乌藤 炒蔓荆子 棉萆薢
0.30989 0.596153 0.481975 0.55016 0.323591 0.400842 0.314741 0.301668 0.50201 0.47509 0.443971 0.4472 0.322251 0.646955 0.351944 0.376339
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.187500, recall: 0.200000, error: 0.812500
92. 
patient tongue id: 02202310125396_1_2
label yaofang:
甘草 当归 茯苓 党参 黄芪 鸡血藤 白术 砂仁 赤石脂 鳖甲 北沙参 黄精 蜈蚣 白花蛇舌 天山雪莲
0.977349 0.528252 0.569629 0.437256 0.563737 0.492262 0.486629 0.383094 0.375905 0.382933
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
93. 
patient tongue id: 03151732024557_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.653278 0.373453 0.34436 0.657817 0.611558 0.594789 0.656051 0.65271 0.642388 0.691738 0.48672 0.676376 0.68611 0.724754
predicted yaofang:
桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.857143, recall: 1.000000, error: 0.142857
94. 
patient tongue id: 03141606320774_1_2_7
label yaofang:
桔梗 防风 金银花 薏苡仁 党参 乳香 胆南星 藿香 白芷 辛夷 干鱼腥草 苍耳子
0.755257 0.409887 0.491216 0.306624 0.397734
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
95. 
patient tongue id: 03271931277035_4
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 黄芪 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.388812 0.816832 0.425436 0.894499 0.427118 0.54966 0.390707 0.476663 0.45047 0.40682 0.836628 0.845784 0.802998 0.859788 0.396074 0.919321 0.416086 0.535189 0.566192 0.738028
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
96. 
patient tongue id: 03061500542067_1_4
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.427427 0.3774 0.499918 0.326008 0.322883 0.301495 0.385123 0.412361 0.422263 0.461472
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
97. 
patient tongue id: 03291341176175_6_7_1
label yaofang:
甘草 茯苓 桔梗 党参 黄芪 白术 酸枣仁 丹参 山药 蔓荆子 鳖甲 建曲 苍耳子 土茯苓 贯众
0.892847 0.310887 0.479092 0.529058 0.420135 0.393521 0.327363
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
98. 
patient tongue id: 04061337141686_2_6
label yaofang:
甘草 柴胡 白芍 延胡索 杜仲 地黄 天麻 桑寄生 佛手 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳 牛大力
0.987372 0.534955 0.643254 0.431275 0.376967 0.329367 0.337232 0.690691 0.593957 0.582276 0.479532 0.499812 0.539068
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
99. 
patient tongue id: 03020802469357_2_6
label yaofang:
甘草 白芍 茯苓 龙骨 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.985836 0.517203 0.644305 0.461366 0.371505 0.30667 0.316079 0.706409 0.577359 0.595938 0.446379 0.500097 0.566613
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.812500, error: 0.000000
100. 
patient tongue id: 04260131295065_6_4_7
label yaofang:
甘草 川芎 枳壳 法半夏 茯苓 连翘 白术 牛膝 厚朴 莱菔子 天麻 白芷 蔓荆子 火麻仁 决明子 广藿香
0.94518 0.501593 0.556902 0.423476 0.465281 0.335197 0.3713
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
101. 
patient tongue id: 06012040069832_3_2
label yaofang:
独活 麦冬 党参 黄芪 枸杞子 熟地黄 杜仲 巴戟天 石斛 桑寄生 淫羊藿 五加皮 千年健
0.357034 0.40767 0.467956 0.409571 0.476322 0.319038
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
102. 
patient tongue id: 02191621119676_2_6_4
label yaofang:
甘草 柴胡 法半夏 牡蛎 连翘 麦冬 丹参 玄参 赤芍 浙贝母 郁金 麦芽 皂角刺 重楼
0.80194 0.418484 0.472785 0.369615
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
103. 
patient tongue id: 01201324248086_1_8
label yaofang:
甘草 金银花 麦冬 何首乌 白术 生地黄 石膏 水牛角 荆芥穗 火麻仁 枇杷叶 麦芽 苦杏仁 白鲜皮
0.912651 0.490508 0.539959 0.42836 0.422488 0.33803
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
104. 
patient tongue id: 03021147481124_1_2
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.42432 0.303093 0.359147 0.320127 0.445197 0.615787
predicted yaofang:
白芍 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
105. 
patient tongue id: 03021241035610_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.748762 0.32862 0.74093 0.702615 0.680307 0.710111 0.749357 0.772482 0.763006 0.523893 0.767331 0.763538 0.806794
predicted yaofang:
桃仁 党参 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.076923, recall: 0.076923, error: 0.923077
106. 
patient tongue id: 01100430173800_4
label yaofang:
桂枝 川芎 防风 羌活 桃仁 红花 胆南星 黄柏 苍术 神曲 白芷 防己 威灵仙 海风藤 龙胆
0.547331 0.346118 0.36187 0.424111 0.37093
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
107. 
patient tongue id: 04112021572770_2_5
label yaofang:
甘草 川芎 生地黄 赤芍 牡丹皮 杜仲 黄柏 山药 山茱萸 灯心草 天麻 全蝎 白芷 菟丝子 麦芽 皂角刺
0.92183 0.334278 0.480117 0.549396 0.440536 0.397037 0.323483 0.358133
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.125000, error: 0.750000
108. 
patient tongue id: 02281844235521_4
label yaofang:
麻黄 陈皮 法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子
0.335313 0.566335 0.404302 0.591297 0.352395 0.437841 0.327157 0.391841 0.41163 0.380811 0.532251 0.607276 0.537031 0.576837 0.312999 0.780114 0.325672 0.421546 0.387791 0.489118
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
109. 
patient tongue id: 06132233274576_7_1
label yaofang:
甘草 茯苓 龙骨 牡蛎 牛蒡子 枸杞子 熟地黄 乌药 车前子 紫菀 蝉蜕 益智 蒺藜
0.418216 0.308101 0.403363 0.352617 0.38501 0.395779 0.44348
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
110. 
patient tongue id: 04180847010682_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.645717 0.382338 0.482118 0.311009 0.372514
predicted yaofang:
甘草 茯苓 党参 丹参 天麻

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
111. 
patient tongue id: 04271416102812_1_3_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.574816 0.378061 0.33151 0.57751 0.506679 0.533992 0.442554 0.563346 0.610494 0.528651 0.354787 0.536345 0.534741 0.578822
predicted yaofang:
桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.857143, recall: 1.000000, error: 0.142857
112. 
patient tongue id: 05160614196457_7_4_1
label yaofang:
茯苓 黄芪 枸杞子 白术 海螵蛸 浙贝母 牡丹皮 车前子 厚朴 生半夏 砂仁 地榆 槐花 地龙 北沙参 蜈蚣 鲜龙葵果
0.385357 0.365946 0.363608 0.311856 0.676261 0.588478 0.402314 0.319657 0.338904 0.601089
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.600000, recall: 0.352941, error: 0.400000
113. 
patient tongue id: 04141836279104_4_1_3
label yaofang:
茯苓 半夏 远志 黄芪 枸杞子 白术 海螵蛸 郁金 厚朴 鸡内金 北沙参 炙甘草 桑椹 首乌藤 紫苏梗 合欢皮
0.538238 0.402039 0.434297 0.362965 0.513715
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
114. 
patient tongue id: 02122100201809_1_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 茯苓 木香 生地黄 杜仲 山药 山茱萸 五灵脂 桑寄生
0.993907 0.309051 0.55528 0.614749 0.464069 0.320082 0.304339 0.683189 0.60523 0.616528 0.483562 0.480051 0.488224
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
115. 
patient tongue id: 03012203260906_1_2
label yaofang:
甘草 茯苓 党参 白术 生地黄 栀子 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.958242 0.51802 0.573888 0.452913 0.303499 0.512566 0.467313 0.463533 0.363344 0.368683 0.374601
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
116. 
patient tongue id: 06132000382495_1_2_5
label yaofang:
甘草 白术 海螵蛸 牡丹皮 杜仲 小蓟 茜草 桑寄生 北沙参 蜈蚣 冬凌草 鸭脚艾
0.408246 0.337237 0.34762 0.633156 0.542355 0.346892 0.482156
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
117. 
patient tongue id: 05311931330271_4
label yaofang:
甘草 桔梗 荆芥 防风 鱼腥草 山楂 瓜蒌皮 射干 白前 百部 鸡内金 枇杷叶 苦杏仁 紫苏叶 木蝴蝶 紫苑 东风桔
0.779313 0.474071 0.50557 0.31925 0.475664
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.058824, error: 0.800000
118. 
patient tongue id: 03111714098381_6_5
label yaofang:
甘草 独活 酸枣仁 生地黄 延胡索 杜仲 山药 山茱萸 桑寄生 麦芽 威灵仙 川木瓜 土茯苓 牛大力 千斤拔
0.52606 0.421722 0.395163 0.362162 0.41422
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
119. 
patient tongue id: 05131739482701_6_7
label yaofang:
甘草 柴胡 白芍 丹参 生地黄 红花 青皮 浙贝母 郁金 天花粉 瓜蒌皮 王不留行 皂角刺 浮小麦 合欢花
0.553181 0.304587 0.425313 0.337759 0.420222 0.406478
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
120. 
patient tongue id: 04121929217384_6_7
label yaofang:
桂枝 甘草 法半夏 党参 丹参 薤白 水蛭 赤石脂 瓜蒌皮 补骨脂 莪术 鹿角霜 醋香附 合欢花 淡附片
0.99243 0.535181 0.657604 0.45442 0.374415 0.310477 0.336206 0.734183 0.647208 0.652099 0.511854 0.556663 0.613484
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.133333, error: 0.846154
121. 
patient tongue id: 03231520316137_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄
0.336359 0.537237 0.435385 0.560073 0.314521 0.406059 0.332403 0.317582 0.302906 0.494289 0.502114 0.493462 0.527278 0.410867 0.711832 0.304482 0.350743 0.344862 0.432819
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
122. 
patient tongue id: 02020852428763_6_4
label yaofang:
甘草 法半夏 当归 茯苓 黄连 杜仲 牛膝 石膏 肉桂 细辛 地黄 砂仁 白芷 升麻 没药 麦芽
0.858993 0.482146 0.493016 0.40978 0.366239
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
123. 
patient tongue id: 03221301248881_1_2_6
label yaofang:
甘草 玉竹 太子参 山药 天麻 天花粉 鳖甲 北沙参 白扁豆 蜈蚣 白花蛇舌 天山雪莲 合欢花 红豆杉 猫爪草
0.990829 0.544722 0.627945 0.469536 0.313594 0.648406 0.590892 0.589154 0.442681 0.465753 0.495887
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
124. 
patient tongue id: 03171053199903_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.36389 0.545907 0.42289 0.412833 0.546802 0.466097 0.497017 0.405804 0.501761 0.487154 0.491871 0.384881 0.476996 0.494199 0.485742
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
125. 
patient tongue id: 03041136401604_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.377651 0.742512 0.436602 0.810658 0.381205 0.527134 0.338064 0.430737 0.405842 0.389625 0.757572 0.758216 0.72342 0.77621 0.342367 0.844372 0.390539 0.503609 0.501592 0.660867
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
126. 
patient tongue id: 02120928504219_5_6
label yaofang:
甘草 白芍 防风 独活 薏苡仁 白及 党参 白术 黄连 苍术 山药 干姜 桑寄生 豆蔻 建曲
0.936666 0.492193 0.550743 0.403155 0.425568
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
127. 
patient tongue id: 01192245599008_6_7_2
label yaofang:
甘草 柴胡 白芍 薏苡仁 党参 黄芪 白术 延胡索 川楝子 山药 砂仁 鳖甲 莪术 建曲 白花蛇舌 红豆杉
0.877342 0.325196 0.475481 0.533321 0.429492 0.436963 0.302026 0.338156
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.312500, error: 0.375000
128. 
patient tongue id: 05182058150915_7_1
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 丹参 车前子 升麻 炙甘草
0.420542 0.35167 0.457536 0.312046 0.310852 0.330883 0.39282 0.410355 0.392035 0.431138
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.400000, error: 0.600000
129. 
patient tongue id: 03012333417967_5_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 桃仁 白术 浙贝母 厚朴 天花粉 火麻仁 决明子 苦杏仁 威灵仙
0.929551 0.301895 0.496593 0.531763 0.421415 0.440007 0.333259 0.34685
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
130. 
patient tongue id: 04221953084479_1_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 白前 百部 豆蔻 北沙参 炙甘草 广藿香 炒白扁豆 炒紫苏子 蜜麻黄 麸炒白术 炒六神曲
0.401121 0.96997 0.3818 0.991656 0.491216 0.673704 0.445364 0.575942 0.529989 0.408883 0.977482 0.981219 0.960311 0.981549 0.448422 0.995161 0.441611 0.639775 0.706267 0.917537
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.750000, error: 0.400000
131. 
patient tongue id: 01070843418731_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌
0.722915 0.397745 0.51074 0.335194 0.352198
predicted yaofang:
甘草 茯苓 党参 黄芪 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
132. 
patient tongue id: 06071955501722_4_7
label yaofang:
甘草 独活 党参 鸡血藤 生地黄 牛膝 细辛 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.977199 0.53181 0.591863 0.449363 0.307114 0.578443 0.515902 0.50629 0.40623 0.407298 0.411765
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
133. 
patient tongue id: 06031649134171_1_2
label yaofang:
茯苓 防风 钩藤 荆芥穗 白芷 香薷 炙甘草 首乌藤 紫苏梗 广藿香 威灵仙 炒蔓荆子
0.339395 0.626764 0.441249 0.65451 0.357298 0.448957 0.351309 0.359056 0.376306 0.342301 0.590013 0.608687 0.572952 0.608219 0.39253 0.785261 0.31214 0.409738 0.416705 0.52718
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.416667, error: 0.750000
134. 
patient tongue id: 05260627200696_1_7_6
label yaofang:
甘草 柴胡 党参 丹参 红花 赤芍 川楝子 乌药 益母草 淫羊藿 仙茅 鹿角霜 醋香附 合欢花 艾叶
0.991778 0.534576 0.665042 0.456635 0.384079 0.315535 0.338855 0.736511 0.636075 0.644625 0.505736 0.546789 0.609167
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.133333, error: 0.846154
135. 
patient tongue id: 02231834456994_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 薄荷 荆芥穗 款冬花 紫菀 百部 炙甘草 广藿香 蜜麻黄
0.383668 0.835006 0.412815 0.912607 0.419321 0.568887 0.38419 0.474409 0.452073 0.412849 0.856274 0.862505 0.826267 0.876824 0.395226 0.942313 0.418409 0.526138 0.582392 0.760676
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
136. 
patient tongue id: 06012000288041_6_1_4
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 远志 枸杞子 白术 泽泻 天麻 蔓荆子 麦芽 首乌藤 沙苑子
0.996622 0.54587 0.700247 0.45829 0.418776 0.326641 0.354091 0.812029 0.691198 0.710491 0.54665 0.609727 0.687767
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
137. 
patient tongue id: 03231226456183_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.365625 0.675241 0.443609 0.747353 0.377664 0.488606 0.340323 0.411571 0.393935 0.372114 0.679754 0.688794 0.661191 0.717886 0.360823 0.818698 0.359486 0.468498 0.495442 0.622928
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
138. 
patient tongue id: 04121326355197_1_4
label yaofang:
茯苓 前胡 桔梗 防风 钩藤 白芷 款冬花 紫菀 百部 炙甘草 辛夷 广藿香 蜜麻黄 炒苍耳子 炒蔓荆子
0.347296 0.642485 0.458132 0.676929 0.378033 0.453323 0.356982 0.39493 0.38239 0.354542 0.625297 0.620007 0.591019 0.624493 0.376894 0.753888 0.329104 0.430259 0.433605 0.551423
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
139. 
patient tongue id: 04052140593562_4_3
label yaofang:
桂枝 陈皮 枳壳 太子参 黄芪 熟地黄 山茱萸 钩藤 天麻 石斛 蝉蜕 佛手 黄精
0.443899 0.387634 0.374403 0.356617 0.31722
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
140. 
patient tongue id: 03012150136198_1_2_4
label yaofang:
甘草 川芎 太子参 黄芪 鸡血藤 酸枣仁 地黄 天麻 白花蛇舌草 地龙 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.972309 0.522226 0.605387 0.479149 0.318146 0.558344 0.534254 0.528948 0.411403 0.434444 0.455252
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
141. 
patient tongue id: 02281210092553_1_6
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 阿胶 五味子 熟地黄 火麻仁 苦参 炙甘草 黑枣
0.66808 0.43971 0.440747 0.375607
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
142. 
patient tongue id: 05191947292297_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 熟地黄 栀子 牡丹皮 山药 菟丝子 桑寄生 女贞子 首乌藤 合欢花 艾叶
0.910346 0.333743 0.480201 0.536316 0.426364 0.377738 0.327796
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
143. 
patient tongue id: 03261558536838_1_3
label yaofang:
半夏 麦冬 枸杞子 酸枣仁 丹参 五味子 钩藤 天麻 三七 桑寄生 豆蔻 北沙参 石榴皮
0.40783 0.367485 0.341064 0.370482 0.365381 0.405424
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
144. 
patient tongue id: 04141824584748_1_4_7
label yaofang:
甘草 党参 黄芪 枸杞子 白术 海螵蛸 杜仲 牛膝 郁金 厚朴 砂仁 菟丝子 鳖甲 莪术 鸡内金 紫苏叶 鲜龙葵果
0.343683 0.326368 0.422023 0.331923 0.329789 0.375461
predicted yaofang:
甘草 法半夏 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.333333, recall: 0.117647, error: 0.666667
145. 
patient tongue id: 04021108132391_1_4
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 党参 浙贝母 山药 砂仁 天麻 鳖甲 皂角刺 紫苏梗 蜈蚣 白花蛇舌 天山雪莲
0.939456 0.503632 0.542759 0.409631 0.453627 0.353062 0.360996
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.857143, recall: 0.375000, error: 0.142857
146. 
patient tongue id: 02212025141620_4_7_6
label yaofang:
甘草 桔梗 连翘 牛蒡子 薏苡仁 浙贝母 天麻 白芷 鳖甲 皂角刺 浮小麦 蜈蚣 半枝莲 红豆杉 龙葵果 广升麻
0.968823 0.519967 0.607057 0.475114 0.351793 0.31664 0.328941 0.601063 0.558996 0.560197 0.447419 0.46408 0.489681
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
147. 
patient tongue id: 03062142384536_1_6_4
label yaofang:
甘草 柴胡 白芍 陈皮 茯苓 半夏 白术 龙眼肉 黄连 山楂 全蝎 鸡内金
0.450553 0.365066 0.409975 0.510608 0.417014 0.306939 0.354179
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
148. 
patient tongue id: 06022246455187_1_4_6
label yaofang:
甘草 陈皮 茯苓 半夏 防风 羌活 党参 杜仲 牛膝 钩藤 天麻 僵蚕 桑寄生 首乌藤 紫苏叶 蜈蚣
0.488708 0.400085 0.376542 0.442078 0.46396 0.321427
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
149. 
patient tongue id: 01132329356228_4
label yaofang:
白芍 远志 太子参 天麻 醋鳖甲 三七粉
0.412683 0.366067 0.349958 0.350036 0.35816 0.414178
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.166667, error: 0.833333
150. 
patient tongue id: 05121841304545_5
label yaofang:
甘草 柴胡 黄芩 葛根 薏苡仁 鱼腥草 蒲公英 黄连 酒川芎 布渣叶 车前草
0.702596 0.448633 0.481267 0.363735 0.537993 0.300328
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
151. 
patient tongue id: 02191229573088_2_5_7
label yaofang:
甘草 黄芩 茯苓 枸杞子 酸枣仁 浙贝母 牡丹皮 山药 山茱萸 桑叶 地黄 泽泻 石斛 建曲 沙苑子 木贼
0.998143 0.547516 0.709289 0.463663 0.408247 0.318422 0.348087 0.841057 0.727204 0.752725 0.587297 0.645502 0.726683
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.250000, error: 0.692308
152. 
patient tongue id: 02191439309511_1_4_7
label yaofang:
甘草 法半夏 茯苓 远志 党参 丹参 黄连 竹茹 胆南星 郁金 天麻 全蝎 莪术 豆蔻 浮小麦
0.990613 0.537616 0.641198 0.470606 0.333575 0.304689 0.650326 0.591133 0.588392 0.461611 0.481046 0.507457
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
153. 
patient tongue id: 04102056113232_4
label yaofang:
甘草 茯苓 柏子仁 肉桂 干姜 砂仁 制川乌 附片
0.407303 0.351892 0.375432 0.381941 0.545463 0.372929
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
154. 
patient tongue id: 01122232481532_1_2
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 山药 地黄 天麻 麦芽 广藿香 蜈蚣 半枝莲 醋鳖甲
0.955227 0.49303 0.588636 0.445406 0.300992 0.52557 0.403791 0.419636 0.309117 0.320733
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.571429, error: 0.200000
155. 
patient tongue id: 02190520261200_1_4_6
label yaofang:
甘草 大枣 茯苓 远志 党参 酸枣仁 生地黄 山药 山茱萸 鳖甲 补骨脂 续断 土鳖虫 牛大力
0.964877 0.524743 0.588854 0.474485 0.301321 0.31187 0.548929 0.495648 0.529628 0.376654 0.39327 0.409036
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
156. 
patient tongue id: 03021315406427_4
label yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.372217 0.753853 0.448777 0.82288 0.401781 0.50404 0.386773 0.427757 0.416264 0.369593 0.761076 0.76368 0.725092 0.772372 0.399769 0.867384 0.363319 0.474431 0.501471 0.658075
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
157. 
patient tongue id: 02212026241597_4_6
label yaofang:
甘草 前胡 酸枣仁 生地黄 牡丹皮 杜仲 天麻 鳖甲 苦杏仁 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.985185 0.528139 0.631399 0.441517 0.357728 0.314857 0.325324 0.66105 0.553672 0.550892 0.434109 0.458061 0.496888
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
158. 
patient tongue id: 03090809433571_6_7
label yaofang:
甘草 川芎 法半夏 茯苓 龙骨 远志 党参 酸枣仁 丹参 胆南星 郁金 石菖蒲 麦芽 首乌藤
0.867761 0.486912 0.548174 0.48443 0.362534 0.384884
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
159. 
patient tongue id: 04071309309172_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.358278 0.697417 0.440407 0.750554 0.396851 0.493465 0.363978 0.412538 0.407719 0.378362 0.693139 0.69531 0.651937 0.696044 0.372726 0.820974 0.361032 0.45868 0.457035 0.601684
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
160. 
patient tongue id: 02120805419233_1_2
label yaofang:
甘草 柴胡 白芍 茯苓 党参 生地黄 山药 车前子 荆芥穗 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲
0.990605 0.534582 0.616915 0.442813 0.325648 0.300935 0.652923 0.550009 0.548024 0.430301 0.441769 0.473441
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
161. 
patient tongue id: 01312048229509_1_3
label yaofang:
桃仁 黄芪 白术 海螵蛸 杜仲 牛膝 当归尾 砂仁 鸡内金 北沙参 紫苏梗 骨碎补 土鳖虫 红豆杉 石上柏 稻芽
0.359127 0.33714 0.599656 0.497707 0.569953
predicted yaofang:
茯苓 半夏 黄芪 白术 北沙参

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
162. 
patient tongue id: 05042045323541_4
label yaofang:
甘草 生地黄 浙贝母 石膏 苍术 细辛 紫苏叶 川木通
0.309001 0.39375 0.522085 0.40486 0.349894 0.322691 0.388623 0.398969 0.305462 0.357944 0.559102 0.615011
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.250000, error: 0.833333
163. 
patient tongue id: 06170914288323_7_6_1
label yaofang:
甘草 柴胡 白芍 茯苓 龙齿 麦冬 黄芪 白术 丹参 郁金 当归尾 珍珠母 麦芽 佛手
0.498957 0.415713 0.420839 0.43542 0.515278 0.326158
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
164. 
patient tongue id: 05161920141572_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.386826 0.880157 0.425534 0.944978 0.443924 0.584984 0.392157 0.510574 0.483689 0.41083 0.899739 0.909717 0.874831 0.918513 0.39384 0.964088 0.429207 0.569513 0.608875 0.808233
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
165. 
patient tongue id: 05231953508528_1_2
label yaofang:
茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.392522 0.893731 0.40203 0.951838 0.443655 0.592294 0.404155 0.503975 0.477378 0.404736 0.911016 0.918507 0.87941 0.923528 0.406873 0.970793 0.417476 0.566511 0.622188 0.818702
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 1.000000, error: 0.400000
166. 
patient tongue id: 06191325531391_1_2
label yaofang:
甘草 茯苓 太子参 鸡血藤 白术 生地黄 浙贝母 山药 鳖甲 补骨脂 北沙参 白花蛇舌 蜂房 岗梅根 四季青
0.933594 0.501047 0.558676 0.422393 0.479057 0.344609 0.375136
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
167. 
patient tongue id: 06141828152611_4
label yaofang:
甘草 桔梗 龙骨 牡蛎 酸枣仁 桑叶 山楂 射干 鸡内金 枇杷叶 苦杏仁 蝉蜕 紫苏叶
0.323606 0.309248 0.30216 0.424393 0.37757 0.43929 0.501767
predicted yaofang:
甘草 陈皮 法半夏 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
168. 
patient tongue id: 04112211287244_1
label yaofang:
当归 茯苓 木香 龙骨 远志 黄芪 白术 酸枣仁 柏子仁 石菖蒲 仙鹤草 蝉蜕 炙甘草
0.326719 0.336301 0.463243 0.306175 0.311556 0.340335 0.379075 0.352672 0.434664 0.533407
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.153846, error: 0.800000
169. 
patient tongue id: 02020834411300_1_6
label yaofang:
甘草 白芍 陈皮 法半夏 茯苓 葛根 木香 蒲公英 党参 白术 山药 砂仁 柿蒂 麦芽
0.958025 0.304212 0.496874 0.574294 0.427513 0.509387 0.381069 0.396766
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
170. 
patient tongue id: 04282256596421_2_6
label yaofang:
甘草 茯苓 远志 党参 鸡血藤 白术 酸枣仁 赤芍 天麻 菟丝子 鳖甲 蜈蚣 天山雪莲 半枝莲 红豆杉
0.991439 0.543366 0.655024 0.456727 0.377576 0.31814 0.336628 0.715115 0.637966 0.629573 0.508759 0.537475 0.579391
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.666667, error: 0.230769
171. 
patient tongue id: 02120828090160_2_6
label yaofang:
甘草 柴胡 白芍 枳壳 党参 延胡索 浙贝母 山药 天麻 五灵脂 鳖甲 诃子 建曲 蜈蚣 白花蛇舌 天山雪莲
0.926329 0.493575 0.531534 0.4281 0.412048 0.317972 0.353225
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
172. 
patient tongue id: 02151839406159_1_4
label yaofang:
甘草 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 香薷 紫菀 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.31766 0.32986 0.458081 0.44292 0.454667 0.309917 0.364381 0.315078 0.305065 0.404129 0.422318 0.404784 0.438689 0.388805 0.610904 0.328275 0.357189
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.470588, recall: 0.571429, error: 0.529412
173. 
patient tongue id: 03221302246306_2_1_6
label yaofang:
甘草 枳壳 茯苓 白术 山药 薤白 天麻 瓜蒌皮 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.993976 0.539664 0.639241 0.476139 0.346958 0.312639 0.699361 0.621629 0.626634 0.485593 0.514844 0.557943
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
174. 
patient tongue id: 03061502517284_1
label yaofang:
大枣 当归 茯苓 木香 远志 党参 黄芪 白术 柏子仁 白芷 蔓荆子 炙甘草
0.335792 0.352869 0.340579 0.311631 0.435474
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
175. 
patient tongue id: 03180107377514_1
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 天麻 白花蛇舌草 炙甘草 百合 紫苏叶
0.364213 0.346334 0.447831 0.310819 0.323174 0.309824 0.368835 0.402361 0.353842 0.413413 0.498534
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
176. 
patient tongue id: 04131816268121_6
label yaofang:
甘草 白芍 桃仁 党参 丹参 生地黄 赤芍 青皮 郁金 天花粉 瓜蒌皮 莪术 王不留行 皂角刺 猫爪草
0.954604 0.510828 0.579905 0.43822 0.30424 0.304637 0.544552 0.456696 0.466321 0.353239 0.365346 0.38434
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
177. 
patient tongue id: 01040009253578_7_5
label yaofang:
甘草 柴胡 枳壳 茯苓 远志 党参 白术 酸枣仁 赤芍 栀子 牡丹皮 郁金 淡豆豉 莪术 麦芽 首乌藤
0.924554 0.310392 0.522192 0.507331 0.422722 0.4085 0.361478 0.381655
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
178. 
patient tongue id: 05262208395203_2_4
label yaofang:
甘草 川芎 前胡 桔梗 浙贝母 牛膝 钩藤 地黄 天麻 益母草 款冬花 麦芽 苦杏仁
0.976412 0.540375 0.596749 0.457873 0.320284 0.570762 0.536035 0.524935 0.425737 0.425146 0.43868
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
179. 
patient tongue id: 02202247302805_5_6
label yaofang:
甘草 黄芩 法半夏 茯苓 薏苡仁 桃仁 远志 细辛 桑白皮 干姜 款冬花 苇茎 苦杏仁 紫苏子 辛夷 炙麻黄
0.979396 0.526721 0.616639 0.452669 0.326369 0.305686 0.605268 0.514969 0.517719 0.394075 0.417047 0.445292
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.125000, error: 0.833333
180. 
patient tongue id: 03012204468651_1_6_2
label yaofang:
甘草 茯苓 党参 白术 杜仲 山药 天麻 槐花 桑寄生 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.966733 0.304742 0.519856 0.576882 0.42089 0.318444 0.30404 0.300592 0.557926 0.482066 0.460133 0.386959 0.382585 0.396374
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.571429, recall: 0.571429, error: 0.428571
181. 
patient tongue id: 05172110352803_1_6
label yaofang:
甘草 川芎 龙骨 羌活 党参 酸枣仁 柏子仁 牛膝 地黄 天麻 全蝎 糯稻根 半枝莲 醋鳖甲
0.921445 0.495791 0.561412 0.442359 0.420822 0.308796 0.364975
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
182. 
patient tongue id: 05182113274928_1_4
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.367496 0.40197 0.316614 0.356033 0.402715 0.319487 0.30029 0.436398
predicted yaofang:
甘草 白芍 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
183. 
patient tongue id: 06190153138023_1_4
label yaofang:
甘草 川芎 茯苓 独活 党参 白术 生地黄 红花 延胡索 牛膝 山药 菟丝子 桑寄生 益母草 秦艽 威灵仙
0.912348 0.345826 0.479506 0.528772 0.437083 0.353953 0.327409
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
184. 
patient tongue id: 02281446049432_6
label yaofang:
枳壳 太子参 白术 柏子仁 黄连 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶 山慈菇
0.350979 0.502358 0.334935 0.305499 0.365319 0.364189 0.324649 0.504843 0.614405
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.153846, error: 0.777778
185. 
patient tongue id: 02231746012860_2_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.395171 0.803654 0.419248 0.881623 0.411089 0.556012 0.387949 0.454968 0.438911 0.412123 0.828531 0.830769 0.797914 0.852194 0.412338 0.911081 0.428738 0.521487 0.582108 0.739958
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
186. 
patient tongue id: 04061954104522_1_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.461448 0.383102 0.382491 0.418137
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
187. 
patient tongue id: 02191429014241_4_6_1
label yaofang:
甘草 茯苓 薏苡仁 党参 山药 砂仁 天麻 鳖甲 扁豆花 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲
0.841056 0.46926 0.509282 0.316504 0.538528 0.373223
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
188. 
patient tongue id: 05140848405914_6
label yaofang:
甘草 茯苓 薏苡仁 党参 鸡血藤 白术 酸枣仁 红花 天麻 桑寄生 鳖甲 续断 蜈蚣 天山雪莲 半枝莲
0.968394 0.506103 0.647262 0.382168 0.370024 0.314744 0.328918 0.644772 0.420229 0.407496 0.322658 0.338192
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
189. 
patient tongue id: 05201512412021_6_7_1
label yaofang:
甘草 茯苓 木香 薏苡仁 党参 赤芍 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 红豆杉 鱼古 瓦楞子 姜黄
0.966049 0.533403 0.566039 0.438246 0.499509 0.443098 0.43411 0.342021 0.325965 0.314034
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
190. 
patient tongue id: 01211230117926_2_1_7
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 牡丹皮 干姜 天花粉 炙甘草 猫爪草 风栗壳 石见穿
0.621754 0.396948 0.485959 0.343431 0.40771 0.300102
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.166667, recall: 0.066667, error: 0.833333
191. 
patient tongue id: 03230722168819_6_5_2
label yaofang:
甘草 白芍 川芎 法半夏 茯苓 麦冬 白术 酸枣仁 生地黄 牡丹皮 苍术 天麻 僵蚕 磁石 蒺藜 浮小麦
0.988637 0.541067 0.647299 0.486274 0.605716 0.567504 0.567554 0.42558 0.448492 0.472067
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
192. 
patient tongue id: 03302013477513_1_6
label yaofang:
甘草 茯苓 半夏 黄芪 白术 丹参 黄连 杜仲 郁金 僵蚕 莪术 麦芽 北沙参 紫苏叶 蜈蚣 合欢皮 预知子
0.390809 0.392277 0.323077 0.539825 0.5109 0.307882 0.47764
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.714286, recall: 0.294118, error: 0.285714
193. 
patient tongue id: 04282308231656_2_6
label yaofang:
甘草 白芍 茯苓 太子参 酸枣仁 知母 地黄 天麻 白花蛇舌草 浮小麦 首乌藤 建曲 蜈蚣 半枝莲 醋鳖甲
0.940001 0.500385 0.59311 0.464688 0.470488 0.414543 0.44239 0.311818 0.332133
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.555556, recall: 0.333333, error: 0.444444
194. 
patient tongue id: 06111043050997_1_2
label yaofang:
甘草 木香 党参 丹参 五味子 山药 水蛭 砂仁 菟丝子 益母草 猪苓 茵陈 虎杖 麦芽
0.987382 0.526917 0.632563 0.452991 0.341151 0.304462 0.640407 0.563087 0.556194 0.434639 0.457959 0.49431
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
195. 
patient tongue id: 05262217595901_4_1_6
label yaofang:
甘草 枳壳 法半夏 党参 郁金 薤白 砂仁 天麻 瓜蒌皮 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.987115 0.532575 0.639141 0.47215 0.357714 0.308235 0.323624 0.656263 0.590397 0.584819 0.463323 0.490641 0.524014
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.533333, error: 0.384615
196. 
patient tongue id: 03101740290818_2_4
label yaofang:
法半夏 茯苓 前胡 太子参 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 广藿香 麸炒白术 炒六神曲
0.315598 0.475524 0.451695 0.45061 0.328173 0.310799 0.302984 0.39292 0.3842 0.375798 0.41658 0.418336 0.611512 0.300199
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.714286, recall: 0.714286, error: 0.285714
197. 
patient tongue id: 06111051532762_1_5
label yaofang:
甘草 防风 金银花 党参 黄芪 白术 五味子 红花 石膏 水牛角 荆芥穗 麦芽 白鲜皮 地肤子
0.92223 0.313668 0.47893 0.561184 0.406676 0.477607 0.321841 0.35883
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
198. 
patient tongue id: 02202223187827_7_4
label yaofang:
甘草 川芎 茯苓 桔梗 桃仁 红花 赤芍 青蒿 五灵脂 银柴胡 决明子 浮小麦 建曲 威灵仙
0.961031 0.318336 0.520567 0.555898 0.418159 0.541669 0.455908 0.450383 0.361434 0.350123 0.358768
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
199. 
patient tongue id: 05242228238885_1_6_4
label yaofang:
甘草 法半夏 茯苓 羌活 党参 白术 酸枣仁 天麻 鳖甲 威灵仙 蜈蚣 天山雪莲 半枝莲 红豆杉
0.932259 0.30407 0.484692 0.555743 0.44407 0.452947 0.339486 0.382312
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.875000, recall: 0.500000, error: 0.125000
200. 
patient tongue id: 06191158228686_7_4
label yaofang:
甘草 川芎 桔梗 防风 羌活 白术 赤芍 浙贝母 牛膝 细辛 荆芥穗 天麻 白芷 蔓荆子 粉葛
0.914794 0.323149 0.509567 0.532204 0.429419 0.412766 0.345587 0.364682
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
201. 
patient tongue id: 03040852019318_6_1
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉
0.984068 0.536379 0.623538 0.451791 0.341906 0.304984 0.31229 0.633221 0.580322 0.563152 0.46029 0.47624 0.50056
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.750000, error: 0.307692
202. 
patient tongue id: 06190800459646_4_1
label yaofang:
桂枝 甘草 白芍 川芎 党参 白术 红花 赤芍 地黄 僵蚕 桑寄生 桑枝 骨碎补 乌梢蛇 络石藤
0.988886 0.541471 0.64748 0.45542 0.363446 0.311527 0.694884 0.588048 0.595239 0.465558 0.494969 0.543638
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
203. 
patient tongue id: 05222109198156_4_1_7
label yaofang:
陈皮 茯苓 半夏 牡蛎 黄芪 白术 丹参 砂仁 苦杏仁 合欢皮 牛大力 墨旱莲
0.479072 0.397629 0.398822 0.52161 0.561305 0.322012 0.408412
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
204. 
patient tongue id: 05272345494049_4_1_6
label yaofang:
黄芪 白术 砂仁 桑寄生 莲子 白鲜皮 续断 橘络 首乌藤 土鳖虫 红豆杉 合欢皮 山慈菇
0.389766 0.409218 0.323033 0.431638 0.397947 0.379896
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
205. 
patient tongue id: 02131317268245_1_4_7
label yaofang:
甘草 柴胡 黄芩 法半夏 防风 金银花 薏苡仁 党参 白芷 白前 辛夷 干鱼腥草
0.561945 0.361393 0.44256
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.666667, recall: 0.166667, error: 0.333333
206. 
patient tongue id: 01132142541437_1_6
label yaofang:
甘草 党参 生地黄 杜仲 山药 山茱萸 天麻 鳖甲 续断 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.960802 0.50761 0.580109 0.447282 0.300207 0.522213 0.436765 0.445457 0.331684 0.33882 0.353209
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
207. 
patient tongue id: 01192130569170_6_2_4
label yaofang:
甘草 葛根 党参 鸡血藤 赤芍 山药 天麻 吴茱萸 白花蛇舌草 建曲 蜈蚣 半枝莲 醋鳖甲 乌梢蛇
0.803026 0.482562 0.509533 0.458199 0.357363 0.34501
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
208. 
patient tongue id: 02211359023524_1_2_7
label yaofang:
甘草 麦冬 太子参 枸杞子 玄参 生地黄 牡丹皮 知母 山药 天麻 天花粉 北沙参 黄精
0.519755 0.405987 0.437291 0.422051 0.39849
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
209. 
patient tongue id: 03101935570478_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.370293 0.857948 0.436895 0.91573 0.426218 0.553537 0.392476 0.477489 0.452895 0.380986 0.864019 0.873584 0.820374 0.873477 0.407832 0.95188 0.362835 0.523074 0.567479 0.754001
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
210. 
patient tongue id: 01122340349168_5_6
label yaofang:
甘草 川芎 茯苓 党参 黄连 生地黄 赤芍 川楝子 牛膝 细辛 天麻 僵蚕 白芷 桑寄生 益母草
0.953549 0.51191 0.544158 0.42602 0.461485 0.355738 0.372466
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
211. 
patient tongue id: 02241428006805_4_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草
0.375392 0.539403 0.393561 0.300398 0.330207 0.337627 0.378341 0.559244 0.670992
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
212. 
patient tongue id: 04282219396447_2_5
label yaofang:
甘草 柴胡 白芍 茯苓 桃仁 党参 栀子 牡丹皮 山药 山茱萸 鳖甲 茵陈 虎杖 土鳖虫 鹿衔草
0.744679 0.313731 0.443023 0.434841 0.40752
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
213. 
patient tongue id: 06070640249717_5_6
label yaofang:
甘草 柴胡 白芍 龙骨 薏苡仁 远志 黄连 天麻 鳖甲 浮小麦 蜈蚣 天山雪莲 合欢花 半枝莲 广金钱草
0.828114 0.312147 0.466539 0.505795 0.417778 0.353908
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
214. 
patient tongue id: 05140835033106_6_2_1
label yaofang:
甘草 川芎 远志 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.999111 0.574359 0.711943 0.457691 0.37363 0.309635 0.823913 0.72572 0.732618 0.565352 0.602649 0.665711
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
215. 
patient tongue id: 05222049530901_7_5_1
label yaofang:
甘草 黄芪 白术 海螵蛸 砂仁 三七 桑寄生 火麻仁 鸡内金 北沙参 首乌藤 紫苏梗 瓦楞子 合欢皮
0.441119 0.369325 0.360119 0.571564 0.582423 0.3601 0.302054 0.439672
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
216. 
patient tongue id: 04201952394364_1_2
label yaofang:
甘草 防风 金银花 红花 水牛角 荆芥穗 天麻 鳖甲 火麻仁 麦芽 白鲜皮 地肤子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.990819 0.534891 0.659387 0.458875 0.394744 0.327527 0.344027 0.744255 0.648955 0.66306 0.522497 0.564835 0.628261
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.437500, error: 0.461538
217. 
patient tongue id: 03200652043789_4
label yaofang:
甘草 法半夏 茯苓 薏苡仁 细辛 天麻 款冬花 莪术 诃子 白花蛇舌草 地龙 紫苏梗 蜈蚣 醋鳖甲
0.984864 0.528728 0.616619 0.461024 0.325087 0.61095 0.561577 0.556138 0.435569 0.44829 0.471516
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
218. 
patient tongue id: 03151942236274_1_4_2
label yaofang:
桂枝 当归 薏苡仁 黄芪 鸡血藤 白术 海螵蛸 厚朴 生半夏 砂仁 鸡内金 土茯苓 稻芽 红参
0.380767 0.39916 0.322393 0.526909 0.452973 0.482809
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
219. 
patient tongue id: 04072001175511_5
label yaofang:
白芍 龙齿 麦冬 太子参 枸杞子 酸枣仁 升麻 野菊花 决明子 珍珠母 夏枯草 百合 五指毛桃
0.507063 0.303864 0.415833 0.343514 0.413661 0.411346 0.336314
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
220. 
patient tongue id: 05131434370866_4_6
label yaofang:
甘草 法半夏 桔梗 桃仁 鱼腥草 远志 浙贝母 细辛 天麻 鳖甲 款冬花 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.904859 0.488519 0.575404 0.410035 0.308832 0.311324 0.5121 0.333265 0.366353
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.444444, recall: 0.250000, error: 0.555556
221. 
patient tongue id: 03020722409937_1_7
label yaofang:
甘草 黄芪 酸枣仁 红花 赤芍 山楂 天麻 肉苁蓉 桑寄生 麦芽 地龙 谷芽 乌梢蛇 炒鸡内金
0.972291 0.520652 0.624692 0.479745 0.338135 0.300633 0.329795 0.616588 0.561121 0.573621 0.442668 0.469141 0.495994
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
222. 
patient tongue id: 05112027139116_1_5_7
label yaofang:
牡蛎 薏苡仁 黄芪 白术 黄连 赤芍 郁金 砂仁 茵陈 莪术 鸡内金 红豆杉 预知子 稻芽
0.629769 0.489827 0.42061 0.301048 0.405084
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
223. 
patient tongue id: 05032112400317_1_4_6
label yaofang:
陈皮 桔梗 太子参 鸡血藤 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 葫芦茶
0.374582 0.391751 0.331048 0.367711 0.350472 0.306334 0.446007
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
224. 
patient tongue id: 04300900263194_5
label yaofang:
甘草 荆芥 金银花 蒲公英 紫花地丁 白术 丹参 浙贝母 地黄 紫草 麦芽 皂角刺 白鲜皮 地肤子
0.984857 0.512985 0.659976 0.44488 0.378221 0.318592 0.329042 0.696032 0.561739 0.57491 0.433112 0.474263 0.53508
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.142857, error: 0.846154
225. 
patient tongue id: 05161932161591_1_4
label yaofang:
陈皮 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香 蜜麻黄
0.393626 0.893578 0.408055 0.952695 0.440433 0.596495 0.408964 0.509832 0.485005 0.413755 0.912242 0.919541 0.884298 0.926036 0.41713 0.970039 0.427709 0.572265 0.635452 0.823856
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
226. 
patient tongue id: 03012057254423_5_6
label yaofang:
甘草 陈皮 法半夏 茯苓 远志 党参 酸枣仁 丹参 黄连 胆南星 石菖蒲 天麻 地龙 首乌藤
0.991827 0.535962 0.655142 0.440736 0.392309 0.328987 0.340812 0.729754 0.618608 0.617176 0.498202 0.524191 0.569116
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
227. 
patient tongue id: 04121300101271_4
label yaofang:
陈皮 法半夏 前胡 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.397654 0.923076 0.414389 0.968798 0.464704 0.604489 0.421513 0.535228 0.500612 0.402355 0.936616 0.943702 0.909369 0.946197 0.415014 0.980291 0.427071 0.590956 0.650186 0.852603
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 1.000000, error: 0.350000
228. 
patient tongue id: 03311619563889_6_7
label yaofang:
甘草 半夏 橘红 牡蛎 薏苡仁 党参 白术 浙贝母 鸡内金 浮小麦 黑枣 合欢皮 墨旱莲
0.551978 0.396118 0.446172 0.304064 0.339124
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
229. 
patient tongue id: 02110746413439_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.613322 0.438022 0.42245 0.358422
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.230769, error: 0.250000
230. 
patient tongue id: 05111924494952_2
label yaofang:
枸杞子 白术 丹参 赤芍 浙贝母 牡丹皮 山药 厚朴 山楂 砂仁 天麻 僵蚕 北沙参 炙甘草 百合 紫苏叶 合欢皮 蛇舌草 岗梅
0.458018 0.377983 0.388808 0.544824 0.610588 0.325886 0.359067 0.322412 0.382817 0.305084
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.500000, recall: 0.263158, error: 0.500000
231. 
patient tongue id: 03221615435248_6_5
label yaofang:
麻黄 甘草 陈皮 法半夏 茯苓 桃仁 黄柏 桑白皮 厚朴 款冬花 射干 地龙 苦杏仁 紫苏子 五倍子 紫苏梗
0.977026 0.519966 0.596816 0.441716 0.303536 0.559464 0.505509 0.490919 0.385615 0.392597 0.409746
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
232. 
patient tongue id: 02142337588099_8_5
label yaofang:
甘草 防风 金银花 白术 红花 牡丹皮 水牛角 荆芥穗 火麻仁 百部 麦芽 白鲜皮 地肤子
0.964 0.302871 0.507587 0.554581 0.425668 0.489281 0.396496 0.398883 0.301293
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.222222, recall: 0.153846, error: 0.777778
233. 
patient tongue id: 01172354588540_1_2
label yaofang:
茯苓 薏苡仁 党参 黄芪 杜仲 山药 巴戟天 芡实 莲子
0.375839 0.392872 0.318157 0.36922 0.306441
predicted yaofang:
甘草 茯苓 党参 黄芪 北沙参

------Score: precision: 0.600000, recall: 0.333333, error: 0.400000
234. 
patient tongue id: 04150711552399_4_7_6
label yaofang:
甘草 川芎 茯苓 薏苡仁 党参 黄连 生地黄 赤芍 山药 补骨脂 浮小麦 白花蛇舌 土鳖虫
0.980164 0.525916 0.624575 0.49682 0.314601 0.308158 0.564522 0.558466 0.55159 0.42657 0.444277 0.456071
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
235. 
patient tongue id: 04192234395911_6_2
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 天麻 鳖甲 款冬花 白前 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.949133 0.514482 0.579105 0.443961 0.490431 0.415589 0.417928 0.302951 0.305935 0.302252
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
236. 
patient tongue id: 04300909341453_5
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 黄连 苍术 山药 厚朴 菟丝子 益母草 豆蔻 合欢花 麸炒枳壳
0.976432 0.520776 0.615818 0.475393 0.336904 0.321335 0.597668 0.541847 0.54458 0.424718 0.454429 0.483538
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
237. 
patient tongue id: 02252115452588_5_6
label yaofang:
甘草 枳壳 薏苡仁 蒲公英 白术 厚朴 天麻 鳖甲 补骨脂 三棱 蜈蚣 天山雪莲 半枝莲 红豆杉
0.924722 0.483385 0.551053 0.454028 0.461238 0.317324 0.377417
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
238. 
patient tongue id: 03061506533188_6
label yaofang:
甘草 柴胡 川芎 香附 防风 赤芍 荆芥穗 白芷 蔓荆子 续断 郁李仁 芥子
0.327659 0.400873 0.336235 0.386749 0.336007 0.302427 0.474786
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
239. 
patient tongue id: 06191151002359_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 桃仁 远志 五味子 浙贝母 细辛 干姜 款冬花 苦杏仁 炙麻黄
0.964209 0.514787 0.622091 0.467251 0.33498 0.319274 0.567187 0.499896 0.513745 0.372718 0.39927 0.420107
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
240. 
patient tongue id: 05032116526318_1_2
label yaofang:
白芍 川芎 葛根 独活 黄芪 细辛 干姜 川牛膝 炙甘草 蜈蚣 姜黄 海桐皮 鹿衔草
0.318379 0.389148 0.524302 0.394883 0.333773 0.323907 0.385315 0.380161 0.304452 0.345863 0.547264 0.61189
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
241. 
patient tongue id: 04131849529759_1_7
label yaofang:
甘草 枳壳 茯苓 龙骨 薏苡仁 黄芪 白术 黄连 海螵蛸 杜仲 泽泻 厚朴 莪术 麦芽 合欢皮 蛇舌草 荔枝核
0.878117 0.483247 0.563624 0.352881 0.578967 0.300046 0.31688 0.475682
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.235294, error: 0.500000
242. 
patient tongue id: 06091956252385_1_4_6
label yaofang:
甘草 半夏 牡蛎 黄芪 阿胶 白术 海螵蛸 杜仲 牛膝 山药 菊花 白茅根 芡实 鸡内金 北沙参 百合 紫苏梗 玉米须 蜈蚣 骨碎补 红豆杉 预知子
0.630566 0.410693 0.468567 0.370781 0.522382
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.136364, error: 0.400000
243. 
patient tongue id: 02191255253650_4_6
label yaofang:
甘草 黄芩 前胡 桔梗 浙贝母 细辛 天麻 鳖甲 白前 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.98778 0.527027 0.625683 0.429468 0.33721 0.302691 0.313147 0.643002 0.538968 0.524883 0.411355 0.43734 0.467228
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
244. 
patient tongue id: 06072249163764_1_4
label yaofang:
甘草 桔梗 独活 芦根 薏苡仁 白术 浙贝母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.996216 0.550406 0.676277 0.462709 0.406255 0.329287 0.347799 0.789563 0.683484 0.695825 0.552192 0.594236 0.660545
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
245. 
patient tongue id: 03231117500690_2_7_4
label yaofang:
甘草 枳壳 法半夏 大枣 茯苓 连翘 薏苡仁 葶苈子 细辛 桑白皮 莱菔子 款冬花 白芥子 苇茎 苦杏仁 紫苏子
0.831683 0.468284 0.538374 0.316598 0.566658 0.379525
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
246. 
patient tongue id: 06031048391762_1_7_6
label yaofang:
甘草 茯苓 前胡 金银花 远志 浙贝母 细辛 天麻 鳖甲 款冬花 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.956321 0.517964 0.591257 0.432739 0.328403 0.304834 0.303896 0.555025 0.487009 0.465847 0.38129 0.387577 0.400132
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
247. 
patient tongue id: 05131555385714_1_2_5
label yaofang:
甘草 柴胡 当归 薏苡仁 党参 黄芪 红花 赤芍 熟地黄 天麻 败酱草 皂角刺 女贞子 广升麻 墨旱莲
0.834683 0.463713 0.523382 0.493278 0.304983 0.330536
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
248. 
patient tongue id: 03230725352245_6_2_7
label yaofang:
甘草 柴胡 白芍 香附 木香 生地黄 延胡索 赤芍 山药 砂仁 天花粉 五灵脂 瓜蒌皮 麦芽 皂角刺 合欢花
0.988844 0.536613 0.650615 0.453346 0.370613 0.31154 0.322645 0.694174 0.614427 0.609579 0.495892 0.521722 0.561903
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.187500, error: 0.769231
249. 
patient tongue id: 01192218022805_7_1
label yaofang:
甘草 牡丹皮 杜仲 黄柏 知母 山茱萸 地黄 天麻 桑寄生 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 骨碎补
0.959814 0.530238 0.552315 0.47634 0.447437 0.472232 0.494876 0.351316 0.336621 0.333281
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
250. 
patient tongue id: 04102037040759_6
label yaofang:
甘草 枳壳 桔梗 黄芪 白术 枳实 槟榔 厚朴 肉苁蓉 火麻仁 紫菀 郁李仁
0.41057 0.370901 0.354875 0.363524 0.354819 0.436006
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
251. 
patient tongue id: 06171152162574_4
label yaofang:
麻黄 白芍 前胡 半夏 防风 太子参 黄芪 白术 细辛 干姜 紫菀 紫苏子 炙甘草 辛夷 广藿香
0.380367 0.789636 0.424931 0.870855 0.415878 0.539556 0.379925 0.465118 0.447745 0.397413 0.812557 0.821586 0.778594 0.830228 0.385268 0.912925 0.399427 0.511824 0.533313 0.70733
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.600000, error: 0.550000
252. 
patient tongue id: 02111346154633_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 黄精
0.751386 0.447078 0.448851 0.369231
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
253. 
patient tongue id: 03012048349617_2
label yaofang:
甘草 麦冬 太子参 生地黄 浙贝母 山药 山茱萸 鳖甲 辛夷 苍耳子 白花蛇舌 天山雪莲 蜂房 四季青
0.963731 0.512485 0.577658 0.428084 0.531284 0.441969 0.434512 0.335125 0.343042 0.354583
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
254. 
patient tongue id: 01051903009901_1_5
label yaofang:
法半夏 前胡 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.402282 0.851308 0.402483 0.92515 0.43406 0.580973 0.407104 0.493439 0.475031 0.419751 0.87633 0.883602 0.84919 0.895702 0.421516 0.949451 0.442307 0.545554 0.609673 0.787369
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
255. 
patient tongue id: 03221323433079_6_4
label yaofang:
甘草 法半夏 茯苓 桔梗 远志 浙贝母 天麻 鳖甲 扁豆花 诃子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 木棉花
0.98968 0.534202 0.636476 0.453855 0.361106 0.313081 0.324306 0.69113 0.591109 0.595017 0.468288 0.493201 0.534747
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.533333, error: 0.384615
256. 
patient tongue id: 05162045203884_5_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 黄柏 郁金 山药 厚朴 砂仁 豆蔻 苦杏仁 紫苏梗 广藿香 白花蛇舌
0.972287 0.525676 0.594958 0.447755 0.333579 0.314535 0.327003 0.603258 0.530145 0.529303 0.425845 0.438049 0.459627
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
257. 
patient tongue id: 02212215372723_1_6
label yaofang:
甘草 独活 党参 白术 杜仲 细辛 地黄 天麻 桑寄生 忍冬藤 续断 蜈蚣 半枝莲 醋鳖甲
0.991268 0.54271 0.621595 0.45032 0.320555 0.634094 0.575033 0.562058 0.451751 0.456308 0.480079
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
258. 
patient tongue id: 04291506135523_6_4_2
label yaofang:
甘草 茯苓 龙骨 远志 酸枣仁 知母 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.997598 0.553653 0.708141 0.459513 0.415322 0.321289 0.355524 0.825996 0.701241 0.718991 0.55767 0.620134 0.700312
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
259. 
patient tongue id: 04210356231584_2_6_4
label yaofang:
甘草 法半夏 茯苓 前胡 桃仁 酸枣仁 浙贝母 细辛 天麻 白花蛇舌草 苦杏仁 蜈蚣 半枝莲 醋鳖甲
0.961222 0.517247 0.575475 0.421855 0.555785 0.444838 0.456251 0.342541 0.347814 0.368829
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
260. 
patient tongue id: 01101812305293_2
label yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.350152 0.383211 0.303771
predicted yaofang:
茯苓 黄芪 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
261. 
patient tongue id: 03151859004925_6_1
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 瓦楞子
0.326081 0.372462 0.513447 0.370102 0.32066 0.323749 0.38001 0.368435 0.34132 0.519887 0.599786
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.636364, recall: 0.583333, error: 0.363636
262. 
patient tongue id: 06071922405605_6_7
label yaofang:
甘草 黄芩 半夏 枸杞子 生地黄 红花 赤芍 海螵蛸 牡丹皮 杜仲 莪术 续断 赭石
0.641803 0.453196 0.364208 0.321524 0.472311
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
263. 
patient tongue id: 04131845026619_1_7
label yaofang:
甘草 半夏 木香 龙骨 薏苡仁 白术 赤芍 海螵蛸 杜仲 郁金 厚朴 砂仁 莪术 续断 合欢皮 预知子 蛇舌草
0.687157 0.422874 0.477878 0.453385 0.59793 0.312189 0.320654
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 砂仁 蜈蚣

------Score: precision: 0.428571, recall: 0.176471, error: 0.571429
264. 
patient tongue id: 02241439135245_4
label yaofang:
甘草 防风 何首乌 熟地黄 牡丹皮 乌梅 珍珠母 蝉蜕 白鲜皮 地肤子 徐长卿
0.394769 0.334893 0.433228 0.31108 0.328451 0.363922 0.410014 0.33128 0.363852 0.478754
predicted yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.100000, recall: 0.090909, error: 0.900000
265. 
patient tongue id: 02120809383432_1_4
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 酸枣仁 知母 郁金 山药 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲
0.988179 0.534638 0.620683 0.464197 0.311116 0.604822 0.537989 0.531122 0.408104 0.419676 0.436587
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
266. 
patient tongue id: 04111958094040_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.382407 0.861897 0.418479 0.927654 0.420456 0.575734 0.389546 0.488585 0.468301 0.412553 0.878589 0.887904 0.849404 0.896783 0.397761 0.95729 0.412384 0.541727 0.601542 0.786009
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.923077, error: 0.400000
267. 
patient tongue id: 03151816189692_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.478181 0.382945 0.459129 0.518943 0.438544 0.307379 0.346408
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
268. 
patient tongue id: 06181858106239_5
label yaofang:
甘草 党参 白术 红花 杜仲 天麻 桑寄生 鳖甲 忍冬藤 蜈蚣 天山雪莲 半枝莲 牛大力 千斤拔
0.866413 0.305003 0.465501 0.515183 0.412908 0.344305
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
269. 
patient tongue id: 03152048311128_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.574144 0.372417 0.348571 0.585124 0.533083 0.54462 0.564014 0.566156 0.566674 0.576762 0.428532 0.56675 0.566727 0.612226
predicted yaofang:
桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.142857, recall: 0.153846, error: 0.857143
270. 
patient tongue id: 05140635035940_1_2_6
label yaofang:
甘草 白芍 太子参 生地黄 红花 赤芍 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤
0.991087 0.530054 0.665481 0.456081 0.390495 0.317464 0.320301 0.727332 0.622876 0.629534 0.488614 0.529885 0.590107
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
271. 
patient tongue id: 06181852205852_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 连翘 党参 黄芪 白术 黄连 乌梅 山药 车前子 干姜 莱菔子 白扁豆 建曲 广升麻
0.996413 0.553861 0.686189 0.463877 0.378259 0.309873 0.333424 0.759911 0.675468 0.674488 0.528335 0.567815 0.617981
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.277778, error: 0.615385
272. 
patient tongue id: 03020842548696_1_6
label yaofang:
甘草 远志 党参 酸枣仁 天麻 秦艽 鳖甲 白花蛇舌草 浮小麦 蜈蚣 天山雪莲 半枝莲 龟甲
0.995364 0.551263 0.676038 0.45815 0.393066 0.316627 0.346928 0.774401 0.670338 0.676773 0.537318 0.578709 0.64194
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.615385, error: 0.384615
273. 
patient tongue id: 02191437207816_5_6_7
label yaofang:
甘草 黄芩 茯苓 桔梗 牛蒡子 桃仁 白术 酸枣仁 玄参 浙贝母 牡丹皮 菟丝子 益母草 威灵仙
0.979432 0.529602 0.593021 0.461122 0.31322 0.316062 0.584462 0.543084 0.534623 0.433782 0.439372 0.454793
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
274. 
patient tongue id: 04200046451932_6_2
label yaofang:
甘草 白芍 陈皮 木香 防风 连翘 党参 白术 山药 车前子 白扁豆 粉葛 建曲
0.908376 0.311416 0.491271 0.530441 0.435544 0.357337 0.324339 0.335467
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
275. 
patient tongue id: 02171855235107_4
label yaofang:
甘草 防风 黄芪 细辛 荆芥穗 白芷 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术
0.378142 0.847792 0.421347 0.913279 0.422149 0.5579 0.379869 0.473023 0.448174 0.392066 0.862199 0.870528 0.8266 0.877349 0.392913 0.942505 0.392398 0.520202 0.572965 0.760307
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.454545, error: 0.750000
276. 
patient tongue id: 02120813557638_1_7
label yaofang:
甘草 独活 党参 延胡索 杜仲 地黄 天麻 桑寄生 白花蛇舌草 威灵仙 蜈蚣 半枝莲 醋鳖甲 骨碎补 牛大力
0.989984 0.546711 0.62604 0.48848 0.313392 0.6386 0.588978 0.596085 0.448313 0.461067 0.475706
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
277. 
patient tongue id: 04201850139171_1_2_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.376377 0.859243 0.418212 0.923122 0.418469 0.563006 0.372541 0.480116 0.457851 0.386481 0.874474 0.884271 0.840042 0.890445 0.387922 0.952931 0.384716 0.535623 0.576373 0.770651
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
278. 
patient tongue id: 03101847268894_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 干姜 豆蔻 姜半夏 炙甘草 紫苏梗
0.321994 0.380833 0.33268 0.309189 0.336284 0.459909 0.423138 0.454543
predicted yaofang:
甘草 白芍 枳壳 茯苓 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.500000, recall: 0.363636, error: 0.500000
279. 
patient tongue id: 03292043443064_1_4
label yaofang:
陈皮 前胡 半夏 防风 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香 苍耳子
0.359375 0.696116 0.43884 0.757332 0.390411 0.493 0.365346 0.408891 0.404947 0.371435 0.697341 0.696076 0.662493 0.702864 0.379833 0.821092 0.362065 0.454547 0.459929 0.600248
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
280. 
patient tongue id: 04201858525959_4
label yaofang:
陈皮 茯苓 前胡 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄
0.381684 0.853264 0.416421 0.927875 0.429604 0.576859 0.392838 0.491805 0.466825 0.417838 0.876418 0.883295 0.851647 0.896094 0.392217 0.952715 0.433899 0.548857 0.602368 0.786174
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 1.000000, error: 0.400000
281. 
patient tongue id: 04172212191990_6_2
label yaofang:
陈皮 枳壳 茯苓 党参 黄芪 白术 砂仁 莱菔子 鸡内金 佛手 紫苏梗
0.637031 0.429803 0.471343 0.428069
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.272727, error: 0.250000
282. 
patient tongue id: 05032256029190_7_1
label yaofang:
甘草 党参 生地黄 延胡索 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力 千斤拔
0.99993 0.597839 0.795132 0.465816 0.441647 0.300058 0.33417 0.93727 0.834789 0.864548 0.665341 0.741982 0.843966
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
283. 
patient tongue id: 03231102369038_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.396603 0.922019 0.37743 0.970976 0.442037 0.635142 0.391942 0.534465 0.505469 0.433015 0.939428 0.946924 0.916836 0.951865 0.39007 0.983596 0.454503 0.59276 0.650825 0.859657
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
284. 
patient tongue id: 01111904284190_1_4
label yaofang:
甘草 陈皮 茯苓 佩兰 豆蔻 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶 炒稻芽 炒麦芽
0.396184 0.937141 0.381951 0.97836 0.446831 0.633895 0.396374 0.517733 0.489505 0.41081 0.952551 0.956266 0.929961 0.962772 0.403677 0.986058 0.442107 0.601491 0.667403 0.875935
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.230769, error: 0.850000
285. 
patient tongue id: 04221843524752_1
label yaofang:
白芍 川芎 大枣 当归 党参 太子参 黄芪 枸杞子 熟地黄 炙甘草 续断 麸炒白术 盐菟丝子 酒女贞子
0.39601 0.920701 0.397465 0.970586 0.445699 0.622564 0.415666 0.526469 0.498956 0.420818 0.938891 0.945442 0.917826 0.950846 0.425382 0.980748 0.457662 0.588929 0.65698 0.857177
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.142857, error: 0.900000
286. 
patient tongue id: 02191221430931_4_1
label yaofang:
甘草 茯苓 党参 白术 丹参 天麻 鳖甲 补骨脂 扁豆花 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.829879 0.318341 0.316171 0.480749 0.460811 0.371006
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
287. 
patient tongue id: 04192241350389_2_6
label yaofang:
甘草 香附 党参 酸枣仁 丹参 青皮 浙贝母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.922291 0.316488 0.499049 0.510033 0.416756 0.366675 0.301323 0.326201
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
288. 
patient tongue id: 01092042185837_6_4
label yaofang:
甘草 独活 酸枣仁 生地黄 杜仲 山药 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜
0.926546 0.489151 0.548502 0.582931 0.469564
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
289. 
patient tongue id: 01041641519556_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗
0.42218 0.372398 0.399482 0.322549 0.366717
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
290. 
patient tongue id: 02120937134578_6
label yaofang:
甘草 柴胡 白芍 黄芩 当归 茯苓 党参 白术 丹参 熟地黄 益母草 淫羊藿 合欢花 麸炒枳壳
0.976913 0.530591 0.601484 0.475037 0.32485 0.300841 0.583514 0.524424 0.525178 0.413726 0.423446 0.440889
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
291. 
patient tongue id: 02201305480823_6
label yaofang:
桂枝 川芎 葛根 独活 赤芍 海螵蛸 细辛 川牛膝 炙甘草 蜈蚣 姜黄 海桐皮 鹿衔草
0.397418 0.534168 0.425936 0.347529 0.35909 0.410504 0.38865 0.598252 0.675935
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.153846, error: 0.777778
292. 
patient tongue id: 04260311123007_2_6
label yaofang:
甘草 党参 丹参 生地黄 浙贝母 郁金 山茱萸 天花粉 瓜蒌皮 款冬花 紫菀 王不留行 枇杷叶 苦杏仁
0.966436 0.525231 0.599286 0.444851 0.326457 0.305373 0.30894 0.566066 0.507121 0.496381 0.402568 0.405329 0.421489
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
293. 
patient tongue id: 05102017330846_1
label yaofang:
陈皮 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.364868 0.866596 0.428195 0.933512 0.410553 0.558597 0.381004 0.473758 0.445996 0.393524 0.883085 0.887621 0.855654 0.899917 0.392161 0.955832 0.393754 0.537711 0.594946 0.785226
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.916667, error: 0.450000
294. 
patient tongue id: 01200658109438_1_2_4
label yaofang:
甘草 前胡 桔梗 浙贝母 细辛 天麻 鳖甲 款冬花 白前 诃子 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.966899 0.518204 0.590609 0.453735 0.504753 0.382611 0.426615
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
295. 
patient tongue id: 05022101393382_6_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 黄连 胆南星 牛膝 山药 细辛 瓜蒌皮 王不留行 麸炒枳壳
0.938643 0.305524 0.498829 0.526929 0.423961 0.406885 0.317969 0.331331
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
296. 
patient tongue id: 02122229191206_6_7
label yaofang:
甘草 川芎 远志 赤芍 牛膝 山茱萸 细辛 天麻 全蝎 菟丝子 莪术 金樱子 蛇床子 麦芽 覆盆子
0.982984 0.524185 0.610762 0.454616 0.310463 0.302663 0.59825 0.504715 0.509221 0.378452 0.401356 0.423884
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
297. 
patient tongue id: 04130904167793_2_4
label yaofang:
甘草 茯苓 桔梗 橘红 太子参 浙贝母 山药 鳖甲 紫菀 白花蛇舌 蜂房 岗梅根 四季青
0.961542 0.509544 0.59151 0.454093 0.304513 0.553532 0.465068 0.477268 0.350918 0.370696 0.397298
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
298. 
patient tongue id: 02130104036462_1_2_6
label yaofang:
甘草 白芍 陈皮 木香 防风 白术 黄连 天麻 鳖甲 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.986604 0.53362 0.617472 0.4883 0.320222 0.30343 0.626825 0.603626 0.60585 0.474411 0.490337 0.519259
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
299. 
patient tongue id: 01041852042791_9
label yaofang:
柴胡 白芍 川芎 黄芩 当归 枳实 石膏 杏仁 细辛 干姜 大黄 生地 滑石 川朴 法夏
0.438198 0.410397 0.349352 0.446044 0.424251 0.39946
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
300. 
patient tongue id: 02272217029894_4_6
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 白花蛇舌草 麦芽 百合 紫苏叶 独脚金 山慈菇
0.338084 0.347034 0.307824 0.357312 0.357236 0.40817
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
301. 
patient tongue id: 03081838101446_4
label yaofang:
麻黄 陈皮 前胡 半夏 防风 细辛 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.379601 0.728565 0.423447 0.806393 0.386742 0.523051 0.363666 0.421745 0.411308 0.401369 0.748145 0.747784 0.730369 0.778864 0.383638 0.849525 0.4143 0.484628 0.532352 0.675174
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
302. 
patient tongue id: 03100007485193_5
label yaofang:
甘草 黄芩 荆芥 金银花 连翘 蒲公英 紫花地丁 白术 红花 牡丹皮 地黄 紫草 麦芽 皂角刺 白鲜皮
0.867819 0.311515 0.465132 0.492826 0.411106 0.303864
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
303. 
patient tongue id: 03261709381039_2
label yaofang:
甘草 桔梗 连翘 薄荷 芦根 桑叶 菊花 苦杏仁 板蓝根 四季青
0.314499 0.316723 0.308276 0.338037 0.302968 0.418122 0.380126 0.419555
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.125000, recall: 0.100000, error: 0.875000
304. 
patient tongue id: 02191405243852_1_4
label yaofang:
茯苓 太子参 黄芪 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 炙甘草 制远志 酒女贞子 墨旱莲 煅龙骨 炒酸枣仁 干益母草
0.379072 0.823134 0.431745 0.89478 0.410719 0.542396 0.382468 0.452306 0.443236 0.384838 0.840765 0.843124 0.807155 0.85902 0.401433 0.926623 0.391429 0.527067 0.569476 0.739495
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
305. 
patient tongue id: 04130049495240_6_1
label yaofang:
甘草 党参 丹参 生地黄 杜仲 天麻 桑寄生 鳖甲 补骨脂 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.987104 0.542262 0.646208 0.457596 0.340193 0.313738 0.679201 0.615139 0.61976 0.48714 0.518177 0.568672
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
306. 
patient tongue id: 05030818564159_1_4
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.381493 0.351475 0.384199 0.500596 0.324948
predicted yaofang:
甘草 茯苓 党参 黄芪 北沙参

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
307. 
patient tongue id: 03232300296240_1_7
label yaofang:
甘草 白芍 川芎 法半夏 茯苓 党参 枸杞子 白术 黄连 生地黄 牛膝 天麻 麦芽 首乌藤
0.985522 0.532508 0.619742 0.438335 0.322009 0.306358 0.66017 0.548791 0.552358 0.425545 0.450665 0.49116
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
308. 
patient tongue id: 03310927377008_4
label yaofang:
法半夏 前胡 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.370821 0.846572 0.447125 0.906372 0.43343 0.546957 0.385352 0.466051 0.442519 0.373508 0.855349 0.862349 0.80839 0.86132 0.39545 0.935782 0.364435 0.508013 0.532148 0.73817
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
309. 
patient tongue id: 05221923039529_1
label yaofang:
陈皮 法半夏 大枣 茯苓 桔梗 牛蒡子 白术 大腹皮 厚朴 白芷 炙甘草 紫苏叶 广藿香 徐长卿
0.389172 0.55422 0.421435 0.34656 0.332459 0.452184 0.391084 0.651899 0.741459
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.142857, error: 0.777778
310. 
patient tongue id: 05232043293154_1_4_7
label yaofang:
甘草 陈皮 当归 茯苓 半夏 党参 枸杞子 白术 杜仲 牛膝 山药 厚朴 菟丝子 鸡内金 紫苏叶 骨碎补 红豆杉
0.848501 0.462062 0.53353 0.400548 0.406948
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.235294, error: 0.200000
311. 
patient tongue id: 05181347264083_2_6
label yaofang:
甘草 白芍 茯苓 龙骨 远志 党参 酸枣仁 生地黄 知母 麦芽 女贞子 首乌藤
0.9788 0.300603 0.505733 0.628035 0.447595 0.34542 0.301868 0.307464 0.635098 0.510199 0.520561 0.386275 0.42816 0.478423
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.428571, recall: 0.500000, error: 0.571429
312. 
patient tongue id: 01140853111671_1_6
label yaofang:
甘草 白术 生地黄 杜仲 山药 山茱萸 天麻 鳖甲 火麻仁 补骨脂 蜈蚣 天山雪莲 半枝莲 红豆杉
0.983788 0.527369 0.635329 0.464454 0.372861 0.31783 0.330219 0.67086 0.59172 0.593097 0.475214 0.504527 0.546436
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
313. 
patient tongue id: 05022113227397_6_4
label yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 郁金 鳖甲 苦杏仁 浮小麦 白花蛇舌 天山雪莲 合欢花 猫爪草
0.995225 0.547765 0.669365 0.456131 0.386328 0.321285 0.332377 0.75187 0.663352 0.665403 0.528331 0.565055 0.619016
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.384615, error: 0.615385
314. 
patient tongue id: 06190753330257_1_4
label yaofang:
甘草 薏苡仁 党参 鸡血藤 赤芍 杜仲 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.961473 0.512772 0.604861 0.464862 0.349525 0.312158 0.331645 0.588232 0.534207 0.542211 0.425934 0.447337 0.478529
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
315. 
patient tongue id: 03261556438389_4
label yaofang:
甘草 柴胡 白芍 当归 茯苓 龙骨 牡蛎 白术 酸枣仁 磁石 珍珠母 炙甘草 浮小麦 黑枣
0.546864 0.368565 0.470112 0.445571 0.481411
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
316. 
patient tongue id: 04192225428001_1_6
label yaofang:
甘草 法半夏 茯苓 龙骨 党参 酸枣仁 丹参 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.988766 0.540562 0.65266 0.473359 0.365796 0.312672 0.334791 0.68749 0.619967 0.62021 0.48751 0.520401 0.556675
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
317. 
patient tongue id: 02181626041591_2_1
label yaofang:
甘草 枳壳 防风 生地黄 茜草 天麻 地榆 槐花 鳖甲 火麻仁 五倍子 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.994869 0.542603 0.663064 0.474054 0.363732 0.300115 0.321786 0.713181 0.621682 0.635605 0.486189 0.515669 0.561181
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
318. 
patient tongue id: 04221901043765_4
label yaofang:
甘草 法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.400216 0.971441 0.364446 0.992803 0.483794 0.681273 0.409587 0.583172 0.539797 0.420953 0.979597 0.983263 0.964953 0.98463 0.395939 0.996058 0.451796 0.655594 0.712489 0.925056
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
319. 
patient tongue id: 02182237155530_6_2
label yaofang:
甘草 柴胡 黄芩 法半夏 茯苓 桔梗 橘红 浙贝母 栀子 牡丹皮 款冬花 扁豆花 紫菀 贯众
0.951766 0.314277 0.505087 0.550957 0.41239 0.462664 0.377653 0.366709
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
320. 
patient tongue id: 03141956031149_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮
0.302246 0.385041 0.318756 0.306743 0.313029 0.469106
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
321. 
patient tongue id: 03192252347417_5_6_1
label yaofang:
甘草 柴胡 白芍 陈皮 木香 防风 党参 白术 黄连 生地黄 川楝子 乌梅 山药 仙鹤草 茜草 麦芽 合欢花
0.9725 0.520505 0.591342 0.447654 0.551112 0.482259 0.48113 0.370374 0.379757 0.39423
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.176471, error: 0.700000
322. 
patient tongue id: 06111119154654_4_1
label yaofang:
甘草 柴胡 川芎 黄芩 茯苓 桔梗 防风 金银花 芦根 党参 浙贝母 荆芥穗 麦芽 苍耳子 贯众
0.941641 0.51095 0.526794 0.426011 0.404343 0.341973 0.352041
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
323. 
patient tongue id: 02231914176151_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.300591 0.304185 0.473213 0.442354 0.428753 0.300134 0.358277 0.306125 0.305993 0.386462 0.377448 0.381129 0.389717 0.37957 0.580865 0.30855 0.318806
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.764706, recall: 0.812500, error: 0.235294
324. 
patient tongue id: 01250651428909_2
label yaofang:
甘草 黄芩 桔梗 太子参 浙贝母 乌梅 牛膝 地黄 火麻仁 白花蛇舌草 北沙参 蜂房 岗梅根 醋鳖甲
0.981474 0.520548 0.603197 0.454461 0.301173 0.573199 0.488807 0.495176 0.367943 0.374789 0.393636
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
325. 
patient tongue id: 06182225235967_1_3
label yaofang:
甘草 茯苓 党参 黄芪 白术 五味子 柏子仁 山茱萸 糯稻根 芡实 浮小麦
0.895413 0.496335 0.497829 0.405369 0.359983
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.363636, error: 0.200000
326. 
patient tongue id: 05271847328133_1
label yaofang:
柴胡 茯苓 白术 山药 山楂 莱菔子 鸡内金 麦芽 炙甘草 黑枣 独脚金 稻芽 葫芦茶
0.534343 0.415866 0.403416 0.371531 0.433591
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
327. 
patient tongue id: 04260020033725_6_2
label yaofang:
甘草 陈皮 枳壳 茯苓 独活 酸枣仁 郁金 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜
0.991264 0.536701 0.671129 0.481829 0.386744 0.319128 0.339558 0.714762 0.642039 0.642584 0.502018 0.549147 0.594024
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
328. 
patient tongue id: 02182011581295_4_6_2
label yaofang:
甘草 桔梗 酸枣仁 浙贝母 郁金 鳖甲 扁豆花 夏枯草 北沙参 白花蛇舌 天山雪莲 蜂房 岗梅根 四季青
0.983583 0.527926 0.626768 0.463699 0.338571 0.305654 0.30903 0.629042 0.563168 0.556167 0.440864 0.462803 0.49017
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
329. 
patient tongue id: 04171812332287_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 仙鹤草 炙甘草 百合 紫苏叶
0.378178 0.512904 0.380268 0.339211 0.360095 0.413029 0.348988 0.564142 0.656431
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.166667, error: 0.777778
330. 
patient tongue id: 03101737585550_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.380856 0.894662 0.419415 0.94728 0.416779 0.573592 0.378741 0.478366 0.440192 0.38207 0.907243 0.909184 0.872109 0.917618 0.393745 0.961909 0.389615 0.542899 0.607764 0.808221
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
331. 
patient tongue id: 06171336573826_4_1
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.757237 0.317084 0.431281 0.477507 0.379521
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
332. 
patient tongue id: 02051501583846_2_4
label yaofang:
白芍 附子 炙甘草
0.359288 0.380613 0.311213 0.358844 0.401824 0.436959
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.666667, error: 0.666667
333. 
patient tongue id: 03280649043639_3_7
label yaofang:
桂枝 柴胡 白芍 当归 茯苓 桃仁 党参 白术 红花 延胡索 炙甘草 女贞子 墨旱莲 两面针
0.484537 0.389663 0.404585 0.342775 0.47005
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
334. 
patient tongue id: 05260707251401_5_6
label yaofang:
甘草 白芍 川芎 黄芩 法半夏 茯苓 前胡 牛蒡子 白术 款冬花 紫菀 紫苏梗
0.856103 0.471116 0.522439 0.311221 0.529797 0.377398
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
335. 
patient tongue id: 01180607593521_1_2_6
label yaofang:
甘草 白芍 陈皮 枳壳 茯苓 蒲公英 党参 白术 天麻 鳖甲 麦芽 五倍子 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.98056 0.530276 0.599463 0.443472 0.30605 0.302027 0.607387 0.509629 0.513569 0.39675 0.409783 0.43169
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
336. 
patient tongue id: 03111514175614_6_2_7
label yaofang:
甘草 柴胡 白芍 茯苓 桃仁 党参 丹参 山药 鳖甲 虎杖 麦芽 百合 黄精 土鳖虫 鹿衔草
0.912323 0.481469 0.595985 0.458648 0.303571 0.451017 0.366541
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
337. 
patient tongue id: 03142004068581_1_7
label yaofang:
桂枝 甘草 茯苓 桔梗 薏苡仁 党参 白术 山药 干姜 砂仁 白扁豆 广藿香
0.349832 0.371679 0.509343 0.360846 0.311294 0.332114 0.379452 0.334073 0.337055 0.489621 0.594458
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.363636, recall: 0.333333, error: 0.636364
338. 
patient tongue id: 03231116340524_6_1_2
label yaofang:
甘草 川芎 茯苓 羌活 党参 白术 砂仁 天麻 白芷 鳖甲 柿蒂 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.952883 0.51487 0.62364 0.501184 0.319301 0.324737 0.5311 0.500184 0.548719 0.358407 0.392497 0.415074
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.625000, error: 0.166667
339. 
patient tongue id: 05140845284954_2_5
label yaofang:
甘草 法半夏 茯苓 桔梗 太子参 浙贝母 郁金 鳖甲 射干 北沙参 苦杏仁 白花蛇舌 天山雪莲 蜂房
0.982268 0.522121 0.61337 0.461477 0.339299 0.307442 0.31365 0.623829 0.550839 0.562627 0.428812 0.45809 0.500456
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
340. 
patient tongue id: 03230720557981_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 酸枣仁 生地黄 赤芍 牡丹皮 菟丝子 益母草 浮小麦 合欢花
0.992141 0.54008 0.651759 0.465664 0.358147 0.305271 0.32179 0.692884 0.61174 0.609918 0.475011 0.511029 0.547434
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
341. 
patient tongue id: 04142223349966_4
label yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 远志 党参 郁金 石菖蒲 天麻 鳖甲 扁豆花 蜈蚣 白花蛇舌 天山雪莲
0.958411 0.30683 0.51562 0.584501 0.450011 0.320721 0.301462 0.538927 0.476841 0.470941 0.374371 0.379504 0.390539
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.533333, error: 0.384615
342. 
patient tongue id: 04132047086619_6_5
label yaofang:
甘草 柴胡 黄芩 茯苓 党参 白术 酸枣仁 丹参 生地黄 赤芍 青皮 栀子 牡丹皮 郁金 王不留行 佛手
0.953451 0.309897 0.504345 0.568355 0.403705 0.476085 0.359085 0.366968
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
343. 
patient tongue id: 01041816268260_2
label yaofang:
桂枝 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.392188 0.82137 0.431866 0.900999 0.419883 0.554632 0.386164 0.480894 0.445242 0.406562 0.845368 0.851174 0.825287 0.871967 0.39331 0.930003 0.426536 0.53685 0.592801 0.759807
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.875000, error: 0.300000
344. 
patient tongue id: 04201926503545_6_4
label yaofang:
甘草 茯苓 木香 党参 白术 酸枣仁 山药 益母草 鳖甲 茵陈 虎杖 麦芽 板蓝根 黄精 土鳖虫
0.988778 0.538199 0.654828 0.462473 0.372627 0.31508 0.33313 0.710839 0.610928 0.618069 0.480779 0.52298 0.575836
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
345. 
patient tongue id: 03101742043210_4
label yaofang:
甘草 薏苡仁 滑石 豆蔻 萹蓄 焦栀子 干鱼腥草 麸炒白术 川木通 广金钱草 车前草
0.387729 0.807847 0.428545 0.882526 0.418801 0.551005 0.387548 0.456274 0.443817 0.403707 0.825492 0.83309 0.795636 0.849606 0.40701 0.918023 0.409197 0.524382 0.578342 0.740214
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
346. 
patient tongue id: 03291339049060_1_6
label yaofang:
甘草 黄芩 薏苡仁 浙贝母 桑白皮 莱菔子 天麻 鳖甲 莪术 枇杷叶 麦芽 苦杏仁 紫苏子 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.985457 0.54025 0.615362 0.462545 0.319711 0.301289 0.633929 0.584732 0.579564 0.452118 0.469119 0.496259
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.294118, error: 0.583333
347. 
patient tongue id: 01192235440678_1_2_4
label yaofang:
甘草 远志 白术 生地黄 黄柏 山药 天麻 糯稻根 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.978637 0.52147 0.615268 0.462886 0.338192 0.310462 0.60846 0.533635 0.5309 0.416064 0.444301 0.469666
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
348. 
patient tongue id: 01190631214937_6_4
label yaofang:
甘草 桔梗 党参 丹参 生地黄 浙贝母 郁金 天麻 白芷 鳖甲 皂角刺 白花蛇舌 天山雪莲 半枝莲
0.982661 0.529352 0.596203 0.43705 0.3001 0.58685 0.496607 0.489576 0.388059 0.385185 0.400015
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
349. 
patient tongue id: 03312026599069_1_2
label yaofang:
甘草 独活 党参 白术 酸枣仁 生地黄 杜仲 天麻 桑寄生 鳖甲 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991446 0.539557 0.668178 0.467344 0.388081 0.322332 0.34171 0.732456 0.646071 0.64887 0.518165 0.559016 0.612682
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.733333, error: 0.153846
350. 
patient tongue id: 04210647556418_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 天麻 款冬花 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.975985 0.499312 0.642642 0.446888 0.36467 0.314767 0.331262 0.645569 0.515142 0.532683 0.389182 0.427522 0.468419
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
351. 
patient tongue id: 02122221457940_5
label yaofang:
甘草 茯苓 薏苡仁 党参 黄连 生地黄 赤芍 牛膝 石膏 山药 山茱萸 细辛 白芷 粉葛 广升麻
0.990192 0.541196 0.643571 0.510007 0.314513 0.627988 0.590678 0.614214 0.436991 0.470546 0.497446
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
352. 
patient tongue id: 04282304217407_6_5
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 茯苓 党参 酸枣仁 柏子仁 生地黄 栀子 牡丹皮 火麻仁 浮小麦 百合
0.994313 0.548415 0.709489 0.470647 0.406457 0.32732 0.353757 0.767358 0.68222 0.688644 0.528166 0.591644 0.647852
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
353. 
patient tongue id: 02122111385208_3_4
label yaofang:
甘草 柴胡 白芍 川芎 陈皮 法半夏 茯苓 党参 五味子 熟附子 赤芍 细辛 干姜 天麻 全蝎 建曲
0.951278 0.312342 0.514134 0.557669 0.436007 0.308757 0.304828 0.301258 0.518931 0.473081 0.459394 0.385227 0.373542 0.385879
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.312500, error: 0.642857
354. 
patient tongue id: 02111327355363_1_2_7
label yaofang:
川芎 陈皮 法半夏 防风 乳香 胆南星 藿香 荆芥穗 白芷 辛夷 苍耳子 芥子 醋没药
0.418574 0.378841 0.373942 0.387028 0.457495
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
355. 
patient tongue id: 06171321555675_4_6
label yaofang:
白芍 香附 枳壳 法半夏 党参 延胡索 海螵蛸 佩兰 白芷 北柴胡 麦芽 炙甘草 蒺藜 紫苏梗
0.719978 0.304416 0.398306 0.471165 0.432681
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
356. 
patient tongue id: 03041051547101_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.384656 0.884054 0.418773 0.943093 0.432637 0.579257 0.405611 0.496714 0.467744 0.400267 0.899449 0.906498 0.86926 0.914047 0.418019 0.964486 0.411256 0.549946 0.616666 0.805144
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
357. 
patient tongue id: 03061506095891_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 延胡索 赤芍 海螵蛸 牛膝
0.347327 0.462405 0.331998 0.34438 0.381784 0.428073 0.488486 0.591755
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
358. 
patient tongue id: 03012248540921_6_4
label yaofang:
甘草 茯苓 桔梗 党参 浙贝母 栀子 牡丹皮 郁金 菟丝子 益母草 鳖甲 扁豆花 夏枯草 猫爪草
0.956064 0.309922 0.503074 0.569233 0.435119 0.468234 0.417466 0.409609 0.307907 0.309284 0.317328
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
359. 
patient tongue id: 03062002596262_2_6
label yaofang:
甘草 党参 丹参 山药 天麻 鳖甲 茵陈 虎杖 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 鹿衔草 赶黄草
0.986902 0.540378 0.632317 0.460447 0.357831 0.319353 0.329074 0.662364 0.610262 0.600379 0.487561 0.508447 0.536429
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
360. 
patient tongue id: 01041833428780_1_4
label yaofang:
薏苡仁 党参 太子参 黄芪 芡实 北沙参 山萸肉 续断 盐菟丝子
0.380656 0.706097 0.42426 0.773849 0.386357 0.513889 0.37422 0.422786 0.42461 0.394028 0.713152 0.7206 0.703779 0.746655 0.401465 0.8528 0.389124 0.471419 0.534999 0.659022
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.222222, error: 0.900000
361. 
patient tongue id: 06031135067510_4_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 黄芩 法半夏 茯苓 前胡 党参 生地黄 桑寄生 款冬花
0.987104 0.544799 0.629337 0.467644 0.33831 0.303187 0.637575 0.582041 0.574039 0.4584 0.473041 0.494125
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
362. 
patient tongue id: 03292019072082_6_5
label yaofang:
甘草 枳壳 黄芩 半夏 牡丹皮 郁金 厚朴 北沙参 板蓝根 辛夷 合欢皮 墨旱莲 岗梅
0.841881 0.464526 0.516805 0.513362 0.331357
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
363. 
patient tongue id: 02251119519932_2
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.363296 0.744985 0.451628 0.805209 0.405034 0.495287 0.372584 0.442939 0.42358 0.369077 0.74492 0.752386 0.704144 0.756596 0.384709 0.867572 0.350482 0.476406 0.491873 0.648363
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
364. 
patient tongue id: 03011058408918_1_7
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 车前子 仙鹤草 炙甘草 百合 紫苏叶
0.379157 0.381095 0.333823 0.353179 0.401343 0.305296 0.450417
predicted yaofang:
甘草 白芍 茯苓 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
365. 
patient tongue id: 02241444525546_6_1
label yaofang:
大枣 当归 茯苓 木香 龙骨 远志 党参 黄芪 白术 酸枣仁 柏子仁 炙甘草
0.413383 0.351528 0.398672 0.335051 0.481159 0.321883
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
366. 
patient tongue id: 01101817073236_4
label yaofang:
陈皮 茯苓 前胡 桔梗 防风 钩藤 荆芥穗 白芷 百部 炙甘草 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.398258 0.955166 0.37017 0.986691 0.463316 0.655077 0.414233 0.555165 0.521735 0.41779 0.967332 0.971783 0.948493 0.974455 0.41069 0.99227 0.452846 0.628799 0.680134 0.897798
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.642857, error: 0.550000
367. 
patient tongue id: 01061615465878_6_5
label yaofang:
甘草 薏苡仁 浙贝母 山药 山茱萸 地黄 桑白皮 天麻 菟丝子 益母草 淡竹叶 白花蛇舌草 蜈蚣 醋鳖甲
0.986362 0.523452 0.611683 0.429041 0.3201 0.649661 0.524775 0.53762 0.401433 0.426542 0.473726
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
368. 
patient tongue id: 03242127065079_1_2
label yaofang:
党参 白术 柏子仁 附子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.383782 0.31683 0.358353 0.369986 0.312514 0.433385 0.337904 0.37349
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.375000, recall: 0.333333, error: 0.625000
369. 
patient tongue id: 04250812199577_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.694183 0.350582 0.386118 0.68845 0.633233 0.646279 0.64272 0.692318 0.684327 0.711442 0.437448 0.696819 0.713564 0.74205
predicted yaofang:
桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.142857, recall: 0.153846, error: 0.857143
370. 
patient tongue id: 04121828578682_2_4_1
label yaofang:
法半夏 茯苓 葛根 前胡 桔梗 防风 麦冬 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.388332 0.850005 0.43407 0.91629 0.432548 0.548464 0.410915 0.472343 0.445619 0.381125 0.867177 0.871132 0.833721 0.879786 0.427816 0.93995 0.398231 0.524612 0.600203 0.77238
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
371. 
patient tongue id: 04142234086409_1_2
label yaofang:
甘草 柴胡 白芍 薏苡仁 党参 黄芪 熟附子 山药 天麻 鳖甲 败酱草 蜈蚣 天山雪莲 半枝莲
0.872622 0.306169 0.478917 0.52014 0.385819 0.388742
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
372. 
patient tongue id: 04202009273167_1_2_5
label yaofang:
甘草 茯苓 薏苡仁 玉竹 党参 白术 赤芍 浙贝母 全蝎 鸡内金 北沙参 蛤壳 辛夷 猫爪草 冬凌草
0.395677 0.365713 0.389998 0.501795 0.336865 0.332733
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
373. 
patient tongue id: 03100548001906_5_6
label yaofang:
甘草 柴胡 党参 酸枣仁 丹参 赤芍 青皮 郁金 天麻 王不留行 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲
0.93102 0.485571 0.590183 0.536563 0.425837 0.349401 0.482887
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
374. 
patient tongue id: 02141933115641_4
label yaofang:
甘草 海螵蛸 肉桂 干姜 附片
0.944265 0.501062 0.601315 0.432726 0.333129 0.547686 0.432214 0.438589 0.318003 0.340214 0.357858
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.200000, error: 0.909091
375. 
patient tongue id: 05032308049925_3_2
label yaofang:
甘草 白芍 茯苓 薏苡仁 蒲公英 党参 白术 栀子 山药 天麻 莪术 蜈蚣 半枝莲 醋鳖甲
0.992563 0.534625 0.668987 0.447268 0.395644 0.323876 0.342432 0.748781 0.621215 0.630714 0.49074 0.533695 0.598728
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
376. 
patient tongue id: 02141951249645_1
label yaofang:
桂枝 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.540953 0.357521 0.455032 0.336978
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
377. 
patient tongue id: 04102042154753_4_1
label yaofang:
陈皮 桔梗 牛蒡子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.371879 0.515452 0.362488 0.323799 0.309453 0.377025 0.369856 0.3324 0.53486 0.624796
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.200000, error: 0.800000
378. 
patient tongue id: 04111945124571_1_6_7
label yaofang:
甘草 茯苓 半夏 蒲公英 党参 白术 海螵蛸 郁金 山药 厚朴 鸡内金 紫苏梗 黑枣
0.597029 0.42736 0.449905 0.380799 0.369926
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
379. 
patient tongue id: 04121310514640_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.327215 0.50337 0.440164 0.503541 0.320076 0.394095 0.330315 0.314241 0.336633 0.316865 0.450329 0.469767 0.45605 0.482815 0.381365 0.675471 0.362618 0.343132 0.424538
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 1.000000, error: 0.368421
380. 
patient tongue id: 02281438483617_2
label yaofang:
陈皮 当归 党参 黄芪 白术 砂仁 天麻 天花粉 炙甘草 辛夷 龙葵
0.405005 0.539155 0.421655 0.362149 0.300531 0.369765 0.421223 0.363934 0.594918 0.63834
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.300000, recall: 0.272727, error: 0.700000
381. 
patient tongue id: 04172200051605_3_1
label yaofang:
陈皮 半夏 龙骨 牡蛎 芦根 白术 延胡索 杜仲 石菖蒲 菟丝子 巴戟天 淫羊藿 浮小麦 狗脊 青果
0.499346 0.405109 0.389732 0.417612 0.490388
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
382. 
patient tongue id: 01201303413246_1_2_7
label yaofang:
甘草 茯苓 黄芪 鸡血藤 酸枣仁 生地黄 杜仲 山药 细辛 天麻 桑寄生 补骨脂 地龙 灯盏细辛
0.93414 0.488002 0.562227 0.437814 0.440666 0.354455
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
383. 
patient tongue id: 01132309492493_1_7
label yaofang:
前胡 薄荷 芦根 牛蒡子 葶苈子 玉竹 栀子 白茅根 淡豆豉 蝉蜕 白眉草
0.376245 0.312307 0.321997 0.339662 0.325742 0.527315
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
384. 
patient tongue id: 04151225136040_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.405926 0.945247 0.394247 0.982608 0.464358 0.641991 0.421143 0.566913 0.530336 0.424943 0.959178 0.965178 0.940707 0.967908 0.412336 0.989606 0.461262 0.621294 0.672793 0.884808
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
385. 
patient tongue id: 01040508356900_6_5
label yaofang:
甘草 黄芩 前胡 桔梗 芦根 桃仁 远志 浙贝母 鳖甲 款冬花 紫菀 苦杏仁 炙麻黄 白花蛇舌
0.939018 0.313013 0.495641 0.546899 0.417593 0.448428 0.344714 0.354623
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
386. 
patient tongue id: 05290824102268_2_5
label yaofang:
甘草 桔梗 金银花 芦根 酸枣仁 浙贝母 天麻 鳖甲 诃子 麦芽 百合 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.963451 0.517551 0.609651 0.45959 0.324221 0.307124 0.570382 0.51217 0.514353 0.385604 0.412288 0.432976
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
387. 
patient tongue id: 01032340551599_5_6
label yaofang:
甘草 法半夏 茯苓 党参 白术 杜仲 郁金 石菖蒲 天麻 桑寄生 麦芽 地龙 辛夷 合欢花
0.952713 0.498938 0.586196 0.487345 0.505086 0.437268 0.471811 0.308012 0.332511 0.344848
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
388. 
patient tongue id: 04120813034404_1_4_7
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子
0.439164 0.367041 0.420905 0.523516 0.321036 0.327033
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
389. 
patient tongue id: 02212221050546_6
label yaofang:
甘草 柴胡 白芍 栀子 牡丹皮 天麻 鳖甲 佛手 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.949661 0.315114 0.536531 0.511018 0.433761 0.380076 0.339965 0.355083
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
390. 
patient tongue id: 04101907167307_1_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.382509 0.844685 0.426015 0.908891 0.424766 0.556027 0.395123 0.472871 0.450057 0.391753 0.857851 0.862672 0.823576 0.870975 0.409871 0.939922 0.397089 0.530005 0.58956 0.763613
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
391. 
patient tongue id: 01192148343243_5_6
label yaofang:
甘草 法半夏 薏苡仁 赤芍 青皮 郁金 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.992146 0.54285 0.648709 0.451295 0.357977 0.330392 0.721265 0.616857 0.618523 0.482392 0.515212 0.56012
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
392. 
patient tongue id: 05022040178729_4_7
label yaofang:
桂枝 甘草 川芎 法半夏 茯苓 白术 红花 赤芍 细辛 天麻 全蝎 僵蚕
0.979535 0.520274 0.631735 0.464188 0.351458 0.308153 0.315404 0.614532 0.55194 0.543994 0.42237 0.45574 0.484417
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.333333, error: 0.692308
393. 
patient tongue id: 05242207155046_5_1
label yaofang:
甘草 薏苡仁 党参 白术 桑叶 天麻 野菊花 莪术 白花蛇舌草 佛手 蜈蚣 半枝莲 醋鳖甲 炒鸡内金
0.966411 0.537464 0.574885 0.439048 0.49929 0.469739 0.448328 0.361226 0.352265 0.345159
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.428571, error: 0.400000
394. 
patient tongue id: 02212211400297_6_2
label yaofang:
甘草 白芍 川芎 独活 酸枣仁 生地黄 延胡索 杜仲 牛膝 山茱萸 钩藤 天麻 桑寄生 续断
0.989567 0.527598 0.646757 0.463432 0.37347 0.322511 0.321928 0.675127 0.582878 0.581194 0.453257 0.47419 0.510967
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
395. 
patient tongue id: 03192305575571_6_5
label yaofang:
甘草 陈皮 法半夏 茯苓 龙骨 牡蛎 远志 党参 酸枣仁 黄连 胆南星 天麻 首乌藤 紫苏梗 广藿香
0.661064 0.344041 0.41697 0.454042 0.41035
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
396. 
patient tongue id: 03311802088239_1_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 钩藤 细辛 白芷 辛夷 紫苏梗 广藿香 炒苍耳子 炒蔓荆子
0.383843 0.817724 0.431901 0.889257 0.424201 0.540736 0.391084 0.475573 0.452272 0.391543 0.834287 0.843888 0.797474 0.850877 0.400496 0.927719 0.38977 0.515885 0.551932 0.727776
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.642857, error: 0.550000
397. 
patient tongue id: 05191836060471_5
label yaofang:
当归 荆芥 牛蒡子 知母 石膏 苍术 通草 地黄 火麻仁 蝉蜕 苦参 蜂房
0.93772 0.327459 0.493627 0.563828 0.440476 0.48813 0.391769 0.430748 0.300687 0.315883
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
398. 
patient tongue id: 05232000358524_6
label yaofang:
甘草 枳壳 黄芩 半夏 蒲公英 枸杞子 白术 黄连 浙贝母 牡丹皮 山茱萸 厚朴 淡豆豉 北沙参 蜈蚣 合欢皮 预知子
0.496727 0.418486 0.397344 0.472541 0.524671 0.372457
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.176471, error: 0.500000
399. 
patient tongue id: 05230811378034_1_2
label yaofang:
甘草 法半夏 桔梗 橘红 防风 金银花 太子参 藿香 白前 鸡内金 蜜百部 干鱼腥草
0.456569 0.300742 0.538302 0.455224 0.339451 0.548128 0.508588 0.479973 0.483384 0.522406 0.530589 0.550982 0.469318 0.538511 0.538429 0.565827
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.062500, recall: 0.083333, error: 0.937500
400. 
patient tongue id: 04020755337352_2_7_6
label yaofang:
甘草 白芍 茯苓 党参 酸枣仁 丹参 黄连 生地黄 山茱萸 益母草 北沙参 粉葛
0.98958 0.533757 0.647379 0.462156 0.387943 0.331435 0.347724 0.709573 0.62795 0.635617 0.5094 0.54007 0.588644
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.416667, error: 0.615385
401. 
patient tongue id: 01201948462277_1_7_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 丹参 郁金 天麻 桑寄生 鳖甲 续断 浮小麦 蜈蚣 天山雪莲 合欢花 半枝莲 红豆杉
0.992078 0.543649 0.639745 0.482198 0.379718 0.325768 0.33733 0.712754 0.648748 0.654315 0.52508 0.555923 0.593965
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.352941, error: 0.538462
402. 
patient tongue id: 03012046007710_2
label yaofang:
甘草 玉竹 太子参 浙贝母 郁金 天麻 天花粉 鳖甲 北沙参 白扁豆 浮小麦 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.945841 0.321196 0.500534 0.550741 0.410902 0.467916 0.385947 0.380443
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
403. 
patient tongue id: 02182207523925_5_7_6
label yaofang:
甘草 法半夏 茯苓 桃仁 远志 党参 酸枣仁 丹参 竹茹 胆南星 栀子 淡豆豉 莪术 麦芽 首乌藤
0.980896 0.524921 0.616181 0.42649 0.347085 0.302282 0.308247 0.639007 0.535093 0.521141 0.422497 0.434911 0.468535
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
404. 
patient tongue id: 06031126381101_6_4
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 熟附子 浙贝母 细辛 干姜 款冬花 地龙 苦杏仁 紫苏子 炙麻黄
0.986426 0.532484 0.64045 0.453526 0.383436 0.321804 0.345407 0.684715 0.603471 0.587566 0.484053 0.508023 0.537778
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.125000, error: 0.846154
405. 
patient tongue id: 02141931048148_4
label yaofang:
大枣 龙骨 党参 阿胶 生地黄 肉桂 车前子 干姜 火麻仁 炙甘草 附片
0.339197 0.370534 0.501397 0.359102 0.32954 0.340755 0.403903 0.379028 0.310674 0.50407 0.566549
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.272727, recall: 0.272727, error: 0.727273
406. 
patient tongue id: 02251129516936_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.357978 0.479452 0.435913 0.518749 0.322172 0.400715 0.35137 0.311157 0.320219 0.317409 0.454324 0.477818 0.476547 0.527085 0.427067 0.664588 0.345159 0.354012 0.363244 0.434704
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
407. 
patient tongue id: 03311622155321_5_7_6
label yaofang:
薏苡仁 黄芪 白术 赤芍 海螵蛸 牛膝 砂仁 鸡内金 红豆杉 土茯苓 合欢皮 墨旱莲 山慈菇 蛇舌草
0.540841 0.408387 0.421424 0.376697 0.439668
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
408. 
patient tongue id: 01190632211910_6_2
label yaofang:
甘草 香附 茯苓 远志 党参 酸枣仁 砂仁 三棱 莪术 麦芽 佛手 浮小麦 首乌藤
0.993291 0.545698 0.639348 0.459776 0.338591 0.30671 0.680435 0.615472 0.612929 0.483542 0.498033 0.535232
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
409. 
patient tongue id: 01101820477482_1_4
label yaofang:
川芎 法半夏 前胡 木香 太子参 郁金 北柴胡 白前 百部 豆蔻 北沙参 炙甘草 麸炒白术 甘松 麸炒枳壳 姜厚朴
0.389891 0.792195 0.400107 0.880351 0.405726 0.555454 0.373211 0.465582 0.446317 0.419121 0.82166 0.826718 0.802714 0.854958 0.379846 0.918973 0.434827 0.521347 0.576453 0.73935
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.437500, error: 0.650000
410. 
patient tongue id: 05242129576063_1_2
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.928192 0.31871 0.481479 0.566058 0.462086 0.446236 0.394696 0.429792 0.30514
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.888889, recall: 0.571429, error: 0.111111
411. 
patient tongue id: 05232120532433_1_4_7
label yaofang:
甘草 茯苓 党参 白术 浙贝母 杜仲 巴戟天 补骨脂 鸡内金 枇杷叶 紫苏子 紫苏叶 蜈蚣 骨碎补 南杏仁
0.423087 0.334756 0.373128 0.359732 0.730226 0.731026 0.400877 0.301521 0.521562 0.41333 0.375579 0.547986 0.434315
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
412. 
patient tongue id: 06022228410780_1_4_7
label yaofang:
甘草 陈皮 半夏 党参 白术 海螵蛸 杜仲 牛膝 山药 僵蚕 莪术 鸡内金 桑椹 紫苏梗 骨碎补 红豆杉 预知子
0.460197 0.384291 0.360925 0.562574 0.573548 0.3408 0.452833
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.176471, error: 0.571429
413. 
patient tongue id: 04282237170670_5_2
label yaofang:
牡蛎 玉竹 生地黄 浙贝母 牡丹皮 黄柏 知母 山药 山茱萸 泽泻 北沙参 辛夷 合欢皮 冬凌草
0.429239 0.335013 0.4272 0.429191 0.330057
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
414. 
patient tongue id: 01132145197254_5_6
label yaofang:
甘草 枳壳 党参 白术 苍术 大黄 厚朴 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.989596 0.537615 0.62911 0.460074 0.339449 0.313095 0.666631 0.598992 0.604717 0.473376 0.49835 0.545077
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
415. 
patient tongue id: 04131801300910_1_6
label yaofang:
甘草 白芍 川芎 龙骨 白术 酸枣仁 丹参 竹茹 牛膝 郁金 薤白 天麻 全蝎 瓜蒌皮 浮小麦 降香
0.988342 0.527295 0.632788 0.429898 0.347726 0.31236 0.661024 0.54927 0.556569 0.430316 0.448554 0.495177
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
416. 
patient tongue id: 04222050458278_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.395293 0.936375 0.382327 0.978735 0.461079 0.635209 0.40574 0.534206 0.50313 0.409791 0.952075 0.957599 0.930888 0.96252 0.413529 0.98679 0.444846 0.606069 0.656433 0.873306
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
417. 
patient tongue id: 05140712142753_4_1_6
label yaofang:
甘草 茯苓 桔梗 党参 白术 浙贝母 天麻 鳖甲 豆蔻 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.987499 0.54188 0.625165 0.428601 0.338033 0.304705 0.657327 0.558461 0.537996 0.434705 0.442597 0.464578
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
418. 
patient tongue id: 03281925025110_3_2
label yaofang:
柴胡 陈皮 黄芩 法半夏 防风 黄连 栀子 石膏 苍术 干姜 厚朴 炙甘草 广藿香
0.838101 0.471632 0.48802 0.464877
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
419. 
patient tongue id: 06181649282845_2_1
label yaofang:
白芍 川芎 陈皮 枳壳 当归 茯苓 党参 鸡血藤 白术 熟地黄 乌药 山药 鸡内金 决明子 麦芽 炙甘草 半枝莲 五指毛桃 蛇舌草
0.592177 0.399169 0.42453 0.489191 0.61066 0.333989 0.316898 0.334158
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.375000, recall: 0.157895, error: 0.625000
420. 
patient tongue id: 05080854491068_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.438655 0.365542 0.395229 0.424205 0.38769
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
421. 
patient tongue id: 04131401530044_2_7
label yaofang:
甘草 法半夏 前胡 桔梗 薏苡仁 浙贝母 细辛 鳖甲 款冬花 莪术 白前 苦杏仁 炙麻黄 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.83307 0.481726 0.487478 0.4291
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.058824, error: 0.750000
422. 
patient tongue id: 05022215346235_2_6
label yaofang:
甘草 党参 玄参 赤芍 浙贝母 郁金 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲 猫爪草
0.988372 0.52978 0.641572 0.443771 0.347136 0.301112 0.312262 0.658284 0.564653 0.553617 0.431377 0.456153 0.490492
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
423. 
patient tongue id: 04222129332247_2_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.390176 0.893545 0.407946 0.951324 0.437733 0.588757 0.405397 0.503678 0.478387 0.407648 0.91028 0.91872 0.880596 0.924471 0.410929 0.96965 0.419839 0.561793 0.62305 0.818944
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
424. 
patient tongue id: 03232258028475_5_6_7
label yaofang:
甘草 法半夏 茯苓 牡蛎 远志 党参 酸枣仁 丹参 黄连 竹茹 胆南星 栀子 薤白 淡豆豉 天麻 瓜蒌皮
0.974138 0.308539 0.53461 0.538032 0.420131 0.478628 0.426131 0.41954 0.325005
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌

------Score: precision: 0.555556, recall: 0.312500, error: 0.444444
425. 
patient tongue id: 05092218467250_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 款冬花 白前 苦杏仁 炙麻黄
0.978252 0.537257 0.596548 0.436372 0.315574 0.300089 0.591964 0.515673 0.500851 0.404119 0.401861 0.41135
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.166667, error: 0.833333
426. 
patient tongue id: 01122214468115_1_5
label yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 黄连 牛膝 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.977318 0.526354 0.609388 0.455108 0.344528 0.31559 0.324174 0.614465 0.53248 0.531111 0.420939 0.436217 0.452014
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
427. 
patient tongue id: 01040644032083_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 橘红 金银花 芦根 浙贝母 莱菔子 白前 紫苏子
0.954116 0.504224 0.565222 0.376417 0.541216 0.366319 0.364954
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
428. 
patient tongue id: 03231252164418_6_1_2
label yaofang:
甘草 党参 赤芍 天麻 桑寄生 鳖甲 决明子 续断 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲 红曲
0.986058 0.524941 0.629943 0.441407 0.352139 0.307363 0.32059 0.669294 0.55949 0.558997 0.442829 0.461775 0.505406
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
429. 
patient tongue id: 04282026134510_3
label yaofang:
甘草 川芎 茯苓 党参 黄芪 生地黄 杜仲 山药 山茱萸 补骨脂 金樱子 桑螵蛸 地龙 辛夷 有瓜石斛
0.963859 0.514607 0.609015 0.469404 0.322085 0.300538 0.549439 0.509147 0.509708 0.383056 0.416846 0.433271
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
430. 
patient tongue id: 04291500458045_1_2_6
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 山药 山茱萸 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.995385 0.550914 0.685153 0.465844 0.377759 0.304577 0.343028 0.778638 0.676147 0.693955 0.535581 0.586408 0.650329
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.923077, recall: 0.857143, error: 0.076923
431. 
patient tongue id: 05290800416213_2_6
label yaofang:
甘草 香附 茯苓 枸杞子 生地黄 牡丹皮 川楝子 山药 山茱萸 泽泻 菟丝子 益母草 王不留行 女贞子 续断
0.966669 0.510102 0.590841 0.448376 0.326306 0.308019 0.316669 0.590207 0.489528 0.503677 0.386972 0.402189 0.426509
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
432. 
patient tongue id: 02142125143703_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.365211 0.856999 0.390263 0.928548 0.421793 0.559807 0.364644 0.492769 0.470058 0.401319 0.876904 0.890925 0.838313 0.890921 0.345112 0.960462 0.399005 0.531789 0.535794 0.76306
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
433. 
patient tongue id: 06162200210480_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.384994 0.950542 0.388345 0.984482 0.450899 0.637473 0.389656 0.532848 0.499917 0.407344 0.962603 0.96757 0.942618 0.971237 0.387711 0.99087 0.429165 0.616252 0.672063 0.8894
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
434. 
patient tongue id: 02201316507832_2
label yaofang:
大枣 当归 茯苓 木香 远志 党参 白术 柏子仁 肉桂 钩藤 川牛膝 炙甘草
0.340833 0.356173 0.480538 0.333769 0.303012 0.30596 0.327055 0.376658 0.348469 0.339922 0.461034 0.5994
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 茯苓 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
435. 
patient tongue id: 03022154325280_7_2
label yaofang:
枳壳 当归 木香 牛蒡子 远志 党参 太子参 黄芪 鸡血藤 白术 柏子仁 神曲 山楂 砂仁 石斛 糯稻根 麦芽 炙甘草 浮小麦 百合 紫苏叶
0.404339 0.316288 0.337897 0.372713 0.357603 0.315228
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
436. 
patient tongue id: 05232035256784_4
label yaofang:
柴胡 白芍 香附 枳壳 桃仁 延胡索 海螵蛸 浙贝母 豆蔻 白花蛇舌草 姜半夏 炙甘草 紫苏梗
0.430877 0.621767 0.491581 0.359551 0.342922 0.429919 0.389859 0.69855 0.744902
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.777778, recall: 0.538462, error: 0.222222
437. 
patient tongue id: 02190438125539_1_2_4
label yaofang:
甘草 远志 党参 生地黄 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲 宽筋藤
0.847527 0.470361 0.480558 0.403459
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
438. 
patient tongue id: 04211937576835_6_4_1
label yaofang:
蒲公英 太子参 黄芪 白术 延胡索 海螵蛸 郁金 砂仁 三七 桑寄生 鸡内金 北沙参 首乌藤 紫苏梗
0.440998 0.361171 0.375114 0.369239 0.538005 0.33007
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
439. 
patient tongue id: 03211855032110_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.385864 0.938701 0.430437 0.977274 0.472712 0.618485 0.424386 0.52731 0.490927 0.390951 0.950572 0.955056 0.925625 0.958111 0.434109 0.984672 0.41193 0.599724 0.656485 0.868605
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
440. 
patient tongue id: 06080123471129_4_1
label yaofang:
甘草 川芎 法半夏 茯苓 党参 白术 厚朴 天麻 鳖甲 蒺藜 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.999052 0.568426 0.728193 0.470878 0.42178 0.313295 0.336807 0.856377 0.740674 0.765727 0.587773 0.651175 0.736861
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.625000, error: 0.230769
441. 
patient tongue id: 03312046296299_2_6
label yaofang:
甘草 白芍 薏苡仁 熟附子 赤芍 郁金 山药 天麻 鳖甲 扁豆花 败酱草 续断 浮小麦 半枝莲 牛大力
0.768552 0.455021 0.488882 0.307713 0.42974
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
442. 
patient tongue id: 06031044322372_6_2_1
label yaofang:
甘草 枳壳 远志 酸枣仁 丹参 生地黄 天麻 瓜蒌皮 鳖甲 紫菀 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97959 0.532739 0.619851 0.461403 0.351877 0.308316 0.31426 0.620632 0.560089 0.550143 0.44475 0.459425 0.483457
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
443. 
patient tongue id: 01062349333519_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.517714 0.367377 0.443698 0.406657 0.314053
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
444. 
patient tongue id: 03151929068214_1
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 火炭母
0.497572 0.389472 0.40168 0.368799
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
445. 
patient tongue id: 05181828424766_5_2
label yaofang:
甘草 前胡 鱼腥草 酸枣仁 浙贝母 桑白皮 瓜蒌皮 射干 枇杷叶 珍珠母 苦杏仁 辛夷 木蝴蝶 南杏仁
0.736022 0.435457 0.483487 0.307705 0.447807
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
446. 
patient tongue id: 04121953566816_1_4_2
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.37417 0.76069 0.440305 0.834074 0.401565 0.523694 0.378046 0.450187 0.43428 0.394335 0.773739 0.780013 0.74065 0.791223 0.390913 0.888992 0.384197 0.492501 0.522501 0.675598
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
447. 
patient tongue id: 05031857245713_4
label yaofang:
桂枝 枳壳 茯苓 麦冬 酸枣仁 五味子 天冬 石斛 佛手 合欢皮 石榴皮
0.674667 0.437999 0.473995 0.432706
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.090909, error: 0.750000
448. 
patient tongue id: 04282302233398_1_6
label yaofang:
甘草 川芎 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.987912 0.534757 0.625301 0.449318 0.327253 0.653946 0.556006 0.560012 0.431725 0.440587 0.478669
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.785714, error: 0.000000
449. 
patient tongue id: 06031655155380_4_1
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.388921 0.860328 0.432786 0.926273 0.440519 0.561994 0.409122 0.490514 0.466324 0.393766 0.876326 0.885134 0.843642 0.89356 0.421633 0.951076 0.40107 0.546116 0.601032 0.779729
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
450. 
patient tongue id: 04181958020820_2
label yaofang:
甘草 白芍 枳壳 桔梗 黄芪 白术 生地黄 枳实 槟榔 厚朴 肉苁蓉 火麻仁 柿蒂 紫菀 郁李仁
0.306777 0.345698 0.461037 0.315939 0.327293 0.340434 0.368974 0.358992 0.442712 0.509027
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
451. 
patient tongue id: 05290842578937_3_2
label yaofang:
甘草 党参 黄芪 杜仲 天麻 鳖甲 桑螵蛸 锁阳 益智 蜈蚣 天山雪莲 半枝莲 广金钱草 红豆杉
0.98399 0.532446 0.643967 0.461808 0.370497 0.317394 0.334149 0.657682 0.591124 0.577789 0.465094 0.498245 0.525721
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
452. 
patient tongue id: 01312127464193_5_8
label yaofang:
甘草 荆芥 防风 金银花 黄芪 白术 紫草 火麻仁 百部 麦芽 苦参 忍冬藤 白鲜皮 地肤子 土茯苓
0.992583 0.53056 0.657055 0.453228 0.360515 0.305795 0.317941 0.685232 0.583623 0.578835 0.438085 0.476412 0.520134
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.133333, error: 0.846154
453. 
patient tongue id: 02201753224110_1_4
label yaofang:
桂枝 陈皮 法半夏 茯苓 党参 海螵蛸 干姜 砂仁 炙甘草 广藿香 麸炒白术 麸炒苍术 炙黄芪 甘松
0.359958 0.64811 0.465823 0.70158 0.392241 0.457744 0.355634 0.407614 0.381992 0.360253 0.649296 0.637628 0.61511 0.65199 0.366297 0.716836 0.353763 0.44286 0.442856 0.566639
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.428571, error: 0.700000
454. 
patient tongue id: 02150557115241_6_2_4
label yaofang:
甘草 茯苓 白术 酸枣仁 生地黄 白茅根 茜草 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.842952 0.47945 0.525433 0.436408 0.338428
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
455. 
patient tongue id: 02122110150955_6_2
label yaofang:
甘草 川芎 茯苓 龙骨 牡蛎 桃仁 酸枣仁 杜仲 牛膝 钩藤 天麻 桑寄生 麦芽
0.985521 0.542201 0.638681 0.492181 0.328188 0.314844 0.613534 0.579308 0.586976 0.43993 0.463845 0.48657
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
456. 
patient tongue id: 03231027523168_2_5_6
label yaofang:
甘草 柴胡 茯苓 丹参 赤芍 牡丹皮 黄柏 知母 山药 山茱萸 地黄 水牛角 淫羊藿 仙茅
0.980622 0.525517 0.599388 0.434899 0.590308 0.513594 0.514421 0.395886 0.402555 0.433015
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
457. 
patient tongue id: 02141932250294_2_1
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.404955 0.879738 0.391839 0.947967 0.433426 0.602634 0.383773 0.484939 0.468271 0.423191 0.90608 0.908868 0.878599 0.926982 0.390741 0.963062 0.448483 0.570245 0.622938 0.81805
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
458. 
patient tongue id: 05092108299408_5_1_6
label yaofang:
甘草 陈皮 枳壳 茯苓 薏苡仁 蒲公英 白术 黄连 黄柏 苍术 荆芥穗 天麻 槐花 百部 苦参 五倍子
0.922641 0.335977 0.484157 0.540104 0.432033 0.418084 0.323522 0.366204
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
459. 
patient tongue id: 02142330545320_6
label yaofang:
甘草 川芎 茯苓 防风 党参 白术 酸枣仁 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.981328 0.519513 0.596999 0.447551 0.325386 0.301139 0.625654 0.542453 0.542532 0.429642 0.455257 0.490905
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.733333, error: 0.083333
460. 
patient tongue id: 05162214044126_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.394453 0.84738 0.41039 0.920806 0.43164 0.57018 0.400535 0.485135 0.465023 0.406268 0.872141 0.879073 0.844946 0.891214 0.41011 0.946505 0.42753 0.54787 0.600491 0.779565
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
461. 
patient tongue id: 02241440241654_1
label yaofang:
陈皮 桔梗 太子参 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.400073 0.322881 0.361931 0.367625 0.307981 0.481774 0.364267 0.366978
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
462. 
patient tongue id: 05261943072541_1_4_7
label yaofang:
陈皮 茯苓 半夏 党参 枸杞子 白术 杜仲 牛膝 山药 厚朴 菟丝子 鸡内金 紫苏梗 蜈蚣 红豆杉 合欢皮 预知子 素馨花
0.501153 0.399125 0.419828 0.498778 0.504793 0.304969 0.375876
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.222222, error: 0.428571
463. 
patient tongue id: 04112208554968_6
label yaofang:
甘草 法半夏 龙齿 酸枣仁 柏子仁 栀子 肉桂 干姜 淡豆豉 砂仁 天麻 蝉蜕 附片 百合 紫苏叶 蜈蚣
0.31829 0.344501 0.458584 0.302591 0.336984 0.3466 0.422096 0.390802 0.42552 0.52649
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.100000, recall: 0.062500, error: 0.900000
464. 
patient tongue id: 05140957086338_4_6
label yaofang:
甘草 柴胡 当归 茯苓 黄芪 白术 酸枣仁 杜仲 桑寄生 桑螵蛸 益智 紫苏梗 广藿香
0.954632 0.318917 0.50658 0.556659 0.422285 0.481139 0.394666 0.404129
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
465. 
patient tongue id: 02231751486195_1_6
label yaofang:
白芍 川芎 法半夏 当归 茯苓 木香 丹参 川楝子 郁金 北柴胡 炙甘草 麸炒白术 醋香附 麸炒枳壳
0.355377 0.67761 0.451093 0.723961 0.379728 0.475072 0.353539 0.398888 0.389184 0.366077 0.666515 0.670354 0.635783 0.677117 0.368879 0.790946 0.341641 0.43897 0.459343 0.589999
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.214286, error: 0.850000
466. 
patient tongue id: 05092243531358_1_2
label yaofang:
黄芪 白术 熟地黄 浙贝母 牡丹皮 山茱萸 厚朴 砂仁 肉苁蓉 北沙参 桑枝 合欢皮 冬凌草
0.866198 0.437671 0.52201 0.536963 0.735109 0.316817 0.32599 0.330447 0.332655 0.436224
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 莪术 北沙参 蜈蚣

------Score: precision: 0.500000, recall: 0.384615, error: 0.500000
467. 
patient tongue id: 06191338342788_1_4
label yaofang:
甘草 川芎 法半夏 茯苓 桔梗 党参 鸡血藤 白术 红花 浙贝母 天麻 僵蚕 地龙
0.997331 0.580565 0.663154 0.461637 0.345426 0.74946 0.672865 0.669207 0.529314 0.544166 0.574603
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
468. 
patient tongue id: 05182105440741_4
label yaofang:
柴胡 白芍 香附 枳壳 连翘 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 瓦楞子 青葙子
0.806085 0.30193 0.441911 0.495788 0.384606 0.32297
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
469. 
patient tongue id: 05251937300629_2_5
label yaofang:
甘草 茯苓 桔梗 半夏 麦冬 黄芪 白术 牡丹皮 厚朴 砂仁 僵蚕 补骨脂 地龙 北沙参 苇根 蛤壳 蜈蚣
0.677196 0.447766 0.468555 0.438084 0.548259 0.344566
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.833333, recall: 0.294118, error: 0.166667
470. 
patient tongue id: 04181937475329_1_7_4
label yaofang:
桂枝 甘草 白芍 茯苓 桃仁 白术 天冬 红花 牛膝 泽泻 车前子 茺蔚子 龟甲
0.984381 0.531414 0.624072 0.452121 0.348654 0.316088 0.32247 0.64492 0.578562 0.567378 0.460674 0.481657 0.512506
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
471. 
patient tongue id: 05221853338757_4
label yaofang:
茯苓 龙骨 牡蛎 薏苡仁 白术 酸枣仁 厚朴 三七 赤小豆 首乌藤 五指毛桃 木棉花
0.723704 0.438526 0.487191 0.480976
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
472. 
patient tongue id: 05172121421873_5_6_7
label yaofang:
甘草 法半夏 茯苓 连翘 党参 浙贝母 牡丹皮 佩兰 砂仁 天花粉 糯稻根 枇杷叶 麦芽 紫苏梗 广藿香
0.940207 0.494071 0.601616 0.469343 0.334981 0.311385 0.550885 0.475118 0.493002 0.35854 0.393576 0.418448
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
473. 
patient tongue id: 04281835578238_5
label yaofang:
甘草 桔梗 荆芥 防风 芦根 薏苡仁 细辛 瓜蒌皮 款冬花 紫菀 白前 百部 苦杏仁 蝉蜕 蜜麻黄 蒸陈皮
0.392626 0.331828 0.446114 0.328294 0.363382 0.398259 0.326728 0.351251 0.507644
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.111111, recall: 0.062500, error: 0.888889
474. 
patient tongue id: 02020855091092_6
label yaofang:
甘草 川芎 茯苓 牡蛎 白术 酸枣仁 生地黄 栀子 知母 天麻 全蝎 麦芽 浮小麦 首乌藤 百合
0.974534 0.521917 0.618535 0.469554 0.361448 0.315576 0.331612 0.642858 0.570631 0.579019 0.462672 0.487992 0.531417
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
475. 
patient tongue id: 03311634589494_7_4
label yaofang:
甘草 柴胡 白芍 茯苓 白术 全蝎 猪苓 莪术 白花蛇舌草 半枝莲 蜂房 瓦楞子 山慈菇 山豆根 半边莲
0.351361 0.518679 0.425451 0.397007 0.513462 0.438121 0.469197 0.359063 0.484029 0.487071 0.4489 0.324306 0.446414 0.465392 0.476364
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.066667, recall: 0.066667, error: 0.933333
476. 
patient tongue id: 02202300060123_5_6
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 生地黄 栀子 乌药 淡竹叶 鸡内金 建曲 川木通 广金钱草 荔枝核
0.943882 0.317595 0.322552 0.502009 0.499203 0.402155 0.360122
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
477. 
patient tongue id: 01211245337731_3_4
label yaofang:
桂枝 柴胡 白芍 茯苓 薏苡仁 桃仁 枳实 牡丹皮 炙甘草
0.481341 0.321143 0.375159 0.392478 0.394184 0.302986
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
478. 
patient tongue id: 06171140560766_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 紫菀 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.371177 0.783544 0.435184 0.860128 0.41581 0.526621 0.369707 0.463317 0.435829 0.391362 0.796779 0.806944 0.761774 0.81486 0.368201 0.90205 0.385417 0.505419 0.519195 0.69259
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.733333, error: 0.450000
479. 
patient tongue id: 01202003017129_1_2
label yaofang:
甘草 陈皮 茯苓 太子参 白术 天冬 熟地黄 浙贝母 山药 山茱萸 砂仁 磁石 枇杷叶 黄精 冬凌草
0.701375 0.469567 0.431359 0.345026 0.453882
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
480. 
patient tongue id: 02271228148586_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.407845 0.304159 0.40069 0.428776 0.525629 0.40808 0.373448 0.316026
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
481. 
patient tongue id: 03021945363191_4
label yaofang:
麻黄 陈皮 茯苓 前胡 半夏 防风 神曲 细辛 款冬花 紫菀 白前 百部 紫苏子 炙甘草 广藿香
0.390557 0.870699 0.400905 0.938238 0.427378 0.586006 0.389947 0.486654 0.465115 0.416864 0.893426 0.899345 0.868432 0.911925 0.397086 0.960758 0.43919 0.549112 0.617075 0.80685
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.733333, error: 0.450000
482. 
patient tongue id: 04182208380615_1_3_7
label yaofang:
甘草 当归 茯苓 党参 黄芪 白术 浙贝母 杜仲 厚朴 砂仁 款冬花 鸡内金 地龙 紫苏子 蜈蚣 鲜龙葵果
0.631136 0.420056 0.4579 0.533128 0.600381 0.338116 0.314415 0.402751
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.875000, recall: 0.437500, error: 0.125000
483. 
patient tongue id: 03151839184523_4
label yaofang:
甘草 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 香薷 紫菀 辛夷 紫苏梗 广藿香 苍耳子
0.373304 0.811374 0.411857 0.890308 0.405422 0.55131 0.370448 0.463298 0.448205 0.406326 0.832385 0.841815 0.806082 0.856967 0.381883 0.931213 0.406641 0.518729 0.56349 0.736628
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.428571, error: 0.700000
484. 
patient tongue id: 02252120107638_5
label yaofang:
桂枝 甘草 白芍 黄芩 茯苓 桔梗 荆芥 防风 金银花 连翘 芦根 浙贝母 板蓝根 广藿香 大青叶
0.980658 0.534516 0.63077 0.494938 0.34207 0.32363 0.627498 0.594771 0.606622 0.468331 0.501892 0.529064
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
485. 
patient tongue id: 03171341050059_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.395656 0.90153 0.41567 0.952337 0.411172 0.600552 0.374171 0.486335 0.454453 0.389815 0.915833 0.9175 0.881671 0.925642 0.389093 0.967372 0.401044 0.570457 0.61021 0.818785
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
486. 
patient tongue id: 01040659588675_6_1
label yaofang:
甘草 柴胡 白芍 香附 茯苓 木香 党参 延胡索 郁金 砂仁 鸡内金 麦芽 佛手 合欢花
0.982709 0.519891 0.624433 0.428874 0.323507 0.308277 0.622822 0.490072 0.47732 0.364956 0.381189 0.398312
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
487. 
patient tongue id: 06050809524703_1_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 车前子 干姜 鸡内金
0.48095 0.363903 0.300467 0.446782 0.479901 0.347543
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术

------Score: precision: 0.833333, recall: 0.384615, error: 0.166667
488. 
patient tongue id: 02252111488011_1_6
label yaofang:
甘草 茯苓 党参 白术 栀子 牡丹皮 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.921998 0.485713 0.547576 0.419224 0.448806 0.320201 0.355233
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 1.000000, recall: 0.500000, error: 0.000000
489. 
patient tongue id: 03302120479306_1_4
label yaofang:
甘草 白芍 枳壳 薏苡仁 党参 延胡索 浙贝母 郁金 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲
0.989519 0.543941 0.654715 0.459404 0.37907 0.322673 0.339025 0.696145 0.616181 0.611434 0.48864 0.514949 0.548811
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
490. 
patient tongue id: 02182009005132_6_2_4
label yaofang:
甘草 白芍 薏苡仁 党参 生地黄 郁金 石菖蒲 天麻 鳖甲 莪术 辛夷 百合 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.984593 0.530431 0.618651 0.45149 0.314926 0.307713 0.607102 0.530111 0.520659 0.404895 0.414076 0.437051
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
491. 
patient tongue id: 05182014049361_1_2
label yaofang:
黄芪 白术 杜仲 生半夏 砂仁 鸡内金 续断 合欢皮 山慈菇 蛇舌草 稻芽 红芪
0.497876 0.393094 0.421963 0.498449 0.541835 0.303171 0.339402
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
492. 
patient tongue id: 03141252213917_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.734078 0.412368 0.545802 0.416783 0.359359 0.300242
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
493. 
patient tongue id: 06012130478797_3_4_6
label yaofang:
甘草 白芍 法半夏 茯苓 党参 黄芪 白术 五味子 细辛 款冬花 地龙 苦杏仁 紫苏子 炙麻黄 川加皮
0.840041 0.333381 0.458513 0.483267 0.356514 0.321342
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
494. 
patient tongue id: 06170911050273_1_2_6
label yaofang:
龙齿 黄芪 白术 丹参 牡丹皮 砂仁 鸡内金 莲子 北沙参 首乌藤 合欢皮 墨旱莲
0.394599 0.318636 0.363336 0.707989 0.622489 0.3208 0.439142 0.310229 0.341339 0.500307 0.33128
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.545455, recall: 0.500000, error: 0.454545
495. 
patient tongue id: 03111505296377_3_4
label yaofang:
甘草 香附 法半夏 茯苓 白术 杜仲 山药 山茱萸 泽泻 天麻 补骨脂 桑螵蛸 益智 佛手 合欢花
0.580687 0.433356 0.429079 0.35182 0.50973
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
496. 
patient tongue id: 03221311417781_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 薏苡仁 桃仁 鱼腥草 浙贝母 细辛 桑白皮 地骨皮 苇茎 苦杏仁
0.996238 0.558926 0.67191 0.472659 0.369299 0.304843 0.321349 0.746509 0.661618 0.664367 0.521279 0.551643 0.594207
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.142857, error: 0.846154
497. 
patient tongue id: 02182203165868_7_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 芦根 牛蒡子 桃仁 玄参 浙贝母 板蓝根 紫苏梗 威灵仙
0.936538 0.508633 0.505728 0.421749 0.373619 0.306875 0.328194
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
498. 
patient tongue id: 03221258216564_4_1
label yaofang:
甘草 薏苡仁 党参 牡丹皮 山药 灯心草 天麻 鳖甲 茵陈 扁豆花 麦芽 蜈蚣 白花蛇舌 天山雪莲 木棉花
0.980212 0.525383 0.62405 0.445849 0.342125 0.303613 0.329121 0.632794 0.519231 0.516093 0.400983 0.419049 0.438122
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.533333, error: 0.384615
499. 
patient tongue id: 01070844265000_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.523273 0.393966 0.371195 0.40556 0.656266 0.685187 0.339905 0.339315 0.480463 0.417416 0.329495 0.366335 0.544536 0.409668 0.303907
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 莪术 鸡内金 北沙参 合欢皮 蛇舌草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
------Average Score: average precision: 0.460088, average recall: 0.368332, error: 0.539912