20544/20571 [============================>.] - ETA: 0s - loss: 0.1231Epoch 00000: val_loss improved from inf to 0.08045, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 189s - loss: 0.1230 - val_loss: 0.0805
Epoch 2/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0888Epoch 00001: val_loss improved from 0.08045 to 0.07852, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 195s - loss: 0.0888 - val_loss: 0.0785
Epoch 3/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0849Epoch 00002: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0849 - val_loss: 0.0806
Epoch 4/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0828Epoch 00003: val_loss improved from 0.07852 to 0.07583, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 181s - loss: 0.0828 - val_loss: 0.0758
Epoch 5/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0817Epoch 00004: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0817 - val_loss: 0.0771
Epoch 6/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0806Epoch 00005: val_loss improved from 0.07583 to 0.07476, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 198s - loss: 0.0806 - val_loss: 0.0748
Epoch 7/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0797Epoch 00006: val_loss improved from 0.07476 to 0.07410, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 181s - loss: 0.0797 - val_loss: 0.0741
Epoch 8/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0791Epoch 00007: val_loss improved from 0.07410 to 0.07370, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 198s - loss: 0.0791 - val_loss: 0.0737
Epoch 9/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0784Epoch 00008: val_loss improved from 0.07370 to 0.07338, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 198s - loss: 0.0784 - val_loss: 0.0734
Epoch 10/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0777Epoch 00009: val_loss did not improve
20571/20571 [==============================] - 181s - loss: 0.0777 - val_loss: 0.0749
Epoch 11/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0773Epoch 00010: val_loss improved from 0.07338 to 0.07326, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 198s - loss: 0.0773 - val_loss: 0.0733
Epoch 12/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0768Epoch 00011: val_loss improved from 0.07326 to 0.07315, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 198s - loss: 0.0768 - val_loss: 0.0731
Epoch 13/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0763Epoch 00012: val_loss did not improve
20571/20571 [==============================] - 180s - loss: 0.0763 - val_loss: 0.0733
Epoch 14/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0759Epoch 00013: val_loss improved from 0.07315 to 0.07239, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 198s - loss: 0.0759 - val_loss: 0.0724
Epoch 15/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0753Epoch 00014: val_loss improved from 0.07239 to 0.07226, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 198s - loss: 0.0753 - val_loss: 0.0723
Epoch 16/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0750Epoch 00015: val_loss improved from 0.07226 to 0.07203, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 181s - loss: 0.0750 - val_loss: 0.0720
Epoch 17/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0746Epoch 00016: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0746 - val_loss: 0.0727
Epoch 18/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0744Epoch 00017: val_loss did not improve
20571/20571 [==============================] - 196s - loss: 0.0744 - val_loss: 0.0728
Epoch 19/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0739Epoch 00018: val_loss did not improve
20571/20571 [==============================] - 125s - loss: 0.0739 - val_loss: 0.0725
Epoch 20/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0736Epoch 00019: val_loss did not improve
20571/20571 [==============================] - 186s - loss: 0.0736 - val_loss: 0.0721
Epoch 21/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0732Epoch 00020: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0732 - val_loss: 0.0735
Epoch 22/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0730Epoch 00021: val_loss did not improve
20571/20571 [==============================] - 182s - loss: 0.0730 - val_loss: 0.0721
Epoch 23/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0725Epoch 00022: val_loss did not improve
20571/20571 [==============================] - 197s - loss: 0.0725 - val_loss: 0.0743
Epoch 24/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0722Epoch 00023: val_loss improved from 0.07203 to 0.07201, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 198s - loss: 0.0722 - val_loss: 0.0720
Epoch 25/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0717Epoch 00024: val_loss did not improve
20571/20571 [==============================] - 181s - loss: 0.0717 - val_loss: 0.0722
Epoch 26/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0715Epoch 00025: val_loss improved from 0.07201 to 0.07198, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 198s - loss: 0.0715 - val_loss: 0.0720
Epoch 27/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0711Epoch 00026: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0711 - val_loss: 0.0733
Epoch 28/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0708Epoch 00027: val_loss did not improve
20571/20571 [==============================] - 181s - loss: 0.0708 - val_loss: 0.0731
Epoch 29/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0704Epoch 00028: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0704 - val_loss: 0.0730
Epoch 30/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0701Epoch 00029: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0701 - val_loss: 0.0729
Epoch 31/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0698Epoch 00030: val_loss did not improve
20571/20571 [==============================] - 181s - loss: 0.0698 - val_loss: 0.0729
Epoch 32/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0693Epoch 00031: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0693 - val_loss: 0.0725
Epoch 33/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0691Epoch 00032: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0691 - val_loss: 0.0754
Epoch 34/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0689Epoch 00033: val_loss did not improve
20571/20571 [==============================] - 181s - loss: 0.0689 - val_loss: 0.0729
Epoch 35/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0685Epoch 00034: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0685 - val_loss: 0.0728
Epoch 36/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0680Epoch 00035: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0680 - val_loss: 0.0724
Epoch 37/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0676Epoch 00036: val_loss did not improve
20571/20571 [==============================] - 181s - loss: 0.0676 - val_loss: 0.0734
Epoch 38/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0673Epoch 00037: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0674 - val_loss: 0.0737
Epoch 39/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0669Epoch 00038: val_loss did not improve
20571/20571 [==============================] - 197s - loss: 0.0669 - val_loss: 0.0744
Epoch 40/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0666Epoch 00039: val_loss did not improve
20571/20571 [==============================] - 182s - loss: 0.0666 - val_loss: 0.0735
Epoch 41/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0662Epoch 00040: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0662 - val_loss: 0.0733
Epoch 42/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0658Epoch 00041: val_loss did not improve
20571/20571 [==============================] - 191s - loss: 0.0658 - val_loss: 0.0732
Epoch 43/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0656Epoch 00042: val_loss did not improve
20571/20571 [==============================] - 188s - loss: 0.0656 - val_loss: 0.0738
Epoch 44/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0651Epoch 00043: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0651 - val_loss: 0.0741
Epoch 45/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0648Epoch 00044: val_loss did not improve
20571/20571 [==============================] - 186s - loss: 0.0648 - val_loss: 0.0741
Epoch 46/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0644Epoch 00045: val_loss did not improve
20571/20571 [==============================] - 194s - loss: 0.0644 - val_loss: 0.0745
Epoch 47/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0640Epoch 00046: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0640 - val_loss: 0.0751
Epoch 48/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0636Epoch 00047: val_loss did not improve
20571/20571 [==============================] - 181s - loss: 0.0637 - val_loss: 0.0752
Epoch 49/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0634Epoch 00048: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0633 - val_loss: 0.0747
Epoch 50/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0631Epoch 00049: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0631 - val_loss: 0.0748
Epoch 51/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0627Epoch 00050: val_loss did not improve
20571/20571 [==============================] - 181s - loss: 0.0627 - val_loss: 0.0753
Epoch 52/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0625Epoch 00051: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0625 - val_loss: 0.0746
Epoch 53/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0622Epoch 00052: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0622 - val_loss: 0.0754
Epoch 54/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0618Epoch 00053: val_loss did not improve
20571/20571 [==============================] - 181s - loss: 0.0618 - val_loss: 0.0750
Epoch 55/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0615Epoch 00054: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0615 - val_loss: 0.0757
Epoch 56/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0612Epoch 00055: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0612 - val_loss: 0.0749
Epoch 57/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0610Epoch 00056: val_loss did not improve
20571/20571 [==============================] - 181s - loss: 0.0610 - val_loss: 0.0761
Epoch 58/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0608Epoch 00057: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0608 - val_loss: 0.0751
Epoch 59/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0605Epoch 00058: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0605 - val_loss: 0.0756
Epoch 60/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0602Epoch 00059: val_loss did not improve
20571/20571 [==============================] - 180s - loss: 0.0603 - val_loss: 0.0762
Epoch 61/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0600Epoch 00060: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0600 - val_loss: 0.0759
Epoch 62/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0597Epoch 00061: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0597 - val_loss: 0.0768
Epoch 63/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0594Epoch 00062: val_loss did not improve
20571/20571 [==============================] - 181s - loss: 0.0594 - val_loss: 0.0763
Epoch 64/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0592Epoch 00063: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0592 - val_loss: 0.0758
Epoch 65/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0590Epoch 00064: val_loss did not improve
20571/20571 [==============================] - 195s - loss: 0.0589 - val_loss: 0.0763
Epoch 66/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0588Epoch 00065: val_loss did not improve
20571/20571 [==============================] - 184s - loss: 0.0588 - val_loss: 0.0760
Epoch 67/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0585Epoch 00066: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0584 - val_loss: 0.0766
Epoch 68/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0583Epoch 00067: val_loss did not improve
20571/20571 [==============================] - 190s - loss: 0.0583 - val_loss: 0.0774
Epoch 69/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0579Epoch 00068: val_loss did not improve
20571/20571 [==============================] - 189s - loss: 0.0579 - val_loss: 0.0767
Epoch 70/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0578Epoch 00069: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0578 - val_loss: 0.0767
Epoch 71/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0576Epoch 00070: val_loss did not improve
20571/20571 [==============================] - 184s - loss: 0.0576 - val_loss: 0.0765
Epoch 72/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0573Epoch 00071: val_loss did not improve
20571/20571 [==============================] - 194s - loss: 0.0573 - val_loss: 0.0765
Epoch 73/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0570Epoch 00072: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0570 - val_loss: 0.0766
Epoch 74/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0568Epoch 00073: val_loss did not improve
20571/20571 [==============================] - 180s - loss: 0.0568 - val_loss: 0.0772
Epoch 75/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0565Epoch 00074: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0565 - val_loss: 0.0770
Epoch 76/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0563Epoch 00075: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0563 - val_loss: 0.0774
Epoch 77/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0561Epoch 00076: val_loss did not improve
20571/20571 [==============================] - 181s - loss: 0.0561 - val_loss: 0.0771
Epoch 78/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0559Epoch 00077: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0558 - val_loss: 0.0775
Epoch 79/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0557Epoch 00078: val_loss did not improve
20571/20571 [==============================] - 198s - loss: 0.0557 - val_loss: 0.0773
Epoch 80/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0554Epoch 00079: val_loss did not improve
20571/20571 [==============================] - 181s - loss: 0.0554 - val_loss: 0.0776
history: [(0.12303425660238715, None, 0.080454273900666382, None), (0.088772118051018131, None, 0.078520199774425689, None), (0.084888796291216415, None, 0.080634359310025314, None), (0.082849887397500099, None, 0.075832425073764462, None), (0.081698976308259494, None, 0.077102934490872299, None), (0.080642519666053222, None, 0.074756477498754151, None), (0.079711087641318581, None, 0.074098251873409002, None), (0.07906390139639774, None, 0.073703163007169378, None), (0.078399730302550263, None, 0.073380514230902333, None), (0.077727434318870345, None, 0.074858675434436972, None), (0.077339999111881122, None, 0.073261227600469256, None), (0.076767572111105464, None, 0.07314783849581917, None), (0.076293895797703765, None, 0.073287443018304338, None), (0.075936897056352287, None, 0.072394312131168995, None), (0.07532302132395638, None, 0.072263885283760459, None), (0.075035883572182022, None, 0.072027245669695164, None), (0.074623139387238482, None, 0.072746459819954826, None), (0.074372766179710684, None, 0.072818859980712386, None), (0.073939897215978892, None, 0.072503152497600379, None), (0.073598749544463354, None, 0.072054808758074476, None), (0.07321395187125615, None, 0.073502581957812729, None), (0.072974117818386253, None, 0.072062167913129888, None), (0.072486346787376255, None, 0.074294101747385086, None), (0.072233186056545426, None, 0.072006742289939071, None), (0.071692446458351863, None, 0.072181525590575807, None), (0.071481287133872765, None, 0.071979128981017632, None), (0.071113877322583285, None, 0.073257439876119837, None), (0.070810875264430376, None, 0.073074577900735571, None), (0.070403857324237082, None, 0.072965406357697701, None), (0.070069114235330521, None, 0.072857963961734801, None), (0.069766392721182222, None, 0.072893401361219412, None), (0.069317533282329383, None, 0.072520063682551442, None), (0.069075126754519572, None, 0.075406210199338658, None), (0.06885180212595346, None, 0.072898843029409063, None), (0.068470221967740844, None, 0.072793389893104313, None), (0.068021447352721295, None, 0.072419182849619845, None), (0.067635652224932702, None, 0.073424638480038773, None), (0.067350072810750242, None, 0.073730272041063874, None), (0.066895943938538413, None, 0.074401295881383861, None), (0.066622121721632163, None, 0.073547583957921422, None), (0.066170111097908643, None, 0.073301362279161827, None), (0.065771827281642728, None, 0.073181406349578773, None), (0.065601574174165553, None, 0.073828801036425376, None), (0.065098686322948698, None, 0.074061590253943904, None), (0.064756786096794916, None, 0.074075225712320392, None), (0.064365613355361215, None, 0.074479340713136638, None), (0.063996452420397962, None, 0.075144682680589783, None), (0.063657720989446387, None, 0.075227982638179799, None), (0.063339848975721549, None, 0.0746847409216327, None), (0.063098100762719933, None, 0.074827438393321399, None), (0.062721628366678106, None, 0.075309162514349465, None), (0.062475086456965791, None, 0.07464128269996817, None), (0.062210690561352575, None, 0.075368287141011001, None), (0.061799476261555228, None, 0.074984430076052613, None), (0.061528600696938822, None, 0.075713711707105738, None), (0.061226910308230152, None, 0.074864232393840671, None), (0.061027516081083859, None, 0.076149466590703527, None), (0.060778095967284229, None, 0.075130119863075384, None), (0.060470099959821833, None, 0.075571843081322615, None), (0.06025213748651255, None, 0.07615561737385515, None), (0.06002908452145006, None, 0.075852733043049389, None), (0.059677865198654874, None, 0.076794367459357415, None), (0.059382974305742707, None, 0.076297296996439612, None), (0.059214659458423156, None, 0.075753517335499079, None), (0.058948873689433572, None, 0.076296671726025042, None), (0.058766203008113679, None, 0.075989229221866558, None), (0.058449466432484186, None, 0.076552047282230543, None), (0.058297568073698236, None, 0.077353593149141628, None), (0.057903842747451952, None, 0.07669842223916061, None), (0.057821538182154131, None, 0.076695930921505215, None), (0.057569099175023682, None, 0.076520309895503832, None), (0.057324027711876245, None, 0.076510298798708423, None), (0.057038952517935976, None, 0.076621919394083762, None), (0.056763088737273676, None, 0.077245558687178154, None), (0.056453381836230346, None, 0.076975739551098557, None), (0.056331154016442758, None, 0.077371202987622997, None), (0.056104871599737739, None, 0.077086322315751687, None), (0.055841513827952362, None, 0.077534595308782844, None), (0.05570465467870598, None, 0.077302035585023132, None), (0.055444803910347049, None, 0.077643909388118326, None)]
0. 
patient tongue id: 03231058256534_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 桃仁 酸枣仁 黄连 竹茹 浙贝母 牡丹皮 天花粉 威灵仙 合欢花
0.911431 0.476842 0.498994 0.430973 0.317918 0.481347 0.438715 0.50736 0.331797 0.36323 0.375867
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
1. 
patient tongue id: 03231056064256_2_6
label yaofang:
甘草 白芍 酸枣仁 牡丹皮 山药 山茱萸 地黄 天麻 白花蛇舌草 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.94649 0.478571 0.520401 0.412665 0.519308 0.502489 0.54289 0.3711 0.416481 0.430407
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
2. 
patient tongue id: 03132013566983_1_4_7
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 佩兰 浮小麦 首乌藤 百合 制远志
0.49645 0.373407 0.370811 0.377967 0.300132
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
3. 
patient tongue id: 06191217185190_4_6
label yaofang:
甘草 党参 鸡血藤 白术 生地黄 杜仲 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力 千斤拔
0.517528 0.349147 0.447671 0.453371 0.413525 0.460906 0.39795 0.412093 0.372757 0.417481 0.367717 0.446635 0.453656 0.418526 0.430623 0.412284
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.214286, error: 0.812500
4. 
patient tongue id: 04282038419013_1_6_5
label yaofang:
甘草 柴胡 白芍 黄芪 白术 丹参 延胡索 海螵蛸 枳实 砂仁 北沙参 广金钱草
0.452381 0.360135 0.352309 0.474023 0.345901
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
5. 
patient tongue id: 04171943375871_4
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 白芷 款冬花 紫菀 百部 豆蔻 蝉蜕 炙甘草 辛夷 广藿香 炒苍耳子 麸炒白术
0.939189 0.311213 0.969801 0.605591 0.771925 0.304454 0.311137 0.315435 0.931617 0.952655 0.917612 0.948163 0.983094 0.399137 0.502599 0.563557 0.855296
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.588235, recall: 0.625000, error: 0.411765
6. 
patient tongue id: 01201308575284_1_2_4
label yaofang:
桂枝 甘草 茯苓 薏苡仁 党参 红花 郁金 山药 荆芥穗 鳖甲 莪术 白鲜皮 蜈蚣 白花蛇舌 天山雪莲 红豆杉 土茯苓
0.885618 0.46188 0.460414 0.421789 0.366668 0.301797 0.414028
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.294118, error: 0.285714
7. 
patient tongue id: 03261712558199_7
label yaofang:
桃仁 丹参 红花 熟地黄 山茱萸 三七
0.440537 0.333557 0.334117 0.393365 0.300354
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
8. 
patient tongue id: 04271848465838_1_7
label yaofang:
桂枝 甘草 半夏 桃仁 蒲公英 黄芪 白术 浙贝母 厚朴 莪术 柿蒂 北沙参 赭石 蛇舌草
0.405992 0.439311 0.386364 0.303396
predicted yaofang:
黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
9. 
patient tongue id: 01051911349112_1
label yaofang:
白芍 川芎 当归 党参 太子参 黄芪 枸杞子 煅牡蛎 北沙参 山萸肉 炙甘草 续断 盐菟丝子 酒女贞子 盐巴戟天 煅龙骨
0.303348 0.837767 0.335405 0.89137 0.501262 0.682498 0.324124 0.348307 0.832101 0.861053 0.836269 0.870408 0.321136 0.933175 0.413424 0.482627 0.539448 0.752696
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.166667, recall: 0.187500, error: 0.833333
10. 
patient tongue id: 03242146453277_1_7_2
label yaofang:
甘草 枳壳 太子参 黄芪 白术 海螵蛸 厚朴 砂仁 火麻仁 鸡内金 北沙参 首乌藤 紫苏梗 合欢皮
0.407875 0.363921 0.317954 0.394344 0.378084
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
11. 
patient tongue id: 04282238335651_3_4
label yaofang:
甘草 白芍 木香 薏苡仁 党参 黄芪 白术 熟附子 天麻 巴戟天 鳖甲 莪术 败酱草 蜈蚣 半枝莲 龙葵果
0.966211 0.516805 0.525874 0.374052 0.57099 0.542126 0.560343 0.407974 0.45138 0.447733
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.437500, error: 0.300000
12. 
patient tongue id: 03240616592582_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 桔梗 白术 丹参 浙贝母 郁金 麦芽 猫爪草 红曲
0.922674 0.492846 0.507288 0.329593 0.522222 0.40783 0.408134 0.325917 0.311326
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
13. 
patient tongue id: 05272331421838_2_5
label yaofang:
黄芪 白术 生地黄 山茱萸 天麻 僵蚕 芡实 枇杷叶 北沙参 辛夷 山慈菇 蛇舌草 冬凌草
0.415578 0.451581 0.421709
predicted yaofang:
黄芪 白术 海螵蛸

------Score: precision: 0.666667, recall: 0.153846, error: 0.333333
14. 
patient tongue id: 02141934264802_1
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 砂仁 菟丝子 巴戟天 桑寄生 火麻仁 续断 制何首乌 黄精 艾叶
0.80775 0.420876 0.47341 0.326104 0.393821
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
15. 
patient tongue id: 01192243204911_1_6
label yaofang:
甘草 葛根 党参 黄芪 黄连 赤芍 牡丹皮 苍术 山药 山茱萸 天麻 首乌藤 合欢花 土茯苓
0.97453 0.497942 0.579892 0.35726 0.353048 0.310215 0.677935 0.547846 0.566761 0.383291 0.467888 0.455454
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
16. 
patient tongue id: 04291611021476_1_2_6
label yaofang:
甘草 党参 白术 丹参 郁金 山药 砂仁 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.981602 0.544824 0.579964 0.336661 0.368348 0.32116 0.691407 0.672288 0.626779 0.535037 0.595928 0.605113
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
17. 
patient tongue id: 03301319121518_4
label yaofang:
法半夏 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.910802 0.331528 0.95183 0.567499 0.742234 0.310047 0.305599 0.322816 0.9049 0.928028 0.888698 0.926414 0.966879 0.418317 0.497026 0.555232 0.823303
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.928571, error: 0.235294
18. 
patient tongue id: 01042355272600_6_4
label yaofang:
麻黄 甘草 法半夏 茯苓 前胡 桔梗 桃仁 远志 浙贝母 细辛 益母草 鳖甲 款冬花 紫菀 紫苏子 白花蛇舌
0.903437 0.475469 0.516788 0.367257 0.303285 0.515662 0.339436 0.388847
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.187500, error: 0.625000
19. 
patient tongue id: 02142001120764_4
label yaofang:
甘草 牛蒡子 肉桂 干姜 附片
0.413896 0.393193 0.317284 0.363523 0.350936 0.407918
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.200000, error: 0.833333
20. 
patient tongue id: 03170925189826_1_4_7
label yaofang:
薏苡仁 桃仁 鸡血藤 赤芍 牡丹皮 苍术 泽泻 萹蓄 炙甘草 威灵仙 土茯苓
0.411856 0.367483 0.37134 0.303984
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
21. 
patient tongue id: 06052030155347_4
label yaofang:
陈皮 茯苓 木香 薏苡仁 海螵蛸 砂仁 柿蒂 赭石 瓦楞子 预知子
0.793809 0.445983 0.420401 0.387105
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.100000, error: 0.750000
22. 
patient tongue id: 01172359288914_1_5
label yaofang:
甘草 茯苓 半夏 橘红 太子参 白术 酸枣仁 砂仁 北沙参 首乌藤 合欢皮 山慈菇
0.501765 0.374273 0.348404 0.348168 0.53775 0.525907 0.343345 0.304811 0.409179 0.338092 0.346703 0.358115 0.308666
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.538462, recall: 0.583333, error: 0.461538
23. 
patient tongue id: 03091846366994_6_1
label yaofang:
甘草 赤芍 杜仲 郁金 天麻 菟丝子 桑寄生 鳖甲 王不留行 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.887624 0.460239 0.47801 0.346524 0.430816 0.301269 0.364084
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
24. 
patient tongue id: 04251849149681_5
label yaofang:
茯苓 党参 白术 肉桂 干姜 炙甘草
0.894298 0.335492 0.448623 0.455444 0.311154 0.393127 0.330218
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.500000, error: 0.571429
25. 
patient tongue id: 01061608531875_6_4_1
label yaofang:
甘草 茯苓 薏苡仁 白术 生地黄 浙贝母 郁金 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲
0.893798 0.463076 0.416745 0.470416 0.418874
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
26. 
patient tongue id: 01100248200851_1_2
label yaofang:
白芍 牛膝 全蝎 苏木 炙甘草 紫苏梗 蜈蚣 醋延胡索
0.355084 0.314245
predicted yaofang:
黄芪 炙甘草

------Score: precision: 0.500000, recall: 0.125000, error: 0.500000
27. 
patient tongue id: 04241848510427_1
label yaofang:
甘草 白芍 川芎 独活 柏子仁 牛膝 细辛 干姜 蜈蚣 姜黄 海桐皮 鹿衔草
0.376484 0.378545 0.389392 0.39424
predicted yaofang:
白芍 白术 海螵蛸 炙甘草

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
28. 
patient tongue id: 02161941536123_6
label yaofang:
甘草 法半夏 浙贝母 石膏 苍术 淡竹叶 紫苏叶 川木通
0.399539 0.3011 0.310599 0.337594 0.532999
predicted yaofang:
白芍 党参 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
29. 
patient tongue id: 01192143110958_2_7
label yaofang:
甘草 桃仁 党参 生地黄 山茱萸 泽泻 车前子 天麻 鳖甲 鹿角霜 蜈蚣 白花蛇舌 天山雪莲 半枝莲 泽兰
0.404141 0.441071 0.417192 0.38764 0.360025 0.334749 0.377431 0.467547
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 款冬花 紫菀 炙甘草

------Score: precision: 0.125000, recall: 0.066667, error: 0.875000
30. 
patient tongue id: 03101940324998_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄
0.644695 0.317439 0.633074 0.427408 0.539014 0.306129 0.302004 0.324029 0.534175 0.717194 0.592055 0.640135 0.885818 0.424963 0.349891 0.535838
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.687500, recall: 0.785714, error: 0.312500
31. 
patient tongue id: 02161951460215_1
label yaofang:
甘草 白芍 当归 木香 党参 白术 海螵蛸 肉桂 车前子 肉豆蔻 诃子 炙甘草 附片
0.550761 0.355124 0.341743 0.407937 0.341425
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
32. 
patient tongue id: 02222335366851_6_4
label yaofang:
甘草 茯苓 半夏 橘红 白术 丹参 赤芍 瓜蒌皮 枇杷叶 北沙参 首乌藤 合欢皮 墨旱莲
0.459808 0.363203 0.303103 0.506167 0.444906 0.321949 0.302256
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
33. 
patient tongue id: 05290815154503_4_6
label yaofang:
甘草 薏苡仁 桃仁 党参 浙贝母 郁金 山药 天麻 补骨脂 莪术 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.9763 0.540618 0.581022 0.329577 0.352919 0.317752 0.680855 0.585117 0.544856 0.427256 0.493974 0.4842
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
34. 
patient tongue id: 06111029236383_2_4
label yaofang:
甘草 黄芩 麦冬 酸枣仁 浙贝母 山药 鳖甲 茵陈 扁豆花 麦芽 白花蛇舌 蜂房 岗梅根 四季青 木棉花
0.946324 0.495841 0.52802 0.365757 0.55102 0.502972 0.49331 0.364216 0.406954 0.38679
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
35. 
patient tongue id: 04252004191718_4_7
label yaofang:
柴胡 黄芩 羌活 党参 白术 泽泻 天麻 白芷 姜半夏 炙甘草 续断
0.354231 0.319507 0.423947 0.326931 0.360637 0.321697 0.353796 0.466342
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.454545, error: 0.375000
36. 
patient tongue id: 04211758115717_1
label yaofang:
法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.301072 0.873911 0.374178 0.911958 0.539872 0.697998 0.331754 0.312699 0.33157 0.856925 0.881384 0.839869 0.878619 0.32793 0.944656 0.395406 0.504749 0.549335 0.784032
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.846154, error: 0.421053
37. 
patient tongue id: 04072021386808_1_2_6
label yaofang:
甘草 茯苓 党参 白术 丹参 厚朴 桑寄生 鸡内金 橘络 首乌藤 桑枝 合欢皮
0.479186 0.38659 0.347165 0.412476 0.406601
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
38. 
patient tongue id: 01061842504754_2_4
label yaofang:
甘草 茯苓 葛根 麦冬 玄参 牡丹皮 北沙参 百合 人参叶 干石斛
0.311739 0.755915 0.379158 0.804827 0.48408 0.609813 0.343949 0.314097 0.352467 0.305843 0.74079 0.767131 0.73626 0.780715 0.353631 0.860708 0.397009 0.459819 0.507624 0.684878
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.200000, error: 0.900000
39. 
patient tongue id: 06082021152527_2_5
label yaofang:
甘草 枳壳 连翘 党参 浙贝母 厚朴 僵蚕 北沙参 板蓝根 辛夷 紫苏叶 土牛膝
0.39051 0.365272 0.315788 0.442905 0.397898 0.349403
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
40. 
patient tongue id: 02020829408841_2
label yaofang:
甘草 茯苓 酸枣仁 生地黄 牡丹皮 山药 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 骨碎补
0.987381 0.560278 0.594476 0.330275 0.391545 0.330017 0.730666 0.693053 0.651718 0.551716 0.618256 0.629355
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
41. 
patient tongue id: 04111950080027_1_4_6
label yaofang:
甘草 党参 太子参 黄芪 枸杞子 白术 丹参 海螵蛸 杜仲 牛膝 郁金 山药 鸡内金 麦芽 北沙参 紫苏叶
0.520452 0.39046 0.372049 0.478424 0.368313
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.250000, error: 0.200000
42. 
patient tongue id: 05222048283442_1_6_5
label yaofang:
牡蛎 连翘 党参 白术 赤芍 山药 厚朴 砂仁 北沙参 土鳖虫 红豆杉 山慈菇 预知子 蛇舌草
0.47478 0.335829 0.455028 0.621303 0.600683 0.378748 0.330413 0.494925 0.37788 0.37335 0.422351 0.371347 0.304036 0.33927
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮 预知子 蛇舌草

------Score: precision: 0.428571, recall: 0.428571, error: 0.571429
43. 
patient tongue id: 02142001548586_4
label yaofang:
甘草 黄连 肉桂 干姜 附片
0.444567 0.393709 0.322778 0.34685 0.30905 0.384857
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.200000, error: 0.833333
44. 
patient tongue id: 01200638521477_6_5
label yaofang:
金银花 党参 红花 厚朴 荆芥穗 天麻 鳖甲 火麻仁 麦芽 白鲜皮 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 土茯苓
0.872909 0.457998 0.498315 0.342984 0.465479 0.34524
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
45. 
patient tongue id: 03021259173139_4
label yaofang:
陈皮 生姜 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子
0.365901 0.372891 0.363888 0.322555 0.466662
predicted yaofang:
法半夏 茯苓 黄芪 钩藤 炙甘草

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
46. 
patient tongue id: 05131439000784_6_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 天麻 鳖甲 白前 紫苏梗 蜈蚣 天山雪莲 半枝莲 红豆杉
0.966944 0.515842 0.550482 0.374421 0.331557 0.321071 0.627401 0.589909 0.570999 0.446697 0.502741 0.479882
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
47. 
patient tongue id: 04201932421557_1_4
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 白术 浙贝母 天麻 白花蛇舌草 苦杏仁 紫苏梗 蜈蚣 半枝莲 醋鳖甲
0.991155 0.553565 0.610613 0.336543 0.410284 0.346732 0.760033 0.740013 0.703116 0.603609 0.676488 0.698421
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
48. 
patient tongue id: 06091943065186_1
label yaofang:
川芎 荆芥 防风 金银花 连翘 厚朴 白芷 天花粉 鳖甲 香薷 白扁豆 辛夷 紫苏叶
0.597108 0.368132 0.345245 0.42934 0.51257
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
49. 
patient tongue id: 05080844507562_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.369195 0.33818 0.346582 0.400754
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
50. 
patient tongue id: 03301934485710_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 蝉蜕 炙甘草 紫苏梗 广藿香 蜜麻黄
0.936094 0.970048 0.593146 0.783634 0.317791 0.933244 0.95429 0.924834 0.95272 0.98325 0.414315 0.517644 0.57423 0.855577
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.785714, recall: 0.785714, error: 0.214286
51. 
patient tongue id: 04072015534511_2
label yaofang:
芦根 麦冬 酸枣仁 五味子 生地黄 知母 珍珠母 北沙参 板蓝根 百合
0.553017 0.412465 0.323547 0.445004 0.426299 0.312715
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.166667, recall: 0.100000, error: 0.833333
52. 
patient tongue id: 02251135181772_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.894241 0.330175 0.938832 0.55565 0.726385 0.327633 0.334269 0.88813 0.913531 0.874946 0.913694 0.325962 0.960317 0.420227 0.495982 0.558693 0.811196
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.647059, recall: 0.785714, error: 0.352941
53. 
patient tongue id: 05242234242510_1_2_6
label yaofang:
甘草 柴胡 白芍 枳壳 薏苡仁 熟附子 天麻 鳖甲 莪术 败酱草 佛手 蜈蚣 半枝莲 龙葵果
0.947915 0.493444 0.520308 0.350044 0.538371 0.387034 0.432496 0.300691
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
54. 
patient tongue id: 04192239251218_2_1
label yaofang:
甘草 黄芩 太子参 生地黄 浙贝母 乌梅 山茱萸 白茅根 鳖甲 北沙参 白花蛇舌 天山雪莲 蜂房 四季青
0.951234 0.509001 0.546024 0.357001 0.324683 0.305238 0.59982 0.477789 0.474967 0.33885 0.389086 0.375214
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
55. 
patient tongue id: 01180640475023_6_4_7
label yaofang:
甘草 法半夏 茯苓 桃仁 远志 党参 酸枣仁 丹参 生地黄 红花 青皮 栀子 佛手 首乌藤 合欢花
0.957274 0.513967 0.526891 0.387367 0.304759 0.318989 0.554486 0.472818 0.49711 0.340563 0.378499 0.35151
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
56. 
patient tongue id: 04102106242777_4_1
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.397904 0.419065 0.386131 0.307225
predicted yaofang:
黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
57. 
patient tongue id: 03221303504034_6_4_2
label yaofang:
甘草 党参 玄参 浙贝母 郁金 天麻 鳖甲 莪术 夏枯草 麦芽 百合 蜈蚣 白花蛇舌 红豆杉 猫爪草
0.71019 0.415548 0.394756 0.337065
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.133333, error: 0.500000
58. 
patient tongue id: 03271352492395_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.305322 0.82986 0.356429 0.881455 0.51317 0.670473 0.334934 0.310137 0.338604 0.818762 0.846829 0.807631 0.853152 0.330952 0.925717 0.393891 0.483841 0.542708 0.753701
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
59. 
patient tongue id: 05260704573725_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 牛蒡子 桃仁 远志 浙贝母 细辛 款冬花 白前 苦杏仁 紫苏梗 蜜麻黄
0.956679 0.509686 0.526243 0.341097 0.303002 0.562436 0.543456 0.528571 0.421587 0.463903 0.468025
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
60. 
patient tongue id: 02231415272573_2
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.309446 0.728819 0.360422 0.794753 0.492658 0.602358 0.324629 0.310156 0.301776 0.338877 0.304067 0.713846 0.77379 0.710131 0.768415 0.30409 0.872478 0.374435 0.4565 0.448599 0.656011
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.571429, recall: 1.000000, error: 0.428571
61. 
patient tongue id: 03302134133528_6_2_4
label yaofang:
甘草 川芎 法半夏 茯苓 牡蛎 白术 酸枣仁 黄连 生地黄 肉桂 灯心草 天麻 滑石 麦芽 艾叶
0.964311 0.541545 0.52512 0.32879 0.574593 0.521084 0.488219 0.387059 0.416914 0.390212
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
62. 
patient tongue id: 05162147413915_1_7
label yaofang:
甘草 枳壳 茯苓 桃仁 麦冬 党参 丹参 五味子 红花 山茱萸 补骨脂 鹿角霜 川加皮
0.974177 0.547916 0.549323 0.314778 0.304064 0.631735 0.563228 0.508513 0.414206 0.454004 0.418839
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
63. 
patient tongue id: 05102146051069_2_1
label yaofang:
白芍 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 山萸肉 炙甘草 沙苑子 制远志 盐菟丝子 酒女贞子 煅龙骨 炒酸枣仁
0.721204 0.395551 0.747246 0.45514 0.583135 0.331245 0.316795 0.690177 0.701388 0.689106 0.726806 0.348468 0.825951 0.366896 0.443448 0.493537 0.654173
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.176471, recall: 0.187500, error: 0.823529
64. 
patient tongue id: 05172106000479_2_1
label yaofang:
甘草 桔梗 芦根 麦冬 黄连 浙贝母 细辛 鳖甲 北沙参 白花蛇舌 蜂房 岗梅根 四季青 广升麻
0.911985 0.494517 0.492186 0.388295 0.465972 0.410366 0.441285 0.301801 0.327693 0.31532
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
65. 
patient tongue id: 04200618296965_6_2_4
label yaofang:
甘草 茯苓 薏苡仁 桃仁 党参 山药 砂仁 天麻 菟丝子 益母草 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 广金钱草
0.920212 0.486916 0.486916 0.343172 0.467034 0.412852 0.41343 0.301953 0.326095 0.303575
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.500000, error: 0.200000
66. 
patient tongue id: 04111516230181_1_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 山药 天花粉 北沙参 玉米须 有瓜石斛
0.413495 0.384289 0.334891 0.426245
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.750000, recall: 0.250000, error: 0.250000
67. 
patient tongue id: 04111958246301_1_4_7
label yaofang:
柴胡 陈皮 茯苓 半夏 党参 白术 丹参 海螵蛸 杜仲 牛膝 山药 僵蚕 桑寄生 秦艽 紫苏叶 布渣叶
0.485194 0.357596 0.384106 0.603 0.533855 0.302875 0.41503 0.311904 0.32445 0.4089
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
68. 
patient tongue id: 04171933015354_1_4
label yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.889891 0.358631 0.919657 0.529423 0.707938 0.308802 0.31097 0.867579 0.888106 0.852218 0.890047 0.314802 0.954902 0.372423 0.496539 0.544582 0.79963
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.705882, recall: 0.857143, error: 0.294118
69. 
patient tongue id: 02221224549676_4_1
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.419306 0.393716 0.309409 0.343907 0.325187 0.419753
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
70. 
patient tongue id: 02272224553829_1
label yaofang:
陈皮 当归 党参 黄芪 鸡血藤 白术 升麻 北柴胡 炙甘草 山慈菇
0.337621 0.331849 0.457532 0.349332 0.354553 0.336022 0.369571 0.444983
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.300000, error: 0.625000
71. 
patient tongue id: 04282247410426_1_2
label yaofang:
甘草 白芍 茯苓 龙骨 独活 党参 白术 酸枣仁 生地黄 杜仲 天麻 桑寄生 牛大力
0.971316 0.528975 0.534875 0.335523 0.304092 0.610627 0.58404 0.550688 0.443026 0.485449 0.478998
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
72. 
patient tongue id: 06190924057113_1_6
label yaofang:
甘草 茯苓 独活 桃仁 党参 红花 杜仲 桑寄生 麦芽 忍冬藤 续断 首乌藤 牛大力 千斤拔
0.966056 0.506723 0.545279 0.336789 0.315882 0.604696 0.571948 0.565975 0.436113 0.496721 0.506891
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
73. 
patient tongue id: 05161942480229_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.888534 0.336434 0.933332 0.539834 0.718289 0.324891 0.33007 0.88088 0.906233 0.866309 0.905174 0.326406 0.957235 0.418834 0.490298 0.557412 0.806068
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.866667, error: 0.235294
74. 
patient tongue id: 04142219043099_6_2_7
label yaofang:
甘草 白芍 茯苓 薏苡仁 桃仁 党参 白术 丹参 麦芽 白扁豆 合欢花 醋鳖甲 土鳖虫
0.976828 0.52956 0.572332 0.33593 0.324499 0.303359 0.667201 0.596896 0.546584 0.438591 0.49465 0.471696
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
75. 
patient tongue id: 04020753291115_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 莪术 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.955252 0.526516 0.539617 0.356559 0.561468 0.538699 0.509231 0.407254 0.441094 0.410944
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.714286, error: 0.000000
76. 
patient tongue id: 03011852441603_4
label yaofang:
麻黄 桂枝 白芍 前胡 半夏 太子参 黄芪 五味子 细辛 干姜 白前 百部 北沙参 紫苏子 炙甘草
0.560433 0.405837 0.522829 0.378261 0.460695 0.314874 0.324666 0.478474 0.489323 0.501391 0.522115 0.347749 0.674788 0.305769 0.353134 0.356065 0.468478
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.411765, recall: 0.466667, error: 0.588235
77. 
patient tongue id: 05221926227579_6_7
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.328891 0.385274 0.31819 0.370118 0.352573 0.459473
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
78. 
patient tongue id: 06111122598915_4_6
label yaofang:
甘草 白芍 龙骨 牡蛎 党参 酸枣仁 杜仲 山药 钩藤 天麻 桑寄生 决明子 浮小麦 建曲
0.850911 0.472912 0.452655 0.389443 0.368378 0.328645
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
79. 
patient tongue id: 03081802336456_4
label yaofang:
甘草 防风 丹参 生地黄 牡丹皮 乌梅 紫草 莪术 珍珠母 白鲜皮 紫苏叶 土茯苓 徐长卿
0.415058 0.306472 0.448452 0.343359 0.302949 0.427822
predicted yaofang:
甘草 柴胡 白芍 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
80. 
patient tongue id: 03101753053496_4_1
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.302521 0.761394 0.377389 0.783316 0.462878 0.604599 0.329398 0.318608 0.723712 0.742907 0.720175 0.761409 0.333548 0.870049 0.357951 0.455155 0.505435 0.677658
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.866667, error: 0.277778
81. 
patient tongue id: 02231849200584_4
label yaofang:
法半夏 前胡 防风 钩藤 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.317956 0.795069 0.350022 0.856753 0.493511 0.659478 0.322505 0.354835 0.306786 0.790894 0.823289 0.797743 0.835598 0.324918 0.900654 0.414865 0.482617 0.52378 0.720143
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
82. 
patient tongue id: 06111122014228_4_6
label yaofang:
甘草 白芍 党参 青皮 浙贝母 郁金 天麻 鳖甲 王不留行 女贞子 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.942001 0.513885 0.531113 0.380507 0.303557 0.314607 0.552449 0.455412 0.473653 0.324825 0.362511 0.341035
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
83. 
patient tongue id: 05270615594126_2_4_6
label yaofang:
甘草 白芍 薏苡仁 酸枣仁 熟附子 天麻 巴戟天 鳖甲 莪术 败酱草 佛手 蜈蚣 天山雪莲 合欢花 半枝莲 红豆杉
0.939071 0.500089 0.539521 0.35302 0.305887 0.56681 0.435036 0.436379 0.347989 0.321112
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.437500, error: 0.300000
84. 
patient tongue id: 04291514412648_4_6
label yaofang:
甘草 川芎 防风 羌活 党参 鸡血藤 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.992649 0.567493 0.60626 0.320883 0.406403 0.333974 0.761473 0.740029 0.697414 0.603272 0.675453 0.692139
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
85. 
patient tongue id: 01041842548170_1_2
label yaofang:
白芍 川芎 当归 党参 太子参 枸杞子 熟地黄 山萸肉 炙甘草 续断 沙苑子 炙黄芪 盐菟丝子 酒女贞子 盐杜仲 盐巴戟天
0.301306 0.698203 0.404142 0.728101 0.448528 0.561099 0.331349 0.319393 0.672679 0.688513 0.664043 0.70474 0.348943 0.795365 0.36955 0.432983 0.477336 0.631584
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.111111, recall: 0.125000, error: 0.888889
86. 
patient tongue id: 02190532585082_6_2_1
label yaofang:
甘草 法半夏 茯苓 丹参 延胡索 赤芍 郁金 薤白 砂仁 五灵脂 瓜蒌皮 莪术 麦芽 合欢花
0.913457 0.467245 0.477937 0.31734 0.448798 0.340479
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
87. 
patient tongue id: 01041846116219_1_4
label yaofang:
法半夏 茯苓 前胡 防风 钩藤 白芷 百部 豆蔻 炙甘草 首乌藤 广藿香 威灵仙 麸炒白术 炒蔓荆子 棉萆薢
0.303322 0.859904 0.345335 0.905102 0.528931 0.689637 0.33958 0.335299 0.84789 0.877091 0.836965 0.879415 0.341298 0.943659 0.403973 0.489707 0.552674 0.780057
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.388889, recall: 0.466667, error: 0.611111
88. 
patient tongue id: 03291954460128_2_5
label yaofang:
甘草 半夏 牛蒡子 枸杞子 白术 玄参 浙贝母 杜仲 僵蚕 补骨脂 射干 北沙参 蝉蜕 百合 蜈蚣 木蝴蝶 冬凌草 山豆根 岗梅
0.604948 0.390074 0.366745 0.465425 0.492716 0.326959
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.105263, error: 0.666667
89. 
patient tongue id: 04272308485765_6
label yaofang:
麻黄 桂枝 甘草 白芍 牡蛎 薏苡仁 桃仁 丹参 红花 赤芍 熟地黄 益母草 夏枯草 鹿角霜 姜炭 芥子
0.364455 0.495657 0.386893 0.310613 0.310629 0.431002 0.333336 0.557012 0.661566
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.111111, recall: 0.062500, error: 0.888889
90. 
patient tongue id: 05221916413616_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.923813 0.316289 0.961644 0.573357 0.769551 0.313905 0.91866 0.941489 0.907544 0.93901 0.973221 0.427791 0.516749 0.553366 0.83837
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.800000, recall: 0.750000, error: 0.200000
91. 
patient tongue id: 04250815062973_1_3
label yaofang:
甘草 枳壳 法半夏 茯苓 橘红 党参 黄芪 丹参 延胡索 竹茹 郁金 厚朴 牡荆子
0.597688 0.375235 0.473005 0.620943 0.5156 0.534363 0.654845 0.617807 0.580294 0.700315 0.368594 0.697531 0.701802 0.714266
predicted yaofang:
桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.214286, recall: 0.230769, error: 0.785714
92. 
patient tongue id: 05262053546021_2_6
label yaofang:
甘草 白术 酸枣仁 生地黄 杜仲 天麻 糯稻根 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 田七末
0.914944 0.32002 0.453903 0.514709 0.372908 0.472914 0.407975 0.463407 0.337498 0.34178
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
93. 
patient tongue id: 05251921163387_3_4
label yaofang:
桂枝 白芍 独活 薏苡仁 黄芪 苍术 炙甘草 桑枝 豨莶草 土茯苓 合欢皮 海桐皮 鹿衔草 走马胎
0.395254 0.334093 0.327984 0.363355 0.374472
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
94. 
patient tongue id: 05242112449464_1_4
label yaofang:
甘草 法半夏 前胡 桔梗 远志 浙贝母 细辛 桑白皮 款冬花 地龙 苦杏仁 紫苏子 炙麻黄
0.986801 0.550808 0.588372 0.328605 0.362487 0.314851 0.728211 0.678517 0.63181 0.519426 0.587861 0.584188
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.076923, error: 0.916667
95. 
patient tongue id: 06070636307073_7_4
label yaofang:
甘草 陈皮 法半夏 茯苓 桃仁 远志 党参 莱菔子 款冬花 白前 紫苏子 蛤壳 木棉花
0.957753 0.507358 0.535622 0.35042 0.579188 0.496381 0.494482 0.354632 0.40998 0.383647
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.230769, error: 0.700000
96. 
patient tongue id: 05092116241660_1_6
label yaofang:
甘草 远志 党参 白术 酸枣仁 玄参 柏子仁 浙贝母 地黄 白花蛇舌草 麦芽 首乌藤 醋鳖甲 猫爪草
0.863521 0.306974 0.438148 0.474323 0.341898 0.410389 0.348778
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
97. 
patient tongue id: 06132008035599_6_1
label yaofang:
甘草 枳壳 薏苡仁 蒲公英 白术 赤芍 浙贝母 牡丹皮 杜仲 郁金 厚朴 僵蚕 莪术 北沙参 续断 蜈蚣 合欢皮 预知子
0.50333 0.369507 0.316072 0.454607 0.453672
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.111111, error: 0.600000
98. 
patient tongue id: 05262120168956_4_1
label yaofang:
甘草 川芎 茯苓 党参 黄芪 白术 赤芍 胆南星 牡丹皮 天麻 僵蚕 芡实 地龙 益智 辛夷
0.940573 0.492794 0.494098 0.380812 0.441664 0.410331 0.462511 0.315232 0.304033
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.555556, recall: 0.333333, error: 0.444444
99. 
patient tongue id: 05061436054799_1_2
label yaofang:
茯苓 党参 僵蚕 磁石 巴戟天 淫羊藿 诃子 枇杷叶 地龙 北沙参 蝉蜕 木蝴蝶
0.515887 0.372991 0.365785 0.48079 0.395829
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
100. 
patient tongue id: 03021120341746_1_4_7
label yaofang:
甘草 法半夏 橘红 防风 金银花 太子参 藿香 白前 鸡内金 辛夷 蜜百部 干鱼腥草
0.343148 0.325785 0.351265 0.372173 0.312477
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
101. 
patient tongue id: 02212230165457_1_2_4
label yaofang:
茯苓 桔梗 橘红 芦根 浙贝母 莱菔子 鳖甲 扁豆花 紫苏子 浮小麦 白花蛇舌 蜂房 四季青 红豆杉
0.905853 0.48392 0.489398 0.385941 0.463405 0.331139 0.395064
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
102. 
patient tongue id: 06080146135403_1_7_6
label yaofang:
甘草 川芎 党参 酸枣仁 生地黄 延胡索 赤芍 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.801178 0.353285 0.385858 0.453483 0.350127 0.317138
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
103. 
patient tongue id: 01040655150965_2
label yaofang:
甘草 茯苓 酸枣仁 生地黄 牡丹皮 山药 山茱萸 天麻 鳖甲 麦芽 蜈蚣 天山雪莲 半枝莲 红豆杉
0.975151 0.537219 0.531295 0.329952 0.611439 0.574044 0.536681 0.439273 0.474121 0.456681
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
104. 
patient tongue id: 02272230289975_4_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.334489 0.466566 0.326517 0.315165 0.371148 0.467674 0.572316
predicted yaofang:
柴胡 白芍 香附 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
105. 
patient tongue id: 04210750135649_1_4_7
label yaofang:
甘草 法半夏 茯苓 桔梗 橘红 金银花 桃仁 党参 黄芪 丹参 枳实 竹茹 厚朴
0.346776 0.3197 0.390099 0.381253 0.438324 0.424692 0.306624 0.353602 0.387899 0.367717 0.363169 0.382521 0.361534 0.371932 0.368753
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.400000, recall: 0.461538, error: 0.600000
106. 
patient tongue id: 03292052128505_4_3
label yaofang:
桔梗 橘红 神曲 石菖蒲 厚朴 僵蚕 鸡内金 麦芽 炙甘草 稻芽 芥子
0.444748 0.348627 0.3205 0.336837 0.38553
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
107. 
patient tongue id: 04201417120633_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.341332 0.571954 0.420062 0.431415 0.604192 0.52899 0.519614 0.634418 0.595158 0.567727 0.674657 0.455658 0.667818 0.672997 0.677929
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
108. 
patient tongue id: 03192301282720_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 金银花 牛蒡子 浙贝母 细辛 桑白皮 瓜蒌皮 款冬花 苦杏仁
0.88801 0.310815 0.456276 0.496321 0.343315 0.439546 0.334292 0.364643
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
109. 
patient tongue id: 02171841358285_1
label yaofang:
麻黄 甘草 桔梗 防风 金银花 连翘 芦根 桑叶 菊花 荆芥穗 干鱼腥草 炒苍耳子 炒牛蒡子 燀苦杏仁
0.300476 0.878238 0.340645 0.93013 0.543249 0.71445 0.31784 0.331081 0.874373 0.901005 0.861202 0.903039 0.328173 0.952535 0.42116 0.483936 0.551289 0.798691
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.166667, recall: 0.214286, error: 0.833333
110. 
patient tongue id: 02161834335559_1
label yaofang:
陈皮 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.96041 0.982421 0.620258 0.818079 0.300528 0.955572 0.970799 0.944845 0.968608 0.991027 0.414145 0.52469 0.593983 0.892334
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.785714, recall: 0.785714, error: 0.214286
111. 
patient tongue id: 03171008294996_1_2
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 酸枣仁 丹参 郁金 鸡内金 首乌藤 百合 制远志
0.423182 0.329956 0.56424
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 1.000000, recall: 0.250000, error: 0.000000
112. 
patient tongue id: 03131236287109_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.430255 0.33587 0.333893 0.401605 0.379692 0.356129 0.315385 0.310277
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 车前子

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
113. 
patient tongue id: 04181147356533_1_3_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.520758 0.347254 0.321678 0.396972 0.512409 0.332292
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
114. 
patient tongue id: 04132037495241_5_2
label yaofang:
甘草 茯苓 桔梗 橘红 党参 丹参 僵蚕 枇杷叶 北沙参 咸竹蜂
0.359626 0.310438 0.405823 0.385384 0.309095 0.368681
predicted yaofang:
甘草 法半夏 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.500000, recall: 0.300000, error: 0.500000
115. 
patient tongue id: 01200432569719_6_5
label yaofang:
甘草 枳壳 龙骨 牡蛎 防风 连翘 党参 黄芪 白术 桑叶 莱菔子 浮小麦 独脚金 使君子
0.846149 0.467967 0.461223 0.384583 0.387223 0.309987 0.373339
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
116. 
patient tongue id: 03022150160233_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.342256 0.439672 0.315562 0.304262 0.326535 0.341912 0.313103 0.455751 0.572157
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
117. 
patient tongue id: 04171746511486_6_7
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.339906 0.471936 0.351924 0.300792 0.323512 0.448288 0.326919 0.523357 0.680742 0.304368
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.800000, recall: 0.727273, error: 0.200000
118. 
patient tongue id: 03081147402334_1_7
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.340485 0.649884 0.349948 0.323583 0.34402 0.304482
predicted yaofang:
甘草 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
119. 
patient tongue id: 05092044406781_1
label yaofang:
甘草 牛蒡子 浙贝母 射干 紫菀 豆蔻 马勃 姜半夏 广藿香 人参叶 龙脷叶 土牛膝
0.328536 0.485808 0.338542 0.324513 0.30597 0.430414 0.549286
predicted yaofang:
柴胡 白芍 白术 海螵蛸 浙贝母 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
120. 
patient tongue id: 03192244192786_1_6_2
label yaofang:
甘草 白芍 茯苓 独活 薏苡仁 党参 山药 天麻 鳖甲 莪术 白扁豆 佛手 蜈蚣 半枝莲 骨碎补
0.687106 0.384071 0.38431 0.369597 0.459304
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
121. 
patient tongue id: 02191426477378_4_1_7
label yaofang:
甘草 茯苓 党参 鸡血藤 白术 生地黄 红花 天麻 僵蚕 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.918507 0.48865 0.47107 0.380598 0.455925 0.341722 0.416527
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 1.000000, recall: 0.466667, error: 0.000000
122. 
patient tongue id: 04051927225104_1
label yaofang:
桂枝 甘草 当归 半夏 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 厚朴 砂仁 肉苁蓉 巴戟天 桑寄生 补骨脂 紫苏叶 骨碎补
0.632143 0.407145 0.392604 0.463144 0.42475
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.166667, error: 0.400000
123. 
patient tongue id: 04272313244644_6
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 浙贝母 紫菀 豆蔻 姜半夏 炙甘草 紫苏梗
0.407904 0.339899 0.468557 0.304793 0.373814 0.338069 0.343064 0.432872
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.416667, error: 0.375000
124. 
patient tongue id: 03291942043686_4
label yaofang:
甘草 半夏 薏苡仁 桃仁 白术 赤芍 浙贝母 牡丹皮 郁金 厚朴 僵蚕 夏枯草 北沙参 蛤壳 土鳖虫 猫爪草 山慈菇
0.544196 0.343172 0.386663 0.411959 0.490359 0.309245
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.333333, recall: 0.117647, error: 0.666667
125. 
patient tongue id: 03231031125155_3_7
label yaofang:
甘草 鸡血藤 枸杞子 白术 红花 熟地黄 杜仲 山药 山茱萸 菟丝子 桑寄生 益母草 淫羊藿 仙茅 威灵仙
0.92496 0.497524 0.512201 0.405002 0.314569 0.502167 0.456973 0.496627 0.341143 0.371214 0.35922
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
126. 
patient tongue id: 01061910374305_4
label yaofang:
法半夏 葛根 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 人参叶
0.813729 0.373545 0.853438 0.498906 0.646159 0.323986 0.321478 0.789999 0.815652 0.778893 0.822995 0.332166 0.901705 0.38135 0.473389 0.523098 0.731535
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.705882, recall: 0.800000, error: 0.294118
127. 
patient tongue id: 04300853010361_6_2
label yaofang:
甘草 荆芥 桃仁 蒲公英 红花 牡丹皮 郁金 地黄 地骨皮 天花粉 紫草 瓜蒌皮 王不留行 麦芽 白鲜皮
0.913462 0.471171 0.491947 0.363623 0.441318 0.343069 0.409455
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.142857, recall: 0.066667, error: 0.857143
128. 
patient tongue id: 01070847139138_1_4
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 厚朴
0.395952 0.356184 0.503512 0.384219 0.301155
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
129. 
patient tongue id: 02211951264696_6_4
label yaofang:
柴胡 白芍 法半夏 大枣 茯苓 龙骨 牡蛎 党参 栀子 牡丹皮 石菖蒲 大黄 淫羊藿 豆蔻 炙甘草 浮小麦
0.963756 0.518968 0.551761 0.340161 0.317038 0.301245 0.603024 0.50227 0.479421 0.359846 0.412468 0.390944
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.125000, error: 0.833333
130. 
patient tongue id: 05232113223439_1_4_6
label yaofang:
甘草 牡蛎 党参 阿胶 枸杞子 白术 牛膝 郁金 厚朴 僵蚕 桑寄生 火麻仁 紫苏子 紫苏叶 布渣叶 预知子 鲜龙葵果
0.488958 0.369429 0.303949 0.472213 0.481726 0.313744
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.235294, error: 0.333333
131. 
patient tongue id: 06091953147930_1_4_6
label yaofang:
甘草 茯苓 半夏 党参 黄芪 枸杞子 白术 柏子仁 海螵蛸 杜仲 牛膝 郁金 山药 厚朴 鸡内金 紫苏叶 黄精 红豆杉
0.516626 0.385363 0.350225 0.330524 0.5262 0.534964 0.332829 0.30116 0.409153 0.340645 0.315622 0.363831 0.303651
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.769231, recall: 0.555556, error: 0.230769
132. 
patient tongue id: 03020749445604_1_4_7
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.300531 0.30203 0.502671 0.301198
predicted yaofang:
茯苓 党参 黄芪 丹参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
133. 
patient tongue id: 04261956406519_4_1
label yaofang:
川芎 当归 茯苓 党参 太子参 黄芪 枸杞子 熟地黄 干姜 北沙参 山萸肉 炙甘草 续断 麸炒白术 盐菟丝子 酒女贞子
0.303005 0.816713 0.369713 0.854995 0.49851 0.651351 0.328717 0.326307 0.79699 0.816282 0.784432 0.830374 0.339613 0.910142 0.386155 0.471541 0.530116 0.734226
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.222222, recall: 0.250000, error: 0.777778
134. 
patient tongue id: 01312052360825_1_7
label yaofang:
甘草 桃仁 黄芪 何首乌 白术 砂仁 磁石 菟丝子 桑寄生 桑枝 土鳖虫 红豆杉 姜黄 墨旱莲
0.599382 0.415094 0.38426 0.393352 0.389634
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
135. 
patient tongue id: 01041825011435_4
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.906043 0.325992 0.945427 0.555455 0.745879 0.312663 0.338832 0.897779 0.926994 0.900423 0.925502 0.969087 0.421855 0.514436 0.547336 0.809925
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.800000, error: 0.250000
136. 
patient tongue id: 04131555111965_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.39338 0.39967 0.38683 0.543551 0.403558 0.386793 0.307645 0.351922 0.348863 0.340701 0.355529 0.319599
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 钩藤 泽泻 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 0.750000, error: 0.250000
137. 
patient tongue id: 01040034403992_1_6_4
label yaofang:
甘草 川芎 桃仁 枸杞子 红花 杜仲 天麻 桑寄生 益母草 鳖甲 粉葛 沙苑子 白花蛇舌 半枝莲
0.925181 0.49126 0.513719 0.3764 0.527432 0.43228 0.463762 0.304459 0.35229 0.333052
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
138. 
patient tongue id: 06011953346194_1_2_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 延胡索 川楝子 天麻 全蝎 鳖甲 浮小麦 白花蛇舌 半枝莲
0.979179 0.513164 0.558383 0.346115 0.311812 0.637247 0.630315 0.609747 0.481103 0.542645 0.559741
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
139. 
patient tongue id: 02171836524924_4_2
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.918117 0.318623 0.953775 0.558829 0.749342 0.315627 0.318495 0.910664 0.932577 0.897599 0.930883 0.312808 0.972468 0.409012 0.499279 0.573833 0.836977
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.866667, error: 0.235294
140. 
patient tongue id: 02010417002740_5_6
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 党参 黄芪 酸枣仁 丹参 黄连 乌梅 皂角刺 建曲 合欢花 麸炒枳壳
0.948335 0.520599 0.506974 0.351 0.301728 0.548318 0.505158 0.488012 0.387542 0.415416 0.398039
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
141. 
patient tongue id: 02211829490908_4
label yaofang:
甘草 白芍 川芎 独活 柏子仁 细辛 干姜 白芷 蜈蚣 姜黄 海桐皮 鹿衔草
0.411742 0.304286 0.352387 0.543801
predicted yaofang:
白芍 白术 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
142. 
patient tongue id: 03282210355984_6_2_4
label yaofang:
甘草 法半夏 党参 浙贝母 郁金 干姜 厚朴 天麻 鳖甲 莪术 麦芽 紫苏梗 蜈蚣 白花蛇舌 红豆杉 猫爪草
0.966901 0.526179 0.563522 0.387788 0.335358 0.340477 0.628781 0.590162 0.571141 0.453127 0.501644 0.47478
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
143. 
patient tongue id: 06012108596980_6
label yaofang:
麻黄 甘草 黄芩 茯苓 黄芪 白术 杜仲 厚朴 僵蚕 辛夷 蜈蚣 猫爪草
0.617159 0.395609 0.379396 0.323145 0.535508 0.570237 0.334502 0.41564 0.337571 0.310765 0.388207
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 莪术 北沙参

------Score: precision: 0.545455, recall: 0.500000, error: 0.454545
144. 
patient tongue id: 03161318279740_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.30906 0.839511 0.355969 0.899401 0.535637 0.680483 0.326977 0.310657 0.34414 0.300178 0.836056 0.865112 0.825491 0.8702 0.32668 0.928826 0.413972 0.486896 0.537417 0.766261
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
145. 
patient tongue id: 04112009034632_5_6
label yaofang:
甘草 薏苡仁 党参 白术 牡丹皮 杜仲 牛膝 天麻 桑寄生 金樱子 桑螵蛸 佛手 合欢花
0.951229 0.509017 0.525904 0.351234 0.561101 0.500066 0.490221 0.370714 0.410973 0.401262
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
146. 
patient tongue id: 06191155533153_5
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 黄连 红花 山药 天麻 蛇床子 麦芽 地龙 苦参 白鲜皮
0.950977 0.52629 0.548359 0.337964 0.329731 0.305711 0.602181 0.483326 0.465885 0.347623 0.396453 0.379867
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
147. 
patient tongue id: 02181555324179_6_5
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 茯苓 白及 麦冬 党参 黄连 生地黄 山药 灯心草 没药
0.980924 0.542445 0.566093 0.336266 0.357889 0.32027 0.668752 0.65311 0.619042 0.520254 0.573133 0.580012
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
148. 
patient tongue id: 04271849269035_4
label yaofang:
甘草 陈皮 前胡 桔梗 半夏 防风 荷叶 荆芥穗 款冬花 紫菀 百部 辛夷 苍耳子
0.303649 0.849836 0.347359 0.914938 0.545391 0.689527 0.326872 0.313525 0.349606 0.307931 0.85114 0.882824 0.841176 0.885617 0.329006 0.933728 0.437725 0.480738 0.534052 0.771351
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.692308, error: 0.550000
149. 
patient tongue id: 02120804283361_4_1
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 黄连 浙贝母 郁金 砂仁 天麻 鳖甲 豆蔻 苦杏仁 蜈蚣 白花蛇舌 天山雪莲
0.860899 0.503244 0.469413 0.341899 0.441293 0.335566 0.346262
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
150. 
patient tongue id: 02120817596003_4_2_6
label yaofang:
甘草 法半夏 当归 茯苓 橘红 远志 白术 浙贝母 细辛 款冬花 紫菀 苦杏仁 炙麻黄
0.930393 0.494464 0.504674 0.363322 0.50027 0.407457 0.45011 0.321247 0.310739
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
151. 
patient tongue id: 02182319320288_6_5
label yaofang:
甘草 柴胡 白芍 茯苓 龙骨 连翘 党参 酸枣仁 栀子 牡丹皮 菟丝子 益母草 合欢花 酒女贞子
0.927485 0.487235 0.491032 0.337554 0.485778 0.329147 0.374959
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
152. 
patient tongue id: 03090859055634_6_5
label yaofang:
甘草 柴胡 白芍 茯苓 木香 薏苡仁 蒲公英 党参 白术 山药 砂仁 麦芽 合欢花
0.859167 0.429284 0.466559 0.388659 0.376506 0.355547
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
153. 
patient tongue id: 01200648408446_1_7_5
label yaofang:
甘草 柴胡 蒲公英 黄芪 生地黄 天麻 白芷 天花粉 鳖甲 百部 王不留行 麦芽 皂角刺 蜈蚣 白花蛇舌 天山雪莲 半枝莲 广升麻
0.479508 0.386592 0.368646 0.37463
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.500000, recall: 0.111111, error: 0.500000
154. 
patient tongue id: 04051841265384_1_4_6
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 麦冬 玉竹 太子参 郁金 北柴胡 款冬花 紫菀 北沙参 人参叶
0.87263 0.322295 0.933501 0.582597 0.733269 0.310991 0.311179 0.35713 0.318409 0.88007 0.905658 0.865322 0.91243 0.317086 0.952941 0.460092 0.500183 0.508778 0.792558
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.421053, recall: 0.533333, error: 0.578947
155. 
patient tongue id: 03151857327355_4
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.371028 0.503217 0.371143 0.315711 0.333377 0.316433 0.329371 0.519145 0.621372
predicted yaofang:
柴胡 白芍 香附 白术 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
156. 
patient tongue id: 03221621042522_5_2
label yaofang:
甘草 茯苓 桔梗 牛蒡子 白术 浙贝母 乌梅 鳖甲 诃子 白花蛇舌 天山雪莲 蜂房 岗梅根 四季青
0.936616 0.506069 0.46648 0.341997 0.431973 0.382201 0.412198
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
157. 
patient tongue id: 02182307154975_6_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 黄连 山药 干姜 砂仁 佛手 合欢花
0.94208 0.503707 0.518835 0.365212 0.534652 0.455337 0.46604 0.326605 0.370448 0.346315
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
158. 
patient tongue id: 04282313116234_2_6
label yaofang:
甘草 川芎 茯苓 党参 酸枣仁 丹参 生地黄 牡丹皮 山茱萸 泽泻 菟丝子 益母草 淫羊藿 女贞子 浮小麦 墨旱莲
0.934492 0.461976 0.535551 0.390109 0.546312 0.439716 0.48877 0.36165 0.346794
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.187500, error: 0.666667
159. 
patient tongue id: 01031835330729_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香
0.300171 0.872004 0.323294 0.928326 0.542113 0.714967 0.326574 0.347147 0.871211 0.900665 0.864343 0.904561 0.32379 0.952912 0.423908 0.491218 0.549018 0.789509
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
160. 
patient tongue id: 03230713488977_7_2_1
label yaofang:
甘草 柴胡 白芍 延胡索 郁金 桑白皮 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲 红豆杉 田七末
0.879148 0.465149 0.47005 0.361862 0.425886 0.339779
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
161. 
patient tongue id: 05262223146094_2_7_6
label yaofang:
甘草 薏苡仁 白术 赤芍 山茱萸 天麻 巴戟天 鳖甲 补骨脂 莪术 豆蔻 蜈蚣 天山雪莲 半枝莲
0.958773 0.508096 0.530533 0.356792 0.567313 0.520025 0.51506 0.378184 0.425272 0.410891
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
162. 
patient tongue id: 03021850550980_4_1_6
label yaofang:
薏苡仁 黄芪 白术 赤芍 浙贝母 杜仲 砂仁 菟丝子 桑寄生 橘核 土鳖虫 红豆杉 山慈菇
0.40517 0.33094 0.607292 0.433544 0.308557 0.379589 0.367609 0.374948
predicted yaofang:
甘草 茯苓 黄芪 白术 海螵蛸 厚朴 鸡内金 北沙参

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
163. 
patient tongue id: 02150731549245_1_2
label yaofang:
甘草 法半夏 茯苓 桔梗 橘红 金银花 桃仁 党参 黄芪 丹参 枳实 竹茹 厚朴
0.395734 0.327921 0.357244 0.392461 0.384217 0.388388 0.328636 0.32703 0.32402 0.32693 0.316655
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤 泽泻 车前子 莱菔子

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
164. 
patient tongue id: 03271921325280_2_4
label yaofang:
法半夏 茯苓 前胡 桔梗 麦冬 玉竹 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 人参叶
0.950829 0.974067 0.603452 0.783814 0.933579 0.965892 0.92087 0.952625 0.992144 0.314432 0.492726 0.482728 0.871055
predicted yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
165. 
patient tongue id: 03272238167313_1_2
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.531933 0.366941 0.403353 0.322656 0.337832
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
166. 
patient tongue id: 03062136387886_1_6_2
label yaofang:
甘草 白芍 党参 酸枣仁 郁金 山药 天麻 鳖甲 莪术 虎杖 浮小麦 蜈蚣 白花蛇舌 合欢花 红豆杉
0.937241 0.493871 0.518505 0.391146 0.517432 0.466862 0.499604 0.344723 0.384736 0.385066
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.400000, error: 0.400000
167. 
patient tongue id: 04211756410401_1
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.309287 0.828264 0.373134 0.88241 0.523827 0.663121 0.333077 0.314393 0.341897 0.303679 0.820278 0.846651 0.809196 0.852082 0.338163 0.915103 0.413058 0.480454 0.536173 0.753648
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
168. 
patient tongue id: 05312142401562_1_5
label yaofang:
甘草 法半夏 茯苓 桔梗 太子参 丹参 黄连 浙贝母 薤白 款冬花 瓜蒌子 化橘红 麸炒枳壳
0.970279 0.526627 0.549925 0.366383 0.338133 0.328468 0.625698 0.592499 0.589358 0.465134 0.516725 0.515381
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
169. 
patient tongue id: 02131310133691_1_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.494959 0.390867 0.3429 0.426627 0.371977
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
170. 
patient tongue id: 06141843553587_6_2_5
label yaofang:
茯苓 牡蛎 熟地黄 牡丹皮 郁金 山药 山茱萸 泽泻 莪术 蜈蚣 土茯苓 合欢皮 姜黄
0.41856 0.378817 0.430043 0.372795 0.316508
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
171. 
patient tongue id: 01050652549915_5
label yaofang:
甘草 法半夏 茯苓 薏苡仁 白术 天麻 胡黄连 茵陈 白花蛇舌草 麦芽 苦杏仁 板蓝根 广藿香 蜈蚣 半枝莲 醋鳖甲
0.976765 0.526979 0.553397 0.349999 0.328062 0.303409 0.631343 0.589284 0.58581 0.447113 0.502711 0.511579
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
172. 
patient tongue id: 04300906068095_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 桃仁 鱼腥草 远志 浙贝母 细辛 鳖甲 款冬花 白花蛇舌草 苦杏仁 紫苏梗
0.905038 0.468446 0.486191 0.391612 0.421743 0.369952 0.438377
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
173. 
patient tongue id: 04241825008241_4_6
label yaofang:
桂枝 柴胡 白芍 黄芩 党参 五味子 郁金 桑寄生 虎杖 白花蛇舌草 姜半夏 炙甘草 土茯苓
0.357463 0.513258 0.344829 0.39161 0.301011 0.304268 0.565507 0.685019
predicted yaofang:
柴胡 白芍 香附 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
174. 
patient tongue id: 05262215590382_6_1
label yaofang:
甘草 远志 党参 白术 酸枣仁 生地黄 天麻 鳖甲 续断 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.971537 0.530588 0.568401 0.368457 0.358479 0.329988 0.659699 0.616222 0.589 0.477719 0.532574 0.534652
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
175. 
patient tongue id: 01061854494532_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.813887 0.341807 0.888352 0.537068 0.666748 0.322194 0.344569 0.8156 0.849645 0.810921 0.86226 0.328547 0.920838 0.414309 0.464885 0.500966 0.745897
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.705882, recall: 0.800000, error: 0.294118
176. 
patient tongue id: 02151823091572_1_2
label yaofang:
甘草 陈皮 茯苓 佩兰 茵陈 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶 木棉花 姜厚朴
0.895976 0.327149 0.938675 0.55414 0.723867 0.324764 0.329644 0.889525 0.915309 0.877311 0.914472 0.328901 0.962847 0.411225 0.492372 0.556334 0.813273
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.117647, recall: 0.153846, error: 0.882353
177. 
patient tongue id: 06082050440223_7_2_3
label yaofang:
甘草 枳壳 半夏 牡蛎 薏苡仁 玄参 熟地黄 杜仲 郁金 厚朴 僵蚕 莪术 紫苏叶 蜈蚣 合欢皮 预知子
0.469106 0.391078 0.401041 0.499351 0.490386 0.356503 0.30656 0.413241
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.375000, recall: 0.187500, error: 0.625000
178. 
patient tongue id: 05232004530790_2_7
label yaofang:
半夏 桃仁 黄芪 枸杞子 白术 丹参 赤芍 海螵蛸 浙贝母 厚朴 僵蚕 莪术 炙甘草 紫苏叶 蜈蚣 蛇舌草
0.430319 0.35549 0.349465 0.353455
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.062500, error: 0.750000
179. 
patient tongue id: 03132024282223_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.307477 0.309158 0.304152 0.313225 0.332228
predicted yaofang:
甘草 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
180. 
patient tongue id: 01130637185885_1_2_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 鱼腥草 浙贝母 鳖甲 款冬花 紫菀 诃子 白花蛇舌 蜂房 四季青
0.850624 0.454776 0.478207 0.362595 0.409149 0.300882
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
181. 
patient tongue id: 01201940535619_1_2_6
label yaofang:
甘草 党参 山药 山茱萸 地黄 天麻 菟丝子 益智仁 益母草 金樱子 白花蛇舌草 蜈蚣 棉萆薢 醋鳖甲
0.980978 0.543879 0.586909 0.342298 0.389657 0.338259 0.719708 0.669558 0.627189 0.527165 0.591031 0.587429
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
182. 
patient tongue id: 05112016376905_1_2_6
label yaofang:
甘草 白芍 龙骨 黄芪 白术 桑寄生 芡实 金樱子 王不留行 桑螵蛸 橘络 紫苏梗 墨旱莲 山慈菇
0.322824 0.509051 0.493071 0.420316 0.339079
predicted yaofang:
甘草 黄芪 白术 海螵蛸 厚朴

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
183. 
patient tongue id: 06010646418162_1_2
label yaofang:
甘草 白芍 桔梗 牛蒡子 玉竹 党参 太子参 生地黄 浙贝母 乌梅 天花粉 鳖甲 北沙参 白花蛇舌 蜂房 四季青
0.982721 0.542049 0.581103 0.364298 0.39098 0.360267 0.703335 0.68215 0.653932 0.557713 0.61464 0.622279
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
184. 
patient tongue id: 02252116489074_1_4_6
label yaofang:
甘草 川芎 陈皮 法半夏 茯苓 桔梗 党参 浙贝母 天麻 糯稻根 鳖甲 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.832341 0.453834 0.470377 0.347698 0.412625 0.332886
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.312500, error: 0.166667
185. 
patient tongue id: 05242114524473_6_4_2
label yaofang:
甘草 当归 茯苓 党参 黄连 浙贝母 白芷 菟丝子 天花粉 益母草 鳖甲 续断 白花蛇舌 蜂房 四季青 红豆杉
0.973009 0.529918 0.568037 0.352815 0.342492 0.319813 0.661298 0.587188 0.558621 0.4369 0.492148 0.476287
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
186. 
patient tongue id: 02211819390295_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.312445 0.828319 0.357708 0.883761 0.518608 0.670625 0.344169 0.302509 0.350083 0.301231 0.821371 0.846951 0.809248 0.858094 0.349915 0.924434 0.405665 0.4748 0.539795 0.754324
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.875000, error: 0.300000
187. 
patient tongue id: 03222018067763_1_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 仙鹤草 砂仁 炙甘草 浮小麦 百合 紫苏叶
0.33543 0.487619 0.329227 0.33536 0.406545 0.494289 0.603651
predicted yaofang:
柴胡 白芍 香附 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.133333, error: 0.714286
188. 
patient tongue id: 01012112410489_1_3
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.451895 0.363033 0.412499 0.540451 0.495852 0.357468 0.437592
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
189. 
patient tongue id: 04101856433649_4_7
label yaofang:
川芎 茯苓 防风 薏苡仁 党参 黄芪 钩藤 赤小豆 芡实 炙甘草 首乌藤 广藿香 威灵仙 棉萆薢
0.316755 0.637721 0.422691 0.674356 0.442304 0.529767 0.335515 0.317858 0.308779 0.343312 0.314604 0.617888 0.630881 0.617122 0.652111 0.361175 0.727462 0.385672 0.42781 0.448138 0.585468
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.190476, recall: 0.285714, error: 0.809524
190. 
patient tongue id: 03141256460545_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.397964 0.370996 0.320285 0.326102 0.3938 0.596694
predicted yaofang:
法半夏 茯苓 桔梗 防风 紫菀 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
191. 
patient tongue id: 04131557407654_1_3_4
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.427161 0.347539 0.366035 0.380536 0.430068 0.39193 0.335386 0.338916 0.327057 0.340835 0.309906 0.316738 0.324985
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤 泽泻 莱菔子 天麻 决明子 夏枯草

------Score: precision: 0.230769, recall: 0.250000, error: 0.769231
192. 
patient tongue id: 04132035468762_6_2_7
label yaofang:
甘草 川芎 龙骨 牡蛎 桃仁 远志 党参 酸枣仁 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.962953 0.506371 0.545853 0.352229 0.580846 0.535628 0.530617 0.39268 0.453817 0.430115
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.500000, error: 0.200000
193. 
patient tongue id: 05131646278177_2_7_6
label yaofang:
甘草 远志 党参 酸枣仁 丹参 生地黄 牡丹皮 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.948657 0.488374 0.534079 0.331278 0.55543 0.414239 0.443024 0.334515 0.322576
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.777778, recall: 0.500000, error: 0.222222
194. 
patient tongue id: 01061841128612_2_4
label yaofang:
陈皮 法半夏 葛根 前胡 桔梗 麦冬 玄参 款冬花 紫菀 百部 北沙参 炙甘草 人参叶 干石斛
0.30763 0.780523 0.371163 0.829084 0.497667 0.632243 0.338285 0.351772 0.30098 0.761985 0.793011 0.76083 0.803315 0.3422 0.88249 0.402334 0.477096 0.515308 0.705696
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.642857, error: 0.526316
195. 
patient tongue id: 03101734585745_4_1
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.311234 0.64665 0.404121 0.661489 0.443186 0.531287 0.331754 0.313612 0.603063 0.623932 0.60964 0.647118 0.352565 0.772999 0.35338 0.419835 0.435394 0.578842
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
196. 
patient tongue id: 04131602117514_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.43238 0.326698 0.341531 0.521467 0.395756
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
197. 
patient tongue id: 05260625080453_2_7_6
label yaofang:
甘草 桃仁 黄芪 红花 赤芍 熟地黄 山茱萸 天麻 肉苁蓉 桑寄生 火麻仁 地龙 辛夷 首乌藤
0.922262 0.492531 0.508328 0.361881 0.492725 0.422508 0.444118 0.311435 0.348416 0.337828
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
198. 
patient tongue id: 03192240356696_6_4
label yaofang:
甘草 白芍 茯苓 党参 酸枣仁 玄参 柏子仁 黄连 生地黄 山茱萸 厚朴 火麻仁 麦芽 郁李仁 合欢花
0.772546 0.458218 0.421809 0.31251 0.413263 0.303848 0.30252
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
199. 
patient tongue id: 01040704323472_5
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 远志 浙贝母 款冬花 白前 苇茎 苦杏仁 炙麻黄
0.92493 0.490503 0.515073 0.363772 0.517639 0.397309 0.423267 0.316967
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
200. 
patient tongue id: 05042132447729_2_4
label yaofang:
麻黄 桂枝 甘草 白芍 牡蛎 薏苡仁 桃仁 丹参 红花 赤芍 熟地黄 益母草 夏枯草 鹿角霜 姜炭 芥子
0.39915 0.306515 0.413555 0.323857 0.396703 0.30894 0.300503 0.382128
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 浙贝母 炙甘草

------Score: precision: 0.250000, recall: 0.125000, error: 0.750000
201. 
patient tongue id: 04012017170708_5
label yaofang:
甘草 金银花 蒲公英 酸枣仁 五味子 生地黄 栀子 车前子 大黄 仙鹤草 茜草 滑石 瞿麦 萹蓄 浮小麦 车前草
0.348462 0.361402 0.362878 0.350697
predicted yaofang:
甘草 白芍 党参 炙甘草

------Score: precision: 0.250000, recall: 0.062500, error: 0.750000
202. 
patient tongue id: 01122227120653_1_6_7
label yaofang:
甘草 枳壳 茯苓 木香 党参 酸枣仁 生地黄 牡丹皮 山药 山茱萸 地骨皮 糯稻根 秦艽 首乌藤 合欢花
0.979031 0.532622 0.565206 0.357836 0.335503 0.31341 0.658045 0.619027 0.603908 0.470353 0.5285 0.529428
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
203. 
patient tongue id: 04071327250754_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.862148 0.33584 0.922292 0.545915 0.705011 0.319101 0.306306 0.347333 0.300812 0.862195 0.891987 0.851549 0.894174 0.313384 0.94466 0.431057 0.488538 0.532197 0.779161
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
204. 
patient tongue id: 06070655339234_2_5
label yaofang:
甘草 龙骨 党参 白术 酸枣仁 生地黄 黄柏 知母 山茱萸 天花粉 糯稻根 淫羊藿 仙茅 女贞子 龟甲
0.992531 0.573697 0.612449 0.341218 0.378969 0.338748 0.759075 0.741138 0.696127 0.59025 0.657893 0.646238
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
205. 
patient tongue id: 05262101082118_2_4
label yaofang:
桂枝 甘草 白芍 党参 白术 桑叶 天麻 糯稻根 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.78239 0.421694 0.437948 0.368883 0.491467 0.375091
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
206. 
patient tongue id: 02171857185233_4
label yaofang:
法半夏 生姜 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.971172 0.989523 0.659815 0.834641 0.968235 0.98012 0.96152 0.978028 0.992902 0.425415 0.517828 0.552895 0.904733
predicted yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 1.000000, recall: 0.866667, error: 0.000000
207. 
patient tongue id: 04111955328078_1_3_4
label yaofang:
陈皮 当归 茯苓 半夏 党参 黄芪 白术 僵蚕 鸡内金 紫苏子 炙甘草 紫苏叶 木蝴蝶
0.325991 0.364412 0.361794
predicted yaofang:
茯苓 黄芪 炙甘草

------Score: precision: 1.000000, recall: 0.230769, error: 0.000000
208. 
patient tongue id: 01041843328962_1_4
label yaofang:
陈皮 法半夏 前胡 麦冬 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.866357 0.346855 0.920433 0.538306 0.697642 0.330586 0.319082 0.347105 0.308061 0.861587 0.890127 0.846081 0.89112 0.325053 0.939483 0.431076 0.484383 0.540066 0.77588
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
209. 
patient tongue id: 02201257050750_1_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 石菖蒲 炙甘草 百合 紫苏叶 青葙子
0.343395 0.372092 0.315422 0.306129 0.430421
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
210. 
patient tongue id: 04112037326132_1_6
label yaofang:
甘草 桔梗 浙贝母 白茅根 地黄 天麻 蔓荆子 白花蛇舌草 辛夷 蜈蚣 蜂房 醋鳖甲 酒女贞子
0.939579 0.481859 0.520241 0.332649 0.527909 0.370509 0.402561
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
211. 
patient tongue id: 05222227181945_4
label yaofang:
茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.851072 0.378248 0.89464 0.528046 0.679449 0.336203 0.315009 0.335828 0.835884 0.862597 0.820541 0.863182 0.334921 0.931248 0.398272 0.488137 0.542924 0.765971
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
212. 
patient tongue id: 01050650379109_6_4
label yaofang:
甘草 茯苓 羌活 党参 延胡索 赤芍 山药 天麻 鳖甲 鹿角霜 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.971171 0.526561 0.557727 0.332228 0.345966 0.300099 0.648701 0.566059 0.545148 0.425832 0.481545 0.481249
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
213. 
patient tongue id: 01040656112790_5_1
label yaofang:
甘草 黄芩 茯苓 薄荷 芦根 牛蒡子 党参 丹参 黄连 山药 鳖甲 补骨脂 白花蛇舌 蜂房 广升麻
0.873645 0.474442 0.464561 0.348055 0.420546 0.343073
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
214. 
patient tongue id: 05032240225166_1_4_7
label yaofang:
甘草 茯苓 赤芍 杜仲 车前子 天麻 桑寄生 鳖甲 鹿角霜 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫
0.964116 0.515259 0.552816 0.347826 0.324453 0.614032 0.566695 0.549896 0.427548 0.48447 0.488955
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
215. 
patient tongue id: 03291337145529_1_6_4
label yaofang:
甘草 川芎 金银花 浙贝母 牛膝 郁金 天麻 蔓荆子 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.841691 0.445867 0.47911 0.365524 0.405312
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
216. 
patient tongue id: 05042033007056_6_1
label yaofang:
陈皮 桔梗 牛蒡子 海螵蛸 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.340291 0.484532 0.348757 0.393003 0.325269 0.540429 0.695243
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
217. 
patient tongue id: 03101650425340_1_2
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.320966 0.577723 0.421812 0.410981 0.619629 0.533908 0.519242 0.643709 0.602136 0.581675 0.683601 0.454551 0.674874 0.680132 0.6923
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.333333, recall: 0.416667, error: 0.666667
218. 
patient tongue id: 06051108214309_1_7_4
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子
0.337511 0.56414 0.419699 0.444973 0.598047 0.515236 0.516346 0.607044 0.58333 0.552956 0.658332 0.429242 0.655424 0.661225 0.66859
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.133333, recall: 0.181818, error: 0.866667
219. 
patient tongue id: 04271433218756_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.452088 0.331963 0.41218 0.423737 0.459704 0.426485 0.344737 0.388947 0.342057 0.388007 0.347099 0.392727 0.356088 0.373 0.386493 0.363709
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
220. 
patient tongue id: 03301918329611_4
label yaofang:
法半夏 前胡 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.354612 0.318124 0.342953 0.327241 0.420424 0.345462 0.717515
predicted yaofang:
法半夏 茯苓 防风 黄芪 紫菀 百部 炙甘草

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
221. 
patient tongue id: 04182037524552_1_4
label yaofang:
甘草 川芎 陈皮 枳壳 茯苓 龙骨 牡蛎 牛蒡子 远志 柏子仁 竹茹 紫菀 姜半夏
0.405396 0.569469 0.449611 0.324987 0.469969 0.319858 0.385735 0.69025 0.789352 0.319915
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.200000, recall: 0.153846, error: 0.800000
222. 
patient tongue id: 01211244269324_4
label yaofang:
陈皮 前胡 薄荷 黄连 厚朴 白芷 冬瓜皮 豆蔻 苦杏仁 姜半夏 辛夷 广藿香 苍耳子
0.348303 0.317331 0.329974
predicted yaofang:
甘草 茯苓 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
223. 
patient tongue id: 04210249494490_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 浙贝母 桑白皮 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.992456 0.563522 0.609484 0.332425 0.407038 0.342928 0.761696 0.745021 0.704983 0.604973 0.677701 0.697609
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
224. 
patient tongue id: 05042040199607_4_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 姜半夏 百合 紫苏叶 独脚金
0.357695 0.502486 0.339067 0.305563 0.322122 0.529241 0.661656
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
225. 
patient tongue id: 04140743185445_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.531125 0.355983 0.565847 0.535069 0.407073 0.486612 0.519707 0.521391 0.451027 0.578327 0.579837 0.593304 0.58675
predicted yaofang:
桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.846154, recall: 0.916667, error: 0.153846
226. 
patient tongue id: 01092337478772_4
label yaofang:
桂枝 白芍 大枣 茯苓 附子 苍术 炙甘草
0.34333 0.351579 0.380395 0.314038
predicted yaofang:
甘草 黄芪 白术 炙甘草

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
227. 
patient tongue id: 03141624023390_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.436009 0.350999 0.327337 0.442999 0.420769
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
228. 
patient tongue id: 05181358505335_5_6
label yaofang:
甘草 荆芥 金银花 薏苡仁 远志 红花 黄柏 苍术 木瓜 莲子 豆蔻 决明子 苦杏仁 白鲜皮 土茯苓
0.70009 0.305989 0.428327 0.396543 0.339439
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
229. 
patient tongue id: 04121934537344_4_1
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.322255 0.586566 0.39778 0.650562 0.437215 0.513008 0.334277 0.303778 0.307259 0.580428 0.603718 0.59455 0.639109 0.371053 0.730783 0.371314 0.392622 0.398293 0.552074
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
230. 
patient tongue id: 04130631448736_4_6
label yaofang:
甘草 川芎 党参 白术 生地黄 牡丹皮 杜仲 牛膝 山茱萸 钩藤 天麻 桑寄生 蒺藜 沙苑子 牛大力
0.978047 0.539957 0.551654 0.330194 0.319297 0.646574 0.623981 0.571257 0.479679 0.524077 0.509415
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
231. 
patient tongue id: 02241843092411_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄
0.909831 0.32621 0.950266 0.562488 0.746632 0.318853 0.327805 0.904066 0.927522 0.890915 0.928274 0.32377 0.967751 0.425303 0.502735 0.564703 0.827347
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.647059, recall: 0.785714, error: 0.352941
232. 
patient tongue id: 04182157102374_7_5
label yaofang:
甘草 白芍 川芎 香附 当归 党参 白术 生地黄 黄柏 砂仁 麦芽 苦参 地肤子 土茯苓
0.93048 0.480031 0.534542 0.353786 0.547327 0.387546 0.414147 0.310813
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
233. 
patient tongue id: 06092000121530_1_2_7
label yaofang:
陈皮 半夏 远志 党参 黄芪 枸杞子 白术 杜仲 牛膝 山药 鳖甲 麦芽 炙甘草 首乌藤 紫苏梗 龟甲 蛇舌草
0.855072 0.428885 0.427162 0.461134 0.308644 0.38708
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.117647, error: 0.666667
234. 
patient tongue id: 01312124447549_1_2_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 生地黄 砂仁 天麻 五灵脂 鳖甲 女贞子 蜈蚣 天山雪莲 半枝莲 墨旱莲
0.969936 0.511815 0.55948 0.355272 0.337492 0.634472 0.563836 0.556885 0.419643 0.479223 0.475184
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
235. 
patient tongue id: 06111024184873_2_6
label yaofang:
甘草 柴胡 白芍 延胡索 郁金 天麻 鳖甲 鸡内金 虎杖 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 广金钱草
0.940852 0.495143 0.528395 0.362483 0.549528 0.471563 0.476475 0.337407 0.388574 0.375053
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.466667, error: 0.300000
236. 
patient tongue id: 06031527498984_2
label yaofang:
陈皮 茯苓 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.857484 0.357024 0.898958 0.528224 0.686265 0.337235 0.300191 0.331215 0.841734 0.870325 0.828409 0.871545 0.335046 0.941444 0.394609 0.488996 0.548329 0.777298
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
237. 
patient tongue id: 01120048459477_7
label yaofang:
陈皮 茯苓 丹参 黄连 枳实 竹茹 姜半夏 炙甘草 首乌藤 合欢皮
0.620572 0.368159 0.567037 0.406609 0.503255 0.328002 0.322122 0.506656 0.61862 0.549775 0.584713 0.808797 0.405482 0.383752 0.527774
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.133333, recall: 0.200000, error: 0.866667
238. 
patient tongue id: 04200312336406_1_2
label yaofang:
甘草 党参 酸枣仁 生地黄 延胡索 杜仲 细辛 天麻 鳖甲 补骨脂 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.955214 0.49314 0.510048 0.40366 0.515297 0.517056 0.557607 0.378511 0.417516 0.420022
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
239. 
patient tongue id: 02202230192018_6_4
label yaofang:
甘草 川芎 法半夏 鸡血藤 白术 杜仲 仙鹤草 天麻 鳖甲 麦芽 蜈蚣 天山雪莲 半枝莲 墨旱莲
0.978357 0.529148 0.570349 0.33568 0.33614 0.664557 0.595932 0.569377 0.447451 0.509516 0.499343
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
240. 
patient tongue id: 05132137301527_1_6
label yaofang:
甘草 独活 党参 黄芪 白术 酸枣仁 生地黄 杜仲 天麻 糯稻根 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.885895 0.34153 0.443355 0.505097 0.346471 0.461202 0.33525 0.394032
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.400000, error: 0.250000
241. 
patient tongue id: 04291632546604_6_2
label yaofang:
甘草 柴胡 连翘 党参 丹参 生地黄 红花 延胡索 赤芍 青皮 川楝子 郁金 瓜蒌皮 王不留行 皂角刺
0.979628 0.535685 0.575497 0.354189 0.370934 0.338318 0.680997 0.634344 0.608027 0.503006 0.562632 0.566885
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
242. 
patient tongue id: 05172138589688_4
label yaofang:
桂枝 川芎 陈皮 黄芪 丹参 栀子 乌药 小蓟 车前子 滑石 瞿麦 石韦 萹蓄 炙甘草 广金钱草
0.573501 0.370532 0.411091 0.344906
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
243. 
patient tongue id: 05260633148369_1_7_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 砂仁 天麻 鳖甲 麦芽 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.957911 0.522591 0.546116 0.37961 0.3545 0.346295 0.608223 0.586573 0.574856 0.474661 0.518247 0.523523
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
244. 
patient tongue id: 04120026149440_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 酸枣仁 生地黄 山药 糯稻根 桑寄生 胡黄连 淫羊藿 仙茅 龟甲
0.874535 0.471323 0.470195 0.304994 0.446658 0.39748 0.320478 0.43703
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
245. 
patient tongue id: 05242116526117_1_2_6
label yaofang:
甘草 白芍 川芎 当归 党参 黄芪 鸡血藤 白术 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲
0.970211 0.528698 0.557063 0.338283 0.331288 0.301575 0.648482 0.594719 0.542541 0.448883 0.507125 0.488795
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
246. 
patient tongue id: 05092033271525_6
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 车前子 砂仁 菟丝子 巴戟天 桑寄生 续断 制何首乌 艾叶
0.337792 0.465147 0.328254 0.338597 0.402991 0.465597 0.562902
predicted yaofang:
柴胡 白芍 香附 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
247. 
patient tongue id: 02120934136471_7_1_4
label yaofang:
甘草 白芍 茯苓 党参 鸡血藤 白术 生地黄 白茅根 赤石脂 鳖甲 补骨脂 建曲 蜈蚣 白花蛇舌 天山雪莲
0.966409 0.519026 0.544143 0.360805 0.333433 0.305695 0.605439 0.571675 0.564105 0.437629 0.488457 0.480802
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
248. 
patient tongue id: 05092117209911_6_4
label yaofang:
甘草 法半夏 桔梗 桃仁 红花 浙贝母 郁金 干姜 厚朴 佩兰 豆蔻 紫苏梗 威灵仙 合欢花
0.93413 0.484154 0.540591 0.388314 0.539749 0.456533 0.468631 0.317203 0.366303 0.333746
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.071429, error: 0.900000
249. 
patient tongue id: 02182224440174_1_2_6
label yaofang:
甘草 白及 地黄 天麻 没药 胡黄连 淡竹叶 白花蛇舌草 麦芽 广藿香 蜈蚣 半枝莲 醋鳖甲 川木通
0.929334 0.319217 0.468111 0.491201 0.34879 0.449655 0.371439 0.425502
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
250. 
patient tongue id: 02202240225371_6_4_7
label yaofang:
甘草 柴胡 白芍 枳壳 延胡索 郁金 砂仁 天麻 鳖甲 浮小麦 蜈蚣 天山雪莲 合欢花 半枝莲 红豆杉
0.992919 0.561504 0.610991 0.350032 0.382607 0.349991 0.766309 0.73014 0.699975 0.573598 0.644992 0.64984
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
251. 
patient tongue id: 03222007493158_6_5_1
label yaofang:
甘草 白芍 陈皮 防风 党参 白术 黄连 延胡索 赤芍 乌梅 山药 干姜 五灵脂 五倍子 建曲 合欢花
0.977431 0.54473 0.53877 0.321167 0.311539 0.633992 0.598746 0.551063 0.4552 0.496538 0.481278
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
252. 
patient tongue id: 03081807286240_1_6
label yaofang:
桂枝 白芍 川芎 法半夏 大枣 龙骨 麦冬 党参 柏子仁 牡丹皮 吴茱萸
0.377199 0.383909 0.321865 0.40898 0.36642 0.304341 0.373248
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 浙贝母 炙甘草

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
253. 
patient tongue id: 02020953237783_1_2_6
label yaofang:
甘草 柴胡 香附 党参 延胡索 赤芍 青皮 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97382 0.517224 0.543212 0.369666 0.30339 0.611665 0.560354 0.56493 0.410179 0.458519 0.454155
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
254. 
patient tongue id: 01052158445066_4
label yaofang:
甘草 茯苓 半夏 党参 白术 砂仁 桑寄生 枇杷叶 地龙 北沙参 骨碎补 土鳖虫
0.5987 0.404143 0.339586 0.446604 0.467175
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
255. 
patient tongue id: 04201949569987_1_6
label yaofang:
甘草 川芎 党参 酸枣仁 生地黄 赤芍 山药 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.936997 0.32287 0.497285 0.522932 0.349905 0.310289 0.552243 0.493546 0.493046 0.380068 0.42492 0.430224
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
256. 
patient tongue id: 03021145252726_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.407926 0.368135 0.303612 0.414248 0.327512
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
257. 
patient tongue id: 01122228287821_1_7
label yaofang:
桂枝 甘草 白芍 川芎 大枣 党参 黄芪 白术 生地黄 胆南星 山药 山茱萸 糯稻根 地龙 首乌藤
0.762218 0.446334 0.371606
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.666667, recall: 0.133333, error: 0.333333
258. 
patient tongue id: 03101836186991_1_3_4
label yaofang:
枳壳 海螵蛸 厚朴 砂仁 天麻 鸡内金 麦芽 橘核 首乌藤 合欢皮 墨旱莲 红景天
0.330441 0.333045 0.462552 0.399214 0.329483
predicted yaofang:
甘草 茯苓 黄芪 白术 海螵蛸

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
259. 
patient tongue id: 04142242037259_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 独活 薏苡仁 远志 酸枣仁 浙贝母 薤白 细辛 瓜蒌皮 款冬花 苦杏仁
0.946624 0.51121 0.549095 0.338075 0.323204 0.303178 0.594628 0.471029 0.449934 0.337778 0.382324 0.352082
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
260. 
patient tongue id: 05162058399720_6_4
label yaofang:
桂枝 柴胡 白芍 黄芩 党参 郁金 虎杖 姜半夏 炙甘草 土茯苓
0.600921 0.399989 0.343434 0.397977 0.338886
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
261. 
patient tongue id: 05162104270945_6_4
label yaofang:
甘草 柴胡 白芍 法半夏 木香 白及 党参 白术 黄连 海螵蛸 山药 益智仁 桑螵蛸 麸炒枳壳
0.931355 0.469721 0.516948 0.354617 0.506229 0.373999 0.419969
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
262. 
patient tongue id: 05290807051922_2_4
label yaofang:
甘草 法半夏 茯苓 桃仁 党参 五味子 山药 厚朴 款冬花 补骨脂 苦杏仁 紫苏梗 威灵仙
0.9806 0.54317 0.574652 0.335016 0.350549 0.31313 0.686168 0.662967 0.610862 0.51989 0.577761 0.56105
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
263. 
patient tongue id: 02201829065462_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.794629 0.367085 0.834749 0.479399 0.628446 0.324804 0.331599 0.766459 0.795531 0.763769 0.808334 0.330183 0.88778 0.38024 0.463475 0.509453 0.706035
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.928571, error: 0.235294
264. 
patient tongue id: 05260810093004_1_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 木香 麦冬 党参 黄芪 丹参 五味子 熟附子 干姜 鸡内金 草豆蔻 六神曲
0.433702 0.361294 0.314143 0.369117 0.470183 0.32745 0.3017
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.714286, recall: 0.333333, error: 0.285714
265. 
patient tongue id: 03231123019564_4_1_6
label yaofang:
甘草 川芎 防风 党参 白术 生地黄 车前子 天麻 鳖甲 白花蛇舌草 鹿角霜 蜈蚣 天山雪莲 半枝莲 川加皮 红豆杉
0.904955 0.317019 0.482436 0.508615 0.389046 0.493665 0.443928 0.477333 0.337227 0.37431 0.377511
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
266. 
patient tongue id: 04260644078550_7_1
label yaofang:
甘草 独活 党参 白术 延胡索 杜仲 牛膝 地黄 天麻 桑寄生 续断 威灵仙 半枝莲 醋鳖甲
0.963134 0.519007 0.524999 0.372994 0.562453 0.524487 0.534515 0.38898 0.429344 0.411828
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
267. 
patient tongue id: 04131755045604_1_2
label yaofang:
甘草 白芍 党参 鸡血藤 白术 丹参 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.965106 0.524831 0.53448 0.3293 0.599481 0.535165 0.513798 0.392894 0.439986 0.43297
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.642857, error: 0.100000
268. 
patient tongue id: 06191324429032_5_2
label yaofang:
甘草 酸枣仁 牡丹皮 杜仲 山药 山茱萸 地黄 天麻 桑寄生 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 牛大力
0.952366 0.487168 0.553174 0.358755 0.301054 0.598927 0.49682 0.496163 0.345622 0.40679 0.398163
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
269. 
patient tongue id: 01132306473066_2_4
label yaofang:
白芍 麦冬 太子参 三七 鳖甲 蝉蜕 酒萸肉
0.510774 0.32431 0.436088 0.322357
predicted yaofang:
甘草 法半夏 茯苓 党参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
270. 
patient tongue id: 05221919100272_1_6_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶 山慈菇
0.3893 0.52267 0.394575 0.412006 0.320127 0.387498 0.62282 0.736953 0.327954
predicted yaofang:
柴胡 白芍 香附 海螵蛸 浙贝母 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.111111, recall: 0.066667, error: 0.888889
271. 
patient tongue id: 03292128363327_1_7_6
label yaofang:
甘草 前胡 党参 丹参 赤芍 山药 桑寄生 益母草 猪苓 鳖甲 款冬花 虎杖 苦杏仁 黄精 土鳖虫 鹿衔草
0.861439 0.480096 0.455689 0.34987 0.389493 0.310716 0.338428
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.187500, error: 0.571429
272. 
patient tongue id: 02211434499371_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.358284 0.412151 0.313215 0.39544
predicted yaofang:
茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
273. 
patient tongue id: 03021206428394_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.461869 0.36164 0.50034 0.456677 0.348113 0.437308 0.441025 0.443203 0.416023 0.474384 0.475441 0.475936 0.472811
predicted yaofang:
桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.153846, recall: 0.166667, error: 0.846154
274. 
patient tongue id: 04151220095278_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.308598 0.815956 0.386203 0.86415 0.50403 0.651511 0.335032 0.306785 0.339365 0.799038 0.823568 0.787915 0.831819 0.346823 0.90013 0.401224 0.475014 0.528088 0.736699
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
275. 
patient tongue id: 02231915359185_1
label yaofang:
白芍 川芎 茯苓 防风 丹参 钩藤 天麻 白芷 石决明 炙甘草 首乌藤 威灵仙 炒蔓荆子 棉萆薢
0.321214 0.784241 0.372171 0.833819 0.49176 0.633752 0.344302 0.311051 0.344342 0.305888 0.769949 0.799408 0.763814 0.805938 0.349749 0.893124 0.399622 0.475315 0.530147 0.720707
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.285714, error: 0.800000
276. 
patient tongue id: 05091928211821_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 薄荷 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 苍耳子
0.303947 0.831731 0.358187 0.892131 0.53058 0.669062 0.330177 0.302999 0.33683 0.823725 0.857038 0.814748 0.861394 0.333508 0.926721 0.407963 0.477046 0.527103 0.760597
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.733333, error: 0.421053
277. 
patient tongue id: 03291337035374_4
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 徐长卿
0.560372 0.383946 0.407117 0.35463 0.413351
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
278. 
patient tongue id: 03081811438533_6
label yaofang:
龙骨 丹参 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.37215 0.319234 0.311678 0.566645
predicted yaofang:
白芍 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.133333, error: 0.500000
279. 
patient tongue id: 04061349559062_1_4
label yaofang:
甘草 法半夏 茯苓 前胡 防风 薄荷 荆芥穗 香薷 豆蔻 紫苏梗 广藿香 威灵仙 麸炒白术 炒六神曲
0.331427 0.70813 0.398105 0.741973 0.4775 0.582253 0.354998 0.335324 0.300299 0.679074 0.703466 0.675506 0.720495 0.362693 0.842476 0.361063 0.454553 0.489701 0.649356
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.315789, recall: 0.428571, error: 0.684211
280. 
patient tongue id: 04171947551792_1_4
label yaofang:
法半夏 茯苓 前胡 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子
0.923415 0.966162 0.586254 0.77267 0.31281 0.344152 0.924601 0.946804 0.91428 0.946849 0.312172 0.977326 0.443694 0.501138 0.566916 0.84186
predicted yaofang:
法半夏 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.687500, recall: 0.846154, error: 0.312500
281. 
patient tongue id: 04141949365862_2_5
label yaofang:
甘草 金银花 麦冬 玄参 黄连 生地黄 红花 山药 荆芥穗 火麻仁 百部 麦芽 白鲜皮 粉葛 建曲
0.975973 0.534586 0.571068 0.344492 0.352374 0.316253 0.665165 0.613915 0.577973 0.46964 0.530761 0.516616
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
282. 
patient tongue id: 05131625543094_6_1
label yaofang:
甘草 柴胡 白芍 茯苓 党参 酸枣仁 山药 天麻 白花蛇舌草 佛手 浮小麦 蜈蚣 合欢花 半枝莲 醋鳖甲
0.957432 0.505198 0.534988 0.354828 0.307336 0.576525 0.53953 0.531166 0.417196 0.46559 0.465595
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
283. 
patient tongue id: 02252313550042_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 连翘 党参 栀子 牡丹皮 山药 莱菔子 麦芽 合欢花
0.965844 0.518901 0.553884 0.37582 0.351244 0.329678 0.626546 0.599061 0.592482 0.47271 0.530422 0.536966
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
284. 
patient tongue id: 03211951067165_1_4
label yaofang:
麻黄 桂枝 甘草 白芍 牡蛎 薏苡仁 桃仁 丹参 红花 赤芍 熟地黄 益母草 夏枯草 鹿角霜 姜炭 芥子
0.357433 0.52665 0.357916 0.302781 0.323694 0.325132 0.51746 0.646466
predicted yaofang:
柴胡 白芍 香附 白术 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.062500, error: 0.875000
285. 
patient tongue id: 04150844069313
label yaofang:
桂枝 白芍 羌活 独活 薏苡仁 鸡血藤 丹参 乳香 狗脊 海风藤 醋没药 青风藤
0.383883
predicted yaofang:
黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
286. 
patient tongue id: 03282227443355_1_5
label yaofang:
甘草 茯苓 党参 酸枣仁 黄连 赤芍 石膏 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.982196 0.539998 0.57101 0.367598 0.344013 0.33435 0.671699 0.65744 0.628792 0.515516 0.568042 0.557025
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
287. 
patient tongue id: 02252101236209_6
label yaofang:
甘草 川芎 法半夏 枸杞子 白术 杜仲 牛膝 天麻 桑寄生 决明子 麦芽 地龙 粉葛 首乌藤
0.980503 0.540014 0.58284 0.340205 0.368428 0.323459 0.694144 0.629328 0.596394 0.480368 0.544197 0.539942
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
288. 
patient tongue id: 04111841125324_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.314893 0.810956 0.367432 0.868284 0.511713 0.658132 0.332356 0.311711 0.344063 0.306227 0.804031 0.82848 0.792324 0.839177 0.337371 0.910614 0.40739 0.474073 0.528301 0.740179
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
289. 
patient tongue id: 03261638567416_6_2
label yaofang:
柴胡 陈皮 麦冬 太子参 黄芪 酸枣仁 青皮 乌药 火麻仁 鸡内金 珍珠母 麦芽 合欢皮
0.307696 0.357747
predicted yaofang:
黄芪 炙甘草

------Score: precision: 0.500000, recall: 0.076923, error: 0.500000
290. 
patient tongue id: 03281926557398_6_2
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 法半夏 当归 葛根 防风 麦冬 天冬 黄连 熟地黄 栀子 牡丹皮 石膏 地黄 石斛 吴茱萸 广藿香 淡附片
0.418143 0.300316 0.363106 0.324079 0.363833
predicted yaofang:
甘草 白芍 茯苓 白术 炙甘草

------Score: precision: 0.400000, recall: 0.095238, error: 0.600000
291. 
patient tongue id: 02141935483313_4
label yaofang:
甘草 柴胡 香附 当归 茯苓 薄荷 牛蒡子 白术 海螵蛸 麦芽 姜半夏 广藿香 青葙子
0.568678 0.309903 0.315304 0.456978 0.315748
predicted yaofang:
甘草 白芍 茯苓 党参 天麻

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
292. 
patient tongue id: 03200655201294_4
label yaofang:
甘草 白芍 蒲公英 白术 黄柏 细辛 天麻 白芷 地榆 槐花 火麻仁 麦芽 五倍子 土茯苓
0.843094 0.322624 0.444982 0.447595 0.333556 0.36059 0.308934
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
293. 
patient tongue id: 01092045333786_5_4_7
label yaofang:
半夏 蒲公英 党参 黄芪 白术 海螵蛸 浙贝母 杜仲 厚朴 砂仁 莪术 鸡内金 白鲜皮 红豆杉
0.496578 0.360041 0.304695 0.511662 0.509197 0.368142 0.337919
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
294. 
patient tongue id: 03291644359202_4_1
label yaofang:
甘草 葛根 鸡血藤 红花 山药 山茱萸 地黄 天麻 僵蚕 天花粉 益母草 木瓜 威灵仙
0.984281 0.549962 0.570473 0.325381 0.341547 0.307979 0.693702 0.666895 0.615841 0.52306 0.57531 0.573834
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
295. 
patient tongue id: 06140824471832_1_3_5
label yaofang:
甘草 桔梗 防风 金银花 太子参 藿香 白前 白鲜皮 六神曲 蜜百部 干鱼腥草 地肤子
0.342885 0.464751 0.413491 0.393861 0.513643 0.408507 0.422461 0.460195 0.471412 0.47896 0.504151 0.371803 0.493283 0.498172 0.505072
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.066667, recall: 0.083333, error: 0.933333
296. 
patient tongue id: 04131941362179_3_7
label yaofang:
当归 枸杞子 五味子 杜仲 附子 山药 菟丝子 巴戟天 金樱子 覆盆子 骨碎补 黑老虎 灯盏细辛 豆豉姜
0.370881 0.306301 0.47998 0.484767 0.368196 0.306143
predicted yaofang:
甘草 茯苓 黄芪 白术 海螵蛸 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
297. 
patient tongue id: 01110245446192_4_7
label yaofang:
麻黄 茯苓 薏苡仁 阿胶 泽泻 滑石 猪苓
0.734993 0.416233 0.386666 0.363816
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
298. 
patient tongue id: 04120159461704_2_1_6
label yaofang:
甘草 独活 薏苡仁 党参 鸡血藤 生地黄 天麻 桑寄生 鳖甲 补骨脂 蜈蚣 天山雪莲 半枝莲 牛大力
0.863339 0.448572 0.462634 0.317979 0.461366 0.338701 0.402194
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
299. 
patient tongue id: 06031610364775_4
label yaofang:
法半夏 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 炒紫苏子 蜜麻黄
0.861588 0.355257 0.906896 0.523957 0.690083 0.328789 0.304344 0.329254 0.84932 0.873531 0.834531 0.875911 0.327964 0.940787 0.403955 0.484653 0.548806 0.779668
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
300. 
patient tongue id: 01050653538144_2
label yaofang:
甘草 桔梗 芦根 太子参 白术 浙贝母 乌梅 山药 鳖甲 茵陈 辛夷 白花蛇舌 蜂房 四季青
0.933483 0.502833 0.513613 0.360324 0.534459 0.433579 0.44992 0.314513 0.35246 0.338801
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
301. 
patient tongue id: 01172235169237_1_4
label yaofang:
甘草 川芎 茯苓 党参 鸡血藤 酸枣仁 丹参 生地黄 红花 赤芍 郁金 天麻 浮小麦 乌梢蛇
0.963066 0.5249 0.539807 0.358089 0.333844 0.32024 0.617494 0.567041 0.548841 0.43651 0.476012 0.46873
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
302. 
patient tongue id: 03211953166678_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.317069 0.36066 0.32919 0.346238
predicted yaofang:
党参 黄芪 白术 海螵蛸

------Score: precision: 0.750000, recall: 0.214286, error: 0.250000
303. 
patient tongue id: 04130337301233_2_1
label yaofang:
甘草 茯苓 太子参 浙贝母 牡丹皮 乌梅 天花粉 鳖甲 麦芽 北沙参 白花蛇舌 蜂房 岗梅根 四季青
0.925698 0.490315 0.517739 0.402863 0.321354 0.323389 0.532441 0.497509 0.52969 0.386698 0.427754 0.445824
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
304. 
patient tongue id: 05222207555699_4
label yaofang:
防风 钩藤 荆芥穗 白芷 香薷 炙甘草 辛夷 首乌藤 紫苏梗 广藿香 威灵仙 炒苍耳子 炒蔓荆子 棉萆薢
0.527036 0.407705 0.488209 0.36949 0.446289 0.317626 0.333951 0.442769 0.461798 0.477574 0.508115 0.369488 0.659759 0.303292 0.335287 0.3458 0.435254
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.235294, recall: 0.285714, error: 0.764706
305. 
patient tongue id: 01032108212956_2_7_1
label yaofang:
甘草 薏苡仁 太子参 山药 山茱萸 细辛 天麻 鳖甲 补骨脂 莪术 蜈蚣 白花蛇舌 骨碎补 土鳖虫 红豆杉
0.79479 0.417191 0.419333 0.383667
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.066667, error: 0.750000
306. 
patient tongue id: 01172223149921_5_2
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 芦根 牛蒡子 黄连 浙贝母 鳖甲 蜈蚣 白花蛇舌 蜂房 岗梅根 四季青 广升麻
0.909857 0.487826 0.511937 0.385046 0.3025 0.307582 0.511719 0.420895 0.444549 0.311926 0.341459 0.323074
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
307. 
patient tongue id: 02191234446620_2_6
label yaofang:
甘草 黄芪 酸枣仁 熟地黄 黄柏 青蒿 天麻 胡黄连 鳖甲 白花蛇舌草 首乌藤 蜈蚣 天山雪莲 半枝莲 龟甲
0.994867 0.566223 0.601157 0.338398 0.392132 0.335365 0.77825 0.76054 0.737582 0.616591 0.68371 0.709518
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
308. 
patient tongue id: 05042017367785_1_2_6
label yaofang:
甘草 白芍 黄芪 丹参 郁金 白茅根 小蓟 砂仁 巴戟天 珍珠母 浮小麦 首乌藤 百合
0.348609 0.357626 0.319622 0.306359 0.36273 0.314063 0.458543
predicted yaofang:
甘草 白芍 茯苓 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
309. 
patient tongue id: 05221928036165_1_4
label yaofang:
法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 首乌藤 威灵仙 炒紫苏子 蜜麻黄 醋五味子
0.321248 0.727606 0.395927 0.782765 0.491278 0.592129 0.342703 0.320806 0.309735 0.357483 0.311187 0.713783 0.743673 0.713897 0.752122 0.351352 0.84204 0.397814 0.459592 0.488159 0.669296
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.812500, error: 0.380952
310. 
patient tongue id: 04221852359868_1
label yaofang:
白芍 大枣 党参 太子参 黄芪 枸杞子 煅牡蛎 山萸肉 炙甘草 续断 沙苑子 麸炒白术 盐菟丝子 酒女贞子 煅龙骨
0.840792 0.382326 0.879723 0.509424 0.662614 0.31736 0.301547 0.316712 0.821205 0.842265 0.808088 0.84737 0.318367 0.919901 0.386945 0.48068 0.531791 0.757775
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.111111, recall: 0.133333, error: 0.888889
311. 
patient tongue id: 05232038297382_1
label yaofang:
甘草 白芍 桃仁 党参 枸杞子 白术 熟地黄 杜仲 砂仁 菟丝子 巴戟天 桑寄生 鳖甲 鹿角霜 续断
0.426847 0.306416 0.410052 0.315279 0.388638 0.366551 0.301944 0.375624
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
312. 
patient tongue id: 03292019427799_7_2
label yaofang:
甘草 枳壳 黄芩 茯苓 半夏 薏苡仁 黄芪 白术 赤芍 浙贝母 杜仲 郁金 天麻 莪术 麦芽 紫苏叶 蜈蚣 合欢皮 蛇舌草
0.696205 0.41612 0.42048 0.31193 0.416169
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.210526, error: 0.200000
313. 
patient tongue id: 03151920512881_6_7
label yaofang:
柴胡 白芍 香附 枳壳 木香 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.49145 0.338806 0.381137 0.323808
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
314. 
patient tongue id: 04211329132597_1_4
label yaofang:
白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.317618 0.710407 0.395476 0.739709 0.453904 0.573946 0.338908 0.327465 0.300334 0.682012 0.69827 0.67933 0.719804 0.358653 0.823272 0.375157 0.436623 0.48842 0.643255
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.687500, error: 0.421053
315. 
patient tongue id: 05222322306981_1
label yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.31856 0.692531 0.40075 0.708467 0.449636 0.564381 0.346817 0.32421 0.302249 0.649923 0.674225 0.652395 0.689257 0.358559 0.817781 0.35834 0.437482 0.477542 0.623392
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.916667, error: 0.421053
316. 
patient tongue id: 06071915502816_6
label yaofang:
甘草 半夏 薏苡仁 黄芪 海螵蛸 牡丹皮 杜仲 郁金 山茱萸 淡豆豉 砂仁 麦芽 紫苏叶 蜈蚣 骨碎补 合欢皮 预知子 蛇舌草
0.332693 0.336666 0.500676 0.350448 0.301416
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.400000, recall: 0.111111, error: 0.600000
317. 
patient tongue id: 04300902356201_4_7_1
label yaofang:
甘草 法半夏 薏苡仁 黄连 郁金 苍术 天麻 地骨皮 糯稻根 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 红豆杉
0.883293 0.314587 0.462563 0.46932 0.353696 0.392559 0.318465 0.370286
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
318. 
patient tongue id: 04251949592243_1_2
label yaofang:
桂枝 白芍 当归 茯苓 龙骨 牡蛎 牛蒡子 党参 黄芪 白术 炙甘草 辛夷
0.336566 0.32772 0.426919 0.379373 0.323057
predicted yaofang:
甘草 党参 黄芪 白术 海螵蛸

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
319. 
patient tongue id: 02190509071895_6_4
label yaofang:
甘草 柴胡 白芍 茯苓 桃仁 丹参 青皮 牡丹皮 乌药 郁金 山茱萸 地黄 王不留行
0.921627 0.466096 0.516982 0.346722 0.505111 0.351385
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
320. 
patient tongue id: 01041628059255_2_7
label yaofang:
甘草 防风 丹参 生地黄 牡丹皮 乌梅 紫草 莪术 珍珠母 白鲜皮 百合 紫苏叶 土茯苓 徐长卿
0.381293 0.337295 0.355584
predicted yaofang:
甘草 白芍 党参

------Score: precision: 0.333333, recall: 0.071429, error: 0.666667
321. 
patient tongue id: 02161933236938_4
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.326161 0.314276 0.434795 0.313209 0.34255 0.320128 0.350889 0.472484
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.454545, error: 0.375000
322. 
patient tongue id: 02212035224695_6_2_7
label yaofang:
甘草 茯苓 白术 酸枣仁 生地黄 牛膝 厚朴 天麻 肉苁蓉 桑寄生 火麻仁 首乌藤 乌梢蛇
0.91689 0.474529 0.520791 0.348063 0.535351 0.306869 0.349334
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
323. 
patient tongue id: 02201759292386_4
label yaofang:
麻黄 甘草 前胡 桔梗 半夏 防风 薄荷 荆芥穗 紫菀 百部 辛夷 紫苏梗 广藿香 苍耳子
0.942423 0.307384 0.97217 0.597407 0.782963 0.303717 0.935325 0.957387 0.924373 0.951664 0.982435 0.407269 0.518824 0.569807 0.861483
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.533333, recall: 0.571429, error: 0.466667
324. 
patient tongue id: 06080153395109_2
label yaofang:
甘草 白芍 金银花 连翘 丹参 生地黄 栀子 牡丹皮 石膏 淡竹叶 广藿香 黄精 天山雪莲 木贼 有瓜石斛 谷精子
0.981553 0.528897 0.572427 0.333495 0.351816 0.676906 0.650725 0.619751 0.511452 0.579634 0.597194
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
325. 
patient tongue id: 03090813078403_5
label yaofang:
甘草 白芍 陈皮 茯苓 木香 党参 白术 黄连 车前子 砂仁 扁豆花 粉葛 建曲 紫苏梗 广藿香
0.579304 0.364328 0.402768 0.355368 0.419861
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
326. 
patient tongue id: 05140844336070_1_2
label yaofang:
黄芩 法半夏 茯苓 桔梗 薏苡仁 桃仁 鱼腥草 远志 浙贝母 款冬花 紫菀 苇茎 苦杏仁 炙麻黄
0.971026 0.531837 0.526826 0.326065 0.571943 0.555824 0.526163 0.413491 0.450059 0.43515
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.071429, error: 0.900000
327. 
patient tongue id: 03021155034951_1_2
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.300174 0.359549
predicted yaofang:
黄芪 炙甘草

------Score: precision: 0.500000, recall: 0.083333, error: 0.500000
328. 
patient tongue id: 05221907441380_1
label yaofang:
柴胡 茯苓 桔梗 党参 黄芪 白术 酸枣仁 山药 砂仁 升麻 珍珠母 首乌藤 救必应
0.48272 0.372622 0.326482 0.451528 0.450801 0.30633
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
329. 
patient tongue id: 06182337195418_6_1
label yaofang:
甘草 法半夏 蒲公英 党参 白术 海螵蛸 砂仁 麦芽 紫苏梗 广藿香 麸炒枳壳 火炭母 救必应
0.931468 0.485675 0.521342 0.369883 0.521539 0.461848 0.477992 0.33594 0.38461 0.370331
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.230769, error: 0.700000
330. 
patient tongue id: 02201812563960_7_4
label yaofang:
甘草 白芍 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 炒僵蚕
0.312561 0.794084 0.361892 0.866131 0.489533 0.647044 0.334928 0.304743 0.351222 0.301889 0.797234 0.824787 0.791432 0.838999 0.361581 0.89298 0.436372 0.455017 0.514757 0.730101
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.142857, error: 0.900000
331. 
patient tongue id: 03091911345577_5_6
label yaofang:
甘草 柴胡 川芎 黄芩 法半夏 茯苓 桔梗 防风 党参 浙贝母 荆芥穗 贯众 大青叶
0.9154 0.47194 0.505163 0.365469 0.478151 0.383987 0.440313 0.309812 0.308844
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
332. 
patient tongue id: 06082035338278_1_5
label yaofang:
甘草 半夏 白术 赤芍 海螵蛸 杜仲 牛膝 山茱萸 厚朴 荷叶 砂仁 僵蚕 续断 赭石 蜈蚣 预知子
0.477008 0.341896 0.360936 0.525374 0.377349
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
333. 
patient tongue id: 03221342376926_9
label yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.304947 0.69235 0.395584 0.725107 0.448128 0.571242 0.330651 0.326813 0.66591 0.683606 0.662865 0.701672 0.343804 0.801424 0.371732 0.440496 0.477875 0.626193
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.923077, error: 0.333333
334. 
patient tongue id: 04112157047370_7_6
label yaofang:
黄芩 茯苓 栀子 杜仲 牛膝 钩藤 石菖蒲 泽泻 天麻 石决明 桑寄生 益母草 蝉蜕 首乌藤
0.330575 0.324548 0.432493 0.339576 0.338258 0.329536 0.374759 0.479493
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
335. 
patient tongue id: 02181608237552_5_1
label yaofang:
甘草 当归 茯苓 防风 薏苡仁 蒲公英 枸杞子 郁金 山药 砂仁 巴戟天 芡实 莲子 珍珠母 蝉蜕 苦参 首乌藤 土茯苓 蛇舌草 亚麻子
0.734358 0.431087 0.354388 0.418002 0.490984
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.100000, error: 0.600000
336. 
patient tongue id: 04131855379532_4
label yaofang:
甘草 橘红 葶苈子 黄芪 枸杞子 枳实 胆南星 浙贝母 附子 郁金 山茱萸 生半夏 全蝎 僵蚕 柿蒂 天竺黄 黑枣 土鳖虫
0.416409 0.344267 0.320042 0.593075 0.461491 0.367366 0.334751 0.384314
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.250000, recall: 0.111111, error: 0.750000
337. 
patient tongue id: 06012111194177_5
label yaofang:
甘草 半夏 薏苡仁 黄芪 白术 海螵蛸 郁金 蒲黄 厚朴 莪术 败酱草 麦芽 赭石 紫苏叶 蜈蚣 合欢皮 预知子 蛇舌草
0.582587 0.394707 0.302146 0.510888 0.519347 0.329404 0.354646
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.222222, error: 0.428571
338. 
patient tongue id: 04071931382525_1_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香 苍耳子
0.607823 0.393006 0.669595 0.43628 0.523141 0.312084 0.586819 0.60851 0.595887 0.641322 0.358505 0.714269 0.364714 0.377977 0.360596 0.535309
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.625000, recall: 0.666667, error: 0.375000
339. 
patient tongue id: 01100656247044_5
label yaofang:
白芍 麦冬 太子参 酸枣仁 丹参 五味子 鳖甲 玉米须
0.585802 0.352574 0.386782 0.413889 0.434642
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
340. 
patient tongue id: 01122323557946_1_5_7
label yaofang:
甘草 白芍 党参 黄芪 黄连 赤芍 石膏 山药 山茱萸 益母草 佛手 首乌藤 合欢花
0.972328 0.536518 0.550194 0.332383 0.326223 0.633782 0.584138 0.549349 0.44012 0.494918 0.472906
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
341. 
patient tongue id: 03041420346568_8_5
label yaofang:
甘草 防风 金银花 远志 白术 黄连 生地黄 红花 桑白皮 水牛角 荆芥穗 火麻仁 白鲜皮 首乌藤 地肤子 土茯苓 蛇蜕
0.741436 0.428507 0.486427 0.466116
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.250000, recall: 0.058824, error: 0.750000
342. 
patient tongue id: 04122133579679_6_4
label yaofang:
甘草 香附 茯苓 薏苡仁 党参 郁金 天麻 鳖甲 扁豆花 莪术 浮小麦 蜈蚣 白花蛇舌 天山雪莲
0.948361 0.481001 0.530483 0.425011 0.304778 0.320909 0.550099 0.525409 0.583355 0.388377 0.451106 0.478148
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
343. 
patient tongue id: 04210740217461_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.612524 0.39922 0.428852 0.311332 0.320107
predicted yaofang:
甘草 茯苓 党参 黄芪 天麻

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
344. 
patient tongue id: 05242127045970_5_1_2
label yaofang:
甘草 连翘 薏苡仁 蒲公英 党参 生地黄 红花 天麻 鳖甲 蜈蚣 白花蛇舌 半枝莲 红豆杉 制天南星
0.865543 0.487574 0.449128 0.34595 0.394018 0.32688
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
345. 
patient tongue id: 01040251058404_7_6_5
label yaofang:
甘草 薏苡仁 党参 白术 延胡索 细辛 天麻 鳖甲 补骨脂 三棱 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.874548 0.474234 0.47363 0.40285 0.401127 0.314033 0.395117
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.857143, recall: 0.375000, error: 0.142857
346. 
patient tongue id: 04122036094221_1_4_9
label yaofang:
甘草 茯苓 远志 党参 白术 厚朴 天麻 肉苁蓉 鳖甲 火麻仁 首乌藤 蜈蚣 天山雪莲 半枝莲 红豆杉
0.969869 0.488025 0.544532 0.366588 0.603518 0.500308 0.539894 0.329255 0.402253 0.402611
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.600000, error: 0.100000
347. 
patient tongue id: 03081758252928_1_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.342299 0.385564 0.395623 0.310556
predicted yaofang:
甘草 黄芪 白术 海螵蛸

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
348. 
patient tongue id: 06031122312143_6_4
label yaofang:
甘草 白芍 法半夏 茯苓 桔梗 浙贝母 桑白皮 天麻 鳖甲 款冬花 地龙 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.917993 0.483133 0.49574 0.3735 0.481294 0.391631 0.434028 0.308302
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.750000, recall: 0.375000, error: 0.250000
349. 
patient tongue id: 01140801547976_6_2
label yaofang:
甘草 柴胡 白芍 茯苓 桃仁 党参 白术 生地黄 栀子 牡丹皮 黄柏 菟丝子 益母草 合欢花 墨旱莲
0.97769 0.530344 0.559441 0.34478 0.336487 0.30073 0.648681 0.609614 0.598497 0.466455 0.522288 0.528152
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
350. 
patient tongue id: 01122218311736_1_2_6
label yaofang:
甘草 党参 鸡血藤 白术 酸枣仁 生地黄 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 乌梢蛇
0.990365 0.553498 0.60075 0.329228 0.377546 0.325437 0.754378 0.691883 0.650422 0.533016 0.600593 0.594117
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.625000, error: 0.166667
351. 
patient tongue id: 03311632574360_1_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 鹿衔草
0.370551 0.527101 0.376557 0.390804 0.34064 0.595666 0.718223
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.857143, recall: 0.545455, error: 0.142857
352. 
patient tongue id: 02231824390438_2
label yaofang:
川芎 茯苓 防风 黄芪 郁金 钩藤 白芷 石决明 北柴胡 炙甘草 首乌藤 威灵仙 炒蔓荆子 棉萆薢
0.92929 0.96672 0.578713 0.777494 0.331608 0.927189 0.949205 0.921175 0.949176 0.980478 0.427434 0.507447 0.565672 0.847342
predicted yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.142857, recall: 0.142857, error: 0.857143
353. 
patient tongue id: 04112050024644_7_1
label yaofang:
甘草 蒲公英 紫花地丁 党参 赤芍 浙贝母 车前子 天麻 益母草 鳖甲 鹿角霜 蜈蚣 天山雪莲 半枝莲
0.953297 0.498416 0.526688 0.357703 0.541544 0.497331 0.501077 0.361923 0.421076 0.397731
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
354. 
patient tongue id: 01172242599197_4_6
label yaofang:
甘草 茯苓 桔梗 玄参 生地黄 浙贝母 牡丹皮 黄柏 知母 山药 山茱萸 泽泻 天花粉
0.995382 0.554893 0.62284 0.317861 0.341601 0.771569 0.711327 0.668743 0.51686 0.610395 0.605626
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
355. 
patient tongue id: 04241831590206_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗
0.399043 0.572674 0.448911 0.30978 0.460019 0.308479 0.386745 0.685288 0.788033 0.319719
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.900000, recall: 0.818182, error: 0.100000
356. 
patient tongue id: 03231120386377_5_1
label yaofang:
甘草 柴胡 白芍 薏苡仁 白术 黄柏 郁金 苍术 山药 车前子 荆芥穗 鳖甲 白花蛇舌草 蜈蚣 天山雪莲 红豆杉
0.88104 0.466174 0.481952 0.413979 0.395376 0.350808 0.435245
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
357. 
patient tongue id: 01061927329459_4
label yaofang:
桂枝 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.323734 0.662057 0.392759 0.702869 0.445418 0.550432 0.339748 0.322104 0.644562 0.670258 0.652853 0.694298 0.361654 0.786703 0.377847 0.428565 0.458806 0.615136
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.687500, error: 0.388889
358. 
patient tongue id: 04130856592193_6_2
label yaofang:
甘草 川芎 陈皮 法半夏 茯苓 白术 牛膝 天麻 僵蚕 桑寄生 补骨脂 地龙 蒺藜 首乌藤
0.946628 0.486476 0.515965 0.334876 0.527584 0.419098 0.440962 0.326844 0.308503
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
359. 
patient tongue id: 04072032195649_1_2_6
label yaofang:
甘草 龙齿 黄芪 白术 厚朴 莪术 鸡内金 莲子 辛夷 首乌藤 合欢皮
0.337392 0.593891 0.386024 0.659514 0.447279 0.522887 0.350176 0.301972 0.30444 0.309986 0.337907 0.314233 0.589522 0.635652 0.600475 0.647311 0.359132 0.75122 0.379061 0.307182 0.413712 0.415208 0.56231
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.086957, recall: 0.181818, error: 0.913043
360. 
patient tongue id: 01042318203965_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.353591 0.469391 0.335645 0.313867 0.331756 0.375022 0.305459 0.462418 0.561943
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 浙贝母 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.142857, error: 0.777778
361. 
patient tongue id: 03222032126054_1_4_6
label yaofang:
甘草 茯苓 太子参 白术 五味子 海螵蛸 砂仁 僵蚕 糯稻根 枇杷叶 地龙 蜈蚣 木蝴蝶
0.557704 0.343187 0.427108 0.362742 0.364159
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
362. 
patient tongue id: 03081820015909_1_2_7
label yaofang:
甘草 茯苓 牡蛎 桃仁 党参 白术 丹参 砂仁 菟丝子 桑寄生 北沙参 橘核 土鳖虫 红豆杉 素馨花
0.402894 0.32194 0.621848 0.391788 0.356556 0.368023 0.352498
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
363. 
patient tongue id: 01121843155889_2
label yaofang:
法半夏 茯苓 前胡 防风 太子参 钩藤 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 威灵仙
0.311246 0.669674 0.387197 0.689662 0.44522 0.559798 0.343069 0.333313 0.631162 0.653922 0.653089 0.692049 0.360881 0.791558 0.366398 0.436037 0.485752 0.618805
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.785714, error: 0.388889
364. 
patient tongue id: 03062124405515_1_4_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 砂仁 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲
0.93863 0.491623 0.538565 0.408098 0.303407 0.337325 0.552107 0.492639 0.515861 0.361955 0.414441 0.399077
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
365. 
patient tongue id: 03012201489241_1_4_6
label yaofang:
甘草 茯苓 木香 薏苡仁 远志 党参 酸枣仁 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.98499 0.542126 0.574241 0.33187 0.34769 0.301897 0.699486 0.662983 0.614 0.508853 0.571555 0.557599
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
366. 
patient tongue id: 02231907510580_4
label yaofang:
法半夏 前胡 桔梗 麦冬 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.331086 0.705872 0.386144 0.753551 0.468002 0.588672 0.351191 0.30856 0.305613 0.349041 0.3132 0.692812 0.718007 0.696248 0.740676 0.364367 0.826455 0.396959 0.45937 0.510022 0.665262
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
367. 
patient tongue id: 03291353549746_1_7
label yaofang:
甘草 川芎 黄芪 鸡血藤 酸枣仁 生地黄 红花 杜仲 牛膝 山药 桑叶 天麻 桑寄生 地龙 浮小麦 灯盏细辛
0.980746 0.545601 0.559792 0.329254 0.322128 0.306074 0.654928 0.63536 0.583142 0.496005 0.53624 0.528377
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
368. 
patient tongue id: 03221946399570_2_6
label yaofang:
甘草 柴胡 白芍 党参 杜仲 山药 天麻 桑寄生 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.75985 0.310376 0.393508 0.421254 0.377173
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
369. 
patient tongue id: 03012312250329_4_1
label yaofang:
桂枝 甘草 白芍 法半夏 茯苓 桃仁 鸡血藤 白术 酸枣仁 红花 赤芍 吴茱萸 麦芽 地龙
0.968813 0.521969 0.534016 0.321348 0.585657 0.530875 0.502401 0.385307 0.433407 0.417286
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
370. 
patient tongue id: 05092135201662_2_1
label yaofang:
甘草 茯苓 桔梗 薏苡仁 浙贝母 细辛 白芷 蔓荆子 白花蛇舌草 辛夷 广藿香 炒苍耳子 蜂房 醋鳖甲
0.919552 0.479981 0.515872 0.373109 0.50127 0.401709 0.431321 0.321261 0.305845
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.222222, recall: 0.142857, error: 0.777778
371. 
patient tongue id: 04232010139991_3
label yaofang:
桂枝 甘草 党参 太子参 黄芪 附子 珍珠母
0.716221 0.40903 0.445839 0.381072 0.433715 0.301526
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
372. 
patient tongue id: 04300917010231_2_4
label yaofang:
甘草 茯苓 党参 白术 熟附子 杜仲 乌药 山茱萸 泽泻 车前子 天麻 补骨脂 桑螵蛸 地龙 益智 泽兰
0.496049 0.38127 0.360781 0.421948 0.309396
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.250000, error: 0.200000
373. 
patient tongue id: 06190819235998_1_4_6
label yaofang:
甘草 枳壳 薏苡仁 远志 党参 黄芪 白术 厚朴 天麻 肉苁蓉 鳖甲 桑螵蛸 蜈蚣 天山雪莲 半枝莲 红豆杉
0.939222 0.49079 0.517728 0.387607 0.509805 0.496923 0.523867 0.379104 0.418575 0.412819
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.500000, error: 0.200000
374. 
patient tongue id: 01092335072380_4
label yaofang:
桂枝 白芍 大枣 玉竹 炙甘草
0.438293 0.352423 0.312525 0.325368 0.307494
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.200000, error: 0.800000
375. 
patient tongue id: 04182155278057_5
label yaofang:
甘草 法半夏 桔梗 金银花 连翘 桃仁 紫花地丁 党参 丹参 浙贝母 郁金 夏枯草 皂角刺
0.957392 0.49419 0.526763 0.339785 0.56393 0.509098 0.506403 0.368396 0.41572 0.40925
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.153846, error: 0.800000
376. 
patient tongue id: 04112102100143_1_6_3
label yaofang:
桂枝 白芍 当归 牡蛎 黄芪 白术 五味子 砂仁 糯稻根 北沙参 炙甘草 黑枣
0.483899 0.345156 0.370171 0.551792 0.559414 0.337688 0.404568 0.330392 0.358917
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 厚朴 砂仁 北沙参

------Score: precision: 0.444444, recall: 0.333333, error: 0.555556
377. 
patient tongue id: 04272321156884_1_7
label yaofang:
白芍 川芎 当归 防风 丹参 钩藤 荆芥穗 天麻 白芷 石决明 炙甘草 首乌藤 广藿香 炒蔓荆子 棉萆薢
0.30616 0.828153 0.372434 0.876319 0.522362 0.664993 0.332714 0.308764 0.337091 0.306653 0.814075 0.838516 0.802708 0.849225 0.333067 0.918517 0.40695 0.483382 0.534068 0.751828
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.333333, error: 0.750000
378. 
patient tongue id: 03282204574308_2_4
label yaofang:
甘草 黄芩 法半夏 茯苓 桃仁 远志 党参 浙贝母 山药 厚朴 紫菀 地龙 苦杏仁 紫苏子 鹿角霜 蜜麻黄
0.866757 0.457909 0.511181 0.3659 0.499473 0.326745
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
379. 
patient tongue id: 01070839045705_1_4_2
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.391156 0.323234 0.409816 0.384563 0.467906 0.410696 0.319872 0.387468 0.371782 0.376817 0.341892 0.39738 0.391049 0.386812 0.369614
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.133333, recall: 0.166667, error: 0.866667
380. 
patient tongue id: 02141929017554_2
label yaofang:
白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.88952 0.321246 0.938657 0.560849 0.73068 0.316239 0.335001 0.886323 0.9134 0.875782 0.915553 0.31288 0.958427 0.417657 0.500555 0.558631 0.806133
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.647059, recall: 0.785714, error: 0.352941
381. 
patient tongue id: 02211842432388_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.418356 0.577883 0.481068 0.32898 0.450149 0.316398 0.396262 0.703754 0.777367 0.32295
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.100000, recall: 0.071429, error: 0.900000
382. 
patient tongue id: 02142201304449_6
label yaofang:
甘草 党参 酸枣仁 牡丹皮 郁金 山药 天麻 鳖甲 扁豆花 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991968 0.555852 0.61225 0.344682 0.393033 0.33045 0.764673 0.756183 0.728554 0.606932 0.689124 0.720535
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
383. 
patient tongue id: 01182056546495_6_4
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 黄芪 白术 竹茹 郁金 石菖蒲 桑螵蛸 益智 广升麻
0.935432 0.505621 0.530627 0.357696 0.321846 0.307759 0.562057 0.48206 0.474928 0.364319 0.4033 0.381157
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
384. 
patient tongue id: 06080319044546_2
label yaofang:
甘草 白芍 党参 黄芪 牡丹皮 地黄 益母草 白花蛇舌草 麦芽 板蓝根 制何首乌 酒女贞子 墨旱莲 酒黄精
0.938615 0.32395 0.473141 0.506055 0.34165 0.498431 0.428727 0.465826 0.301955 0.354381 0.356047
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
385. 
patient tongue id: 01110256056809_3
label yaofang:
桂枝 白芍 大枣 龙骨 牡蛎 炙甘草
0.316147 0.423588 0.375687 0.328768 0.334232
predicted yaofang:
茯苓 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.200000, recall: 0.166667, error: 0.800000
386. 
patient tongue id: 04210646332134_4_5
label yaofang:
甘草 法半夏 茯苓 前胡 连翘 牛蒡子 薏苡仁 浙贝母 桑白皮 莱菔子 款冬花 苇茎 苦杏仁 紫苏子
0.489838 0.368332 0.363822 0.365902 0.32943 0.352702
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
387. 
patient tongue id: 06181845156965_1_5
label yaofang:
甘草 川芎 茯苓 党参 白术 赤芍 杜仲 牛膝 山药 钩藤 天麻 防己 桑寄生 决明子 粉葛 首乌藤
0.897852 0.472581 0.487429 0.403567 0.425052 0.324836 0.398488
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
388. 
patient tongue id: 05161917057692_4
label yaofang:
麻黄 茯苓 葛根 前胡 桔梗 半夏 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 苍耳子
0.891993 0.340439 0.938753 0.553742 0.722861 0.314654 0.309034 0.333665 0.884838 0.909548 0.869873 0.909812 0.306418 0.957582 0.417569 0.489209 0.543627 0.805176
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.733333, error: 0.388889
389. 
patient tongue id: 01211220485390_1
label yaofang:
茯苓 太子参 山药 钩藤 鸡内金 麦芽 蝉蜕 独脚金 稻芽 芒果核
0.302343 0.424039 0.340274 0.315022 0.372848
predicted yaofang:
茯苓 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
390. 
patient tongue id: 01211259013885_6_1
label yaofang:
柴胡 白芍 当归 茯苓 薄荷 白术 秦艽 炙甘草 嫩桑枝 丝瓜络 威灵仙
0.513291
predicted yaofang:
炙甘草

------Score: precision: 1.000000, recall: 0.090909, error: 0.000000
391. 
patient tongue id: 04121924134246_5_7
label yaofang:
甘草 独活 薏苡仁 杜仲 苍术 厚朴 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.546456 0.396586 0.327824 0.434309 0.45279
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
392. 
patient tongue id: 02131312038334_1_7_4
label yaofang:
桂枝 葛根 桃仁 延胡索 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草
0.544084 0.347562 0.347001 0.403474 0.347297
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
393. 
patient tongue id: 03291415175204_1_6
label yaofang:
甘草 白芍 防风 金银花 党参 白术 生地黄 红花 牡丹皮 水牛角 荆芥穗 白鲜皮 浮小麦 地肤子 合欢花
0.940042 0.496462 0.510552 0.324317 0.510372 0.415553 0.413509 0.320903
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
394. 
patient tongue id: 04132019213277_1_7_6
label yaofang:
甘草 柴胡 白芍 黄芪 何首乌 丹参 枳实 郁金 小蓟 砂仁 珍珠母 浮小麦 首乌藤 百合
0.332904 0.316094 0.343282 0.417005 0.383267 0.380844
predicted yaofang:
甘草 白芍 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
395. 
patient tongue id: 01032224476237_5_2
label yaofang:
柴胡 白芍 黄芩 枳实 石膏 杏仁 细辛 干姜 大黄 生地 滑石 川朴 法夏
0.874354 0.473573 0.462874 0.387867 0.360879 0.311795 0.369209
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
396. 
patient tongue id: 01050639076824_1_7_2
label yaofang:
甘草 赤芍 杜仲 山药 山茱萸 天麻 桑寄生 鳖甲 桑螵蛸 蜈蚣 天山雪莲 半枝莲 骨碎补 土鳖虫 牛大力
0.98858 0.560183 0.598031 0.343163 0.388959 0.340318 0.741199 0.704419 0.662935 0.562374 0.617656 0.624091
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
397. 
patient tongue id: 05260618214147_4_7_6
label yaofang:
甘草 茯苓 桃仁 党参 白术 酸枣仁 红花 天麻 鳖甲 益智 辛夷 沙苑子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.587741 0.408315 0.423945 0.352052 0.346903 0.308047
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.833333, recall: 0.312500, error: 0.166667
398. 
patient tongue id: 05191953220086_1_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 郁金 山药 石菖蒲 天麻 鳖甲 扁豆花 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.977845 0.528989 0.569207 0.361434 0.334416 0.317181 0.660702 0.603172 0.582737 0.444877 0.505998 0.489548
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.800000, error: 0.000000
399. 
patient tongue id: 01070839503393_1_2_6
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志 黄精
0.396683 0.378541 0.393039 0.337531
predicted yaofang:
甘草 茯苓 黄芪 白术

------Score: precision: 0.750000, recall: 0.250000, error: 0.250000
400. 
patient tongue id: 03311657470159_1_6
label yaofang:
甘草 白芍 川芎 独活 牛蒡子 牛膝 细辛 干姜 蜈蚣 姜黄 海桐皮 鹿衔草
0.353764 0.306732 0.409782 0.460645 0.397106
predicted yaofang:
甘草 党参 黄芪 白术 海螵蛸

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
401. 
patient tongue id: 05092118240753_3_4
label yaofang:
甘草 香附 法半夏 茯苓 党参 丹参 黄连 熟附子 红花 郁金 车前子 瓜蒌皮 莪术 鹿角霜 玉米须
0.903488 0.475206 0.476029 0.377952 0.421739 0.372691 0.410687
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
402. 
patient tongue id: 05242130540310_2_5
label yaofang:
甘草 茯苓 桔梗 芦根 牛蒡子 太子参 白术 浙贝母 乌梅 天花粉 鳖甲 白花蛇舌 蜂房 四季青
0.994151 0.575224 0.631593 0.309694 0.38563 0.33076 0.785567 0.742768 0.674584 0.581037 0.651771 0.628635
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
403. 
patient tongue id: 03081829166099_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.306933 0.637868 0.390221 0.646908 0.421802 0.525306 0.329362 0.583142 0.627309 0.595024 0.632807 0.337584 0.784138 0.339904 0.406851 0.408656 0.5594
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.705882, recall: 0.857143, error: 0.294118
404. 
patient tongue id: 02221233493656_1_3_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.395199 0.422302 0.388211 0.543579 0.429685 0.314358 0.402599 0.361367 0.388311 0.32468 0.400097 0.384775 0.408332 0.377749
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.214286, recall: 0.230769, error: 0.785714
405. 
patient tongue id: 05290820294519_4_6
label yaofang:
甘草 茯苓 薏苡仁 党参 杜仲 山药 天麻 菟丝子 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.954039 0.50167 0.520201 0.359457 0.540313 0.472914 0.484245 0.332604 0.380198 0.359116
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.600000, error: 0.100000
406. 
patient tongue id: 01201949464024_3_5_7
label yaofang:
甘草 白芍 薏苡仁 熟附子 郁金 大腹皮 干姜 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 川木瓜 土鳖虫
0.91366 0.330392 0.509996 0.425285 0.371805 0.302876
predicted yaofang:
甘草 法半夏 茯苓 党参 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
407. 
patient tongue id: 05232027526791_2_1_5
label yaofang:
甘草 柴胡 半夏 蒲公英 党参 枸杞子 白术 厚朴 淡豆豉 砂仁 柿蒂 北沙参 赭石 合欢皮 预知子 鸡骨草
0.373258 0.384735 0.342302 0.441021 0.375709 0.389949
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
408. 
patient tongue id: 01032055340919_4
label yaofang:
甘草 川芎 茯苓 枸杞子 丹参 杜仲 牛膝 泽泻 天麻 防己 益母草 天山雪莲 吉利
0.900625 0.482262 0.470527 0.35399 0.430828 0.316431 0.372806
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
409. 
patient tongue id: 03302021437010_2_1_4
label yaofang:
甘草 牛蒡子 桃仁 麦冬 枸杞子 玄参 山茱萸 生半夏 砂仁 僵蚕 莪术 北沙参 赭石 辛夷 紫苏叶 蜈蚣 木蝴蝶 土鳖虫 岗梅
0.405081 0.309287 0.397369 0.647892 0.54382 0.354045 0.450695 0.317622 0.383284 0.391612 0.300069
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.272727, recall: 0.157895, error: 0.727273
410. 
patient tongue id: 03232310047761_3_4
label yaofang:
甘草 白芍 薏苡仁 党参 熟附子 肉桂 山药 山茱萸 车前子 大腹皮 猪苓 鳖甲 补骨脂 莪术 白花蛇舌 红豆杉
0.935368 0.487675 0.525502 0.375663 0.539245 0.467122 0.48278 0.334471 0.387098 0.370433
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
411. 
patient tongue id: 04142232323334_1_4
label yaofang:
桂枝 甘草 茯苓 党参 黄芪 白术 熟附子 泽泻 天麻 鳖甲 败酱草 建曲 蜈蚣 天山雪莲 半枝莲
0.983661 0.547718 0.558519 0.327233 0.312625 0.662539 0.623712 0.578338 0.470011 0.51577 0.497557
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
412. 
patient tongue id: 01182125572738_2_4_6
label yaofang:
甘草 枳壳 茯苓 连翘 党参 白术 浙贝母 郁金 山药 砂仁 鳖甲 火麻仁 鸡内金 苦杏仁 白花蛇舌 天山雪莲
0.947001 0.513716 0.529774 0.345493 0.309844 0.570492 0.457778 0.462354 0.32766 0.368925 0.35749
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
413. 
patient tongue id: 04241924565699_5
label yaofang:
金银花 薏苡仁 枸杞子 赤小豆 野菊花 火麻仁 茵陈 夏枯草 四季青 木棉花
0.380621 0.422122 0.423072 0.409623
predicted yaofang:
白芍 白术 海螵蛸 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
414. 
patient tongue id: 04252311414224_6_4
label yaofang:
甘草 陈皮 黄芩 茯苓 前胡 桃仁 远志 细辛 款冬花 白前 苦杏仁 紫苏子 炙麻黄
0.847362 0.475092 0.430222 0.376191 0.339809 0.31671
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
415. 
patient tongue id: 03291953364807_5_2_7
label yaofang:
甘草 桃仁 丹参 赤芍 牡丹皮 厚朴 射干 柿蒂 北沙参 苦杏仁 赭石 木蝴蝶 山豆根 岗梅
0.591985 0.39736 0.3949 0.377929 0.396743
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
416. 
patient tongue id: 01190643310777_2_6
label yaofang:
甘草 柴胡 白芍 川芎 茯苓 酸枣仁 生地黄 牛膝 山药 山茱萸 细辛 天麻 全蝎 菟丝子 桑寄生 益母草
0.902453 0.450307 0.456893 0.342864 0.363552 0.330039
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
417. 
patient tongue id: 02151324327011_4_1
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子
0.353487 0.530345 0.426341 0.386645 0.5733 0.492237 0.47774 0.572034 0.551413 0.545335 0.614083 0.445478 0.603063 0.610166 0.620941
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.133333, recall: 0.181818, error: 0.866667
418. 
patient tongue id: 03302010244226_5
label yaofang:
甘草 枳壳 薏苡仁 桃仁 蒲公英 赤芍 牡丹皮 厚朴 石韦 北沙参 蜈蚣 土鳖虫 蛇舌草 冬凌草 鸭脚艾
0.38257 0.347762 0.33854 0.397987
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.066667, error: 0.750000
419. 
patient tongue id: 04142013564760_6_5_1
label yaofang:
甘草 川芎 荆芥 牛膝 细辛 天麻 白芷 火麻仁 白花蛇舌草 麦芽 制何首乌 地肤子 蜈蚣 醋鳖甲
0.960348 0.520527 0.539086 0.370108 0.32294 0.314026 0.59158 0.583677 0.559547 0.454906 0.497444 0.485763
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
420. 
patient tongue id: 01190636595638_1_2_6
label yaofang:
甘草 白芍 太子参 何首乌 白术 酸枣仁 牡丹皮 天麻 鳖甲 火麻仁 续断 沙苑子 蜈蚣 白花蛇舌 天山雪莲 乌梢蛇
0.97664 0.530179 0.56867 0.393827 0.363837 0.344056 0.66338 0.631687 0.630924 0.489825 0.553075 0.557809
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
421. 
patient tongue id: 05270749486627_1_4
label yaofang:
黄芪 仙鹤草 菟丝子 升麻 淫羊藿 鸡内金 虎杖 莲子 白花蛇舌草 麸炒白术 炙黄芪 炒稻芽 炒麦芽 穿山龙
0.397375 0.35341 0.347217 0.37775 0.399057 0.378133 0.315661 0.337416 0.315849 0.302523 0.317725
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤 泽泻 车前子 莱菔子

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
422. 
patient tongue id: 05162139537286_1_2_4
label yaofang:
甘草 玉竹 太子参 灯心草 天麻 鳖甲 茵陈 扁豆花 麦芽 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.885402 0.328804 0.44001 0.50084 0.353216 0.438514 0.347181
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
423. 
patient tongue id: 06140811569035_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.408946 0.355586 0.341369 0.473172 0.301293
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
424. 
patient tongue id: 03171338007660_2
label yaofang:
甘草 茯苓 葛根 防风 麦冬 玄参 牡丹皮 荷叶 白芷 北沙参 百合 广藿香 炒六神曲 布渣叶 干石斛 荆芥炭
0.304351 0.840171 0.360189 0.881584 0.512496 0.677274 0.335991 0.326536 0.826748 0.845052 0.814738 0.858087 0.349445 0.933533 0.393071 0.477887 0.545587 0.764223
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.222222, recall: 0.250000, error: 0.777778
425. 
patient tongue id: 01062340548391_1_4_7
label yaofang:
黄芩 金银花 牛蒡子 蒲公英 麦冬 细辛 山楂 蔓荆子 鸡内金 干鱼腥草 苍耳子 炒六神曲
0.371595 0.390059 0.423397 0.349061 0.344215
predicted yaofang:
甘草 法半夏 茯苓 黄芪 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
426. 
patient tongue id: 02260515162255_6_2
label yaofang:
甘草 党参 白术 杜仲 砂仁 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.977177 0.531234 0.532911 0.318193 0.60393 0.540862 0.528066 0.395899 0.439802 0.437777
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.642857, error: 0.100000
427. 
patient tongue id: 01051856300945_4
label yaofang:
法半夏 前胡 防风 钩藤 白芷 款冬花 紫菀 白前 百部 豆蔻 炙甘草 辛夷 广藿香 威灵仙 炒紫苏子 蜜麻黄
0.890766 0.324389 0.937309 0.550561 0.735542 0.309155 0.33481 0.883986 0.91195 0.877429 0.913642 0.306364 0.958984 0.422358 0.505604 0.549368 0.805155
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.705882, recall: 0.750000, error: 0.294118
428. 
patient tongue id: 06022221214416_1_4_7
label yaofang:
党参 黄芪 枸杞子 白术 海螵蛸 杜仲 牛膝 山药 白茅根 泽泻 厚朴 巴戟天 紫苏叶 玉米须 蜈蚣 鲜龙葵果
0.360637 0.333451 0.343358 0.546127 0.483982 0.349465 0.360944 0.36382
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 厚朴 北沙参

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
429. 
patient tongue id: 03271408358225_1_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄
0.65957 0.437855 0.647051 0.420815 0.50285 0.316804 0.595475 0.575726 0.572414 0.599433 0.343003 0.70845 0.323492 0.387612 0.424925 0.540895
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.687500, recall: 0.785714, error: 0.312500
430. 
patient tongue id: 04141251098036_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.324083 0.795392 0.382398 0.859411 0.515693 0.638324 0.358032 0.328018 0.307948 0.36076 0.323125 0.790467 0.823663 0.776062 0.82423 0.358115 0.888881 0.420896 0.468118 0.51902 0.719219
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 1.000000, error: 0.285714
431. 
patient tongue id: 05162128599559_2_4
label yaofang:
甘草 当归 茯苓 生地黄 牡丹皮 杜仲 山药 山茱萸 仙鹤草 茜草 桑寄生 扁豆花 续断 鱼古
0.75167 0.427997 0.369525 0.354807 0.457511
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
432. 
patient tongue id: 03290714081600_3_2_6
label yaofang:
甘草 薏苡仁 党参 黄柏 乌药 厚朴 天麻 鳖甲 火麻仁 补骨脂 莪术 蜈蚣 白花蛇舌 红豆杉
0.342287 0.471839 0.332731 0.303079 0.336864 0.380597 0.466257 0.560168
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.071429, error: 0.875000
433. 
patient tongue id: 05162056430383_2_6
label yaofang:
甘草 白芍 茯苓 党参 酸枣仁 生地黄 天麻 桑寄生 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.932894 0.503031 0.51981 0.325633 0.545962 0.415083 0.394982 0.319532
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.875000, recall: 0.466667, error: 0.125000
434. 
patient tongue id: 03171432118567_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.303164 0.836959 0.381246 0.879664 0.510313 0.669544 0.336826 0.305867 0.329486 0.822167 0.842585 0.807416 0.85204 0.340286 0.91995 0.401661 0.485145 0.541146 0.759884
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
435. 
patient tongue id: 02212006401213_1_2_6
label yaofang:
甘草 柴胡 白芍 茯苓 地黄 天麻 桑寄生 浮小麦 蜈蚣 合欢花 半枝莲 醋鳖甲 麸炒枳壳
0.898755 0.304149 0.462188 0.492986 0.345652 0.448173 0.320394 0.371233
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.384615, error: 0.375000
436. 
patient tongue id: 05032320192138_1_5_6
label yaofang:
甘草 桔梗 金银花 芦根 牛蒡子 薏苡仁 浙贝母 天麻 天花粉 鳖甲 蜈蚣 天山雪莲 半枝莲 红豆杉
0.943311 0.478674 0.512507 0.407968 0.504339 0.497342 0.54721 0.374804 0.424359 0.435681
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.428571, error: 0.400000
437. 
patient tongue id: 03302130480924_1_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 党参 浙贝母 莱菔子 天麻 莪术 紫菀 白花蛇舌草 蜈蚣 醋鳖甲
0.77309 0.40882 0.391 0.373922 0.50449 0.349991
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
438. 
patient tongue id: 04071422593039_1_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.329534 0.682644 0.406862 0.737701 0.461772 0.571242 0.342823 0.308762 0.35315 0.325706 0.675343 0.689713 0.675986 0.71965 0.366491 0.774779 0.419884 0.450289 0.489128 0.643982
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
439. 
patient tongue id: 04101916510584_1
label yaofang:
防风 太子参 黄芪 白术 细辛 白芷 炙甘草 辛夷 紫苏梗 广藿香 炒苍耳子
0.30984 0.798715 0.375052 0.855764 0.512939 0.650247 0.331606 0.306341 0.345669 0.301331 0.791166 0.816522 0.785742 0.827829 0.33621 0.900655 0.409899 0.481121 0.523311 0.732651
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.636364, error: 0.650000
440. 
patient tongue id: 03011059288122_6_4
label yaofang:
枳壳 桔梗 牛蒡子 党参 白术 海螵蛸 旋覆花 紫菀 百部 北沙参 炙甘草 紫苏梗 化橘红
0.303709 0.503608
predicted yaofang:
黄芪 炙甘草

------Score: precision: 0.500000, recall: 0.076923, error: 0.500000
441. 
patient tongue id: 03231053473252_2_6
label yaofang:
甘草 茯苓 酸枣仁 生地黄 天麻 鳖甲 茵陈 扁豆花 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.489984 0.379855 0.315007 0.31662
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
442. 
patient tongue id: 03302121431277_1_7
label yaofang:
甘草 川芎 法半夏 茯苓 桔梗 连翘 党参 黄芪 白术 浙贝母 山药 砂仁 莱菔子 天麻 麦芽 地龙
0.93548 0.503981 0.49892 0.327886 0.511476 0.42698 0.421845 0.305956 0.334861 0.317555
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.312500, error: 0.500000
443. 
patient tongue id: 02231904414416_1_4
label yaofang:
茯苓 葛根 海螵蛸 干姜 佩兰 豆蔻 炙甘草 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炙黄芪 炒六神曲 甘松 干石斛
0.31528 0.789988 0.366163 0.856715 0.504186 0.650075 0.337569 0.307632 0.357043 0.310012 0.790694 0.817732 0.784221 0.832391 0.343392 0.89002 0.424455 0.476182 0.53139 0.732643
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.200000, error: 0.850000
444. 
patient tongue id: 05181825178638_6
label yaofang:
麦冬 酸枣仁 丹参 钩藤 灯心草 三七 煅牡蛎 煅龙骨 红景天 毛冬青
0.367974 0.310084 0.306419 0.306042 0.367568 0.371014
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
445. 
patient tongue id: 03221309495509_1_2_6
label yaofang:
甘草 独活 党参 白术 酸枣仁 杜仲 山药 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.98806 0.550002 0.60957 0.342082 0.382062 0.335816 0.745192 0.691111 0.647993 0.530472 0.609882 0.609881
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
446. 
patient tongue id: 03291351101751_1_6
label yaofang:
甘草 牡蛎 党参 白术 黄柏 郁金 山药 山茱萸 天麻 地骨皮 秦艽 白花蛇舌草 浮小麦 醋龟甲 蜈蚣 半枝莲 醋鳖甲
0.77191 0.315904 0.400548 0.434034 0.381593
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.176471, error: 0.400000
447. 
patient tongue id: 01040648125845_6_2
label yaofang:
甘草 香附 茯苓 龙骨 党参 太子参 酸枣仁 丹参 黄连 生地黄 乌药 益母草 麦芽 浮小麦
0.943007 0.513166 0.503404 0.333989 0.52353 0.407429 0.412657 0.308328
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
448. 
patient tongue id: 01201326209972_5_2
label yaofang:
甘草 黄芩 玄参 浙贝母 白茅根 地黄 茜草 天花粉 诃子 白花蛇舌草 辛夷 蜂房 岗梅根 醋鳖甲
0.943021 0.493351 0.527414 0.352602 0.56201 0.47634 0.486918 0.342168 0.395651 0.386345
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.071429, error: 0.900000
449. 
patient tongue id: 02191215541941_1_7
label yaofang:
甘草 川芎 党参 酸枣仁 生地黄 赤芍 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.938069 0.482912 0.516757 0.360506 0.53131 0.462981 0.497837 0.336421 0.392851 0.397145
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.571429, error: 0.200000
450. 
patient tongue id: 05032303441320_5_7
label yaofang:
甘草 白芍 川芎 龙骨 天冬 杜仲 黄柏 牛膝 僵蚕 桑寄生 麦芽 地龙 赭石 首乌藤 醋鳖甲
0.965633 0.303634 0.502633 0.541508 0.350505 0.303494 0.58491 0.569627 0.569731 0.435154 0.496819 0.508473
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
451. 
patient tongue id: 03012018245910_4
label yaofang:
甘草 法半夏 茯苓 前胡 防风 薄荷 荆芥穗 白芷 北柴胡 香薷 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子 炒六神曲
0.315933 0.827198 0.365629 0.872945 0.513074 0.669993 0.345854 0.339666 0.817406 0.841697 0.805783 0.849599 0.355017 0.921525 0.405439 0.489191 0.550859 0.754529
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.444444, recall: 0.500000, error: 0.555556
452. 
patient tongue id: 05032225027079_1_6
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.347891 0.555959 0.389089 0.306658 0.477788 0.379853 0.658122 0.823697 0.3179
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.222222, recall: 0.200000, error: 0.777778
453. 
patient tongue id: 02122219175729_1_6
label yaofang:
甘草 荆芥 金银花 黄芪 白术 红花 天麻 白花蛇舌草 麦芽 苦参 白鲜皮 地肤子 蜈蚣 半枝莲 醋鳖甲
0.984866 0.541391 0.584616 0.336811 0.359185 0.318557 0.707295 0.665814 0.617362 0.515698 0.578979 0.5638
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
454. 
patient tongue id: 04130648139042_2_6
label yaofang:
甘草 白芍 川芎 龙骨 牡蛎 酸枣仁 地黄 地骨皮 菟丝子 益母草 蒺藜 首乌藤 合欢花 酒女贞子 墨旱莲
0.919556 0.496303 0.499569 0.381017 0.498817 0.44981 0.4657 0.339514 0.373004 0.36219
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.066667, error: 0.900000
455. 
patient tongue id: 04121948029325_1_4_2
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.877118 0.32572 0.93114 0.538123 0.714079 0.311983 0.305658 0.33983 0.874045 0.906285 0.865279 0.90438 0.31743 0.952569 0.429593 0.48681 0.540165 0.788663
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.866667, error: 0.277778
456. 
patient tongue id: 02131312386059_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.310444 0.332372 0.396565
predicted yaofang:
甘草 茯苓 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
457. 
patient tongue id: 05221919547156_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.313548 0.845588 0.385192 0.886246 0.520754 0.67224 0.331507 0.319103 0.332169 0.304486 0.825964 0.852287 0.812001 0.852414 0.333662 0.923081 0.401344 0.497908 0.54786 0.762505
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
458. 
patient tongue id: 03012006403838_4
label yaofang:
陈皮 法半夏 茯苓 党参 黄芪 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 炒六神曲 甘松
0.328676 0.774071 0.382308 0.830969 0.505346 0.632388 0.347222 0.317014 0.306279 0.35258 0.314937 0.768701 0.794702 0.760267 0.808395 0.356982 0.882161 0.405205 0.475957 0.530806 0.715972
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.238095, recall: 0.416667, error: 0.761905
459. 
patient tongue id: 03032020454767_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.321147 0.759276 0.400687 0.804149 0.482678 0.615794 0.348078 0.319966 0.304235 0.350207 0.318548 0.744448 0.762701 0.733333 0.776594 0.354653 0.85708 0.400783 0.466863 0.517058 0.69238
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
460. 
patient tongue id: 06132027237493_1_4_6
label yaofang:
陈皮 前胡 半夏 荆芥 浙贝母 僵蚕 百部 苦杏仁 紫苏子 蝉蜕 紫苏叶 人参叶 紫苑
0.575214 0.384133 0.323297 0.442929 0.488801 0.301815
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
461. 
patient tongue id: 05181820312126_3
label yaofang:
桔梗 半夏 荆芥 防风 牛蒡子 桑白皮 百部 苦杏仁 炙甘草 紫苑 芥子 青果 东风桔
0.515961 0.395473 0.320072 0.359375 0.407578
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
462. 
patient tongue id: 05022047456811_1_2
label yaofang:
甘草 枳壳 茯苓 木香 党参 白术 酸枣仁 柏子仁 黄连 厚朴 桑寄生 火麻仁 浮小麦 合欢花 牛大力
0.829734 0.458304 0.477185 0.398259 0.398058 0.356946
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
463. 
patient tongue id: 03151917074448_1_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.463939 0.361599 0.341505 0.366973 0.370378 0.320959
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
464. 
patient tongue id: 04061359408200_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.881243 0.336198 0.924173 0.539479 0.707009 0.329046 0.325757 0.870539 0.896744 0.857274 0.897911 0.322895 0.957426 0.39607 0.485544 0.553227 0.798277
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.588235, recall: 0.714286, error: 0.411765
465. 
patient tongue id: 06010208339212_6_4_7
label yaofang:
甘草 法半夏 茯苓 党参 白术 砂仁 天麻 鳖甲 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986692 0.548134 0.583441 0.345747 0.370724 0.33228 0.708648 0.687967 0.652566 0.555765 0.615864 0.626495
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
466. 
patient tongue id: 02122233360852_6_1
label yaofang:
甘草 党参 丹参 知母 地黄 天麻 莪术 白花蛇舌草 浮小麦 首乌藤 蜈蚣 合欢花 半枝莲 醋鳖甲
0.911857 0.481337 0.513388 0.350354 0.518534 0.383246 0.412562 0.31293
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
467. 
patient tongue id: 04112212203016_4_1
label yaofang:
甘草 柴胡 白芍 陈皮 枳壳 法半夏 茯苓 前胡 薏苡仁 党参 川楝子 乌药 山药 佛手
0.947736 0.498487 0.51959 0.358425 0.530989 0.442544 0.469531 0.307025 0.351406 0.339567
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
468. 
patient tongue id: 04201426514805_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.372431 0.434765 0.38361 0.529865 0.431954 0.31574 0.415236 0.34689 0.390926 0.339299 0.398715 0.398263 0.401113 0.36952
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.214286, recall: 0.230769, error: 0.785714
469. 
patient tongue id: 06141844357697_6_2
label yaofang:
半夏 麦冬 黄芪 白术 浙贝母 杜仲 郁金 厚朴 僵蚕 桑寄生 莪术 柿蒂 北沙参 苦杏仁 辛夷 蜈蚣 合欢皮 预知子 岗梅
0.729736 0.465193 0.367663 0.36699
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.052632, error: 0.750000
470. 
patient tongue id: 04271902046548_2
label yaofang:
茯苓 桔梗 防风 玉竹 太子参 黄芪 枸杞子 山药 细辛 白芷 芡实 北沙参 辛夷 炒苍耳子 人参叶
0.301403 0.859721 0.34194 0.911464 0.535115 0.698562 0.325096 0.330354 0.853348 0.881677 0.841891 0.886578 0.329579 0.946214 0.411084 0.488719 0.550297 0.786004
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.333333, recall: 0.400000, error: 0.666667
471. 
patient tongue id: 04131750454167_1_6_4
label yaofang:
龙齿 黄芪 白术 海螵蛸 砂仁 桑寄生 鸡内金 北沙参 橘络 桑椹 首乌藤 红豆杉 合欢皮 稻芽
0.647842 0.420245 0.367858 0.376938 0.431828
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
472. 
patient tongue id: 03291619029462_6_4
label yaofang:
甘草 独活 薏苡仁 酸枣仁 杜仲 天麻 菟丝子 秦艽 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.807553 0.438062 0.463314 0.355946 0.437238 0.337469 0.300606
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
473. 
patient tongue id: 04131400541791_6_2
label yaofang:
甘草 茯苓 党参 酸枣仁 丹参 生地黄 牡丹皮 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.950465 0.512691 0.51492 0.383177 0.311654 0.537275 0.51079 0.523079 0.381311 0.420882 0.401365
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
474. 
patient tongue id: 03170931326875_1_2_7
label yaofang:
甘草 枳壳 木香 太子参 丹参 黄连 海螵蛸 厚朴 鸡内金 草豆蔻 六神曲 五指毛桃
0.414897 0.377996 0.309208 0.40168 0.335852
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
475. 
patient tongue id: 05152113420975_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.341578 0.321852 0.34842 0.485176
predicted yaofang:
白芍 白术 海螵蛸 炙甘草

------Score: precision: 0.500000, recall: 0.133333, error: 0.500000
476. 
patient tongue id: 05092058325703_2_4
label yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.311554 0.758203 0.390292 0.788364 0.472882 0.611677 0.347144 0.322327 0.733505 0.74906 0.72366 0.772392 0.356767 0.868311 0.370546 0.458526 0.516334 0.693632
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
477. 
patient tongue id: 04061953289469_1_3
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.379339 0.394227 0.3304 0.388261 0.31738 0.343516
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 钩藤

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
478. 
patient tongue id: 06190157216929_2_4
label yaofang:
甘草 法半夏 茯苓 桔梗 橘红 芦根 太子参 浙贝母 鳖甲 紫菀 苦杏仁 百合 白花蛇舌 蜂房 四季青
0.91589 0.499463 0.443125 0.302516 0.392072 0.364056 0.340703
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
479. 
patient tongue id: 04202043006693_6_1
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 蝉蜕 炙甘草 百合 紫苏叶
0.388166 0.553391 0.434175 0.323119 0.467985 0.332093 0.649253 0.734234
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.066667, error: 0.875000
480. 
patient tongue id: 01110253175513_2_5
label yaofang:
桂枝 白芍 大枣 黄芪 炙甘草 土鳖虫 乌梢蛇
0.503111 0.374216 0.358391 0.336778 0.340499
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
481. 
patient tongue id: 05182043239826_4
label yaofang:
麻黄 桂枝 白芍 法半夏 牛蒡子 五味子 浙贝母 细辛 干姜 款冬花 射干 紫菀 炙甘草
0.375421 0.552553 0.402487 0.456903 0.383466 0.667551 0.805089 0.315676
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
482. 
patient tongue id: 03211954556641_4_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 白芷 蔓荆子 豆蔻 姜半夏 炙甘草 紫苏梗
0.328393 0.441045 0.315818 0.322373 0.347217 0.404252 0.427904 0.542129
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.750000, recall: 0.500000, error: 0.250000
483. 
patient tongue id: 04061344130144_4_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 薏苡仁 党参 白术 天麻 败酱草 蜈蚣 半枝莲 醋鳖甲 淡附片
0.83053 0.452663 0.491468 0.386024 0.422371
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 1.000000, recall: 0.357143, error: 0.000000
484. 
patient tongue id: 06182202482525_5_6
label yaofang:
党参 黄芪 枸杞子 熟地黄 杜仲 乌药 山茱萸 菟丝子 巴戟天 益智仁 芡实 金樱子 覆盆子 酒女贞子
0.789892 0.443661 0.437106 0.335177 0.336259
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
485. 
patient tongue id: 04182023122058_1_2
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.339515 0.487599 0.343288 0.312766 0.425021 0.31237 0.536162 0.664806
predicted yaofang:
柴胡 白芍 香附 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
486. 
patient tongue id: 05222229321601_1_4
label yaofang:
川芎 当归 防风 党参 太子参 黄芪 枸杞子 芡实 豆蔻 北沙参 山萸肉 续断 麸炒白术 盐菟丝子
0.906972 0.35225 0.940497 0.548565 0.72441 0.315746 0.309654 0.894245 0.915182 0.874682 0.912273 0.312996 0.962094 0.397234 0.491307 0.556844 0.8167
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.176471, recall: 0.214286, error: 0.823529
487. 
patient tongue id: 01250648304335_1_2
label yaofang:
甘草 茯苓 生地黄 牡丹皮 杜仲 乌药 郁金 山药 山茱萸 泽泻 桑寄生 桑螵蛸 益智 鹿角霜 佛手
0.878187 0.480536 0.469521 0.366886 0.407362 0.360612
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
488. 
patient tongue id: 05131648300090_2_6
label yaofang:
甘草 党参 杜仲 山药 天麻 桑寄生 鳖甲 麦芽 白扁豆 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.975904 0.527698 0.577504 0.37667 0.373225 0.347698 0.678056 0.636401 0.61748 0.507814 0.569117 0.561222
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
489. 
patient tongue id: 03141544521724_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.376176 0.499522 0.419013 0.450416 0.521976 0.441669 0.459684 0.485024 0.503188 0.469531 0.55064 0.39758 0.53988 0.547707 0.550187
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
490. 
patient tongue id: 04211341312324_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.318364 0.783246 0.357225 0.862787 0.516012 0.649072 0.338046 0.309026 0.362292 0.312523 0.78671 0.823435 0.783093 0.834583 0.344164 0.892608 0.430832 0.467367 0.506972 0.719266
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.750000, error: 0.400000
491. 
patient tongue id: 05242110430794_6_2_1
label yaofang:
甘草 桔梗 薏苡仁 浙贝母 桑白皮 天麻 鳖甲 款冬花 紫菀 百合 蜈蚣 白花蛇舌 天山雪莲 合欢花
0.979792 0.548244 0.568976 0.313487 0.3291 0.67164 0.598292 0.538484 0.444712 0.496549 0.476663
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
492. 
patient tongue id: 03020733570220_6_1
label yaofang:
甘草 法半夏 茯苓 酸枣仁 山药 天麻 鳖甲 桑螵蛸 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲
0.941711 0.49292 0.540849 0.386371 0.318035 0.306631 0.579738 0.444735 0.477503 0.309905 0.357535 0.342995
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.692308, error: 0.250000
493. 
patient tongue id: 01042332284833_7_6
label yaofang:
甘草 羌活 远志 党参 鸡血藤 白术 地黄 天麻 白花蛇舌草 威灵仙 蜈蚣 半枝莲 醋鳖甲 乌梢蛇
0.967432 0.514059 0.54368 0.359235 0.312167 0.302943 0.597472 0.53511 0.544311 0.39483 0.448135 0.439755
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
494. 
patient tongue id: 05290802387660_2_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 桑白皮 厚朴 款冬花 地龙 苦杏仁 紫苏子 炙麻黄
0.932002 0.512203 0.524315 0.351788 0.318423 0.306411 0.575614 0.483025 0.450495 0.355548 0.394063 0.367812
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
495. 
patient tongue id: 06190156289663_2_6
label yaofang:
甘草 前胡 羌活 薏苡仁 党参 天麻 白芷 鳖甲 紫菀 苦杏仁 粉葛 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.892037 0.48816 0.495883 0.35949 0.476013 0.368282 0.391804
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
496. 
patient tongue id: 04130633573998_7_6
label yaofang:
甘草 白芍 茯苓 桃仁 党参 酸枣仁 黄连 生地黄 杜仲 山茱萸 桑寄生 火麻仁 补骨脂 合欢花 牛大力
0.844532 0.436213 0.479928 0.397185 0.388322 0.354861
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
497. 
patient tongue id: 06190117161640_1_7
label yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 山药 桑寄生 芡实 白花蛇舌草 玉米须 广金钱草
0.737336 0.447509 0.423854 0.372444 0.427216
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 1.000000, recall: 0.416667, error: 0.000000
498. 
patient tongue id: 05140824141986_6_4_2
label yaofang:
甘草 黄芩 茯苓 桔梗 党参 太子参 酸枣仁 浙贝母 鳖甲 麦芽 北沙参 首乌藤 白花蛇舌 蜂房 岗梅根 四季青
0.842535 0.309265 0.438525 0.460782 0.352721 0.367412 0.317683
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.187500, error: 0.571429
499. 
patient tongue id: 05260706113577_1_4
label yaofang:
甘草 白芍 薏苡仁 蒲公英 党参 白术 熟附子 山药 砂仁 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲
0.899342 0.470847 0.464454 0.43702 0.391098 0.387261 0.489333 0.304193 0.32649
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.888889, recall: 0.571429, error: 0.111111
------Average Score: average precision: 0.458668, average recall: 0.335380, error: 0.541332