8512/8539 [============================>.] - ETA: 0s - loss: 0.1609Epoch 00000: val_loss improved from inf to 0.09435, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 69s - loss: 0.1607 - val_loss: 0.0944
Epoch 2/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0980Epoch 00001: val_loss improved from 0.09435 to 0.08182, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0980 - val_loss: 0.0818
Epoch 3/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0913Epoch 00002: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0912 - val_loss: 0.0834
Epoch 4/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0879Epoch 00003: val_loss improved from 0.08182 to 0.08022, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0879 - val_loss: 0.0802
Epoch 5/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0860Epoch 00004: val_loss improved from 0.08022 to 0.07730, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0859 - val_loss: 0.0773
Epoch 6/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0845Epoch 00005: val_loss improved from 0.07730 to 0.07668, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0845 - val_loss: 0.0767
Epoch 7/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0832Epoch 00006: val_loss improved from 0.07668 to 0.07613, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0833 - val_loss: 0.0761
Epoch 8/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0821Epoch 00007: val_loss improved from 0.07613 to 0.07562, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0821 - val_loss: 0.0756
Epoch 9/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0813Epoch 00008: val_loss improved from 0.07562 to 0.07464, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0813 - val_loss: 0.0746
Epoch 10/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0809Epoch 00009: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0809 - val_loss: 0.0749
Epoch 11/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0803Epoch 00010: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0803 - val_loss: 0.0749
Epoch 12/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0798Epoch 00011: val_loss improved from 0.07464 to 0.07362, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0798 - val_loss: 0.0736
Epoch 13/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0792Epoch 00012: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0793 - val_loss: 0.0743
Epoch 14/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0787Epoch 00013: val_loss improved from 0.07362 to 0.07358, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0787 - val_loss: 0.0736
Epoch 15/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0784Epoch 00014: val_loss improved from 0.07358 to 0.07355, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0784 - val_loss: 0.0735
Epoch 16/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0778Epoch 00015: val_loss improved from 0.07355 to 0.07340, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0778 - val_loss: 0.0734
Epoch 17/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0773Epoch 00016: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0773 - val_loss: 0.0736
Epoch 18/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0771Epoch 00017: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0771 - val_loss: 0.0735
Epoch 19/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0767Epoch 00018: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0767 - val_loss: 0.0735
Epoch 20/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0764Epoch 00019: val_loss improved from 0.07340 to 0.07290, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0764 - val_loss: 0.0729
Epoch 21/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0759Epoch 00020: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0760 - val_loss: 0.0732
Epoch 22/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0757Epoch 00021: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0757 - val_loss: 0.0736
Epoch 23/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0752Epoch 00022: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0752 - val_loss: 0.0745
Epoch 24/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0751Epoch 00023: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0751 - val_loss: 0.0736
Epoch 25/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0749Epoch 00024: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0749 - val_loss: 0.0731
Epoch 26/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0744Epoch 00025: val_loss improved from 0.07290 to 0.07266, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0744 - val_loss: 0.0727
Epoch 27/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0741Epoch 00026: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0741 - val_loss: 0.0730
Epoch 28/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0740Epoch 00027: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0740 - val_loss: 0.0734
Epoch 29/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0739Epoch 00028: val_loss improved from 0.07266 to 0.07230, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0739 - val_loss: 0.0723
Epoch 30/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0736Epoch 00029: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0736 - val_loss: 0.0729
Epoch 31/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0732Epoch 00030: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0732 - val_loss: 0.0727
Epoch 32/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0729Epoch 00031: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0729 - val_loss: 0.0725
Epoch 33/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0728Epoch 00032: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0728 - val_loss: 0.0725
Epoch 34/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0724Epoch 00033: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0724 - val_loss: 0.0726
Epoch 35/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0721Epoch 00034: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0721 - val_loss: 0.0730
Epoch 36/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0718Epoch 00035: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0718 - val_loss: 0.0730
Epoch 37/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0717Epoch 00036: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0717 - val_loss: 0.0729
Epoch 38/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0713Epoch 00037: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0713 - val_loss: 0.0735
Epoch 39/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0710Epoch 00038: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0710 - val_loss: 0.0727
Epoch 40/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0710Epoch 00039: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0710 - val_loss: 0.0729
Epoch 41/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0707Epoch 00040: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0707 - val_loss: 0.0731
Epoch 42/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0705Epoch 00041: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0705 - val_loss: 0.0728
Epoch 43/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0704Epoch 00042: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0704 - val_loss: 0.0728
Epoch 44/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0701Epoch 00043: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0701 - val_loss: 0.0734
Epoch 45/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0699Epoch 00044: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0699 - val_loss: 0.0732
Epoch 46/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0695Epoch 00045: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0695 - val_loss: 0.0733
Epoch 47/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0696Epoch 00046: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0695 - val_loss: 0.0736
Epoch 48/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0692Epoch 00047: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0692 - val_loss: 0.0738
Epoch 49/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0690Epoch 00048: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0690 - val_loss: 0.0742
Epoch 50/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0685Epoch 00049: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0685 - val_loss: 0.0737
Epoch 51/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0681Epoch 00050: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0681 - val_loss: 0.0736
Epoch 52/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0682Epoch 00051: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0682 - val_loss: 0.0738
Epoch 53/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0679Epoch 00052: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0679 - val_loss: 0.0744
Epoch 54/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0677Epoch 00053: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0677 - val_loss: 0.0749
Epoch 55/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0676Epoch 00054: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0676 - val_loss: 0.0740
Epoch 56/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0673Epoch 00055: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0673 - val_loss: 0.0746
Epoch 57/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0670Epoch 00056: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0670 - val_loss: 0.0748
Epoch 58/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0667Epoch 00057: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0667 - val_loss: 0.0754
Epoch 59/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0665Epoch 00058: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0665 - val_loss: 0.0746
Epoch 60/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0661Epoch 00059: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0661 - val_loss: 0.0751
Epoch 61/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0659Epoch 00060: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0659 - val_loss: 0.0747
Epoch 62/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0657Epoch 00061: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0657 - val_loss: 0.0754
Epoch 63/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0654Epoch 00062: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0653 - val_loss: 0.0751
Epoch 64/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0653Epoch 00063: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0653 - val_loss: 0.0755
Epoch 65/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0649Epoch 00064: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0649 - val_loss: 0.0749
Epoch 66/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0650Epoch 00065: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0650 - val_loss: 0.0754
Epoch 67/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0645Epoch 00066: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0644 - val_loss: 0.0756
Epoch 68/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0642Epoch 00067: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0642 - val_loss: 0.0758
Epoch 69/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0640Epoch 00068: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0640 - val_loss: 0.0754
Epoch 70/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0637Epoch 00069: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0637 - val_loss: 0.0758
Epoch 71/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0634Epoch 00070: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0634 - val_loss: 0.0758
Epoch 72/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0632Epoch 00071: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0632 - val_loss: 0.0759
Epoch 73/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0631Epoch 00072: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0631 - val_loss: 0.0758
Epoch 74/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0626Epoch 00073: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0626 - val_loss: 0.0765
Epoch 75/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0626Epoch 00074: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0626 - val_loss: 0.0765
Epoch 76/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0624Epoch 00075: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0624 - val_loss: 0.0762
Epoch 77/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0621Epoch 00076: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0621 - val_loss: 0.0764
Epoch 78/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0618Epoch 00077: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0618 - val_loss: 0.0764
Epoch 79/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0617Epoch 00078: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0617 - val_loss: 0.0764
Epoch 80/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0614Epoch 00079: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0614 - val_loss: 0.0760
history: [(0.16068435246296098, None, 0.094354435255675967, None), (0.09798155942961656, None, 0.081818119783104562, None), (0.09124972083792221, None, 0.083379324430074453, None), (0.087930504780161053, None, 0.080222461659174696, None), (0.085934501754265924, None, 0.077304673909922655, None), (0.084509736226919818, None, 0.076680693079482068, None), (0.083263458622354916, None, 0.076130906440617832, None), (0.082094892003501604, None, 0.075621309843692155, None), (0.081342106039147974, None, 0.074642466374369332, None), (0.080910848126658261, None, 0.074857738292042592, None), (0.080344238180315095, None, 0.074859670885316615, None), (0.079786829256888556, None, 0.073615528725005763, None), (0.079255615709285604, None, 0.074312693988665551, None), (0.078704362200942388, None, 0.07358094539506968, None), (0.078381420428676948, None, 0.0735489152945005, None), (0.077835938496582116, None, 0.07340293145660079, None), (0.077278030836228986, None, 0.073640256137638305, None), (0.077119933864679163, None, 0.073539501444979033, None), (0.076680807920945226, None, 0.073511906213812775, None), (0.076364592333730094, None, 0.072901253817063985, None), (0.075956489225505505, None, 0.073227773164654827, None), (0.075681198915785799, None, 0.073633454166925877, None), (0.075247679509083773, None, 0.074473327387383575, None), (0.075094331761324545, None, 0.073568366549827235, None), (0.074890838033115151, None, 0.073133641328567117, None), (0.074409933357868954, None, 0.072656424245336554, None), (0.074101191158456065, None, 0.073009296760454284, None), (0.073989702460846532, None, 0.073364842642139605, None), (0.073930406110782873, None, 0.072304441760747865, None), (0.073609803844383329, None, 0.072879096854737396, None), (0.073171188962139866, None, 0.072677421427908395, None), (0.072943992695507984, None, 0.072461734870414587, None), (0.07284634466200024, None, 0.072531918684641525, None), (0.072412272673333639, None, 0.072603345190212401, None), (0.072131640018114562, None, 0.073006171637620687, None), (0.07184259982288603, None, 0.073002432974485248, None), (0.071696791129077897, None, 0.072910756200224483, None), (0.071332172239911493, None, 0.073548958524242869, None), (0.070984818760293861, None, 0.072672003191032689, None), (0.071034172476768936, None, 0.072888063423799512, None), (0.070744869534926605, None, 0.073125075944614065, None), (0.070519487307981632, None, 0.072801000960580592, None), (0.070353403314904459, None, 0.072805403052887199, None), (0.070073772013703947, None, 0.073443025787234745, None), (0.069924732357602104, None, 0.073195085884668887, None), (0.06951740431218785, None, 0.073268719645210242, None), (0.069544161077349287, None, 0.073615097682991307, None), (0.069183227792076848, None, 0.073752520448995593, None), (0.068958842749303306, None, 0.074155031979739008, None), (0.068527619505266438, None, 0.073713548399589879, None), (0.06814382201280314, None, 0.073643838202123682, None), (0.068233924881121163, None, 0.073849858654724376, None), (0.067923351858801106, None, 0.074397328790727552, None), (0.067700706409240918, None, 0.074868782235807549, None), (0.067578521065151317, None, 0.073975123055688624, None), (0.067284502689328007, None, 0.074632484998021803, None), (0.066953710048591547, None, 0.074764916448147742, None), (0.066713832911234408, None, 0.075360622816470074, None), (0.066469932408002794, None, 0.074642294874558077, None), (0.066149478680300952, None, 0.075097200088885235, None), (0.065886193143217156, None, 0.074671069289738448, None), (0.06570273018838553, None, 0.075383121304677961, None), (0.06534748435428793, None, 0.075146649947096578, None), (0.065253419563172502, None, 0.075485859352808729, None), (0.064918409861534368, None, 0.074931633941856493, None), (0.064990227019176755, None, 0.075418504357556287, None), (0.064447546746206161, None, 0.075571218689719402, None), (0.064172958230746133, None, 0.075805235531303902, None), (0.063952022830347413, None, 0.075441569690302621, None), (0.063672815758522475, None, 0.075779647863173219, None), (0.063406963864196753, None, 0.075823970739439736, None), (0.063246227199669144, None, 0.07589304299799951, None), (0.063055332298108627, None, 0.075796266451423427, None), (0.062594919054845211, None, 0.076509951344339841, None), (0.062560825882974055, None, 0.076501196120684831, None), (0.062425994160796153, None, 0.076242774206421754, None), (0.062078082691675217, None, 0.076364685464036339, None), (0.061816621679537387, None, 0.076413714187049162, None), (0.061684294861490185, None, 0.076367254877265117, None), (0.061442864855697082, None, 0.075979160547474806, None)]
0. 
patient tongue id: 05242132105103_2_4
label yaofang:
甘草 茯苓 前胡 桔梗 芦根 桃仁 远志 太子参 浙贝母 细辛 白前 诃子 紫苏子
0.952951 0.307466 0.472093 0.556732 0.368919 0.328479 0.527622 0.528042 0.470476 0.423053 0.427528 0.404073
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
1. 
patient tongue id: 03230716219670_1_2_6
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 郁金 天麻 鳖甲 莪术 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.977456 0.474191 0.598675 0.333099 0.312094 0.302086 0.343673 0.593325 0.569058 0.491781 0.448673 0.465297 0.444504
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
2. 
patient tongue id: 04241935110955_4
label yaofang:
陈皮 茯苓 桔梗 薏苡仁 党参 白术 黄柏 牛膝 苍术 山药 砂仁 桑寄生 白扁豆 续断
0.884286 0.315419 0.449288 0.506769 0.371545 0.301828 0.412563 0.386267 0.365672
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
3. 
patient tongue id: 03221303504034_6_4_2
label yaofang:
甘草 党参 玄参 浙贝母 郁金 天麻 鳖甲 莪术 夏枯草 麦芽 百合 蜈蚣 白花蛇舌 红豆杉 猫爪草
0.908775 0.323072 0.45062 0.518909 0.349653 0.45889 0.42569 0.386634 0.312862 0.317861
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.600000, recall: 0.400000, error: 0.400000
4. 
patient tongue id: 04282206071724_2_6
label yaofang:
甘草 薏苡仁 太子参 白术 生地黄 山药 天麻 巴戟天 鳖甲 补骨脂 莪术 续断 蜈蚣 天山雪莲 半枝莲
0.915628 0.451846 0.520301 0.348 0.46054 0.394194 0.357232
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.333333, error: 0.285714
5. 
patient tongue id: 05131655022872_6_1
label yaofang:
甘草 川芎 法半夏 羌活 党参 牛膝 细辛 天麻 僵蚕 白芷 鳖甲 蜈蚣 白花蛇舌 天山雪莲 猫爪草
0.83195 0.370969 0.459939 0.329733 0.311364
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
6. 
patient tongue id: 02191217103571_6_1
label yaofang:
柴胡 白芍 法半夏 茯苓 木香 党参 白术 黄连 山药 砂仁 鸡内金 白扁豆 紫苏梗
0.921161 0.334847 0.414912 0.52719 0.339823 0.466286 0.390878 0.390574 0.303205 0.33332
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
7. 
patient tongue id: 05172130278123_5
label yaofang:
甘草 黄芩 前胡 桔梗 薄荷 鱼腥草 浙贝母 细辛 桑白皮 款冬花 紫菀 诃子 苇茎 苦杏仁 瓜蒌子 木蝴蝶
0.981059 0.466317 0.58382 0.399072 0.343652 0.349679 0.634892 0.603858 0.605734 0.502033 0.53495 0.603797
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.062500, error: 0.916667
8. 
patient tongue id: 04102050063168_4_3
label yaofang:
桂枝 陈皮 茯苓 半夏 芦根 薏苡仁 白术 酸枣仁 厚朴 佩兰 砂仁 煅牡蛎 珍珠母 广藿香 土茯苓 煅龙骨 木棉花
0.624876 0.33489 0.458399 0.328721 0.311307 0.322151 0.313865
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 天麻

------Score: precision: 0.285714, recall: 0.117647, error: 0.714286
9. 
patient tongue id: 06140838565102_1_3_7
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 芡实 浮小麦 首乌藤 百合 制远志 石榴皮
0.47905 0.34829 0.383646 0.36153
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 1.000000, recall: 0.307692, error: 0.000000
10. 
patient tongue id: 05032246351434_2_7_4
label yaofang:
甘草 黄芪 丹参 生地黄 山药 山茱萸 泽泻 车前子 天麻 鳖甲 皂角刺 鹿角霜 蜈蚣 天山雪莲 半枝莲
0.978218 0.458192 0.592352 0.366201 0.336975 0.348906 0.633793 0.555791 0.566142 0.446461 0.489849 0.565103
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
11. 
patient tongue id: 01211321219422_4_3_6
label yaofang:
陈皮 大枣 茯苓 桔梗 薏苡仁 太子参 白术 山药 砂仁 白扁豆 炙甘草
0.421892 0.382634 0.357436 0.321119 0.328455
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
12. 
patient tongue id: 05092052429433_1_4
label yaofang:
甘草 白芍 川芎 独活 鸡血藤 牛膝 细辛 干姜 威灵仙 蜈蚣 姜黄 海桐皮 鹿衔草
0.41018 0.518915 0.413454 0.312141 0.371425 0.321895 0.582169 0.649947 0.315179
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.222222, recall: 0.153846, error: 0.777778
13. 
patient tongue id: 03232316368104_4
label yaofang:
甘草 白芍 法半夏 茯苓 薏苡仁 党参 赤芍 厚朴 滑石 补骨脂 豆蔻 苦杏仁 宽筋藤 路路通
0.929188 0.309001 0.429613 0.52866 0.37042 0.467807 0.426878 0.414367 0.303794 0.329184 0.330487
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
14. 
patient tongue id: 03301354502104_4
label yaofang:
麻黄 法半夏 前胡 桔梗 防风 薄荷 白芷 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗
0.42354 0.636994 0.40617 0.830066 0.463496 0.51545 0.30178 0.332681 0.367004 0.347806 0.715263 0.773899 0.741975 0.776738 0.345986 0.906991 0.339868 0.50477 0.468928 0.657063
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.733333, error: 0.450000
15. 
patient tongue id: 05102200510046_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.449716 0.614089 0.434628 0.79815 0.45733 0.495946 0.355026 0.358734 0.40116 0.358611 0.686724 0.748105 0.722763 0.750642 0.412058 0.879899 0.35286 0.307215 0.502776 0.48728 0.653385
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
16. 
patient tongue id: 03021840477706_4
label yaofang:
麻黄 柴胡 前胡 桔梗 半夏 防风 荆芥穗 款冬花 紫菀 白前 百部 紫苏子 炙甘草 广藿香
0.433487 0.774384 0.400427 0.94282 0.538277 0.636345 0.3669 0.398994 0.413487 0.858055 0.898091 0.863111 0.89855 0.310731 0.968961 0.389383 0.614018 0.518002 0.747809
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.642857, error: 0.526316
17. 
patient tongue id: 01132125433209_6_4
label yaofang:
甘草 枳壳 蒲公英 白及 党参 白术 槟榔 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.972255 0.450728 0.555865 0.378253 0.32244 0.512868 0.467973 0.476803 0.353854 0.367031 0.386255
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
18. 
patient tongue id: 05230830340455_1_4_7
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.447009 0.479879 0.346319 0.439086 0.533816 0.531825 0.463279 0.472555 0.398837 0.423419 0.452352 0.471837 0.485592 0.513555 0.502299
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.266667, recall: 0.333333, error: 0.733333
19. 
patient tongue id: 04260737028094_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.388548 0.448761 0.330372 0.402474 0.474781 0.520289 0.434771 0.448564 0.438768 0.400115 0.421104 0.425045 0.436081 0.482555 0.486547
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.266667, recall: 0.307692, error: 0.733333
20. 
patient tongue id: 03021948296585_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.431908 0.705939 0.410263 0.890597 0.499204 0.563112 0.324672 0.355987 0.412109 0.394095 0.777527 0.847196 0.806037 0.83206 0.357831 0.948702 0.358941 0.300106 0.565314 0.498861 0.707383
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
21. 
patient tongue id: 02211951264696_6_4
label yaofang:
柴胡 白芍 法半夏 大枣 茯苓 龙骨 牡蛎 党参 栀子 牡丹皮 石菖蒲 大黄 淫羊藿 豆蔻 炙甘草 浮小麦
0.970218 0.301121 0.480345 0.578134 0.338797 0.306588 0.352151 0.554811 0.54021 0.463657 0.437204 0.436792 0.410499
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.187500, error: 0.769231
22. 
patient tongue id: 06191336334153_1_6
label yaofang:
甘草 川芎 茯苓 羌活 独活 党参 鸡血藤 白术 生地黄 红花 延胡索 赤芍 忍冬藤 威灵仙 牛大力 千斤拔
0.985657 0.485866 0.613665 0.31946 0.322938 0.304866 0.348319 0.620126 0.599676 0.508023 0.47961 0.484426 0.461046
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
23. 
patient tongue id: 03282216419969_6_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 砂仁 天麻 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.980485 0.303234 0.468989 0.59026 0.338253 0.305095 0.325135 0.583197 0.584676 0.509833 0.461386 0.471023 0.457385
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
24. 
patient tongue id: 05131448353962_2_1_6
label yaofang:
甘草 枳壳 薏苡仁 太子参 丹参 山茱萸 薤白 瓜蒌皮 鳖甲 莪术 降香 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.83131 0.375948 0.489679 0.367246 0.357797
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
25. 
patient tongue id: 05180840552358_6
label yaofang:
甘草 柴胡 白芍 羌活 独活 党参 酸枣仁 延胡索 赤芍 牡丹皮 细辛 天麻 全蝎 白芷 威灵仙 合欢花
0.967498 0.477437 0.584458 0.343483 0.32856 0.301785 0.359473 0.573109 0.555909 0.481981 0.451113 0.455013 0.435465
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.250000, error: 0.692308
26. 
patient tongue id: 02190548364354_4
label yaofang:
甘草 黄芩 法半夏 前胡 桃仁 远志 桑白皮 苏子 款冬花 紫菀 地龙 苦杏仁 蜜麻黄
0.908898 0.307901 0.431545 0.527323 0.394728 0.321045 0.48252 0.444059 0.435766 0.33573 0.358 0.380311
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.076923, error: 0.916667
27. 
patient tongue id: 03020821206680_1_5_6
label yaofang:
甘草 柴胡 白芍 枳壳 薏苡仁 党参 牡丹皮 郁金 山药 砂仁 鳖甲 白花蛇舌草 麦芽 天山雪莲
0.934274 0.407389 0.519081 0.435883 0.416818 0.304312 0.394431
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
28. 
patient tongue id: 01201943127971_6_2
label yaofang:
甘草 柴胡 白芍 酸枣仁 牡丹皮 白茅根 地黄 天麻 补骨脂 白花蛇舌草 蜈蚣 合欢花 半枝莲 醋鳖甲
0.974624 0.487369 0.579575 0.371869 0.3043 0.342939 0.563688 0.576299 0.510786 0.46234 0.467171 0.452528
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
29. 
patient tongue id: 04202032314874_1_7_4
label yaofang:
柴胡 白芍 陈皮 当归 党参 黄芪 白术 牛膝 车前子 升麻 炙甘草
0.362551 0.361897 0.323714 0.388649 0.302948 0.327771
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.666667, recall: 0.363636, error: 0.333333
30. 
patient tongue id: 06071922405605_6_7
label yaofang:
甘草 黄芩 半夏 枸杞子 生地黄 红花 赤芍 海螵蛸 牡丹皮 杜仲 莪术 续断 赭石
0.875429 0.45368 0.50705 0.430669 0.327579 0.382981 0.314787 0.36987
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
31. 
patient tongue id: 02141937483142_1_4
label yaofang:
香附 枳壳 法半夏 党参 延胡索 海螵蛸 北柴胡 麦芽 炙甘草 紫苏梗 广藿香
0.897005 0.451168 0.518056 0.344115 0.425895 0.349043 0.343663
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
32. 
patient tongue id: 01041842548170_1_2
label yaofang:
白芍 川芎 当归 党参 太子参 枸杞子 熟地黄 山萸肉 炙甘草 续断 沙苑子 炙黄芪 盐菟丝子 酒女贞子 盐杜仲 盐巴戟天
0.370602 0.43464 0.428756 0.416983 0.333509 0.319923 0.365999 0.367633 0.353005 0.320988 0.310859 0.457061
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.083333, recall: 0.062500, error: 0.916667
33. 
patient tongue id: 04012004092485_2_5
label yaofang:
桔梗 荆芥 防风 牛蒡子 薏苡仁 酸枣仁 乳香 没药 苦杏仁 炙甘草 浮小麦 木棉花 东风桔 咸竹蜂
0.427113 0.583359 0.435415 0.73092 0.446298 0.482037 0.346036 0.355227 0.395098 0.361715 0.620624 0.683147 0.667461 0.667413 0.381071 0.835446 0.345327 0.310452 0.478786 0.466617 0.601745
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.142857, recall: 0.214286, error: 0.857143
34. 
patient tongue id: 02231847526655_2
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 麦冬 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.379214 0.611586 0.404071 0.783331 0.454577 0.555843 0.308185 0.35271 0.395138 0.300294 0.385343 0.650362 0.733475 0.697554 0.72998 0.359229 0.875728 0.366245 0.521516 0.483674 0.625386
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
35. 
patient tongue id: 04281837048971_5
label yaofang:
甘草 桔梗 荆芥 芦根 薏苡仁 鱼腥草 白茅根 桑白皮 莱菔子 白芷 瓜蒌皮 紫菀 白前 百部 苦杏仁 紫苏子 辛夷 蜜麻黄 炒苍耳子
0.693486 0.393964 0.308271 0.418153 0.324475
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.052632, error: 0.800000
36. 
patient tongue id: 01182111404656_6_7
label yaofang:
甘草 桃仁 太子参 黄芪 白术 酸枣仁 海螵蛸 厚朴 当归尾 橘核 首乌藤 土鳖虫 红豆杉 合欢皮
0.450358 0.372965 0.330518 0.356953 0.352523
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
37. 
patient tongue id: 01312255123191_1_7
label yaofang:
甘草 羌活 独活 党参 白术 红花 地黄 天麻 白花蛇舌草 桑枝 威灵仙 蜈蚣 半枝莲 醋鳖甲
0.939547 0.459795 0.556084 0.370619 0.320477 0.493852 0.471122 0.420115 0.354598 0.365397 0.335787
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
38. 
patient tongue id: 03261611575991_6
label yaofang:
甘草 柴胡 白芍 川芎 香附 远志 枳实 泽泻 升麻 首乌藤 合欢皮
0.393261 0.303265 0.314604 0.392226 0.319561 0.301377 0.309452
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 车前子 炙甘草

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
39. 
patient tongue id: 04200628534554_6_2_5
label yaofang:
甘草 白芍 枳壳 茯苓 龙骨 党参 丹参 黄连 胆南星 牡丹皮 郁金 薤白 瓜蒌皮 麦芽
0.984151 0.492462 0.608048 0.324706 0.318628 0.301368 0.349082 0.604868 0.594079 0.508488 0.483806 0.482269 0.463566
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
40. 
patient tongue id: 03141954364482_6_1
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.436356 0.535882 0.452938 0.344038 0.309322 0.305312 0.384713 0.348962 0.305383 0.601129 0.630902 0.340147
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 豆蔻 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.750000, recall: 0.818182, error: 0.250000
41. 
patient tongue id: 03021302058625_1_4
label yaofang:
麻黄 甘草 法半夏 葛根 前胡 桔梗 防风 薄荷 荆芥穗 香薷 辛夷 紫苏梗 广藿香 炒苍耳子
0.35593 0.696007 0.439741 0.867273 0.458147 0.467652 0.304325 0.333587 0.733717 0.782863 0.760587 0.748058 0.915584 0.512414 0.436128 0.647454
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.312500, recall: 0.357143, error: 0.687500
42. 
patient tongue id: 04181952445996_5_1_6
label yaofang:
甘草 白芍 川芎 羌活 独活 金银花 薏苡仁 党参 白术 牛膝 桑寄生 补骨脂 忍冬藤 威灵仙 白花蛇舌 天山雪莲
0.970594 0.47036 0.594788 0.340918 0.303627 0.339657 0.559488 0.539364 0.462355 0.420259 0.430422 0.414909
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
43. 
patient tongue id: 03301343345239_4_1
label yaofang:
甘草 葛根 党参 太子参 黄芪 柏子仁 生地黄 熟地黄 火麻仁 木瓜 冬瓜子 北沙参 炒白扁豆
0.451615 0.694099 0.431419 0.864328 0.487821 0.545618 0.337158 0.384907 0.41789 0.396253 0.752927 0.814313 0.772256 0.801925 0.368471 0.924037 0.373337 0.316494 0.552487 0.51067 0.682664
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.095238, recall: 0.153846, error: 0.904762
44. 
patient tongue id: 04300856518439_1
label yaofang:
甘草 茯苓 远志 党参 白术 山药 天麻 鳖甲 扁豆花 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.767923 0.389376 0.43166 0.329255 0.482649
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
45. 
patient tongue id: 01211240516602_7_4
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 鸡血藤 牡丹皮 干姜 全蝎 天花粉 炙甘草 蜈蚣 土鳖虫 狗脊
0.613503 0.313817 0.372947 0.401489 0.329467
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.117647, error: 0.600000
46. 
patient tongue id: 04271852039237_2_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.45404 0.775064 0.435227 0.937575 0.528961 0.594127 0.322338 0.363282 0.420147 0.391755 0.843171 0.893569 0.867886 0.87831 0.354492 0.971985 0.336286 0.602255 0.521222 0.765998
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
47. 
patient tongue id: 01202009450908_5_1
label yaofang:
甘草 茯苓 薏苡仁 蒲公英 太子参 白术 山药 砂仁 补骨脂 鸡内金 北沙参 稻芽
0.598462 0.391949 0.358444 0.401245 0.525502
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
48. 
patient tongue id: 06132106352388_6
label yaofang:
柴胡 白芍 香附 枳壳 丹参 海螵蛸 浙贝母 豆蔻 白花蛇舌草 姜半夏 炙甘草 紫苏梗
0.391482 0.496749 0.375884 0.310018 0.321982 0.304986 0.511724 0.582345
predicted yaofang:
柴胡 白芍 香附 党参 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.750000, recall: 0.500000, error: 0.250000
49. 
patient tongue id: 06010646418162_1_2
label yaofang:
甘草 白芍 桔梗 牛蒡子 玉竹 党参 太子参 生地黄 浙贝母 乌梅 天花粉 鳖甲 北沙参 白花蛇舌 蜂房 四季青
0.992569 0.486717 0.627717 0.347341 0.348405 0.300387 0.381115 0.670874 0.633361 0.591384 0.519056 0.542163 0.566782
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
50. 
patient tongue id: 05160622235734_4
label yaofang:
麦冬 黄芪 白术 五味子 浙贝母 郁金 厚朴 火麻仁 莪术 夏枯草 北沙参 猫爪草 合欢皮 冬凌草
0.601346 0.376374 0.342561 0.472387 0.605696 0.363415 0.311081 0.368029
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
51. 
patient tongue id: 04181944125599_1
label yaofang:
甘草 白芍 川芎 当归 龙骨 生地黄 熟地黄 杜仲 山药 山茱萸 续断 墨旱莲 艾叶
0.935577 0.310769 0.433239 0.53619 0.366598 0.302186 0.481927 0.461158 0.424832 0.337759 0.360004 0.347942
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
52. 
patient tongue id: 03142008207106_2_4
label yaofang:
甘草 柴胡 白芍 枳壳 桔梗 黄芪 白术 生地黄 槟榔 厚朴 火麻仁 柿蒂 紫菀 珍珠母 出肉苁蓉
0.368603 0.313168 0.411267 0.31859 0.331463 0.310915 0.448432
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
53. 
patient tongue id: 05100801390725_1_3
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.435456 0.319978 0.378623 0.439052 0.335936 0.30072
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
54. 
patient tongue id: 03291632350250_1_5
label yaofang:
甘草 茯苓 远志 党参 白术 杜仲 黄柏 泽泻 车前子 菟丝子 桑寄生 金樱子 蛇床子 覆盆子 川木瓜
0.972642 0.484863 0.595848 0.35024 0.328022 0.307214 0.364051 0.581812 0.558549 0.491711 0.454921 0.463298 0.452293
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
55. 
patient tongue id: 01041854131839_9_5
label yaofang:
柴胡 白芍 黄芩 枳实 石膏 杏仁 细辛 干姜 大黄 生地 滑石 川朴 法夏
0.470215 0.334925 0.311399 0.374653 0.313435
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
56. 
patient tongue id: 05261924337732_3
label yaofang:
桔梗 半夏 荆芥 防风 牛蒡子 酸枣仁 桑白皮 珍珠母 炙甘草 百合 紫苏叶 木蝴蝶 紫苑
0.878768 0.451919 0.505001 0.379457 0.305691 0.40994 0.345986 0.362129
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
57. 
patient tongue id: 02182145524315_6_1
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 酸枣仁 厚朴 仙鹤草 肉苁蓉 地榆 槐花 火麻仁
0.981646 0.486766 0.593727 0.336285 0.325615 0.351136 0.612476 0.561396 0.505968 0.452594 0.465617 0.468807
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
58. 
patient tongue id: 01182127052075_6_4
label yaofang:
甘草 法半夏 茯苓 党参 栀子 淡豆豉 莱菔子 茵陈 麦芽 紫苏子 白扁豆 谷芽 麸炒枳壳 木棉花
0.977224 0.507558 0.603782 0.342254 0.336353 0.302793 0.362918 0.586945 0.562997 0.484198 0.472007 0.462251 0.423682
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
59. 
patient tongue id: 03311644459818_1
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗 徐长卿
0.49264 0.349491 0.317031 0.436669
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
60. 
patient tongue id: 06191214431422_6_1
label yaofang:
甘草 茯苓 党参 石膏 山药 天麻 胡黄连 鳖甲 浮小麦 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.965315 0.310576 0.474763 0.568255 0.337644 0.30469 0.33208 0.555245 0.540656 0.4701 0.42953 0.430417 0.406046
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
61. 
patient tongue id: 03311620517282_1_4_6
label yaofang:
蒲公英 太子参 黄芪 白术 当归尾 砂仁 磁石 菟丝子 桑寄生 鸡内金 首乌藤 红豆杉 合欢皮
0.45487 0.366305 0.477313 0.479157 0.317679 0.423921
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 北沙参

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
62. 
patient tongue id: 06111106505276_2_4
label yaofang:
甘草 柴胡 黄芩 法半夏 薏苡仁 党参 浙贝母 车前子 鳖甲 麦芽 白花蛇舌 蜂房 四季青 龙胆
0.924873 0.301638 0.473958 0.545479 0.376064 0.302673 0.344721 0.482685 0.478819 0.417532 0.382496 0.376213 0.34113
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
63. 
patient tongue id: 05092129571701_1_2
label yaofang:
甘草 龙骨 党参 太子参 丹参 红花 山茱萸 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.982636 0.490672 0.590917 0.345288 0.318294 0.348935 0.596967 0.591233 0.52598 0.487687 0.490726 0.485936
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
64. 
patient tongue id: 03061807376459_6_1
label yaofang:
甘草 柴胡 茯苓 丹参 赤芍 青皮 郁金 山药 天花粉 瓜蒌皮 王不留行 皂角刺 合欢花
0.958148 0.307789 0.482083 0.566573 0.359893 0.309015 0.343808 0.535057 0.540311 0.471341 0.441926 0.435992 0.408497
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
65. 
patient tongue id: 04171749042943_4_2
label yaofang:
甘草 浙贝母 牛膝 苍术 干姜 草果 淡竹叶 生石膏 豆蔻 姜半夏 川木通 龙脷叶
0.380891 0.492029 0.401156 0.36046 0.301812 0.581282 0.646093
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
66. 
patient tongue id: 02191409300920_4_1
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 蝉蜕 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.443646 0.685126 0.417619 0.877879 0.473763 0.52811 0.333686 0.344133 0.391077 0.349495 0.766895 0.821911 0.795224 0.81807 0.4054 0.931914 0.343503 0.51262 0.499106 0.698293
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.875000, error: 0.300000
67. 
patient tongue id: 01211231484565_1_2
label yaofang:
白芍 茯苓 龙骨 麦冬 白术 酸枣仁 柏子仁 附子 磁石 蝉蜕
0.329948 0.3617 0.330128 0.350766 0.449362
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
68. 
patient tongue id: 04222153139524_1_2
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.45094 0.782468 0.426127 0.941683 0.521376 0.590782 0.307132 0.364692 0.414656 0.37975 0.84863 0.901427 0.865014 0.886437 0.33466 0.974341 0.335721 0.603224 0.521728 0.765924
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
69. 
patient tongue id: 01190619030405_6_2_4
label yaofang:
甘草 枳壳 黄芩 法半夏 茯苓 连翘 党参 莱菔子 天麻 鳖甲 紫苏子 蜈蚣 天山雪莲 半枝莲 红豆杉
0.868947 0.318623 0.457177 0.506869 0.384021 0.302173 0.318703 0.418951 0.370608 0.362239
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.600000, recall: 0.400000, error: 0.400000
70. 
patient tongue id: 01211310032594_1
label yaofang:
桂枝 白芍 川芎 陈皮 当归 茯苓 防风 独活 党参 黄芪 熟地黄 杜仲 牛膝 细辛 秦艽 炙甘草 续断
0.462027 0.329241 0.371408 0.312035 0.371105
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.176471, error: 0.400000
71. 
patient tongue id: 03261600108015_1
label yaofang:
茯苓 桔梗 太子参 黄芪 山楂 升麻 鸡内金 麦芽 稻芽 云芝
0.538436 0.332266 0.37551 0.562137 0.480915 0.369757 0.365795
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.200000, error: 0.714286
72. 
patient tongue id: 03222021329290_6_1
label yaofang:
甘草 柴胡 川芎 香附 防风 赤芍 荆芥穗 白芷 蔓荆子 郁李仁 辛夷 芥子
0.438978 0.348441 0.359798
predicted yaofang:
甘草 白芍 党参

------Score: precision: 0.333333, recall: 0.083333, error: 0.666667
73. 
patient tongue id: 03310917126402_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 青蒿 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄 炒苍耳子
0.457164 0.769562 0.41271 0.928978 0.536652 0.589063 0.320515 0.383629 0.417922 0.393823 0.834836 0.883692 0.848324 0.873238 0.357392 0.96507 0.365797 0.302702 0.589839 0.517438 0.736672
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.571429, recall: 0.750000, error: 0.428571
74. 
patient tongue id: 01130633110456_1_4_6
label yaofang:
甘草 法半夏 茯苓 党参 黄连 郁金 山药 砂仁 天麻 鳖甲 莪术 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.922834 0.330749 0.436178 0.539283 0.321015 0.306433 0.513351 0.389322 0.34358 0.311764
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.800000, recall: 0.500000, error: 0.200000
75. 
patient tongue id: 06052014161266_3_2
label yaofang:
麻黄 川芎 桔梗 橘红 麦冬 五味子 石菖蒲 白芷 三七 百部 紫苏子 炙甘草 浮小麦 紫苑 芥子 东风桔
0.589025 0.361182 0.387651 0.405157 0.47592
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
76. 
patient tongue id: 03211841249339_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.454016 0.718742 0.415716 0.903213 0.520378 0.589411 0.321862 0.386809 0.400823 0.398586 0.80861 0.853906 0.820403 0.860252 0.358863 0.943073 0.379936 0.319137 0.570733 0.51329 0.713969
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 1.000000, error: 0.285714
77. 
patient tongue id: 02191248292562_2_4_6
label yaofang:
甘草 柴胡 白芍 枳壳 当归 茯苓 党参 白术 丹参 栀子 牡丹皮 山药 车前子 麦芽 木贼 有瓜石斛
0.996155 0.514127 0.646 0.322059 0.346069 0.675919 0.649134 0.55192 0.524102 0.520775 0.494039
predicted yaofang:
甘草 茯苓 党参 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
78. 
patient tongue id: 03312042063947_5
label yaofang:
甘草 薏苡仁 白术 熟附子 苍术 山药 厚朴 天麻 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲 龙葵果
0.841886 0.408818 0.51191 0.373352 0.313027 0.417311 0.30825
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.333333, error: 0.285714
79. 
patient tongue id: 04151213515221_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.436266 0.74276 0.4177 0.909313 0.498535 0.572992 0.305858 0.373689 0.426558 0.38391 0.80032 0.874261 0.829523 0.846364 0.311192 0.964187 0.331893 0.307507 0.591154 0.49923 0.735211
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.761905, recall: 1.000000, error: 0.238095
80. 
patient tongue id: 06111031519512_2_1
label yaofang:
甘草 柴胡 黄芩 茯苓 党参 白术 生地黄 赤芍 青皮 牡丹皮 郁金 天花粉 益母草 王不留行 鹿衔草
0.980092 0.301428 0.492511 0.578429 0.352894 0.310272 0.34541 0.576511 0.57987 0.520405 0.48148 0.47901 0.47297
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
81. 
patient tongue id: 01182135003848_1_5_7
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 酸枣仁 丹参 生地黄 栀子 牡丹皮 菟丝子 桑寄生 益母草 合欢花
0.971292 0.45294 0.574726 0.325029 0.311347 0.57628 0.480598 0.435573 0.351957 0.384628 0.405588
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
82. 
patient tongue id: 05092020277175_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 石菖蒲 炙甘草 百合 紫苏叶 青葙子
0.37267 0.484942 0.368632 0.330842 0.506483 0.565541
predicted yaofang:
柴胡 白芍 香附 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.066667, error: 0.833333
83. 
patient tongue id: 03041406070224_4_6
label yaofang:
甘草 柴胡 白芍 茯苓 桃仁 浙贝母 干姜 厚朴 诃子 蝉蜕 浮小麦 紫苏梗 合欢花 猫爪草
0.927644 0.3022 0.464815 0.547429 0.348108 0.328185 0.495878 0.474077 0.409246 0.368532 0.368046 0.338787
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
84. 
patient tongue id: 05080849339847_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.488453 0.41957 0.300587 0.438965 0.48138 0.473188 0.395023 0.411361 0.323414 0.347967 0.366934 0.355536 0.371641 0.390565 0.3607
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.733333, recall: 0.916667, error: 0.266667
85. 
patient tongue id: 04271837132477_1
label yaofang:
甘草 茯苓 半夏 黄芪 海螵蛸 杜仲 厚朴 砂仁 僵蚕 紫苏叶 蜈蚣 红参 鸭脚艾
0.491154 0.334411 0.362744 0.514916 0.441702 0.329521 0.33381
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
86. 
patient tongue id: 01180613272480_6_4_1
label yaofang:
甘草 川芎 党参 生地黄 杜仲 牛膝 山药 山茱萸 钩藤 天麻 防己 桑寄生 补骨脂 麦芽 狗脊 牛大力 红曲
0.978505 0.491816 0.596501 0.33578 0.346202 0.313105 0.385016 0.604575 0.563754 0.496597 0.467767 0.471247 0.45918
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.294118, error: 0.615385
87. 
patient tongue id: 03232305545008_2
label yaofang:
甘草 川芎 茯苓 荆芥 党参 白术 酸枣仁 红花 熟地黄 山茱萸 侧柏叶 地黄 菟丝子 桑椹 首乌藤 制何首乌
0.939232 0.327325 0.465875 0.548129 0.367331 0.319924 0.491267 0.499399 0.432767 0.394247 0.391557 0.361117
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
88. 
patient tongue id: 03021128578741_1_2
label yaofang:
桂枝 葛根 桃仁 延胡索 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草
0.513879 0.315764 0.415554 0.353457 0.301298 0.320566
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
89. 
patient tongue id: 05191017063065_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.429372 0.436652 0.305254 0.420296 0.471232 0.500978 0.410598 0.42962 0.394128 0.38521 0.399296 0.394004 0.405567 0.445527 0.424672
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.733333, recall: 0.846154, error: 0.266667
90. 
patient tongue id: 02141940404896_1_2
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 款冬花 麦芽 百合 紫苏叶 独脚金
0.744917 0.366857 0.392128 0.449876 0.329082 0.303119
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
91. 
patient tongue id: 06080144204730_1_2
label yaofang:
甘草 党参 丹参 生地黄 浙贝母 天麻 益母草 鳖甲 虎杖 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.948125 0.341363 0.427757 0.546176 0.366462 0.303453 0.538376 0.480447 0.480974 0.366217 0.404754 0.443864
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
92. 
patient tongue id: 04271433218756_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.527064 0.373513 0.441226 0.412601 0.435513 0.354429 0.361261 0.332275 0.302948
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 车前子 夏枯草

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
93. 
patient tongue id: 03111722556066_6_5
label yaofang:
甘草 法半夏 茯苓 薏苡仁 蒲公英 党参 山药 天麻 莪术 浮小麦 蜈蚣 半枝莲 醋鳖甲 化橘红
0.656387 0.359645 0.405858 0.388265 0.453003
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
94. 
patient tongue id: 04061955538030_4_2_1
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 白花蛇舌草 炙甘草 百合 紫苏叶
0.432885 0.333818 0.429323 0.338422 0.360342 0.367453
predicted yaofang:
甘草 柴胡 白芍 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
95. 
patient tongue id: 02190539414508_4_6
label yaofang:
甘草 川芎 法半夏 远志 白术 杜仲 牛膝 钩藤 天麻 桑寄生 决明子 麦芽 蒺藜
0.914607 0.438731 0.541028 0.341892 0.344541 0.307713 0.362299 0.547821 0.410815 0.411904 0.343864 0.363368
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
96. 
patient tongue id: 04182008173944_6_1
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 龙骨 桃仁 柏子仁 生地黄 红花 赤芍 牛膝 姜半夏 合欢皮
0.449106 0.34415 0.46516 0.339244 0.305158 0.399902
predicted yaofang:
甘草 柴胡 白芍 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
97. 
patient tongue id: 02151823091572_1_2
label yaofang:
甘草 陈皮 茯苓 佩兰 茵陈 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶 木棉花 姜厚朴
0.447095 0.635491 0.446846 0.794803 0.455647 0.522116 0.346814 0.368604 0.397059 0.378863 0.682241 0.748309 0.707817 0.725636 0.378168 0.869994 0.372582 0.318603 0.521142 0.476406 0.627283
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.142857, recall: 0.230769, error: 0.857143
98. 
patient tongue id: 05182113274928_1_4
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.377045 0.485504 0.360585 0.303676 0.337018 0.537429 0.571645
predicted yaofang:
柴胡 白芍 香附 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
99. 
patient tongue id: 02190529343889_5_6_1
label yaofang:
甘草 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 三棱 莪术 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.989145 0.477302 0.616474 0.340442 0.352792 0.307467 0.367546 0.66713 0.629504 0.586466 0.51763 0.541086 0.570127
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.625000, error: 0.230769
100. 
patient tongue id: 06181701557961_2_5
label yaofang:
甘草 牛蒡子 浙贝母 郁金 厚朴 生半夏 莪术 北沙参 赭石 蜈蚣 猫爪草 土牛膝
0.603507 0.373492 0.392597 0.479178 0.537362 0.332483 0.330445
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
101. 
patient tongue id: 03201835251300_1_6
label yaofang:
桂枝 甘草 白芍 法半夏 大枣 桃仁 党参 郁金 大蓟 北柴胡 淫羊藿 广藿香 土茯苓
0.418195 0.538338 0.419568 0.326138 0.326268 0.569177 0.624076 0.307193
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
102. 
patient tongue id: 02260707247775_1_4
label yaofang:
甘草 前胡 桔梗 浙贝母 桑白皮 天麻 鳖甲 款冬花 枇杷叶 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 田七末
0.991126 0.470046 0.616231 0.339974 0.356281 0.357062 0.669666 0.634222 0.603052 0.517081 0.544633 0.603033
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
103. 
patient tongue id: 03302119258776_1_5
label yaofang:
甘草 白芍 木香 独活 桃仁 党参 鸡血藤 丹参 五味子 赤芍 山药 茵陈 补骨脂 虎杖
0.897894 0.467717 0.507943 0.426338 0.300061 0.322454 0.417413 0.406137 0.418396 0.31435 0.31557 0.304645
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
104. 
patient tongue id: 04210740217461_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.746194 0.305369 0.403093 0.464376 0.351372 0.331692
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
105. 
patient tongue id: 02281208346837_1_2
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.483315 0.315885 0.343353 0.412814 0.452383 0.387573 0.341922
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
106. 
patient tongue id: 04131849529759_1_7
label yaofang:
甘草 枳壳 茯苓 龙骨 薏苡仁 黄芪 白术 黄连 海螵蛸 杜仲 泽泻 厚朴 莪术 麦芽 合欢皮 蛇舌草 荔枝核
0.748971 0.398413 0.438681 0.340412 0.449608
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.235294, error: 0.200000
107. 
patient tongue id: 05092115287211_2_5
label yaofang:
甘草 黄芩 茯苓 党参 白术 生地黄 天麻 磁石 白芷 蔓荆子 桑寄生 麦芽 辛夷 广藿香 沙苑子 苍耳子
0.976901 0.464346 0.572186 0.333332 0.315704 0.542746 0.540353 0.460158 0.4153 0.417552 0.37999
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
108. 
patient tongue id: 03231106169980_6_4
label yaofang:
甘草 连翘 白术 生地黄 赤芍 郁金 车前子 天麻 菟丝子 鳖甲 鹿角霜 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.996989 0.475397 0.6686 0.335085 0.366459 0.357833 0.764676 0.689587 0.687271 0.579512 0.617649 0.70727
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
109. 
patient tongue id: 01140827116311_6_2
label yaofang:
甘草 独活 党参 鸡血藤 白术 酸枣仁 红花 苍术 地黄 天麻 白花蛇舌草 威灵仙 蜈蚣 半枝莲 醋鳖甲
0.92565 0.334748 0.41926 0.527821 0.36124 0.467022 0.428776 0.425178 0.309391 0.332705 0.351878
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
110. 
patient tongue id: 04202111302599_4
label yaofang:
甘草 法半夏 桃仁 黄连 海螵蛸 栀子 大黄 紫草 川牛膝 皂角刺 紫苏叶
0.367543 0.355488 0.46201 0.33646 0.321114 0.394149 0.510265
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
111. 
patient tongue id: 06012004236927_2_1
label yaofang:
甘草 薏苡仁 太子参 酸枣仁 山药 山茱萸 泽泻 车前子 天麻 猪苓 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉
0.623232 0.322195 0.34801 0.412182 0.332072
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
112. 
patient tongue id: 06091836257860_2_7
label yaofang:
白芍 茯苓 茯神 鸡血藤 丹参 牡丹皮 杜仲 山药 地黄 泽泻 补骨脂 山萸肉 炙甘草
0.949219 0.343906 0.402143 0.531632 0.330806 0.473651 0.380052 0.398458 0.301639
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.222222, recall: 0.153846, error: 0.777778
113. 
patient tongue id: 02241359186060_1_7_5
label yaofang:
黄芪 白术 赤芍 牡丹皮 杜仲 黄柏 牛膝 水蛭 砂仁 菟丝子 桑螵蛸 北沙参 红豆杉 山慈菇 石上柏
0.561831 0.323739 0.382001 0.463321 0.442384
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
114. 
patient tongue id: 02211434499371_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.464733 0.313967 0.363615 0.502885 0.388758 0.31157
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
115. 
patient tongue id: 04021140327072_1_5
label yaofang:
甘草 当归 桔梗 连翘 薏苡仁 党参 黄芪 丹参 生地黄 牡丹皮 川楝子 山药 大黄 败酱草 麦芽 皂角刺
0.826502 0.407452 0.475008 0.412111 0.33656 0.317433
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
116. 
patient tongue id: 05182024138694_5_7_6
label yaofang:
半夏 牡蛎 麦冬 酸枣仁 赤芍 浙贝母 郁金 厚朴 夏枯草 北沙参 合欢皮
0.478018 0.368472 0.429413 0.459112 0.455035 0.353843 0.379538 0.318124 0.315103 0.339436 0.311501 0.3058 0.338673 0.335624
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.071429, recall: 0.090909, error: 0.928571
117. 
patient tongue id: 06062245391606_4_2
label yaofang:
甘草 茯苓 桔梗 薏苡仁 太子参 白术 延胡索 川楝子 山药 砂仁 糯稻根 鳖甲 北沙参 白扁豆 丝瓜络 白花蛇舌
0.815628 0.424887 0.487412 0.399224 0.308765 0.3541
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
118. 
patient tongue id: 04112320271024_2_1_6
label yaofang:
桂枝 当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.412974 0.315972 0.351394 0.377284
predicted yaofang:
甘草 白芍 党参 白术

------Score: precision: 0.500000, recall: 0.153846, error: 0.500000
119. 
patient tongue id: 02142319550887_5_1_6
label yaofang:
甘草 木香 薏苡仁 党参 黄连 山药 厚朴 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.93446 0.43402 0.531757 0.414641 0.312214 0.440185 0.357296 0.405705
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.400000, error: 0.250000
120. 
patient tongue id: 04202009273167_1_2_5
label yaofang:
甘草 茯苓 薏苡仁 玉竹 党参 白术 赤芍 浙贝母 全蝎 鸡内金 北沙参 蛤壳 辛夷 猫爪草 冬凌草
0.468375 0.330263 0.33993 0.411647 0.484002 0.390246 0.349827
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
121. 
patient tongue id: 04081602413364_1_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 赤芍 牛膝 郁金 六神曲
0.835803 0.392906 0.466634 0.438061 0.3023
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
122. 
patient tongue id: 04272230288084_1_2
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.412348 0.656031 0.413689 0.833315 0.477109 0.531208 0.333609 0.347272 0.403338 0.366856 0.722804 0.792552 0.759999 0.789999 0.389007 0.909057 0.345365 0.532033 0.487217 0.674648
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
123. 
patient tongue id: 04061344130144_4_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 薏苡仁 党参 白术 天麻 败酱草 蜈蚣 半枝莲 醋鳖甲 淡附片
0.965346 0.464525 0.566819 0.351606 0.338933 0.5324 0.528807 0.444802 0.413232 0.414457 0.37822
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
124. 
patient tongue id: 01092328393225_3
label yaofang:
川芎 当归 党参 黄芪 白术 丹参 红花 黄柏 牛膝 桑叶 益母草 炙甘草
0.323505 0.327975 0.383658
predicted yaofang:
白芍 党参 炙甘草

------Score: precision: 0.666667, recall: 0.166667, error: 0.333333
125. 
patient tongue id: 03111715303406_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 桃仁 紫花地丁 浙贝母 厚朴 白芷 火麻仁 麦芽 苦杏仁 皂角刺 白鲜皮
0.654886 0.304218 0.370151 0.419021 0.413517
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
126. 
patient tongue id: 01180619216835_1_7
label yaofang:
桂枝 甘草 川芎 茯苓 鸡血藤 白术 酸枣仁 生地黄 赤芍 牛膝 天麻 桑寄生 桑枝 乌梢蛇
0.935919 0.304787 0.460185 0.533441 0.342757 0.456838 0.438729 0.367897 0.314256 0.31917
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
127. 
patient tongue id: 03311812474863_1_3
label yaofang:
防风 海螵蛸 钩藤 干姜 白芷 香薷 豆蔻 炙甘草 首乌藤 广藿香 麸炒白术 麸炒苍术 甘松 炒蔓荆子
0.365762 0.430057 0.435165 0.472767 0.362559 0.359184 0.325002 0.32631 0.41062 0.457936 0.451456 0.433032 0.37623 0.623587 0.367263 0.377528
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.250000, recall: 0.285714, error: 0.750000
128. 
patient tongue id: 04271434407503_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.338283 0.587018 0.407289 0.724478 0.414975 0.498569 0.340576 0.327801 0.587803 0.66617 0.663924 0.659008 0.336674 0.800572 0.311857 0.453065 0.406522 0.545465
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
129. 
patient tongue id: 01041825305063_2_4
label yaofang:
陈皮 茯苓 前胡 桔梗 麦冬 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.443797 0.739749 0.414151 0.909028 0.49081 0.591349 0.319765 0.374883 0.414781 0.403368 0.797747 0.863977 0.826555 0.848234 0.344363 0.95673 0.368132 0.585485 0.52365 0.725967
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.923077, error: 0.400000
130. 
patient tongue id: 01201321236386_1_7_5
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 延胡索 砂仁 天麻 鳖甲 莪术 诃子 紫苏梗 威灵仙 蜈蚣 白花蛇舌 天山雪莲
0.940121 0.306655 0.477302 0.558431 0.37379 0.350094 0.508267 0.500709 0.431057 0.402264 0.404316 0.362667
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
131. 
patient tongue id: 04252313425279_5_6
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 独活 芦根 牛蒡子 红花 浙贝母 白茅根 诃子 蝉蜕
0.964286 0.484749 0.57437 0.350119 0.338211 0.302169 0.365 0.561525 0.533065 0.475533 0.441729 0.443694 0.437244
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.142857, error: 0.846154
132. 
patient tongue id: 06072117334297_1_6
label yaofang:
甘草 党参 白术 酸枣仁 杜仲 地黄 天麻 桑寄生 白花蛇舌草 续断 蜈蚣 半枝莲 醋鳖甲 牛大力
0.955318 0.44588 0.552928 0.389424 0.303925 0.32736 0.52902 0.52312 0.489868 0.40887 0.442196 0.455943
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
133. 
patient tongue id: 04071435068708_1_5
label yaofang:
甘草 茯苓 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 炒僵蚕
0.438846 0.645617 0.450801 0.804078 0.45569 0.534099 0.342733 0.390184 0.425768 0.388674 0.68992 0.77048 0.730905 0.737266 0.35298 0.884543 0.353986 0.337896 0.54369 0.50406 0.650433
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.095238, recall: 0.142857, error: 0.904762
134. 
patient tongue id: 03012140128412_6_1_2
label yaofang:
甘草 白芍 木香 薏苡仁 党参 黄连 山茱萸 天麻 赤石脂 鳖甲 补骨脂 莪术 豆蔻 建曲 蜈蚣 白花蛇舌 天山雪莲
0.810323 0.306572 0.448776 0.440711 0.320484 0.321888
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.235294, error: 0.333333
135. 
patient tongue id: 03062136387886_1_6_2
label yaofang:
甘草 白芍 党参 酸枣仁 郁金 山药 天麻 鳖甲 莪术 虎杖 浮小麦 蜈蚣 白花蛇舌 合欢花 红豆杉
0.954797 0.472234 0.561903 0.368257 0.321122 0.304879 0.353609 0.550269 0.535198 0.477317 0.435267 0.440418 0.424733
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.533333, error: 0.384615
136. 
patient tongue id: 04261334490446_2_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.345063 0.393712 0.334677 0.420452
predicted yaofang:
白芍 白术 海螵蛸 炙甘草

------Score: precision: 0.500000, recall: 0.153846, error: 0.500000
137. 
patient tongue id: 03232109450926_6_2_1
label yaofang:
甘草 桔梗 太子参 酸枣仁 丹参 浙贝母 郁金 天麻 天花粉 鳖甲 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.993405 0.494908 0.625719 0.323953 0.3204 0.34561 0.654194 0.641137 0.564625 0.525885 0.530237 0.522439
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
138. 
patient tongue id: 04141900555595_4
label yaofang:
甘草 法半夏 前胡 桔梗 防风 黄芪 细辛 荆芥穗 白芷 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术
0.43824 0.615596 0.40637 0.822453 0.468916 0.520236 0.338439 0.350987 0.392912 0.371535 0.71701 0.774926 0.744044 0.781663 0.384083 0.902311 0.363641 0.306725 0.509589 0.486996 0.656525
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.428571, recall: 0.642857, error: 0.571429
139. 
patient tongue id: 03211947277137_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗
0.365775 0.306775 0.43071 0.345963 0.324149 0.408201
predicted yaofang:
甘草 柴胡 白芍 党参 姜半夏 炙甘草

------Score: precision: 0.666667, recall: 0.363636, error: 0.333333
140. 
patient tongue id: 04052200245154_1
label yaofang:
桂枝 当归 半夏 桃仁 黄芪 白术 赤芍 海螵蛸 杜仲 厚朴 砂仁 僵蚕 赭石 蜈蚣 土鳖虫
0.529314 0.388932 0.337199 0.430078 0.480666 0.342639
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
141. 
patient tongue id: 05172138193437_3
label yaofang:
桂枝 薏苡仁 远志 酸枣仁 杜仲 山药 厚朴 巴戟天 淫羊藿 补骨脂 吴茱萸 鸡内金 珍珠母 广藿香 土茯苓
0.728123 0.402421 0.416312 0.410338
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
142. 
patient tongue id: 06132139032818_6_4
label yaofang:
甘草 白芍 独活 桃仁 牛膝 细辛 干姜 土鳖虫 姜黄 穿破石 鹿衔草 透骨消
0.397723 0.5076 0.41989 0.373376 0.314719 0.630994 0.672553 0.307371
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.250000, recall: 0.166667, error: 0.750000
143. 
patient tongue id: 06111004392602_1_4
label yaofang:
甘草 茯苓 龙骨 远志 党参 白术 酸枣仁 山药 山茱萸 补骨脂 芡实 麦芽 益智 鹿角霜 川加皮
0.989479 0.509638 0.628787 0.328016 0.323542 0.301838 0.364725 0.630055 0.607489 0.522916 0.499381 0.496892 0.466153
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
144. 
patient tongue id: 04282258099554_2_5_6
label yaofang:
甘草 茯苓 牡蛎 酸枣仁 生地黄 牡丹皮 杜仲 山药 山茱萸 泽泻 天麻 桑寄生 决明子 麦芽 牛大力
0.935706 0.319029 0.452147 0.543296 0.340028 0.310544 0.485693 0.480947 0.40721 0.367971 0.364801 0.333894
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
145. 
patient tongue id: 04122208228468_1_6_2
label yaofang:
甘草 大枣 龙骨 党参 酸枣仁 生地黄 山药 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.915503 0.397412 0.510719 0.41515 0.409708 0.336634 0.390042
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
146. 
patient tongue id: 04181928396457_6_4
label yaofang:
桂枝 甘草 白芍 香附 当归 防风 生地黄 荆芥穗 虎杖 白花蛇舌草 蒺藜 制何首乌 徐长卿
0.43343 0.560923 0.465693 0.35973 0.304204 0.664603 0.687019 0.307854
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
147. 
patient tongue id: 03040859418804_4_6
label yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 桃仁 远志 党参 浙贝母 杜仲 桑寄生 益母草 豆蔻 蜈蚣 合欢花 鹿衔草
0.894212 0.425857 0.513163 0.385225 0.38015 0.30769
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
148. 
patient tongue id: 05181047208803_6_2
label yaofang:
甘草 柴胡 白芍 茯苓 党参 酸枣仁 生地黄 栀子 牡丹皮 鳖甲 北沙参 浮小麦 百合 白花蛇舌 合欢花 蜂房 四季青
0.974854 0.313213 0.480035 0.577756 0.366607 0.365617 0.314146 0.367145 0.615377 0.591765 0.574952 0.504627 0.518156 0.568238
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.571429, recall: 0.470588, error: 0.428571
149. 
patient tongue id: 06162202190157_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.512613 0.379178 0.35559 0.383114 0.44945 0.306366
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
150. 
patient tongue id: 03222006228858_4
label yaofang:
甘草 香附 茯苓 党参 白术 海螵蛸 紫苏梗 瓦楞子 猫爪草 山慈菇
0.402985 0.511683 0.427214 0.365095 0.341172 0.614377 0.657344 0.321912
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.375000, recall: 0.300000, error: 0.625000
151. 
patient tongue id: 01032053202599_3_4
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 熟附子 山茱萸 车前子 大腹皮 桑寄生 猪苓 麦芽 茺蔚子 川木瓜
0.31438 0.340789 0.520305 0.443744 0.609392 0.388241 0.335977 0.521393 0.517075 0.491905 0.449357 0.635963 0.372458 0.402141
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.142857, recall: 0.133333, error: 0.857143
152. 
patient tongue id: 02201800576481_1_4
label yaofang:
麻黄 甘草 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 香薷 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子
0.370011 0.543999 0.466201 0.632581 0.403388 0.41055 0.322565 0.320249 0.333884 0.308384 0.533398 0.564001 0.543251 0.515838 0.325267 0.668554 0.415713 0.341329 0.462705
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.315789, recall: 0.400000, error: 0.684211
153. 
patient tongue id: 04112047525895_2_5
label yaofang:
甘草 柴胡 白芍 蒲公英 党参 黄连 栀子 天麻 白芷 鳖甲 麦芽 皂角刺 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.913266 0.425598 0.51241 0.390078 0.40483 0.369093 0.376739
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
154. 
patient tongue id: 03061514250045_6_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.398587 0.525953 0.403106 0.333074 0.303263 0.556696 0.621538
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.857143, recall: 0.545455, error: 0.142857
155. 
patient tongue id: 02021012407689_6_1_7
label yaofang:
茯苓 薏苡仁 太子参 白术 龙眼肉 山药 芡实 莲子 百合
0.655989 0.409452 0.379868 0.359029 0.461665
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.222222, error: 0.600000
156. 
patient tongue id: 03271536347983_4_5
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 大枣 当归 牡蛎 防风 麦冬 党参 黄连 生地黄 栀子 糯稻根 生石膏 鸡内金 姜半夏 浮小麦 广藿香 蜈蚣 红芪
0.922862 0.315605 0.421807 0.533055 0.354448 0.455472 0.398105 0.37134
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.181818, error: 0.500000
157. 
patient tongue id: 04121308064439_4_6_1
label yaofang:
茯苓 防风 郁金 钩藤 荆芥穗 白芷 北柴胡 香薷 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.453464 0.599023 0.441484 0.771049 0.462094 0.519302 0.36722 0.366265 0.379453 0.3057 0.38076 0.665853 0.713339 0.702952 0.721487 0.413203 0.842875 0.379136 0.322912 0.508892 0.477817 0.621596
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.272727, recall: 0.428571, error: 0.727273
158. 
patient tongue id: 06082037178161_5
label yaofang:
甘草 枳壳 薏苡仁 蒲公英 白术 赤芍 浙贝母 牡丹皮 郁金 厚朴 茵陈 莪术 虎杖 北沙参 白鲜皮 蜈蚣 土鳖虫 姜黄 蛇舌草
0.527419 0.369303 0.322498 0.350764 0.524104 0.560862 0.409269 0.314522 0.328257 0.422006
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.400000, recall: 0.210526, error: 0.600000
159. 
patient tongue id: 04121847359621_4_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 木贼
0.325852 0.347123 0.403842 0.405398 0.325031 0.336415 0.372894 0.374751 0.376891 0.426007 0.544997 0.324418
predicted yaofang:
陈皮 法半夏 茯苓 前胡 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
160. 
patient tongue id: 04150844069313
label yaofang:
桂枝 白芍 羌活 独活 薏苡仁 鸡血藤 丹参 乳香 狗脊 海风藤 醋没药 青风藤
0.445873 0.364901 0.410799 0.445363 0.432495 0.336685 0.366967 0.335744 0.308186
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 车前子 夏枯草

------Score: precision: 0.111111, recall: 0.083333, error: 0.888889
161. 
patient tongue id: 05022220273856_2_5
label yaofang:
甘草 山茱萸 天麻 菟丝子 益母草 鳖甲 桑螵蛸 益智 续断 蜈蚣 天山雪莲 半枝莲 广金钱草 红豆杉
0.978234 0.484381 0.587628 0.374817 0.341322 0.56565 0.570402 0.515772 0.463629 0.469876 0.461556
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
162. 
patient tongue id: 01032215147825_2
label yaofang:
甘草 黄芩 桔梗 麦冬 玄参 生地黄 浙贝母 白茅根 鳖甲 苍耳子 白花蛇舌 天山雪莲 蜂房 四季青
0.955855 0.481528 0.569138 0.351288 0.308377 0.36004 0.543988 0.510747 0.435961 0.406989 0.407488 0.37796
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
163. 
patient tongue id: 02110740088122_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.374871 0.356736 0.404055 0.404715 0.389099 0.35466 0.395962 0.30781 0.303384 0.322684
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 车前子 决明子 夏枯草 制何首乌

------Score: precision: 0.700000, recall: 0.583333, error: 0.300000
164. 
patient tongue id: 02020929573123_1_2_6
label yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 杜仲 山茱萸 天麻 菟丝子 女贞子 合欢花 狗脊 墨旱莲
0.911314 0.435061 0.522234 0.397549 0.430699 0.400874 0.414531 0.309426 0.3264
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
165. 
patient tongue id: 04202049347600_1_6
label yaofang:
当归 木香 桃仁 远志 党参 黄芪 鸡血藤 白术 柏子仁 虎杖 炙甘草 百合 紫苏叶
0.379615 0.486877 0.385414 0.52265 0.558463
predicted yaofang:
柴胡 白芍 香附 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
166. 
patient tongue id: 03040910180364_2_7_6
label yaofang:
甘草 茯苓 连翘 薏苡仁 桃仁 党参 郁金 山药 砂仁 鳖甲 莪术 麦芽 紫苏梗 白花蛇舌
0.934333 0.306293 0.43182 0.548386 0.347426 0.31122 0.493676 0.448909 0.394871 0.32118 0.344918 0.323218
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
167. 
patient tongue id: 06070112274861_2_1_6
label yaofang:
甘草 茯苓 龙骨 牡蛎 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989482 0.503136 0.621397 0.322441 0.314056 0.346977 0.626967 0.611497 0.522099 0.497421 0.497631 0.470354
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
168. 
patient tongue id: 05222055463844_1_4_7
label yaofang:
黄芪 枸杞子 白术 延胡索 山药 车前子 砂仁 补骨脂 芡实 金樱子 北沙参
0.554276 0.33468 0.360351 0.511856 0.532637 0.361393 0.339982
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
169. 
patient tongue id: 02191433487714_1_2_5
label yaofang:
粉葛 建曲
0.982462 0.490927 0.599913 0.334094 0.319271 0.300799 0.35046 0.612398 0.602144 0.512652 0.484219 0.494896 0.461403
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
170. 
patient tongue id: 06181834386447_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 红花 山药 天麻 鳖甲 佛手 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.988635 0.497636 0.615167 0.314743 0.330711 0.349122 0.62529 0.612537 0.524286 0.502548 0.501254 0.486295
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
171. 
patient tongue id: 04052122572847_5
label yaofang:
甘草 荆芥 金银花 连翘 薄荷 牛蒡子 淡豆豉 茵陈 淡竹叶 布渣叶
0.764364 0.311122 0.372585 0.448802 0.363868
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
172. 
patient tongue id: 05222120402021_7_4_1
label yaofang:
桃仁 黄芪 白术 海螵蛸 砂仁 桑寄生 鸡内金 北沙参 续断 紫苏梗 土鳖虫 红曲
0.515332 0.314396 0.315286 0.554162 0.647781 0.445844 0.325551 0.318444 0.409981 0.310664
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.500000, recall: 0.416667, error: 0.500000
173. 
patient tongue id: 03021319044474_4_1
label yaofang:
陈皮 法半夏 茯苓 党参 海螵蛸 干姜 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 炙黄芪 甘松
0.408298 0.62963 0.434358 0.783801 0.449494 0.509072 0.311291 0.3325 0.373138 0.367216 0.659696 0.728605 0.696079 0.709591 0.332802 0.868287 0.347129 0.508696 0.456509 0.611481
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.461538, error: 0.700000
174. 
patient tongue id: 04020749080688_6_4
label yaofang:
甘草 川芎 羌活 独活 薏苡仁 远志 牛膝 细辛 天麻 全蝎 白芷 鳖甲 粉葛 白花蛇舌 红豆杉
0.808515 0.412067 0.484315 0.334854 0.451037 0.30443
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
175. 
patient tongue id: 01192152376587_2_5
label yaofang:
甘草 黄芩 桔梗 防风 芦根 麦冬 丹参 玄参 生地黄 浙贝母 白茅根 车前子 鳖甲 鹿角霜 白花蛇舌 四季青
0.993585 0.48127 0.641105 0.356976 0.363145 0.3685 0.698087 0.650304 0.641504 0.547125 0.572346 0.651767
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
176. 
patient tongue id: 06141831216599_1_7
label yaofang:
桃仁 黄芪 枸杞子 丹参 红花 杜仲 牛膝 续断 骨碎补 毛冬青
0.781809 0.377144 0.459542 0.304643 0.412504
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
177. 
patient tongue id: 04261340269886_7_1
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 延胡索 赤芍 牛膝 附子 小茴香
0.384459 0.483737 0.377471 0.303134 0.34839 0.518781 0.576977
predicted yaofang:
柴胡 白芍 香附 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
178. 
patient tongue id: 01040652017321_2_6_4
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 山药 砂仁 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.844752 0.31504 0.453951 0.475328 0.332327 0.349833 0.322006 0.316747
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 1.000000, recall: 0.533333, error: 0.000000
179. 
patient tongue id: 05140635035940_1_2_6
label yaofang:
甘草 白芍 太子参 生地黄 红花 赤芍 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤
0.976056 0.307043 0.468486 0.584289 0.365558 0.336431 0.351617 0.589957 0.572479 0.543461 0.466703 0.484655 0.520491
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
180. 
patient tongue id: 04112315282386_1
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 郁金 鸡内金 炙甘草 百合 紫苏叶
0.45326 0.568852 0.482841 0.317164 0.373596 0.348937 0.300684 0.654384 0.699342 0.338848
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 干姜 豆蔻 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.100000, recall: 0.076923, error: 0.900000
181. 
patient tongue id: 01130636088314_5_2
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 牛蒡子 浙贝母 厚朴 天花粉 瓜蒌子 紫苏梗 木蝴蝶 合欢花
0.938852 0.320821 0.488352 0.559786 0.34388 0.328583 0.305682 0.307202 0.356854 0.527817 0.524637 0.441252 0.435269 0.422414 0.387753
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.214286, error: 0.800000
182. 
patient tongue id: 01182139361636_2_6
label yaofang:
甘草 酸枣仁 浙贝母 杜仲 山药 白茅根 地黄 天麻 桑寄生 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.967782 0.301969 0.483503 0.584506 0.347906 0.3378 0.324888 0.361627 0.580834 0.564636 0.495327 0.463877 0.468828 0.452672
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.428571, recall: 0.428571, error: 0.571429
183. 
patient tongue id: 03171008294996_1_2
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 酸枣仁 丹参 郁金 鸡内金 首乌藤 百合 制远志
0.438088 0.436123 0.310724 0.431613 0.48915 0.475266 0.39571 0.424039 0.343435 0.373488 0.422751 0.395987 0.418243 0.416148 0.412706
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.266667, recall: 0.333333, error: 0.733333
184. 
patient tongue id: 03062133338494_1_6
label yaofang:
甘草 当归 茯苓 远志 党参 生地黄 黄柏 肉桂 车前子 砂仁 菟丝子 巴戟天 金樱子 覆盆子
0.981845 0.503143 0.601658 0.330757 0.323423 0.301977 0.355456 0.5904 0.575562 0.486521 0.471711 0.464532 0.432528
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
185. 
patient tongue id: 05132002275078_6
label yaofang:
甘草 茯苓 党参 白术 丹参 延胡索 青皮 川楝子 郁金 地黄 天花粉 瓜蒌皮 王不留行 浮小麦 猫爪草
0.909671 0.348208 0.420212 0.511425 0.370743 0.466169 0.405512 0.421008 0.325855 0.357633
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
186. 
patient tongue id: 03161314269919_1_4
label yaofang:
太子参 黄芪 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 炙甘草 制远志 酒女贞子 墨旱莲 煅龙骨 炒酸枣仁 干益母草
0.439896 0.710249 0.429152 0.880802 0.475815 0.560311 0.310356 0.38725 0.41731 0.385441 0.765009 0.845776 0.798663 0.806601 0.30493 0.946621 0.357845 0.305142 0.577164 0.5131 0.708478
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.142857, recall: 0.200000, error: 0.857143
187. 
patient tongue id: 03022123009938_1_4
label yaofang:
茯苓 薏苡仁 黄芪 白术 海螵蛸 山药 生半夏 砂仁 鸡内金 紫苏梗 稻芽
0.456939 0.312168 0.377065 0.514871 0.365171 0.314589
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.272727, error: 0.500000
188. 
patient tongue id: 05032244345008_2_7
label yaofang:
甘草 党参 黄连 赤芍 郁金 苍术 山茱萸 天麻 鳖甲 王不留行 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.907726 0.335574 0.373501 0.50124 0.379395 0.427481 0.333136 0.383824
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
189. 
patient tongue id: 06082016147051_2_5
label yaofang:
柴胡 半夏 连翘 牛蒡子 党参 黄芪 枸杞子 白术 生地黄 牡丹皮 杜仲 牛膝 补骨脂 莪术 北沙参 赭石
0.739507 0.401117 0.448347 0.313264 0.452681
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
190. 
patient tongue id: 06132005463900_2_6
label yaofang:
甘草 枳壳 半夏 太子参 枸杞子 杜仲 厚朴 茜草 僵蚕 麦芽 北沙参 佛手 合欢皮 预知子 蛇舌草
0.779234 0.39773 0.460521 0.361098 0.447277
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
191. 
patient tongue id: 04112326552142_6
label yaofang:
甘草 法半夏 龙齿 酸枣仁 柏子仁 栀子 肉桂 淡豆豉 天麻 百合 紫苏叶
0.332589 0.416467 0.313222 0.321044 0.319015 0.413602 0.47604
predicted yaofang:
柴胡 白芍 香附 党参 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
192. 
patient tongue id: 02191231050687_1
label yaofang:
甘草 白芍 茯苓 党参 酸枣仁 山药 山茱萸 地黄 补骨脂 麦芽 首乌藤 牛大力
0.994033 0.496261 0.648887 0.327615 0.354807 0.30105 0.362373 0.704321 0.635753 0.601129 0.516283 0.549552 0.579915
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.416667, error: 0.615385
193. 
patient tongue id: 04271511564412_1_4_7
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 厚朴
0.383585 0.309403 0.365634 0.525356 0.379732 0.327018
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.833333, recall: 0.384615, error: 0.166667
194. 
patient tongue id: 03151955537614_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.339687 0.319703 0.373577 0.425652 0.366507 0.326085 0.33184
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 车前子

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
195. 
patient tongue id: 01040656112790_5_1
label yaofang:
甘草 黄芩 茯苓 薄荷 芦根 牛蒡子 党参 丹参 黄连 山药 鳖甲 补骨脂 白花蛇舌 蜂房 广升麻
0.973296 0.483822 0.586197 0.325908 0.345585 0.558914 0.5433 0.448421 0.428027 0.42258 0.37632
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
196. 
patient tongue id: 03020716306095_1_4
label yaofang:
甘草 桔梗 薏苡仁 浙贝母 黄柏 牛膝 苍术 天麻 桑寄生 白花蛇舌草 忍冬藤 蜈蚣 半枝莲 醋鳖甲
0.962119 0.443949 0.555417 0.395626 0.322531 0.526391 0.458336 0.488388 0.340215 0.377719 0.434615
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
197. 
patient tongue id: 04260648030842_1_7
label yaofang:
甘草 川芎 法半夏 茯苓 远志 枸杞子 杜仲 牛膝 天麻 益母草 桑螵蛸 麦芽 益智 蒺藜 沙苑子 天山雪莲
0.956506 0.46556 0.573249 0.373189 0.307998 0.342968 0.530028 0.520962 0.460158 0.416353 0.424078 0.407695
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
198. 
patient tongue id: 01132142541437_1_6
label yaofang:
甘草 党参 生地黄 杜仲 山药 山茱萸 天麻 鳖甲 续断 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.971026 0.307738 0.468795 0.580178 0.35141 0.32202 0.343098 0.588507 0.565207 0.517276 0.459313 0.473051 0.48875
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
199. 
patient tongue id: 02122230267996_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 牛蒡子 浙贝母 细辛 桑白皮 干姜 款冬花 苦杏仁 炙麻黄
0.966501 0.472673 0.565485 0.354385 0.327574 0.504777 0.471126 0.424716 0.359293 0.362861 0.343305
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
200. 
patient tongue id: 03012252296265_1_2_6
label yaofang:
甘草 法半夏 桔梗 芦根 桃仁 远志 党参 浙贝母 鳖甲 苦杏仁 辛夷 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97041 0.458224 0.5845 0.354714 0.330975 0.540967 0.503598 0.457888 0.377382 0.399461 0.400174
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
201. 
patient tongue id: 02231839524609_4
label yaofang:
法半夏 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.309554 0.338057 0.372026 0.341877 0.30148 0.317902 0.395013 0.387918 0.349043 0.376795 0.681024
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 黄芪 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
202. 
patient tongue id: 02191211041298_6_4
label yaofang:
甘草 白芍 党参 白术 丹参 玄参 厚朴 天麻 火麻仁 决明子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.987033 0.465416 0.603427 0.336821 0.317985 0.341054 0.623601 0.594593 0.545254 0.474116 0.497702 0.524486
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
203. 
patient tongue id: 02201307311005_4
label yaofang:
甘草 防风 丹参 生地黄 牡丹皮 乌梅 车前子 紫草 莪术 珍珠母 白鲜皮 紫苏叶 土茯苓 徐长卿
0.447023 0.374504 0.472385 0.328935 0.368766 0.335477 0.304012 0.342101 0.381284
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 浙贝母 姜半夏 炙甘草

------Score: precision: 0.111111, recall: 0.071429, error: 0.888889
204. 
patient tongue id: 03131248131953_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.43052 0.607618 0.440194 0.775834 0.44939 0.482166 0.336409 0.319108 0.348482 0.311714 0.666633 0.711915 0.711953 0.72536 0.403511 0.850067 0.310476 0.481356 0.481212 0.646008
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
205. 
patient tongue id: 04112001397508_3_4
label yaofang:
甘草 白芍 薏苡仁 桃仁 党参 黄芪 白术 熟附子 山药 干姜 鳖甲 麦芽 佛手 土鳖虫
0.964391 0.49792 0.577892 0.360487 0.312004 0.361806 0.539962 0.540011 0.46014 0.444616 0.431181 0.398753
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
206. 
patient tongue id: 04252259438299_4_1
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 桃仁 远志 浙贝母 细辛 桑白皮 款冬花 苦杏仁 紫苏子 炙麻黄
0.972496 0.479247 0.584803 0.338943 0.344212 0.562516 0.54733 0.472777 0.434149 0.434843 0.408815
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
207. 
patient tongue id: 03291444298441_7_6_4
label yaofang:
甘草 川芎 法半夏 茯苓 远志 党参 白术 酸枣仁 丹参 黄连 牛膝 天麻 全蝎 夜交藤 蒿苯
0.97311 0.482998 0.576882 0.342626 0.303027 0.337512 0.558455 0.56664 0.480464 0.455999 0.448323 0.417209
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
208. 
patient tongue id: 06022125460500_1_4
label yaofang:
当归 茯苓 薏苡仁 党参 黄芪 枸杞子 杜仲 三七 莲子 西洋参 续断 骨碎补
0.499524 0.357307 0.364256 0.409863 0.463896
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
209. 
patient tongue id: 02191638388173_6_4_7
label yaofang:
甘草 陈皮 黄芩 法半夏 大枣 薏苡仁 桃仁 葶苈子 郁金 桑白皮 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 红豆杉
0.983107 0.488216 0.614013 0.335379 0.306591 0.351022 0.600294 0.582876 0.493869 0.461997 0.465828 0.434614
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
210. 
patient tongue id: 01250702455333_1_6_2
label yaofang:
甘草 桔梗 太子参 酸枣仁 赤芍 浙贝母 郁金 地黄 天麻 诃子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.895339 0.336201 0.437809 0.510632 0.348557 0.437476 0.35403 0.337504
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
211. 
patient tongue id: 03222003292779_6_7
label yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 黄连 郁金 石菖蒲 桑螵蛸 益智 浮小麦 首乌藤 百合
0.958951 0.301912 0.467339 0.566851 0.351649 0.302874 0.338628 0.535712 0.519786 0.450631 0.412681 0.416039 0.391734
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
212. 
patient tongue id: 05311943200818_3_1
label yaofang:
麻黄 茯苓 桔梗 半夏 芦根 牛蒡子 麦冬 桑白皮 白前 炙甘草 浮小麦 百合 紫苑 青果
0.323733 0.341427 0.401943 0.361033 0.301409 0.340582 0.303799 0.346798 0.357852 0.346832 0.416232 0.556224
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
213. 
patient tongue id: 03242143409914_1
label yaofang:
柴胡 黄芩 龙骨 党参 白术 泽泻 干姜 天麻 姜半夏 炙甘草 续断
0.327091 0.341357 0.4502 0.323268 0.377309 0.536112
predicted yaofang:
甘草 柴胡 白芍 白术 姜半夏 炙甘草

------Score: precision: 0.666667, recall: 0.363636, error: 0.333333
214. 
patient tongue id: 04130625003047_1_2_5
label yaofang:
甘草 茯苓 党参 黄芪 黄连 赤芍 杜仲 石膏 山药 山茱萸 水蛭 天花粉 桑寄生 粉葛 合欢花
0.969502 0.313259 0.492855 0.576109 0.343673 0.325263 0.30583 0.348781 0.570195 0.574045 0.485606 0.471117 0.464781 0.434814
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.266667, error: 0.714286
215. 
patient tongue id: 03240555090631_1
label yaofang:
甘草 防风 独活 连翘 黄芪 白术 丹参 五味子 天麻 鳖甲 皂角刺 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.966123 0.455914 0.573452 0.38413 0.311164 0.337614 0.556415 0.558589 0.50403 0.441903 0.459807 0.45846
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
216. 
patient tongue id: 06111122014228_4_6
label yaofang:
甘草 白芍 党参 青皮 浙贝母 郁金 天麻 鳖甲 王不留行 女贞子 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.952735 0.453091 0.555724 0.375759 0.324064 0.483206 0.458308 0.415776 0.342454 0.344154 0.307518
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
217. 
patient tongue id: 04241853155437_1_6
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 海螵蛸 车前子 砂仁 升麻 炙甘草 山慈菇
0.367505 0.479913 0.340933 0.488249 0.571226
predicted yaofang:
柴胡 白芍 香附 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
218. 
patient tongue id: 05131620525084_1_2_7
label yaofang:
甘草 桃仁 党参 白术 酸枣仁 柏子仁 天麻 肉苁蓉 鳖甲 火麻仁 补骨脂 蜈蚣 天山雪莲 半枝莲 红豆杉
0.900379 0.434661 0.54148 0.337701 0.304828 0.349743 0.521102 0.357801 0.360652
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.777778, recall: 0.466667, error: 0.222222
219. 
patient tongue id: 01061606253871_6_1_7
label yaofang:
甘草 柴胡 黄芩 大枣 茯苓 白术 赤芍 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.904486 0.327131 0.4548 0.528503 0.365987 0.302685 0.333116 0.475605 0.452 0.40935 0.354452 0.362527 0.346521
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
220. 
patient tongue id: 03111742026944_5_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 牛蒡子 薏苡仁 浙贝母 细辛 天麻 鳖甲 白前 紫苏梗 蜈蚣 白花蛇舌
0.975499 0.485668 0.586782 0.348096 0.330343 0.560521 0.569159 0.483884 0.453736 0.451168 0.413565
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
221. 
patient tongue id: 04102037040759_6
label yaofang:
甘草 枳壳 桔梗 黄芪 白术 枳实 槟榔 厚朴 肉苁蓉 火麻仁 紫菀 郁李仁
0.747214 0.300192 0.355541 0.445543 0.328085
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
222. 
patient tongue id: 01062039045315_6_1
label yaofang:
甘草 法半夏 茯苓 桔梗 生地黄 浙贝母 牡丹皮 黄柏 知母 山药 山茱萸 厚朴 天花粉 紫苏梗
0.815714 0.323016 0.401608 0.495127 0.367292 0.391312
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
223. 
patient tongue id: 05201513380066_2_7
label yaofang:
甘草 法半夏 茯苓 桃仁 党参 黄芪 白术 山茱萸 天麻 僵蚕 鳖甲 蒺藜 赭石 龟甲
0.947725 0.479081 0.552457 0.370632 0.330322 0.467828 0.453892 0.408179 0.352598 0.344213 0.312953
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
224. 
patient tongue id: 02240825529730_1_2_7
label yaofang:
当归 党参 黄芪 枸杞子 熟附子 乌药 肉桂 干姜 巴戟天 吴茱萸 炙甘草 黄精
0.484692 0.312739 0.382666 0.463779 0.310197 0.318412
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
225. 
patient tongue id: 02191239523367_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.452849 0.771056 0.411883 0.936633 0.516075 0.607161 0.308623 0.35405 0.408806 0.396418 0.84104 0.898769 0.859775 0.889225 0.34501 0.973028 0.35908 0.603795 0.519736 0.760661
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
226. 
patient tongue id: 03192243063741_1_4_6
label yaofang:
甘草 法半夏 茯苓 党参 酸枣仁 黄连 生地黄 竹茹 黄柏 知母 砂仁 天麻 柿蒂 浮小麦 百合
0.930214 0.30226 0.473365 0.541831 0.361292 0.340381 0.497252 0.48068 0.421924 0.386004 0.377164 0.348009
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
227. 
patient tongue id: 02122102390835_1_8
label yaofang:
甘草 白芍 茯苓 荆芥 党参 红花 赤芍 天麻 木瓜 白花蛇舌草 麦芽 白鲜皮 蜈蚣 半枝莲 醋鳖甲 宽筋藤
0.960517 0.475856 0.575384 0.339093 0.336883 0.359947 0.556806 0.520738 0.451203 0.418781 0.424512 0.409416
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
228. 
patient tongue id: 05241943410155_4_6_1
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 砂仁 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.962689 0.315282 0.464136 0.567848 0.332245 0.317301 0.528693 0.539361 0.446935 0.421511 0.41804 0.382989
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
229. 
patient tongue id: 01062037534192_6_2
label yaofang:
甘草 柴胡 白芍 川芎 当归 茯苓 蒲公英 党参 白术 酸枣仁 麦芽 合欢花 麸炒枳壳
0.782848 0.34235 0.449336 0.457949 0.346626 0.342508
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.833333, recall: 0.384615, error: 0.166667
230. 
patient tongue id: 04201428120019_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.504919 0.349976 0.423599 0.529054 0.420164 0.304042 0.357361 0.3055
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 夏枯草

------Score: precision: 0.625000, recall: 0.416667, error: 0.375000
231. 
patient tongue id: 02260650148678_1_6
label yaofang:
甘草 远志 党参 黄芪 白术 酸枣仁 生地黄 天麻 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989944 0.466941 0.623675 0.342882 0.353496 0.349441 0.666487 0.636629 0.60613 0.520949 0.544095 0.599404
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
232. 
patient tongue id: 04112202009003_6
label yaofang:
甘草 白芍 羌活 独活 党参 白术 酸枣仁 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.968463 0.466929 0.574509 0.336438 0.304424 0.331894 0.547283 0.53736 0.457054 0.417976 0.425655 0.40359
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
233. 
patient tongue id: 04200641008400_2_5_6
label yaofang:
甘草 生地黄 石膏 山药 车前子 荆芥穗 天麻 胡黄连 鳖甲 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.974563 0.492188 0.604042 0.315522 0.332292 0.306248 0.359123 0.592779 0.559757 0.460154 0.454029 0.449886 0.419334
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
234. 
patient tongue id: 02212009043627_4
label yaofang:
甘草 黄芩 桔梗 牛蒡子 浙贝母 天麻 款冬花 紫菀 白花蛇舌草 苦杏仁 蜈蚣 半枝莲 醋鳖甲
0.9103 0.306728 0.442827 0.533523 0.358616 0.305966 0.457475 0.418224 0.374163 0.307543 0.323399
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
235. 
patient tongue id: 05201504259416_5_7_6
label yaofang:
甘草 蒲公英 党参 红花 浙贝母 郁金 厚朴 天麻 天花粉 瓜蒌皮 鳖甲 麦芽 蜈蚣 白花蛇舌 半枝莲 红豆杉 猫爪草
0.861898 0.317709 0.439027 0.516224 0.399643 0.328291 0.437128 0.381731 0.382445 0.303469
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.500000, recall: 0.294118, error: 0.500000
236. 
patient tongue id: 03290710107847_6_1
label yaofang:
甘草 牡蛎 远志 党参 酸枣仁 丹参 知母 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97413 0.481185 0.589277 0.354309 0.329566 0.310495 0.360592 0.585896 0.589163 0.51148 0.480805 0.487452 0.468221
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
237. 
patient tongue id: 01182117332708_5_1_7
label yaofang:
甘草 金银花 生地黄 红花 牡丹皮 水牛角 荆芥穗 天麻 鳖甲 火麻仁 白鲜皮 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.942165 0.469664 0.562867 0.364657 0.339854 0.311371 0.368786 0.544259 0.504457 0.448142 0.406555 0.416632 0.405214
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
238. 
patient tongue id: 02190501591797_6_2_7
label yaofang:
甘草 茯苓 龙骨 党参 黄芪 白术 酸枣仁 黄连 栀子 知母 山药 山茱萸 地黄 首乌藤
0.954372 0.467156 0.542719 0.376611 0.457516 0.425851 0.402204 0.301316 0.304943
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
239. 
patient tongue id: 03101835431221_1_6_5
label yaofang:
黄芪 白术 郁金 厚朴 火麻仁 鸡内金 珍珠母 夏枯草 麦芽 北沙参 橘核 首乌藤 红豆杉 墨旱莲
0.37932 0.326789 0.377977 0.541423
predicted yaofang:
茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
240. 
patient tongue id: 03022125311787_1
label yaofang:
甘草 柏子仁 肉桂 砂仁 附片
0.393257 0.327683 0.425625 0.339553 0.324059 0.305968 0.453627
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.200000, error: 0.857143
241. 
patient tongue id: 02201826351081_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子
0.389905 0.592388 0.427526 0.77295 0.443178 0.515953 0.308878 0.308173 0.342288 0.340367 0.656764 0.692832 0.690656 0.709065 0.376541 0.822665 0.362381 0.471687 0.41645 0.590045
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 1.000000, error: 0.400000
242. 
patient tongue id: 03291348014225_4_7
label yaofang:
甘草 川芎 法半夏 茯苓 酸枣仁 红花 杜仲 牛膝 天麻 桑螵蛸 益智 天山雪莲
0.969275 0.456311 0.576924 0.326362 0.312133 0.534065 0.515892 0.420552 0.380775 0.395279 0.35409
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.333333, error: 0.636364
243. 
patient tongue id: 05232047284319_7
label yaofang:
陈皮 桔梗 枳实 大腹皮 干姜 厚朴 白芷 莪术 姜半夏 紫苏叶 广藿香
0.448956 0.361707 0.363242 0.394251 0.300532
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
244. 
patient tongue id: 01250655343895_5_6_1
label yaofang:
甘草 枳壳 木香 白及 党参 黄芪 生地黄 车前子 仙鹤草 茜草 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲
0.972099 0.493978 0.591099 0.333634 0.324954 0.30291 0.358058 0.567164 0.535548 0.454723 0.427083 0.42202 0.393246
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.533333, error: 0.384615
245. 
patient tongue id: 05081759345828_5
label yaofang:
茯苓 木香 党参 太子参 黄芪 白术 熟地黄 砂仁 姜半夏 炙甘草 牛大力 五指毛桃 千斤拔 蒸陈皮
0.73337 0.322146 0.359536 0.440644 0.344273
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
246. 
patient tongue id: 04282218309687_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 酸枣仁 丹参 黄连 郁金 山茱萸 补骨脂 佛手 浮小麦
0.96875 0.490779 0.570783 0.360202 0.313179 0.342844 0.571062 0.557758 0.503939 0.458647 0.455121 0.44909
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
247. 
patient tongue id: 03271539162076_5_6_7
label yaofang:
桂枝 柴胡 白芍 黄芩 当归 白及 党参 黄连 熟地黄 乌梅 黄柏 细辛 干姜 三七 鸡内金 炙甘草 淡附片 半边莲
0.866294 0.304535 0.410965 0.494468 0.334251 0.400815
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.111111, error: 0.666667
248. 
patient tongue id: 05111930341593_5_6_7
label yaofang:
甘草 桃仁 黄芪 白术 丹参 赤芍 海螵蛸 浙贝母 杜仲 乌药 泽泻 厚朴 肉苁蓉 莪术 北沙参 蛇舌草 荔枝核
0.492039 0.321951 0.330766 0.51381 0.517719 0.351662 0.349873
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.714286, recall: 0.294118, error: 0.285714
249. 
patient tongue id: 04260635535885_6_1
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 远志 党参 酸枣仁 黄连 桑螵蛸 益智 佛手 首乌藤
0.772315 0.336102 0.420366 0.473646 0.330841 0.352444
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
250. 
patient tongue id: 04251957529247_4_1
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草 山慈菇
0.340899 0.458432 0.438924 0.564696
predicted yaofang:
柴胡 白芍 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
251. 
patient tongue id: 06082011087953_1
label yaofang:
桂枝 白芍 川芎 当归 茯苓 防风 芦根 麦冬 党参 白术 五味子 延胡索 北沙参 炙甘草 女贞子
0.579897 0.320695 0.38599 0.313027 0.456452
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
252. 
patient tongue id: 02281827158001_1
label yaofang:
茯苓 党参 白术 乌药 肉桂 山药 益智仁 诃子 金樱子 桑螵蛸 益智 百合 覆盆子
0.336727 0.311424 0.407028 0.363367 0.444407
predicted yaofang:
甘草 柴胡 白芍 党参 炙甘草

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
253. 
patient tongue id: 04131901183042_2_5
label yaofang:
甘草 黄芩 太子参 黄芪 白术 海螵蛸 浙贝母 牡丹皮 杜仲 小蓟 厚朴 肉苁蓉 莪术 北沙参 赭石 三七粉 荔枝核 鸭脚艾
0.532365 0.357882 0.392871 0.40992 0.427627
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.166667, error: 0.400000
254. 
patient tongue id: 02020844199682_6_5_2
label yaofang:
甘草 白芍 茯苓 金银花 党参 黄芪 白术 生地黄 牡丹皮 山药 山茱萸 白芷 淡竹叶 皂角刺 白花蛇舌
0.815084 0.383505 0.393204 0.478549 0.333589 0.366503
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
255. 
patient tongue id: 04200239248798_1_6
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 山药 莱菔子 天麻 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.958412 0.478005 0.579264 0.334471 0.307146 0.348834 0.529859 0.523875 0.427554 0.422935 0.411637 0.372609
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
256. 
patient tongue id: 01312307506769_1_4
label yaofang:
甘草 陈皮 法半夏 薏苡仁 远志 浙贝母 厚朴 天麻 鳖甲 款冬花 莪术 百部 紫苏子 蜈蚣 白花蛇舌 天山雪莲
0.961797 0.483956 0.572 0.322195 0.326845 0.506598 0.494792 0.390592 0.384054 0.370725 0.318673
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
257. 
patient tongue id: 06031105419337_5_1_6
label yaofang:
甘草 薏苡仁 党参 白术 黄连 苍术 厚朴 天麻 鳖甲 鸡内金 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.484539 0.308022 0.422489 0.452069 0.441309 0.366009 0.309855 0.386633 0.387184 0.333526 0.450868 0.319471
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 炙甘草 广藿香

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
258. 
patient tongue id: 03231105134033_4
label yaofang:
甘草 陈皮 茯苓 前胡 桔梗 半夏 防风 黄芪 白术 白前 百部 广藿香
0.441505 0.748951 0.400001 0.917352 0.519192 0.541115 0.382613 0.366535 0.417243 0.795781 0.862672 0.836668 0.796397 0.936179 0.36741 0.580735 0.505443 0.690015
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.444444, recall: 0.666667, error: 0.555556
259. 
patient tongue id: 05222322306981_1
label yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.453189 0.760635 0.407656 0.936043 0.514132 0.590138 0.311059 0.357703 0.408922 0.377381 0.846249 0.896209 0.861047 0.893252 0.358591 0.970849 0.356233 0.587814 0.528991 0.764621
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.916667, error: 0.450000
260. 
patient tongue id: 03200655201294_4
label yaofang:
甘草 白芍 蒲公英 白术 黄柏 细辛 天麻 白芷 地榆 槐花 火麻仁 麦芽 五倍子 土茯苓
0.853877 0.380131 0.394873 0.49436 0.347928 0.303504 0.383759 0.329588 0.313633
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
261. 
patient tongue id: 04121937593956_1_4
label yaofang:
甘草 川芎 远志 党参 黄芪 白术 赤芍 天麻 全蝎 白芷 鳖甲 白花蛇舌 天山雪莲 半枝莲
0.982104 0.4585 0.586338 0.360912 0.331338 0.348907 0.609604 0.564958 0.55133 0.448198 0.48046 0.528048
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
262. 
patient tongue id: 02122219175729_1_6
label yaofang:
甘草 荆芥 金银花 黄芪 白术 红花 天麻 白花蛇舌草 麦芽 苦参 白鲜皮 地肤子 蜈蚣 半枝莲 醋鳖甲
0.984758 0.50427 0.600789 0.320513 0.305268 0.342928 0.598432 0.577571 0.484881 0.464242 0.460147 0.421314
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
263. 
patient tongue id: 05130658176079_6_2
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 连翘 党参 白术 酸枣仁 山药 益母草 麦芽 益智 白扁豆 浮小麦 建曲
0.957545 0.473125 0.554961 0.343512 0.318418 0.518663 0.492893 0.426615 0.376606 0.378344 0.345421
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
264. 
patient tongue id: 05242121038315_6
label yaofang:
甘草 柴胡 白芍 黄芩 茯苓 党参 白术 牡丹皮 砂仁 菟丝子 益母草 醋香附 酒女贞子
0.961863 0.322981 0.455921 0.565608 0.334628 0.305928 0.527838 0.518696 0.444275 0.393707 0.404208 0.384483
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
265. 
patient tongue id: 03261701182774_2
label yaofang:
甘草 茯苓 桔梗 龙骨 薏苡仁 白术 浙贝母 枇杷叶 苦杏仁 蝉蜕 浮小麦 百合 木蝴蝶 青果
0.630185 0.374426 0.434712 0.355328 0.435442
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
266. 
patient tongue id: 04181951396891_3
label yaofang:
甘草 白芍 薏苡仁 党参 白术 熟附子 山药 天麻 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 红豆杉
0.957926 0.478926 0.57576 0.348364 0.335177 0.524565 0.523976 0.439776 0.414018 0.411602 0.376396
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
267. 
patient tongue id: 02211842064776_4_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 白花蛇舌草 姜半夏 炙甘草 紫苏梗 半枝莲
0.576578 0.381703 0.409292 0.327783 0.362484
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
268. 
patient tongue id: 03221701085913_1_5_6
label yaofang:
黄芪 白术 赤芍 砂仁 桑寄生 王不留行 北沙参 橘核 红豆杉 合欢皮 墨旱莲 山慈菇 蛇舌草
0.622353 0.377003 0.364906 0.405904 0.555271 0.300797
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
269. 
patient tongue id: 04061407417923_4
label yaofang:
法半夏 茯苓 前胡 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 芡实 豆蔻 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.424438 0.619678 0.434225 0.784715 0.43974 0.489654 0.333333 0.331827 0.39355 0.349574 0.659235 0.724889 0.717169 0.720741 0.367466 0.87597 0.344167 0.498652 0.471793 0.632064
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.812500, error: 0.350000
270. 
patient tongue id: 01132139334095_6_2
label yaofang:
甘草 茯苓 龙骨 远志 酸枣仁 丹参 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.930135 0.357429 0.411883 0.528714 0.362853 0.500756 0.439037 0.448833 0.325002 0.365496 0.406652
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.615385, error: 0.272727
271. 
patient tongue id: 02170909247053_1_4_7
label yaofang:
桂枝 茯苓 党参 黄芪 丹参 山药 高良姜 肉苁蓉 淫羊藿 鸡内金 仙茅 花椒
0.427179 0.333243 0.304967 0.385706 0.409383 0.378082 0.301361
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
272. 
patient tongue id: 06080137327410_1_2
label yaofang:
甘草 香附 桃仁 酸枣仁 赤芍 天麻 地骨皮 瓜蒌皮 鳖甲 王不留行 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.924234 0.312562 0.451183 0.523752 0.381281 0.333872 0.478751 0.460376 0.458478 0.376409 0.393761 0.414623
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
273. 
patient tongue id: 06011954371170_1_7
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 知母 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.942685 0.324185 0.464049 0.551023 0.359939 0.32857 0.301977 0.351944 0.553428 0.500465 0.479358 0.404474 0.428503 0.452403
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.785714, recall: 0.687500, error: 0.214286
274. 
patient tongue id: 05232008254971_6
label yaofang:
当归 木香 党参 黄芪 鸡血藤 白术 丹参 柏子仁 海螵蛸 炙甘草 百合 紫苏叶
0.628753 0.328031 0.41258 0.469844
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
275. 
patient tongue id: 03161848267142_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.334887 0.390675 0.324339 0.309002
predicted yaofang:
茯苓 黄芪 丹参 钩藤

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
276. 
patient tongue id: 01192142010436_2_7_1
label yaofang:
甘草 桃仁 白术 生地黄 浙贝母 乌药 山药 山茱萸 天麻 鳖甲 桑螵蛸 蜈蚣 天山雪莲 半枝莲
0.711531 0.408385 0.461967 0.372807 0.343877
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
277. 
patient tongue id: 05232002187688_1
label yaofang:
桂枝 甘草 白芍 陈皮 茯苓 半夏 薏苡仁 黄芪 白术 杜仲 厚朴 僵蚕 肉苁蓉 巴戟天 补骨脂 续断 粉葛 紫苏叶 五指毛桃
0.530827 0.35971 0.369996 0.492425 0.450093 0.323156 0.346918
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.714286, recall: 0.263158, error: 0.285714
278. 
patient tongue id: 03221635111112_1_2_7
label yaofang:
茯苓 黄芪 白术 砂仁 天麻 菟丝子 桑寄生 鸡内金 首乌藤 蜈蚣 稻芽 罗布麻
0.531944 0.402214 0.318975 0.394828 0.494798 0.505667 0.305566 0.322585 0.304358 0.410992 0.342381 0.35346 0.417834
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 赤芍 杜仲 郁金 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.384615, recall: 0.416667, error: 0.615385
279. 
patient tongue id: 05022035337061_1_7_2
label yaofang:
甘草 茯苓 桃仁 党参 鸡血藤 白术 丹参 砂仁 鳖甲 豆蔻 麦芽 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.806003 0.393849 0.481108 0.367047 0.338891
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.250000, error: 0.200000
280. 
patient tongue id: 02182255435587_1_6_4
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 厚朴 天麻 鳖甲 莪术 紫菀 百部 苦杏仁 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.969254 0.485863 0.58005 0.367833 0.302844 0.361727 0.543703 0.510701 0.444754 0.40951 0.409176 0.380797
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
281. 
patient tongue id: 02020855091092_6
label yaofang:
甘草 川芎 茯苓 牡蛎 白术 酸枣仁 生地黄 栀子 知母 天麻 全蝎 麦芽 浮小麦 首乌藤 百合
0.994015 0.475176 0.640875 0.33172 0.369149 0.306427 0.362176 0.719399 0.652526 0.643256 0.531352 0.575532 0.649771
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
282. 
patient tongue id: 05231757432311_5
label yaofang:
甘草 前胡 薄荷 芦根 薏苡仁 桑白皮 滑石 瓜蒌皮 射干 地龙 蜜麻黄
0.541347 0.385294 0.357057 0.368815 0.346119 0.330261
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
283. 
patient tongue id: 01201314291366_1
label yaofang:
甘草 茯苓 党参 白术 山药 砂仁 天麻 白花蛇舌草 浮小麦 首乌藤 紫苏梗 蜈蚣 合欢花 半枝莲 醋鳖甲
0.927797 0.464913 0.563784 0.337253 0.340165 0.489433 0.462838 0.384766 0.359398 0.351216 0.324183
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
284. 
patient tongue id: 03111204183204_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.423381 0.489845 0.360944 0.440897 0.521341 0.535549 0.460201 0.475445 0.423986 0.444787 0.483008 0.490603 0.303264 0.514631 0.510354 0.508265
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.250000, error: 0.812500
285. 
patient tongue id: 04141321376769_1_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄 炒苍耳子
0.439472 0.678047 0.437311 0.859265 0.495141 0.534611 0.345476 0.36493 0.410345 0.379799 0.74511 0.807964 0.776933 0.794723 0.378708 0.925956 0.361473 0.309046 0.541315 0.498946 0.680829
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
286. 
patient tongue id: 03012128168976_7_2
label yaofang:
甘草 茯苓 薏苡仁 党参 酸枣仁 郁金 山药 天麻 菟丝子 益母草 鳖甲 莪术 蜈蚣 半枝莲
0.86614 0.316246 0.437719 0.497092 0.332394 0.410808 0.302603
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
287. 
patient tongue id: 03020814555141_2_3
label yaofang:
甘草 茯苓 党参 酸枣仁 丹参 五味子 生地黄 山药 山茱萸 补骨脂 麦芽 鹿角霜 川加皮
0.927112 0.406156 0.538236 0.381869 0.47701 0.381426 0.400031 0.311866
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
288. 
patient tongue id: 01130643035378_1_2_6
label yaofang:
甘草 薏苡仁 远志 浙贝母 郁金 天麻 鳖甲 款冬花 莪术 紫菀 苦杏仁 蜈蚣 白花蛇舌 天山雪莲
0.940146 0.31254 0.492247 0.539023 0.338673 0.304051 0.324859 0.485813 0.469263 0.408481 0.378535 0.367181 0.337368
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
289. 
patient tongue id: 06182218295714_1_3
label yaofang:
甘草 陈皮 法半夏 茯苓 黄芪 白术 丹参 紫苏梗 广藿香 手参
0.852175 0.423281 0.476555 0.413668 0.338687 0.316207
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.300000, error: 0.500000
290. 
patient tongue id: 06071959301204_5_1
label yaofang:
柴胡 白芍 陈皮 法半夏 茯苓 白及 党参 白术 黄连 干姜 柿蒂 麦芽 炙甘草 紫苏梗 广藿香
0.886443 0.442456 0.510405 0.363576 0.390764 0.301113
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
291. 
patient tongue id: 05022128325973_2_5_6
label yaofang:
甘草 薏苡仁 党参 赤芍 山药 天麻 鳖甲 莪术 虎杖 黄精 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.719311 0.348352 0.466408 0.316819 0.300961 0.318205
predicted yaofang:
甘草 茯苓 党参 白术 丹参 天麻

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
292. 
patient tongue id: 04260632138967_1_4
label yaofang:
甘草 法半夏 茯苓 党参 鸡血藤 山药 砂仁 天麻 鳖甲 麦芽 白扁豆 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.936146 0.439876 0.551399 0.336988 0.320292 0.5007 0.442179 0.385539 0.317402 0.339887 0.310913
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
293. 
patient tongue id: 04222131519793_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 蜜麻黄
0.452044 0.735511 0.420439 0.917043 0.515523 0.582912 0.318057 0.369715 0.404828 0.391881 0.818845 0.872877 0.828641 0.863827 0.345602 0.957811 0.369237 0.306352 0.588812 0.499571 0.725574
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 1.000000, error: 0.380952
294. 
patient tongue id: 01110301227138_5
label yaofang:
桂枝 白芍 茯苓 薏苡仁 桃仁 蒲公英 栀子 牡丹皮 淡豆豉 败酱草
0.411407 0.340075 0.382542
predicted yaofang:
甘草 白芍 党参

------Score: precision: 0.333333, recall: 0.100000, error: 0.666667
295. 
patient tongue id: 03230712517889_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 蒲公英 党参 砂仁 莱菔子 五灵脂 仙茅 麦芽 紫苏梗 广藿香 鱼古
0.965161 0.474067 0.585595 0.371013 0.3132 0.354313 0.55758 0.520534 0.476949 0.411467 0.427259 0.423236
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
296. 
patient tongue id: 05032247476481_4_6
label yaofang:
甘草 柴胡 白芍 法半夏 黄连 赤芍 青皮 牡丹皮 郁金 山药 车前子 荆芥穗 瓜蒌皮 王不留行
0.876735 0.38254 0.496126 0.40541 0.355087
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
297. 
patient tongue id: 03021333206458_1_4
label yaofang:
甘草 前胡 桔梗 半夏 防风 薄荷 钩藤 荆芥穗 白芷 蔓荆子 香薷 辛夷 紫苏梗 广藿香 苍耳子
0.36592 0.473131 0.42681 0.565144 0.376523 0.360137 0.312014 0.314737 0.480866 0.502852 0.489098 0.479861 0.356461 0.658694 0.372575 0.310841 0.424009
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.235294, recall: 0.266667, error: 0.764706
298. 
patient tongue id: 04020823449393_2_6
label yaofang:
甘草 茯苓 前胡 桔梗 芦根 党参 浙贝母 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.966535 0.47611 0.57908 0.343937 0.304039 0.339134 0.560121 0.529755 0.458931 0.410251 0.422911 0.403739
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
299. 
patient tongue id: 01140822344814_2_5
label yaofang:
甘草 茯苓 白术 牡丹皮 黄柏 知母 山药 山茱萸 地黄 泽泻 车前子 猪苓
0.924184 0.306356 0.460591 0.541795 0.36229 0.337134 0.484649 0.481486 0.412193 0.380948 0.37797 0.34579
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
300. 
patient tongue id: 02020840424299_2_1_6
label yaofang:
甘草 龙骨 白术 酸枣仁 生地黄 山药 山茱萸 天麻 鳖甲 首乌藤 建曲 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.933851 0.314519 0.424396 0.545676 0.364369 0.309606 0.502571 0.462708 0.435422 0.351862 0.374159 0.392423
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
301. 
patient tongue id: 02241400456898_1_6_5
label yaofang:
甘草 枳壳 桔梗 牡蛎 薏苡仁 延胡索 浙贝母 川楝子 厚朴 莪术 王不留行 北沙参 广金钱草 猫爪草
0.420038 0.369728 0.315918 0.38707 0.328371
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
302. 
patient tongue id: 03020744024244_1_4_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.446955 0.386698 0.42742 0.317221
predicted yaofang:
甘草 党参 黄芪 丹参

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
303. 
patient tongue id: 05260704573725_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 牛蒡子 桃仁 远志 浙贝母 细辛 款冬花 白前 苦杏仁 紫苏梗 蜜麻黄
0.989695 0.482164 0.620055 0.357828 0.372055 0.301482 0.364818 0.700907 0.637133 0.638904 0.544162 0.573275 0.658196
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.133333, error: 0.846154
304. 
patient tongue id: 04282029420731_2
label yaofang:
甘草 法半夏 茯苓 芦根 薏苡仁 酸枣仁 竹茹 天麻 鳖甲 莪术 北沙参 蜈蚣 白花蛇舌 龙葵果
0.922697 0.440117 0.541865 0.377541 0.319534 0.482253 0.43832 0.414639 0.323226 0.346926 0.34183
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
305. 
patient tongue id: 01040009253578_7_5
label yaofang:
甘草 柴胡 枳壳 茯苓 远志 党参 白术 酸枣仁 赤芍 栀子 牡丹皮 郁金 淡豆豉 莪术 麦芽 首乌藤
0.676286 0.309498 0.435126 0.344313 0.428322 0.321591 0.303559 0.328435
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 浙贝母 天麻

------Score: precision: 0.625000, recall: 0.312500, error: 0.375000
306. 
patient tongue id: 05162132177385_2_6
label yaofang:
甘草 茯苓 党参 丹参 黄连 浙贝母 山药 山茱萸 天花粉 鳖甲 粉葛 浮小麦 白花蛇舌 天山雪莲 猫爪草
0.932198 0.320126 0.467827 0.552591 0.369883 0.300391 0.303577 0.338222 0.505764 0.508101 0.4412 0.408624 0.407007 0.378308
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.571429, recall: 0.533333, error: 0.428571
307. 
patient tongue id: 05312143408050_4
label yaofang:
甘草 羌活 独活 薏苡仁 党参 白术 杜仲 天麻 白花蛇舌草 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.829776 0.330651 0.399596 0.478917 0.385584 0.366553 0.318841
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
308. 
patient tongue id: 03301341123103_1_4_2
label yaofang:
甘草 葛根 桔梗 防风 麦冬 玄参 生地黄 赤芍 细辛 白芷 北沙参 辛夷 广藿香 炒苍耳子 人参叶 炒六神曲
0.438173 0.59712 0.399168 0.790466 0.445528 0.507689 0.333846 0.343536 0.394369 0.367342 0.681153 0.741846 0.713297 0.75578 0.377178 0.884082 0.363477 0.482333 0.472643 0.629928
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.437500, error: 0.650000
309. 
patient tongue id: 06092009242841_1_4_7
label yaofang:
陈皮 当归 半夏 防风 党参 黄芪 枸杞子 白术 浙贝母 杜仲 牛膝 厚朴 僵蚕 菟丝子 莪术 鸡内金 麦芽 紫苏叶 红豆杉
0.745222 0.391508 0.424857 0.388963 0.517636
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.157895, error: 0.400000
310. 
patient tongue id: 03040739483479_1_4_7
label yaofang:
甘草 白芍 茯苓 麦冬 党参 白术 熟附子 干姜 肉苁蓉
0.503881 0.341582 0.388492 0.442404 0.42056 0.431019 0.361563 0.375986 0.302985 0.319896 0.353199 0.314751 0.308347 0.330552 0.321629 0.307178
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.333333, error: 0.812500
311. 
patient tongue id: 01202008334044_4_1_7
label yaofang:
甘草 茯苓 橘红 太子参 生半夏 僵蚕 火麻仁 川贝母 鸡内金 枇杷叶 地龙 辛夷 紫苏叶 冬凌草
0.568771 0.434466 0.351887 0.342497 0.3645 0.31492
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
312. 
patient tongue id: 05131431364375_5
label yaofang:
甘草 白芍 当归 金银花 连翘 薏苡仁 天麻 白芷 鳖甲 皂角刺 蜈蚣 白花蛇舌 半枝莲 红豆杉 广升麻
0.883571 0.453049 0.488928 0.411104 0.30491 0.362895 0.335013
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
313. 
patient tongue id: 04192240395713_4_2
label yaofang:
甘草 黄芩 桔梗 芦根 浙贝母 乌梅 鳖甲 诃子 北沙参 苦杏仁 白花蛇舌 蜂房 岗梅根 四季青
0.959591 0.476345 0.555309 0.355186 0.336702 0.514501 0.509245 0.446753 0.406358 0.397932 0.374902
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
314. 
patient tongue id: 02251111100095_4_1
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.439854 0.65117 0.417219 0.839388 0.467156 0.531622 0.339164 0.34518 0.396377 0.361834 0.728406 0.786854 0.758852 0.79647 0.401349 0.902188 0.359643 0.510169 0.484361 0.670343
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
315. 
patient tongue id: 04252014472308_1_2
label yaofang:
甘草 白芍 枳壳 桔梗 黄芪 白术 槟榔 厚朴 肉苁蓉 火麻仁 紫菀
0.463439 0.311821 0.371336 0.384371
predicted yaofang:
甘草 白芍 党参 白术

------Score: precision: 0.750000, recall: 0.272727, error: 0.250000
316. 
patient tongue id: 02190543097042_5_7_6
label yaofang:
甘草 薏苡仁 党参 枸杞子 白术 山药 天麻 鳖甲 扁豆花 麦芽 蒺藜 蜈蚣 白花蛇舌 天山雪莲 半枝莲 龙葵果
0.976064 0.471607 0.582302 0.34073 0.342616 0.538933 0.552249 0.469781 0.45101 0.43924 0.418722
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.625000, error: 0.090909
317. 
patient tongue id: 04241825008241_4_6
label yaofang:
桂枝 柴胡 白芍 黄芩 党参 五味子 郁金 桑寄生 虎杖 白花蛇舌草 姜半夏 炙甘草 土茯苓
0.397416 0.516261 0.415938 0.305208 0.361281 0.597721 0.636418
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
318. 
patient tongue id: 05172106000479_2_1
label yaofang:
甘草 桔梗 芦根 麦冬 黄连 浙贝母 细辛 鳖甲 北沙参 白花蛇舌 蜂房 岗梅根 四季青 广升麻
0.972172 0.472793 0.564846 0.352454 0.318257 0.533903 0.562098 0.475056 0.444341 0.442886 0.398655
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
319. 
patient tongue id: 05270623438583_1_7_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 郁金 山药 天麻 僵蚕 桑寄生 麦芽 首乌藤 合欢花
0.977431 0.490827 0.599841 0.336347 0.303945 0.342943 0.565778 0.566819 0.469809 0.45198 0.451019 0.414855
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.538462, error: 0.416667
320. 
patient tongue id: 01202015416381_1_4
label yaofang:
太子参 黄芪 白术 海螵蛸 浙贝母 山药 砂仁 石斛 鸡内金 紫苏梗 红豆杉 稻芽
0.894186 0.441695 0.5229 0.396927 0.318984 0.436549 0.365977 0.388446
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.166667, error: 0.750000
321. 
patient tongue id: 02122115124088_2_6
label yaofang:
甘草 茯苓 党参 黄芪 酸枣仁 生地黄 牛膝 山药 地骨皮 蔓荆子 糯稻根 女贞子 浮小麦 首乌藤 合欢花
0.94599 0.300409 0.495811 0.554141 0.357086 0.300325 0.359584 0.497381 0.515645 0.432107 0.435314 0.404001 0.356265
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
322. 
patient tongue id: 05092119226603_6
label yaofang:
甘草 柴胡 川芎 香附 当归 茯苓 连翘 党参 生地黄 赤芍 青皮 浙贝母 苍术 益母草 王不留行
0.760528 0.408099 0.359082 0.450084 0.326971 0.300224
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
323. 
patient tongue id: 04222240029844_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.42697 0.592766 0.432802 0.767565 0.448594 0.507342 0.340892 0.357367 0.392723 0.386434 0.650678 0.717889 0.687549 0.711937 0.381138 0.846056 0.369887 0.322195 0.51822 0.470203 0.623941
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
324. 
patient tongue id: 03291341176175_6_7_1
label yaofang:
甘草 茯苓 桔梗 党参 黄芪 白术 酸枣仁 丹参 山药 蔓荆子 鳖甲 建曲 苍耳子 土茯苓 贯众
0.987945 0.479143 0.610912 0.32741 0.300291 0.329495 0.598412 0.596818 0.513635 0.468831 0.475402 0.464077
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
325. 
patient tongue id: 01312315485946_6_4
label yaofang:
甘草 川芎 当归 远志 枸杞子 赤芍 杜仲 牛膝 细辛 泽泻 天麻 全蝎 菟丝子 莪术 蛇床子 麦芽 荔枝核
0.925003 0.48519 0.526277 0.37323 0.326617 0.446696 0.402906 0.376537 0.301791 0.300697
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.200000, recall: 0.117647, error: 0.800000
326. 
patient tongue id: 01042307517024_4
label yaofang:
甘草 白芍 当归 桔梗 麦冬 玄参 生地黄 熟地黄 浙贝母 通草 百合
0.543495 0.304116 0.402852 0.369634 0.328305
predicted yaofang:
甘草 柴胡 白芍 党参 白术

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
327. 
patient tongue id: 03240624395550_1_6_2
label yaofang:
枳壳 黄芪 白术 海螵蛸 厚朴 砂仁 磁石 鸡内金 麦芽 女贞子 首乌藤 合欢皮 墨旱莲
0.680196 0.392751 0.406266 0.413591 0.509345 0.305142
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
328. 
patient tongue id: 01092053262728_5
label yaofang:
川芎 黄芩 牡蛎 麦冬 桑叶 菊花 白芷 北沙参 赭石 辛夷 桑枝 苍耳子 合欢皮
0.513834 0.35509 0.360543 0.432059 0.414378
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
329. 
patient tongue id: 02281153146165_1_4_7
label yaofang:
黄芩 桔梗 橘红 防风 金银花 薏苡仁 白前 鸡内金 苦杏仁 蜜百部 蜜枇杷叶 干鱼腥草
0.391494 0.457938 0.42112 0.386345 0.502313 0.420668 0.442935 0.341916 0.397659 0.504893 0.406786 0.434763 0.431154 0.439156
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
330. 
patient tongue id: 01061612088942_6_5
label yaofang:
甘草 柴胡 白芍 法半夏 远志 白术 黄连 山药 车前子 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.935914 0.361221 0.446215 0.535206 0.324041 0.449596 0.444191 0.372721 0.3254 0.323943
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.800000, recall: 0.500000, error: 0.200000
331. 
patient tongue id: 05262112222912_1_6_5
label yaofang:
甘草 白芍 薏苡仁 党参 白术 山药 山茱萸 泽泻 鳖甲 莪术 虎杖 蛇床子 麦芽 白花蛇舌 天山雪莲 红豆杉
0.748047 0.305458 0.34804 0.458421 0.364997
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.250000, error: 0.200000
332. 
patient tongue id: 03041110065629_1_4
label yaofang:
白芍 茯苓 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 炙甘草 制远志 木贼 酒女贞子 煅龙骨 炒酸枣仁 素馨花
0.315917 0.502842 0.373265 0.592188 0.330084 0.393963 0.457785 0.5911 0.591505 0.598181 0.364342 0.817928 0.354557 0.447823
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.214286, recall: 0.187500, error: 0.785714
333. 
patient tongue id: 04081601431148_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.623463 0.379897 0.428078 0.367646 0.432727
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
334. 
patient tongue id: 02211830317758_6_7
label yaofang:
白芍 香附 枳壳 柏子仁 海螵蛸 白芷 茵陈 豆蔻 姜半夏 炙甘草 紫苏梗
0.761525 0.397808 0.477798 0.32896 0.327843
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
335. 
patient tongue id: 01121843508326_1
label yaofang:
甘草 党参 太子参 黄芪 柏子仁 生地黄 熟地黄 火麻仁 木瓜 冬瓜子 北沙参 炒白扁豆
0.42156 0.629745 0.415657 0.804457 0.43174 0.500222 0.31058 0.338827 0.374564 0.343185 0.682388 0.758784 0.70986 0.739227 0.339864 0.88903 0.327602 0.493656 0.458331 0.626618
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.166667, error: 0.900000
336. 
patient tongue id: 04061954184075_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.983796 0.504243 0.600771 0.342209 0.300107 0.361193 0.589971 0.558458 0.485624 0.444728 0.445884 0.40978
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.083333, error: 0.916667
337. 
patient tongue id: 05131442189046_2_5
label yaofang:
甘草 黄芩 桔梗 牛蒡子 太子参 玄参 浙贝母 天花粉 鳖甲 苍耳子 白花蛇舌 蜂房 岗梅根 四季青
0.976576 0.482269 0.59259 0.318111 0.33156 0.571888 0.556621 0.451575 0.433263 0.439657 0.396225
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
338. 
patient tongue id: 04061348439195_4
label yaofang:
甘草 法半夏 葛根 前胡 桔梗 防风 荆芥穗 北柴胡 香薷 紫苏梗 广藿香 炒苍耳子
0.325592 0.562308 0.433461 0.677311 0.405038 0.444435 0.319156 0.559598 0.617649 0.61538 0.615901 0.332855 0.780984 0.414293 0.32301 0.487801
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.312500, recall: 0.416667, error: 0.687500
339. 
patient tongue id: 03022214309911_7_6_4
label yaofang:
甘草 川芎 薏苡仁 太子参 酸枣仁 生地黄 知母 天麻 鳖甲 莪术 浮小麦 首乌藤 蜈蚣 白花蛇舌 龙葵果
0.920609 0.301542 0.443422 0.538455 0.374284 0.462742 0.435774 0.400396 0.3199 0.335163 0.320331
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
340. 
patient tongue id: 04102040402642_4_6
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 蝉蜕 姜半夏 紫苏叶 广藿香 鹿衔草
0.415084 0.524541 0.444791 0.308057 0.366689 0.308045 0.625233 0.636139 0.300934
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.222222, recall: 0.166667, error: 0.777778
341. 
patient tongue id: 03192237110114_4_1
label yaofang:
甘草 薏苡仁 党参 山药 砂仁 天麻 鳖甲 茵陈 扁豆花 麦芽 紫苏梗 蜈蚣 白花蛇舌 天山雪莲
0.784947 0.383359 0.457517 0.395575 0.301093
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
342. 
patient tongue id: 05131612082027_1_2_7
label yaofang:
甘草 茯苓 党参 生地黄 牡丹皮 杜仲 山药 山茱萸 泽泻 车前子 菟丝子 桑寄生 益母草 白花蛇舌
0.977629 0.319289 0.441432 0.587617 0.339982 0.300411 0.599881 0.532763 0.52704 0.406958 0.444976 0.49921
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
343. 
patient tongue id: 04102052035309_6_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.313771 0.390879 0.493033 0.353058 0.305058 0.322076 0.321085 0.317494 0.483247 0.573869
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
344. 
patient tongue id: 01250636099448_5_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 薏苡仁 桃仁 鱼腥草 远志 浙贝母 款冬花 苇茎 苦杏仁 紫苏子
0.961465 0.487376 0.568212 0.385562 0.312209 0.366024 0.528391 0.521677 0.474229 0.427781 0.430067 0.413281
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
345. 
patient tongue id: 02111327355363_1_2_7
label yaofang:
川芎 陈皮 法半夏 防风 乳香 胆南星 藿香 荆芥穗 白芷 辛夷 苍耳子 芥子 醋没药
0.536857 0.328387 0.366204 0.328072 0.455613
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
346. 
patient tongue id: 03272235332035_1_4_7
label yaofang:
人参 当归 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子
0.455427 0.301821 0.406846 0.366691 0.340542
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
347. 
patient tongue id: 03242146453277_1_7_2
label yaofang:
甘草 枳壳 太子参 黄芪 白术 海螵蛸 厚朴 砂仁 火麻仁 鸡内金 北沙参 首乌藤 紫苏梗 合欢皮
0.476068 0.320656 0.356943 0.465608 0.477818 0.310815
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
348. 
patient tongue id: 05221902373110_3
label yaofang:
枳壳 桔梗 荆芥 防风 羌活 牛蒡子 细辛 淡竹叶 款冬花 紫菀 苦杏仁 蝉蜕 紫苏叶
0.52771 0.307736 0.306007 0.345425 0.397171
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
349. 
patient tongue id: 01040642322133_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 木香 薏苡仁 浙贝母 细辛 大腹皮 莱菔子 地骨皮 款冬花 紫苏子
0.955606 0.481118 0.562633 0.311907 0.32794 0.529169 0.505102 0.403501 0.392524 0.382949 0.341967
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
350. 
patient tongue id: 04201955406507_6_1
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 山药 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.95889 0.300981 0.451271 0.564081 0.374787 0.330406 0.344541 0.55436 0.510843 0.494891 0.399462 0.433514 0.464032
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
351. 
patient tongue id: 04211801560608_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.367291 0.638186 0.409473 0.849648 0.449207 0.557906 0.327452 0.315213 0.721008 0.774487 0.777196 0.806239 0.385824 0.901449 0.354853 0.487511 0.399476 0.631453
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.812500, error: 0.277778
352. 
patient tongue id: 03242129362043_4_6
label yaofang:
柴胡 白芍 香附 枳壳 黄芩 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.433596 0.535646 0.463029 0.332523 0.370617 0.328231 0.613896 0.634179 0.318472
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.888889, recall: 0.727273, error: 0.111111
353. 
patient tongue id: 04291605237998_1_7_2
label yaofang:
桂枝 甘草 川芎 葛根 白术 红花 赤芍 杜仲 地黄 桑寄生 续断 桑枝 骨碎补 乌梢蛇 络石藤
0.915926 0.423281 0.509339 0.443833 0.428926 0.383329 0.445237 0.306014 0.348516
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.222222, recall: 0.133333, error: 0.777778
354. 
patient tongue id: 04262141595130_4_1
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.444714 0.674464 0.404768 0.880492 0.493123 0.556943 0.336964 0.359556 0.401911 0.379203 0.776865 0.829974 0.799863 0.841351 0.394052 0.935262 0.368093 0.302263 0.531546 0.495064 0.694666
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.523810, recall: 0.785714, error: 0.476190
355. 
patient tongue id: 04181949571742_5
label yaofang:
桂枝 柴胡 白芍 黄芩 党参 五味子 郁金 虎杖 白花蛇舌草 姜半夏 炙甘草 土茯苓 溪黄草
0.341351 0.357604 0.436858 0.301506 0.320238 0.336893 0.308755 0.406033 0.506615
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.555556, recall: 0.384615, error: 0.444444
356. 
patient tongue id: 02211845094978_1_4
label yaofang:
桂枝 白芍 当归 茯苓 龙骨 牡蛎 牛蒡子 党参 黄芪 白术 附子 紫菀 炙甘草
0.576206 0.393112 0.376334 0.352945
predicted yaofang:
甘草 白芍 党参 白术

------Score: precision: 0.750000, recall: 0.230769, error: 0.250000
357. 
patient tongue id: 01132131515835_1_6
label yaofang:
甘草 桔梗 独活 薏苡仁 浙贝母 天麻 桑寄生 瓜蒌皮 豆蔻 白花蛇舌草 苦杏仁 蜈蚣 半枝莲 醋鳖甲
0.924788 0.434567 0.532434 0.419602 0.324688 0.45766 0.368133 0.414203 0.320339
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
358. 
patient tongue id: 03121857518410_4
label yaofang:
甘草 葛根 桔梗 防风 麦冬 玄参 生地黄 赤芍 白芷 北沙参 辛夷 广藿香 炒苍耳子 人参叶 炒六神曲 醋香附
0.463648 0.826403 0.41959 0.96348 0.572137 0.660878 0.30064 0.369386 0.404835 0.404657 0.894618 0.930167 0.904607 0.926081 0.352336 0.982913 0.379001 0.651358 0.533761 0.803107
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.375000, error: 0.700000
359. 
patient tongue id: 01092332436156_4
label yaofang:
党参 白术 干姜 大黄 火麻仁 炙甘草
0.582298 0.381591 0.385734 0.311954
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
360. 
patient tongue id: 02161836320574_2
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.419022 0.551884 0.418781 0.697102 0.428275 0.481322 0.346794 0.339041 0.379581 0.361592 0.589797 0.651844 0.638627 0.646689 0.375181 0.79658 0.345908 0.464361 0.434497 0.566484
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.812500, error: 0.350000
361. 
patient tongue id: 04071416038321_4
label yaofang:
陈皮 法半夏 生姜 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 广藿香 炒苍耳子
0.497825 0.846076 0.39111 0.97734 0.561935 0.683535 0.400915 0.437118 0.42275 0.925753 0.955022 0.923404 0.9511 0.311032 0.990069 0.386116 0.302487 0.666686 0.560479 0.8317
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
362. 
patient tongue id: 02120822494191_1
label yaofang:
甘草 白芍 黄芩 连翘 黄芪 白术 丹参 生地黄 菟丝子 桑寄生 益母草 皂角刺
0.949587 0.473012 0.563284 0.338154 0.303222 0.348954 0.51595 0.465036 0.399322 0.363426 0.367492 0.342086
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.166667, error: 0.833333
363. 
patient tongue id: 04061349559062_1_4
label yaofang:
甘草 法半夏 茯苓 前胡 防风 薄荷 荆芥穗 香薷 豆蔻 紫苏梗 广藿香 威灵仙 麸炒白术 炒六神曲
0.470697 0.749133 0.433813 0.905726 0.508833 0.584442 0.341196 0.394434 0.421053 0.402065 0.809527 0.862481 0.82417 0.833702 0.365195 0.948306 0.358326 0.325455 0.583585 0.534449 0.737348
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.285714, recall: 0.428571, error: 0.714286
364. 
patient tongue id: 03271921325280_2_4
label yaofang:
法半夏 茯苓 前胡 桔梗 麦冬 玉竹 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 人参叶
0.435032 0.786732 0.339616 0.950335 0.495223 0.594466 0.375827 0.449705 0.399597 0.857912 0.932081 0.875711 0.897607 0.988532 0.306568 0.635902 0.500894 0.789229
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.642857, error: 0.500000
365. 
patient tongue id: 05242113505067_7_1
label yaofang:
桂枝 甘草 川芎 法半夏 茯苓 白术 红花 杜仲 牛膝 天麻 桑螵蛸 益智 辛夷 首乌藤 天山雪莲
0.946756 0.465036 0.563205 0.359889 0.341271 0.511483 0.471217 0.417206 0.358574 0.373664 0.356064
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
366. 
patient tongue id: 01050641319963_1_2_6
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 赤芍 天麻 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.969684 0.466889 0.581438 0.349813 0.342527 0.30302 0.355591 0.593614 0.559019 0.507333 0.452419 0.47127 0.481684
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
367. 
patient tongue id: 01052209566290_4_1
label yaofang:
橘红 黄芪 白术 赤芍 海螵蛸 浙贝母 生半夏 砂仁 鸡内金 枇杷叶 蜈蚣 五指毛桃 山慈菇 稻芽 红景天
0.54678 0.354604 0.378164 0.4841 0.500505 0.332762 0.332345
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.133333, error: 0.714286
368. 
patient tongue id: 04251822492547_4
label yaofang:
麻黄 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷
0.461513 0.701263 0.418409 0.894758 0.501103 0.563892 0.328983 0.353748 0.384183 0.356344 0.793825 0.841539 0.824012 0.855109 0.406246 0.94066 0.363571 0.543876 0.5102 0.720606
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.625000, error: 0.500000
369. 
patient tongue id: 06190708280816_6_7_1
label yaofang:
桂枝 甘草 法半夏 龙骨 党参 丹参 红花 薤白 水蛭 天麻 瓜蒌皮 三棱 莪术 麦芽
0.990182 0.485439 0.611609 0.305338 0.334421 0.361964 0.646471 0.614039 0.54534 0.503559 0.511685 0.516172
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
370. 
patient tongue id: 03231040313074_6_2
label yaofang:
甘草 白芍 党参 五味子 山药 山茱萸 天麻 赤石脂 鳖甲 补骨脂 豆蔻 五倍子 建曲 蜈蚣 天山雪莲 半枝莲 广升麻
0.974795 0.308245 0.480271 0.596471 0.333559 0.320011 0.347883 0.58241 0.575039 0.497655 0.466866 0.470564 0.461041
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.529412, error: 0.307692
371. 
patient tongue id: 02122121483945_1_6
label yaofang:
甘草 木香 党参 黄芪 鸡血藤 山药 干姜 天麻 鳖甲 白扁豆 建曲 蜈蚣 半枝莲
0.98127 0.485693 0.603442 0.312008 0.313483 0.345183 0.601184 0.584725 0.475687 0.4625 0.461215 0.426702
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.538462, error: 0.416667
372. 
patient tongue id: 05140634368137_1_2_6
label yaofang:
甘草 白芍 太子参 生地黄 红花 赤芍 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤
0.976056 0.307043 0.468486 0.584289 0.365558 0.336431 0.351617 0.589957 0.572479 0.543461 0.466703 0.484655 0.520491
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
373. 
patient tongue id: 03312026599069_1_2
label yaofang:
甘草 独活 党参 白术 酸枣仁 生地黄 杜仲 天麻 桑寄生 鳖甲 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.977052 0.466395 0.588935 0.344182 0.316574 0.335939 0.584861 0.572502 0.500393 0.458547 0.469552 0.46311
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
374. 
patient tongue id: 04241841344343_4_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 白花蛇舌草 姜半夏 炙甘草 紫苏梗 山慈菇
0.310947 0.390518 0.526687 0.367664 0.497497 0.559198
predicted yaofang:
甘草 柴胡 白芍 香附 姜半夏 炙甘草

------Score: precision: 0.833333, recall: 0.416667, error: 0.166667
375. 
patient tongue id: 06031107428321_6_5
label yaofang:
甘草 陈皮 茯苓 木香 连翘 党参 黄连 槟榔 苍术 厚朴 莱菔子 扁豆花 麦芽
0.948156 0.314201 0.453938 0.547773 0.336081 0.495386 0.487548 0.404864 0.364485 0.367725 0.326097
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
376. 
patient tongue id: 01122232481532_1_2
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 山药 地黄 天麻 麦芽 广藿香 蜈蚣 半枝莲 醋鳖甲
0.965004 0.489193 0.573925 0.349916 0.33512 0.515155 0.471531 0.42113 0.355846 0.359939 0.326551
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
377. 
patient tongue id: 02212131519143_2_5
label yaofang:
甘草 黄芩 法半夏 茯苓 薄荷 牛蒡子 党参 白术 黄连 鳖甲 白花蛇舌 蜂房 岗梅根 四季青 广升麻
0.964581 0.488104 0.580064 0.342361 0.3121 0.301626 0.345294 0.565573 0.568531 0.471921 0.457107 0.457388 0.418829
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
378. 
patient tongue id: 06132023412614_1_4_7
label yaofang:
甘草 枳壳 半夏 牛蒡子 黄芪 白术 赤芍 杜仲 厚朴 肉苁蓉 莪术 鸡内金 北沙参 紫苏梗 蜈蚣
0.89586 0.446736 0.475378 0.469883 0.337703 0.385337
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
379. 
patient tongue id: 06050915326782_1_3_7
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.794322 0.404275 0.442093 0.378152
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
380. 
patient tongue id: 03261651213449_4
label yaofang:
甘草 前胡 荆芥 防风 牛蒡子 鱼腥草 浙贝母 桑白皮 紫菀 枇杷叶 紫苏叶 东风桔
0.372931 0.357791 0.33032 0.346255
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
381. 
patient tongue id: 03141605059502_1_2_7
label yaofang:
甘草 白芍 当归 山药 巴戟天 生山萸肉
0.624265 0.34123 0.342261 0.410292 0.303372
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.333333, error: 0.600000
382. 
patient tongue id: 01140810454226_6_7_5
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 大枣 茯苓 桃仁 党参 酸枣仁 丹参 黄连 红花 胆南星 莪术 首乌藤
0.974143 0.469194 0.556947 0.381531 0.302787 0.346087 0.53976 0.524298 0.516584 0.422212 0.434799 0.464207
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
383. 
patient tongue id: 01172342582375_1_2_6
label yaofang:
甘草 柴胡 白芍 香附 法半夏 茯苓 党参 酸枣仁 丹参 生地黄 牡丹皮 菟丝子 益母草 合欢花
0.957323 0.480047 0.571402 0.360746 0.305082 0.348371 0.529599 0.511448 0.444817 0.402255 0.408524 0.375982
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
384. 
patient tongue id: 01062338537439_1_4_6
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.661381 0.388312 0.459233 0.320112 0.342359
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
385. 
patient tongue id: 05182159013014_2_1
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.451889 0.425897 0.301554 0.36949 0.339788 0.370305 0.321634
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
386. 
patient tongue id: 02182009588372_4_7
label yaofang:
甘草 白芍 川芎 羌活 黄芪 牛膝 细辛 天麻 全蝎 白芷 皂角刺 辛夷 苍耳子
0.982434 0.496388 0.598511 0.333228 0.320955 0.358441 0.591908 0.579472 0.496343 0.476901 0.464915 0.435283
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
387. 
patient tongue id: 01040034403992_1_6_4
label yaofang:
甘草 川芎 桃仁 枸杞子 红花 杜仲 天麻 桑寄生 益母草 鳖甲 粉葛 沙苑子 白花蛇舌 半枝莲
0.978952 0.492011 0.600067 0.307257 0.323582 0.353519 0.589405 0.558302 0.458629 0.453903 0.450265 0.415859
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
388. 
patient tongue id: 05312152047031_6_4_1
label yaofang:
甘草 枳壳 法半夏 党参 丹参 赤芍 薤白 天麻 瓜蒌皮 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜 宽筋藤
0.977762 0.455484 0.591182 0.338398 0.359109 0.311478 0.366977 0.641452 0.58336 0.549896 0.47694 0.50592 0.549029
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
389. 
patient tongue id: 04182032359196_9
label yaofang:
枳壳 牛蒡子 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶 独脚金
0.371392 0.338478 0.43798 0.318781 0.37053 0.336485 0.466431
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
390. 
patient tongue id: 03272250374718_4_3
label yaofang:
桂枝 茯苓 桔梗 半夏 党参 黄芪 白术 砂仁 莱菔子 鸡内金 麦芽 炙甘草
0.801995 0.406466 0.447589 0.38381 0.331641
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
391. 
patient tongue id: 05171900213570_1
label yaofang:
陈皮 茯苓 前胡 防风 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.429621 0.60562 0.424391 0.806822 0.449514 0.47797 0.348978 0.325118 0.371077 0.341308 0.682307 0.752601 0.737726 0.756164 0.407378 0.898257 0.325657 0.492729 0.471744 0.656213
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
392. 
patient tongue id: 03291624470070_1_2_6
label yaofang:
甘草 桔梗 薏苡仁 浙贝母 天麻 鳖甲 紫菀 百部 苦杏仁 炙麻黄 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.930405 0.465572 0.53143 0.382384 0.32449 0.44901 0.439539 0.417659 0.346409 0.344096 0.330201
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
393. 
patient tongue id: 04130636245448_1_6
label yaofang:
甘草 法半夏 茯苓 前胡 薏苡仁 党参 郁金 砂仁 莱菔子 天麻 鳖甲 款冬花 莪术 蜈蚣 白花蛇舌 天山雪莲
0.867802 0.300644 0.408253 0.51319 0.321471 0.418754
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
394. 
patient tongue id: 04142237189321_2
label yaofang:
甘草 前胡 桔梗 金银花 连翘 薄荷 芦根 牛蒡子 桑叶 菊花 白前 苦杏仁 紫苏叶 木蝴蝶
0.56655 0.370249 0.367824 0.385561
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
395. 
patient tongue id: 06071205262413_1_3
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.479765 0.358277 0.350942 0.406644 0.334748
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
396. 
patient tongue id: 01062343401491_3_5_8
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.96714 0.509013 0.503418 0.468933 0.419501 0.341082 0.324353
predicted yaofang:
甘草 茯苓 党参 天麻 鳖甲 蜈蚣 白花蛇舌

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
397. 
patient tongue id: 04122045022755_3_4
label yaofang:
甘草 薏苡仁 党参 熟附子 赤芍 杜仲 天麻 桑寄生 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.815113 0.325533 0.379399 0.461108 0.396177 0.327813 0.312964
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
398. 
patient tongue id: 01122231511043_5_6
label yaofang:
甘草 蒲公英 党参 黄芪 白术 黄连 郁金 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 红豆杉 广升麻
0.941038 0.481612 0.535302 0.351612 0.318941 0.502044 0.439004 0.411728 0.32299 0.334706 0.307059
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
399. 
patient tongue id: 03061805430610_1_5
label yaofang:
甘草 茯苓 远志 牡丹皮 黄柏 山药 巴戟天 金樱子 蛇床子 麦芽 苦参 白扁豆 土茯苓
0.839221 0.317253 0.468894 0.482482 0.408143 0.301005 0.329206 0.396908 0.374298 0.387019 0.304428 0.303723
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
400. 
patient tongue id: 02190438125539_1_2_4
label yaofang:
甘草 远志 党参 生地黄 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲 宽筋藤
0.886527 0.438594 0.517395 0.380716 0.316459 0.431399 0.307722 0.343998
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
401. 
patient tongue id: 02142003339952_4
label yaofang:
桂枝 柴胡 黄芩 党参 虎杖 白花蛇舌草 姜半夏 炙甘草 土茯苓
0.441346 0.355971
predicted yaofang:
甘草 党参

------Score: precision: 0.500000, recall: 0.111111, error: 0.500000
402. 
patient tongue id: 04061835397566_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.463156 0.728107 0.405305 0.918657 0.497809 0.587122 0.320276 0.374107 0.423002 0.402518 0.822727 0.8743 0.833362 0.875194 0.353321 0.959821 0.380897 0.301339 0.579191 0.509724 0.732205
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.761905, recall: 1.000000, error: 0.238095
403. 
patient tongue id: 02211359023524_1_2_7
label yaofang:
甘草 麦冬 太子参 枸杞子 玄参 生地黄 牡丹皮 知母 山药 天麻 天花粉 北沙参 黄精
0.590631 0.326618 0.423905 0.454473 0.314587 0.313159
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
404. 
patient tongue id: 04132037495241_5_2
label yaofang:
甘草 茯苓 桔梗 橘红 党参 丹参 僵蚕 枇杷叶 北沙参 咸竹蜂
0.450385 0.307728 0.36871 0.416422 0.474542 0.402527 0.315331 0.366451 0.328337
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 车前子

------Score: precision: 0.444444, recall: 0.400000, error: 0.555556
405. 
patient tongue id: 04130630379678_1_6
label yaofang:
甘草 法半夏 茯苓 枸杞子 白术 天麻 鳖甲 麦芽 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.983228 0.485883 0.607222 0.31004 0.301732 0.338983 0.59156 0.578059 0.478983 0.458577 0.454895 0.428913
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
406. 
patient tongue id: 03091844112760_2_4
label yaofang:
麻黄 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.420022 0.64328 0.416064 0.816586 0.452529 0.49047 0.321194 0.338563 0.389346 0.345513 0.691298 0.777698 0.734485 0.741479 0.350351 0.914619 0.314463 0.499345 0.457457 0.642983
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
407. 
patient tongue id: 05250737519819_2_6_7
label yaofang:
甘草 法半夏 茯苓 丹参 青皮 浙贝母 牡丹皮 郁金 灯心草 白芷 天花粉 瓜蒌皮 皂角刺
0.948128 0.450574 0.557744 0.338249 0.331398 0.508608 0.439857 0.384643 0.316999 0.330347
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.200000, recall: 0.153846, error: 0.800000
408. 
patient tongue id: 02020839283105_6_4
label yaofang:
甘草 茯苓 远志 党参 白术 天麻 鳖甲 扁豆花 麦芽 佛手 蜈蚣 白花蛇舌 天山雪莲 半枝莲 木棉花
0.947958 0.352081 0.408011 0.538213 0.342725 0.492853 0.40433 0.434936 0.310669 0.354026
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.600000, error: 0.100000
409. 
patient tongue id: 06022243164161_1_4_7
label yaofang:
枳壳 茯苓 半夏 党参 太子参 枸杞子 白术 杜仲 牛膝 郁金 厚朴 菟丝子 鸡内金 莲子 北沙参 紫苏梗 红豆杉 土茯苓 预知子
0.540746 0.363951 0.387325 0.513139 0.501692 0.371329 0.306374 0.354276
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.750000, recall: 0.315789, error: 0.250000
410. 
patient tongue id: 03151855349633_1_7
label yaofang:
桂枝 当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.307437 0.304758 0.413172 0.31603 0.304125 0.300743 0.532759
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
411. 
patient tongue id: 04192251436734_6
label yaofang:
甘草 白芍 川芎 茯苓 橘红 防风 黄芪 白术 酸枣仁 五味子 浙贝母 山茱萸 仙茅 麦芽 辛夷 苍耳子 蜂房
0.977358 0.492748 0.601828 0.322513 0.318638 0.300737 0.346891 0.589413 0.57995 0.477797 0.470047 0.46761 0.432557
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.235294, error: 0.692308
412. 
patient tongue id: 05270618578477_1_2_6
label yaofang:
甘草 白芍 枳壳 当归 木香 仙鹤草 茜草 天麻 地榆 赤石脂 鳖甲 补骨脂 豆蔻 蜈蚣 半枝莲 红豆杉
0.971647 0.491242 0.580425 0.317287 0.330899 0.55063 0.54022 0.446092 0.426528 0.416769 0.382032
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
413. 
patient tongue id: 02181626041591_2_1
label yaofang:
甘草 枳壳 防风 生地黄 茜草 天麻 地榆 槐花 鳖甲 火麻仁 五倍子 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.90248 0.466633 0.509685 0.385297 0.301588 0.380038 0.373469 0.358529
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
414. 
patient tongue id: 04171811296364_1
label yaofang:
陈皮 桔梗 海螵蛸 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.404115 0.506964 0.407352 0.350392 0.304862 0.58239 0.62878 0.300067
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.375000, recall: 0.272727, error: 0.625000
415. 
patient tongue id: 05232001453630_2_7
label yaofang:
甘草 半夏 黄芪 枸杞子 白术 牡丹皮 郁金 山茱萸 厚朴 淡豆豉 砂仁 莪术 麦芽 预知子
0.550982 0.363836 0.422047 0.425369 0.341126 0.33082
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
416. 
patient tongue id: 02211402073496_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 淡竹叶 北沙参
0.429261 0.321305 0.357239 0.546517 0.364506 0.323074 0.301719 0.358736
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
417. 
patient tongue id: 03231120386377_5_1
label yaofang:
甘草 柴胡 白芍 薏苡仁 白术 黄柏 郁金 苍术 山药 车前子 荆芥穗 鳖甲 白花蛇舌草 蜈蚣 天山雪莲 红豆杉
0.947719 0.438604 0.529151 0.399208 0.463185 0.437945 0.442625 0.314137 0.333279 0.360684
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.312500, error: 0.500000
418. 
patient tongue id: 05180832586570_6_7_2
label yaofang:
桂枝 甘草 柴胡 白芍 枳壳 茯苓 党参 白术 黄连 红花 肉桂 山茱萸 干姜 王不留行 浮小麦 艾叶
0.938688 0.320487 0.403604 0.537535 0.32509 0.490478 0.393355 0.38306 0.301927
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.555556, recall: 0.312500, error: 0.444444
419. 
patient tongue id: 03081811438533_6
label yaofang:
龙骨 丹参 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.307482 0.410783 0.301053 0.398234 0.514954
predicted yaofang:
柴胡 白芍 党参 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
420. 
patient tongue id: 06140811569035_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.508573 0.330472 0.352162 0.428502 0.453669 0.411151 0.327338 0.357733 0.302101
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 夏枯草

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
421. 
patient tongue id: 04102057235415_3
label yaofang:
茯苓 桔梗 薏苡仁 麦冬 党参 白术 附子 山药 干姜 砂仁 鸡内金 麦芽 北沙参 炙甘草 稻芽
0.39477 0.333142 0.346903 0.355649 0.318624
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
422. 
patient tongue id: 05290758413287_1_2
label yaofang:
甘草 茯苓 桔梗 玉竹 太子参 浙贝母 天麻 白花蛇舌草 北沙参 苦杏仁 蜈蚣 半枝莲 醋鳖甲 化橘红
0.935747 0.454243 0.545709 0.391859 0.340092 0.458576 0.441122 0.41023 0.340966 0.345063 0.324857
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
423. 
patient tongue id: 01052107241455_1_2
label yaofang:
陈皮 当归 熟地 茯苓 五味子 细辛 干姜 生地 炙甘草 法夏
0.802788 0.358168 0.351831 0.466881 0.364806
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
424. 
patient tongue id: 02190545136525_5_1
label yaofang:
甘草 防风 金银花 连翘 黄芪 白术 玄参 五味子 生地黄 牡丹皮 仙鹤草 茜草 水牛角 淡竹叶 麦芽 白鲜皮
0.858569 0.332586 0.413542 0.498781 0.340749 0.46389 0.329976 0.341743
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.125000, error: 0.750000
425. 
patient tongue id: 02122101348965_6_5_1
label yaofang:
柴胡 白芍 黄芩 法半夏 大枣 茯苓 龙骨 牡蛎 党参 竹茹 郁金 石菖蒲 大黄 炙甘草 浮小麦 合欢花
0.938854 0.329381 0.457169 0.540668 0.333432 0.498173 0.468472 0.406041 0.3468 0.35738 0.327884
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
426. 
patient tongue id: 05261933056225_1_4_7
label yaofang:
陈皮 半夏 党参 黄芪 枸杞子 白术 杜仲 牛膝 郁金 山药 厚朴 僵蚕 菟丝子 鸡内金 紫苏梗 红豆杉
0.562821 0.36987 0.391983 0.397412 0.404095
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
427. 
patient tongue id: 04112028460285_1_2
label yaofang:
甘草 茯苓 党参 白术 丹参 郁金 山药 天麻 鳖甲 王不留行 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.94828 0.440122 0.551093 0.369592 0.303658 0.492884 0.458553 0.429708 0.329809 0.355871 0.362665
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
428. 
patient tongue id: 05022224296344_2_6
label yaofang:
甘草 柴胡 白芍 黄芩 茯苓 桃仁 党参 白术 生地黄 菟丝子 益母草 淫羊藿 仙茅 合欢花
0.98605 0.50396 0.611086 0.312174 0.330873 0.350529 0.608527 0.595975 0.499019 0.486405 0.475947 0.449593
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
429. 
patient tongue id: 02182149310238_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 干姜 款冬花 苦杏仁 紫苏子 炙麻黄
0.952491 0.473737 0.552431 0.345618 0.319625 0.510813 0.483265 0.421186 0.368303 0.372899 0.346455
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
430. 
patient tongue id: 05022215346235_2_6
label yaofang:
甘草 党参 玄参 赤芍 浙贝母 郁金 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲 猫爪草
0.972896 0.478628 0.585992 0.33488 0.32981 0.529833 0.535762 0.441814 0.423696 0.418069 0.386244
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
431. 
patient tongue id: 05260646327673_4_7
label yaofang:
甘草 陈皮 法半夏 茯苓 牛蒡子 桃仁 白术 红花 赤芍 浙贝母 细辛 紫苏梗 威灵仙 田七末
0.941988 0.442714 0.53749 0.451062 0.325439 0.454103 0.392299 0.448063 0.310813 0.346314
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
432. 
patient tongue id: 05290759440515_2_5
label yaofang:
甘草 法半夏 茯苓 麦冬 太子参 生地黄 栀子 石膏 山药 青蒿 淡竹叶 北沙参
0.985506 0.476798 0.59842 0.351971 0.30831 0.340847 0.613078 0.598197 0.547964 0.483074 0.500444 0.512056
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.250000, error: 0.750000
433. 
patient tongue id: 03091905364448_6
label yaofang:
甘草 川芎 栀子 牡丹皮 杜仲 牛膝 天麻 桑寄生 鳖甲 麦芽 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.987382 0.473515 0.616975 0.360573 0.359317 0.358282 0.679595 0.631282 0.615462 0.537069 0.563854 0.626424
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
434. 
patient tongue id: 06190139080832_1_7
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 党参 白术 郁金 厚朴 砂仁 麦芽 紫苏梗 广藿香 木棉花 火炭母 救必应
0.906483 0.436979 0.54565 0.307714 0.322458 0.484442 0.302298
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.235294, error: 0.428571
435. 
patient tongue id: 03081847078615_4
label yaofang:
麻黄 陈皮 前胡 半夏 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香
0.468814 0.773414 0.426771 0.93779 0.518045 0.599672 0.315303 0.360037 0.401003 0.38251 0.843459 0.895556 0.860266 0.882008 0.344593 0.972209 0.361113 0.602063 0.520694 0.75591
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
436. 
patient tongue id: 04201942212243_1_2_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.869575 0.385061 0.491633 0.396069 0.336376
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 1.000000, recall: 0.357143, error: 0.000000
437. 
patient tongue id: 06181659305358_5
label yaofang:
甘草 连翘 牛蒡子 蒲公英 黄芪 赤芍 浙贝母 牡丹皮 桑叶 桑白皮 白鲜皮 辛夷 蜈蚣 姜黄 土牛膝
0.78931 0.300141 0.412009 0.448967 0.426388 0.310683 0.306638
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.133333, error: 0.714286
438. 
patient tongue id: 04131848339695_1
label yaofang:
甘草 茯苓 半夏 黄芪 白术 丹参 海螵蛸 浙贝母 杜仲 厚朴 砂仁 僵蚕 莪术 北沙参 紫苏叶 蛇舌草
0.610845 0.385765 0.386154 0.45108 0.549922 0.355096 0.309936 0.336484
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.875000, recall: 0.437500, error: 0.125000
439. 
patient tongue id: 03312044594120_4_7
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 独活 浙贝母 杜仲 细辛 桑寄生 款冬花 白前 牛大力
0.986294 0.481819 0.613963 0.326858 0.337565 0.308604 0.365037 0.640113 0.604008 0.532207 0.483801 0.504539 0.504299
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.153846, error: 0.846154
440. 
patient tongue id: 03040850557983_6_4
label yaofang:
甘草 川芎 陈皮 法半夏 茯苓 远志 党参 白术 酸枣仁 生地黄 竹茹 胆南星 浮小麦 首乌藤
0.825792 0.361404 0.381729 0.481163 0.361198 0.347319
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
441. 
patient tongue id: 03222038102778_1_2
label yaofang:
玉竹 黄芪 白术 五味子 熟地黄 牡丹皮 山药 山茱萸 当归尾 北沙参 辛夷 蜈蚣 猫爪草 冬凌草
0.628615 0.365047 0.417588 0.489584 0.504811 0.319235 0.306465
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
442. 
patient tongue id: 04142235021638_1_2_6
label yaofang:
甘草 白芍 陈皮 茯苓 党参 白术 黄连 延胡索 熟地黄 槟榔 乌梅 山药 茜草 砂仁 鸡内金 麦芽
0.972723 0.309667 0.497147 0.587326 0.332006 0.322448 0.302428 0.337618 0.573201 0.582455 0.48303 0.477848 0.468137 0.429544
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.428571, recall: 0.375000, error: 0.571429
443. 
patient tongue id: 03032017312703_2
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 麦冬 太子参 款冬花 紫菀 百部 北沙参 炙甘草 炒紫苏子 人参叶
0.385375 0.51744 0.43314 0.609325 0.382989 0.37941 0.323454 0.33663 0.519388 0.576565 0.546851 0.559378 0.393614 0.751755 0.387342 0.341539 0.470986
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.705882, recall: 0.857143, error: 0.294118
444. 
patient tongue id: 04181940077963_6_1
label yaofang:
甘草 柴胡 党参 赤芍 郁金 山药 天麻 鳖甲 佛手 蜈蚣 白花蛇舌 天山雪莲 红豆杉 猫爪草
0.952367 0.307316 0.469763 0.551573 0.369613 0.327088 0.492104 0.504364 0.445259 0.400075 0.397022 0.369475
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
445. 
patient tongue id: 05270620515603_1_6
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 浙贝母 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.98608 0.492264 0.606521 0.331141 0.317949 0.34885 0.608888 0.601865 0.516997 0.485767 0.491026 0.472061
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
446. 
patient tongue id: 01031815255285_1
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.399443 0.549867 0.429828 0.704692 0.404276 0.448088 0.337888 0.305357 0.33927 0.319445 0.585207 0.648452 0.633997 0.640976 0.412779 0.796336 0.318559 0.440466 0.427442 0.569155
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
447. 
patient tongue id: 01121859066674_4_1
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 钩藤 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子
0.421161 0.664088 0.403883 0.856325 0.461317 0.540113 0.306805 0.327018 0.383164 0.366559 0.731309 0.797668 0.769999 0.789493 0.339223 0.929622 0.352667 0.525309 0.477367 0.672217
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
448. 
patient tongue id: 03272238467098_1_2
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.77281 0.360991 0.480425 0.342949 0.376025
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
449. 
patient tongue id: 06171154037668_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.519101 0.404295 0.343796 0.411772 0.453905 0.387217
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
450. 
patient tongue id: 01042300325775_7
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 莪术 豆蔻 姜半夏 炙甘草 紫苏梗 瓦楞子
0.394724 0.374588 0.481715 0.32867 0.345504 0.301091 0.378964 0.456334
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.454545, error: 0.375000
451. 
patient tongue id: 03041138019642_1_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.410141 0.632598 0.436016 0.792648 0.448935 0.49885 0.327742 0.33513 0.39065 0.35004 0.684704 0.746218 0.710492 0.750255 0.383131 0.863529 0.327134 0.500227 0.468812 0.637797
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
452. 
patient tongue id: 04182158400875_2_6_1
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 党参 延胡索 乌梅 山药 益母草 鳖甲 莪术 白花蛇舌 红豆杉
0.982226 0.48436 0.600857 0.343974 0.31104 0.355521 0.588901 0.5769 0.501174 0.465196 0.471144 0.457044
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
453. 
patient tongue id: 02182016022334_7_2_6
label yaofang:
甘草 柴胡 香附 枳壳 茯苓 桃仁 丹参 生地黄 赤芍 乌药 山药 菟丝子 益母草 合欢花
0.962381 0.32098 0.473461 0.582451 0.359351 0.33298 0.304821 0.353197 0.558932 0.545455 0.474342 0.438899 0.448695 0.427757
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.285714, error: 0.714286
454. 
patient tongue id: 04130303523550_6_7_2
label yaofang:
桂枝 甘草 柴胡 白芍 香附 茯苓 桃仁 党参 黄连 红花 菟丝子 益母草
0.963257 0.437452 0.568228 0.413816 0.32234 0.531151 0.47148 0.493491 0.357257 0.393294 0.439051
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
455. 
patient tongue id: 03282217422837_5
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 金银花 连翘 芦根 浙贝母 淡竹叶 诃子 苦杏仁
0.878522 0.301983 0.367471 0.499595 0.372565 0.37083
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
456. 
patient tongue id: 01130637185885_1_2_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 鱼腥草 浙贝母 鳖甲 款冬花 紫菀 诃子 白花蛇舌 蜂房 四季青
0.945568 0.483424 0.572795 0.354867 0.317673 0.305142 0.363767 0.531379 0.519663 0.437507 0.421284 0.41675 0.389496
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
457. 
patient tongue id: 05251940285221_2_4_7
label yaofang:
甘草 茯苓 葶苈子 黄芪 枸杞子 赤芍 胆南星 浙贝母 附子 郁金 山茱萸 生半夏 全蝎 僵蚕 柿蒂 天竺黄 赭石 黑枣 土鳖虫 姜黄
0.622162 0.398987 0.393784 0.325217 0.459967
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.150000, error: 0.400000
458. 
patient tongue id: 05092237048121_6_2
label yaofang:
甘草 柴胡 香附 枳壳 茯苓 半夏 党参 白术 浙贝母 厚朴 僵蚕 夏枯草 合欢皮 预知子
0.730148 0.390848 0.405706 0.354737 0.528782
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
459. 
patient tongue id: 03221616552594_1_2
label yaofang:
甘草 白芍 川芎 香附 枳壳 黄芩 当归 党参 白术 丹参 生地黄 砂仁 菟丝子 桑寄生 莪术
0.990168 0.501156 0.626778 0.324567 0.330818 0.36407 0.634989 0.607061 0.521089 0.495103 0.499104 0.484643
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
460. 
patient tongue id: 03221307369672_5_6_1
label yaofang:
甘草 陈皮 党参 黄连 红花 牛膝 石膏 苍术 天麻 天花粉 鳖甲 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.968816 0.481539 0.592053 0.312017 0.336021 0.312658 0.357731 0.591565 0.548163 0.457478 0.435665 0.445158 0.421029
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
461. 
patient tongue id: 04131808275500_4_6
label yaofang:
甘草 柴胡 白芍 枳壳 党参 延胡索 川楝子 山药 天麻 猪苓 鳖甲 蜈蚣 天山雪莲 半枝莲
0.909084 0.303184 0.485997 0.497254 0.328583 0.44327 0.415878 0.373833 0.331063 0.313225
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
462. 
patient tongue id: 03261555596938_2
label yaofang:
桔梗 荆芥 防风 羌活 芦根 牛蒡子 细辛 苦杏仁 炙甘草 紫苑 野马追
0.518713 0.343568 0.369748 0.410948 0.382316
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
463. 
patient tongue id: 06072255368046_1_7
label yaofang:
甘草 茯苓 太子参 鸡血藤 酸枣仁 丹参 生地黄 赤芍 砂仁 天麻 鳖甲 白花蛇舌草 蜈蚣 天山雪莲 半枝莲
0.993726 0.471784 0.634125 0.35457 0.341833 0.35115 0.718765 0.64136 0.647114 0.534209 0.577515 0.664666
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
464. 
patient tongue id: 04282303197895_3_6
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 知母 山药 山茱萸 补骨脂 鹿角霜 浮小麦 百合 川加皮
0.971351 0.48302 0.589289 0.341631 0.315307 0.301935 0.355409 0.564985 0.554189 0.468224 0.448337 0.445976 0.41468
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
465. 
patient tongue id: 04020825417695_1_2
label yaofang:
甘草 白芍 陈皮 防风 桃仁 党参 枸杞子 白术 生地黄 车前子 菟丝子 桑寄生 益母草 女贞子 建曲 覆盆子
0.758611 0.350312 0.405765 0.433744 0.3133 0.329814
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
466. 
patient tongue id: 05231942379915_2_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄 麸炒白术 醋五味子
0.400888 0.729476 0.384695 0.904863 0.471069 0.561558 0.312942 0.397772 0.348314 0.785725 0.878785 0.826887 0.861557 0.302848 0.967806 0.565157 0.473465 0.730193
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.555556, recall: 0.625000, error: 0.444444
467. 
patient tongue id: 02222334070377_6_5
label yaofang:
茯苓 薏苡仁 玉竹 党参 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 山药 当归尾 砂仁 菟丝子 巴戟天 桑寄生 芡实 鸡内金 莲子 北沙参 百合 红豆杉 合欢皮 山慈菇
0.391172 0.507943
predicted yaofang:
黄芪 炙甘草

------Score: precision: 0.500000, recall: 0.041667, error: 0.500000
468. 
patient tongue id: 04200640061959_6_1
label yaofang:
甘草 白芍 川芎 牡蛎 麦冬 枸杞子 天冬 牛膝 菊花 泽泻 天麻 女贞子 墨旱莲 龟甲
0.871682 0.311304 0.486257 0.453088 0.398203
predicted yaofang:
甘草 法半夏 茯苓 党参 天麻

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
469. 
patient tongue id: 06072355512978_1_7_4
label yaofang:
甘草 川芎 党参 何首乌 黄连 赤芍 牛膝 郁金 山药 天麻 天花粉 益母草 决明子 红曲 谷精子
0.91647 0.301358 0.401989 0.531096 0.388215 0.456854 0.384454 0.400809 0.303492 0.322778
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
470. 
patient tongue id: 05092139598441_4_1_6
label yaofang:
甘草 黄芩 法半夏 桔梗 浙贝母 细辛 桑白皮 鳖甲 款冬花 紫菀 苦杏仁 白花蛇舌 蜂房 四季青
0.93918 0.456523 0.539538 0.355687 0.319886 0.506784 0.487595 0.422791 0.369767 0.38034 0.342477
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
471. 
patient tongue id: 04271529206511_1_2_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 赤芍 牛膝 郁金 六神曲
0.459553 0.337706 0.404336 0.515256 0.334375 0.339612 0.315978 0.310769 0.308093
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 牛膝 厚朴 北沙参

------Score: precision: 0.222222, recall: 0.153846, error: 0.777778
472. 
patient tongue id: 02272158459546_6_4
label yaofang:
桂枝 甘草 白芍 川芎 陈皮 枳壳 当归 茯苓 龙骨 牡蛎 牛蒡子 远志 麦冬 党参 酸枣仁 柏子仁 竹茹 牡丹皮 吴茱萸 姜半夏
0.430948 0.563675 0.467775 0.309394 0.366268 0.324414 0.670049 0.700491 0.309865
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.333333, recall: 0.150000, error: 0.666667
473. 
patient tongue id: 06031049385633_1_2_6
label yaofang:
桂枝 甘草 白芍 茯苓 党参 黄芪 白术 生地黄 赤芍 山药 山茱萸 粉葛 牛大力 千斤拔 络石藤
0.746458 0.386009 0.358622 0.435015 0.350086 0.302592
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
474. 
patient tongue id: 02120757349998_2
label yaofang:
橘红 麦冬 五味子 海螵蛸 桑叶 僵蚕 天花粉 枇杷叶 地龙 北沙参 蝉蜕 辛夷
0.478231 0.404451 0.328678 0.438815 0.427008 0.396206
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
475. 
patient tongue id: 02211207014904_1_4_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.536472 0.313191 0.301661 0.423643 0.408545 0.356112 0.318671
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
476. 
patient tongue id: 04131810034539_2
label yaofang:
甘草 黄芩 法半夏 桔梗 浙贝母 鳖甲 款冬花 紫菀 苦杏仁 白花蛇舌 蜂房 四季青 红豆杉
0.930239 0.306733 0.46883 0.546106 0.366458 0.316129 0.478145 0.474904 0.404781 0.365916 0.360579 0.324203
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
477. 
patient tongue id: 05262058549635_6_4
label yaofang:
甘草 柴胡 白芍 薏苡仁 浙贝母 郁金 天麻 白花蛇舌草 苦杏仁 浮小麦 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.89001 0.430815 0.48419 0.427264 0.303776 0.359823 0.353361
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
478. 
patient tongue id: 04272307073135_4_6
label yaofang:
甘草 柴胡 白芍 枳壳 桔梗 黄芪 白术 生地黄 槟榔 厚朴 肉苁蓉 火麻仁 柿蒂 紫菀 石上柏
0.354396 0.345163 0.458419 0.327732 0.306949 0.344022 0.489099
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
479. 
patient tongue id: 05092144585401_4_1_6
label yaofang:
甘草 白芍 陈皮 防风 羌活 薏苡仁 白术 浙贝母 天麻 鳖甲 补骨脂 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.957425 0.481084 0.574504 0.344685 0.308929 0.34421 0.526589 0.510478 0.431906 0.403586 0.398147 0.363754
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
480. 
patient tongue id: 02141954002349_1
label yaofang:
甘草 海螵蛸 枳实 肉桂 干姜 附片
0.354881 0.474101 0.354515 0.484054 0.539281
predicted yaofang:
柴胡 白芍 香附 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
481. 
patient tongue id: 03090757578761_1_5
label yaofang:
甘草 前胡 桔梗 金银花 芦根 牛蒡子 浙贝母 天麻 鳖甲 苦杏仁 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.820237 0.376369 0.486269 0.362776 0.411399
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
482. 
patient tongue id: 01042332284833_7_6
label yaofang:
甘草 羌活 远志 党参 鸡血藤 白术 地黄 天麻 白花蛇舌草 威灵仙 蜈蚣 半枝莲 醋鳖甲 乌梢蛇
0.940404 0.447498 0.542014 0.369987 0.313977 0.486565 0.467845 0.429968 0.357145 0.373529 0.371504
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
483. 
patient tongue id: 02190642028124_2_6_1
label yaofang:
甘草 党参 酸枣仁 丹参 生地黄 山药 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.97586 0.460654 0.568567 0.356732 0.318995 0.564002 0.551974 0.526725 0.4345 0.447713 0.486384
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
484. 
patient tongue id: 05232118075663_1_4_7
label yaofang:
甘草 茯苓 党参 枸杞子 白术 海螵蛸 杜仲 牛膝 郁金 山药 菟丝子 鸡内金 紫苏叶 骨碎补 合欢皮 蛇舌草
0.571582 0.382589 0.385599 0.404523 0.451124
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.250000, error: 0.200000
485. 
patient tongue id: 06190627350227_2_7
label yaofang:
甘草 川芎 龙骨 桃仁 党参 枸杞子 酸枣仁 红花 杜仲 山药 钩藤 天麻 桑寄生 女贞子 浮小麦 墨旱莲
0.968901 0.475828 0.579163 0.371497 0.304629 0.359159 0.573802 0.556993 0.501153 0.448657 0.463987 0.453296
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
486. 
patient tongue id: 04181950027741_6_1
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 杜仲 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲 红豆杉
0.959799 0.447361 0.565406 0.345035 0.3172 0.528538 0.4857 0.448723 0.360721 0.384848 0.39302
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
487. 
patient tongue id: 04121945400239_1_4
label yaofang:
甘草 木香 党参 白术 酸枣仁 山药 天麻 鳖甲 白扁豆 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.963068 0.305666 0.445018 0.54458 0.385973 0.303726 0.532707 0.508902 0.514338 0.39929 0.421648 0.474468
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
488. 
patient tongue id: 04061347093230_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.395597 0.632269 0.4312 0.790277 0.458717 0.515476 0.326032 0.324604 0.382657 0.358463 0.672737 0.744673 0.720188 0.739041 0.36941 0.877109 0.339887 0.512442 0.459151 0.628358
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
489. 
patient tongue id: 03171016103782_1_3_7
label yaofang:
黄芩 桔梗 金银花 牛蒡子 薏苡仁 蒲公英 太子参 蔓荆子 鸡内金 辛夷 苍耳子 炒六神曲
0.459085 0.357735 0.410013 0.464732 0.4086 0.314411 0.35973 0.307417
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 车前子

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
490. 
patient tongue id: 06121758067022_1
label yaofang:
甘草 川芎 当归 龙骨 牡蛎 桃仁 党参 黄芪 酸枣仁 红花 泽泻 磁石 糯稻根 浮小麦
0.744758 0.367293 0.443992 0.420324
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
491. 
patient tongue id: 03280626222610_6
label yaofang:
甘草 柴胡 香附 龙骨 牡蛎 薏苡仁 酸枣仁 黄柏 苍术 砂仁 磁石 珍珠母
0.622797 0.377769 0.402056 0.459742 0.514292 0.335096 0.318356
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
492. 
patient tongue id: 04142216117817_3_1_4
label yaofang:
桂枝 龙齿 黄芪 白术 浙贝母 牛膝 厚朴 当归尾 生半夏 砂仁 首乌藤 五指毛桃 山慈菇 鲜龙葵果
0.527744 0.349294 0.36806 0.468011 0.576206 0.386986 0.340644 0.306375
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
493. 
patient tongue id: 02122123513123_2
label yaofang:
甘草 党参 白术 酸枣仁 地黄 天麻 菟丝子 益母草 浮小麦 百合 蜈蚣 合欢花 半枝莲 醋鳖甲
0.948246 0.472404 0.565366 0.366499 0.340136 0.506691 0.475156 0.41305 0.362379 0.364369 0.334083
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
494. 
patient tongue id: 02020827264910_2_6
label yaofang:
甘草 川芎 太子参 鸡血藤 山药 山茱萸 地黄 天麻 补骨脂 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 乌梢蛇
0.974768 0.468156 0.578541 0.351113 0.341276 0.578869 0.556328 0.508217 0.443004 0.458164 0.479047
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
495. 
patient tongue id: 04211800462177_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄
0.384734 0.430111 0.379217 0.454163 0.400917
predicted yaofang:
茯苓 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
496. 
patient tongue id: 06162302142383_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 紫菀 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.431862 0.554885 0.423193 0.713557 0.42592 0.479997 0.34242 0.36539 0.392785 0.369593 0.616783 0.677224 0.637164 0.655529 0.375251 0.803384 0.373489 0.317509 0.486311 0.466887 0.59905
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.523810, recall: 0.733333, error: 0.476190
497. 
patient tongue id: 04131854052878_7_6_5
label yaofang:
麻黄 甘草 桔梗 薏苡仁 鱼腥草 太子参 海螵蛸 浙贝母 水蛭 厚朴 僵蚕 射干 莪术 石韦 北沙参 苦杏仁 苇根 蝉蜕 冬凌草 守宫
0.405456 0.373109 0.354757 0.408691
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.050000, error: 0.750000
498. 
patient tongue id: 03231437076546_4
label yaofang:
陈皮 法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.441471 0.331252 0.335339 0.47238 0.306014 0.327763
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
499. 
patient tongue id: 03101846119948_4_1
label yaofang:
玉竹 丹参 海螵蛸 浙贝母 川牛膝 土茯苓 山慈菇 粉萆薢
0.446394 0.560409 0.47149 0.320335 0.338755 0.324092 0.609294 0.615816 0.307975
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.111111, recall: 0.125000, error: 0.888889
------Average Score: average precision: 0.452003, average recall: 0.335812, error: 0.547997
