8512/8539 [============================>.] - ETA: 0s - loss: 0.1633Epoch 00000: val_loss improved from inf to 0.08598, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 72s - loss: 0.1631 - val_loss: 0.0860
Epoch 2/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0983Epoch 00001: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0983 - val_loss: 0.0875
Epoch 3/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0916Epoch 00002: val_loss improved from 0.08598 to 0.08458, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0916 - val_loss: 0.0846
Epoch 4/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0883Epoch 00003: val_loss improved from 0.08458 to 0.08265, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0883 - val_loss: 0.0826
Epoch 5/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0860Epoch 00004: val_loss improved from 0.08265 to 0.07658, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0860 - val_loss: 0.0766
Epoch 6/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0847Epoch 00005: val_loss improved from 0.07658 to 0.07593, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0847 - val_loss: 0.0759
Epoch 7/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0833Epoch 00006: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0833 - val_loss: 0.0794
Epoch 8/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0824Epoch 00007: val_loss improved from 0.07593 to 0.07553, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0824 - val_loss: 0.0755
Epoch 9/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0817Epoch 00008: val_loss improved from 0.07553 to 0.07512, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0817 - val_loss: 0.0751
Epoch 10/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0808Epoch 00009: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0809 - val_loss: 0.0753
Epoch 11/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0804Epoch 00010: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0804 - val_loss: 0.0756
Epoch 12/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0798Epoch 00011: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0798 - val_loss: 0.0766
Epoch 13/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0796Epoch 00012: val_loss improved from 0.07512 to 0.07463, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0796 - val_loss: 0.0746
Epoch 14/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0787Epoch 00013: val_loss improved from 0.07463 to 0.07412, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0787 - val_loss: 0.0741
Epoch 15/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0781Epoch 00014: val_loss improved from 0.07412 to 0.07381, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0781 - val_loss: 0.0738
Epoch 16/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0777Epoch 00015: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0777 - val_loss: 0.0764
Epoch 17/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0777Epoch 00016: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0777 - val_loss: 0.0752
Epoch 18/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0770Epoch 00017: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0770 - val_loss: 0.0743
Epoch 19/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0767Epoch 00018: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0767 - val_loss: 0.0739
Epoch 20/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0765Epoch 00019: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0764 - val_loss: 0.0745
Epoch 21/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0760Epoch 00020: val_loss improved from 0.07381 to 0.07308, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0759 - val_loss: 0.0731
Epoch 22/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0755Epoch 00021: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0755 - val_loss: 0.0733
Epoch 23/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0754Epoch 00022: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0754 - val_loss: 0.0749
Epoch 24/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0749Epoch 00023: val_loss improved from 0.07308 to 0.07304, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0749 - val_loss: 0.0730
Epoch 25/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0748Epoch 00024: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0748 - val_loss: 0.0734
Epoch 26/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0742Epoch 00025: val_loss improved from 0.07304 to 0.07252, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 66s - loss: 0.0742 - val_loss: 0.0725
Epoch 27/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0742Epoch 00026: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0742 - val_loss: 0.0742
Epoch 28/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0738Epoch 00027: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0738 - val_loss: 0.0736
Epoch 29/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0737Epoch 00028: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0737 - val_loss: 0.0728
Epoch 30/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0733Epoch 00029: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0733 - val_loss: 0.0732
Epoch 31/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0731Epoch 00030: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0731 - val_loss: 0.0728
Epoch 32/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0728Epoch 00031: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0728 - val_loss: 0.0732
Epoch 33/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0725Epoch 00032: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0725 - val_loss: 0.0738
Epoch 34/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0724Epoch 00033: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0723 - val_loss: 0.0731
Epoch 35/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0721Epoch 00034: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0721 - val_loss: 0.0735
Epoch 36/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0717Epoch 00035: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0717 - val_loss: 0.0735
Epoch 37/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0715Epoch 00036: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0715 - val_loss: 0.0730
Epoch 38/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0716Epoch 00037: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0716 - val_loss: 0.0729
Epoch 39/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0711Epoch 00038: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0711 - val_loss: 0.0733
Epoch 40/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0709Epoch 00039: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0709 - val_loss: 0.0752
Epoch 41/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0706Epoch 00040: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0706 - val_loss: 0.0745
Epoch 42/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0705Epoch 00041: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0705 - val_loss: 0.0728
Epoch 43/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0703Epoch 00042: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0703 - val_loss: 0.0736
Epoch 44/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0700Epoch 00043: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0700 - val_loss: 0.0749
Epoch 45/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0697Epoch 00044: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0697 - val_loss: 0.0735
Epoch 46/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0695Epoch 00045: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0695 - val_loss: 0.0730
Epoch 47/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0693Epoch 00046: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0693 - val_loss: 0.0736
Epoch 48/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0690Epoch 00047: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0690 - val_loss: 0.0741
Epoch 49/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0687Epoch 00048: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0687 - val_loss: 0.0736
Epoch 50/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0686Epoch 00049: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0686 - val_loss: 0.0738
Epoch 51/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0684Epoch 00050: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0684 - val_loss: 0.0740
Epoch 52/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0682Epoch 00051: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0682 - val_loss: 0.0737
Epoch 53/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0679Epoch 00052: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0679 - val_loss: 0.0740
Epoch 54/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0677Epoch 00053: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0677 - val_loss: 0.0745
Epoch 55/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0675Epoch 00054: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0675 - val_loss: 0.0743
Epoch 56/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0674Epoch 00055: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0674 - val_loss: 0.0744
Epoch 57/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0671Epoch 00056: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0671 - val_loss: 0.0758
Epoch 58/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0668Epoch 00057: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0668 - val_loss: 0.0753
Epoch 59/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0666Epoch 00058: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0666 - val_loss: 0.0748
Epoch 60/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00059: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0660 - val_loss: 0.0750
Epoch 61/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0661Epoch 00060: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0661 - val_loss: 0.0753
Epoch 62/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00061: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0660 - val_loss: 0.0749
Epoch 63/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0657Epoch 00062: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0657 - val_loss: 0.0753
Epoch 64/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0652Epoch 00063: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0652 - val_loss: 0.0755
Epoch 65/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0652Epoch 00064: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0652 - val_loss: 0.0761
Epoch 66/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0649Epoch 00065: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0649 - val_loss: 0.0762
Epoch 67/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0644Epoch 00066: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0644 - val_loss: 0.0772
Epoch 68/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0644Epoch 00067: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0644 - val_loss: 0.0759
Epoch 69/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0641Epoch 00068: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0641 - val_loss: 0.0761
Epoch 70/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0640Epoch 00069: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0639 - val_loss: 0.0763
Epoch 71/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0637Epoch 00070: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0637 - val_loss: 0.0759
Epoch 72/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0635Epoch 00071: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0635 - val_loss: 0.0760
Epoch 73/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0633Epoch 00072: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0632 - val_loss: 0.0768
Epoch 74/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0632Epoch 00073: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0631 - val_loss: 0.0768
Epoch 75/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0628Epoch 00074: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0628 - val_loss: 0.0766
Epoch 76/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0626Epoch 00075: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0626 - val_loss: 0.0770
Epoch 77/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0624Epoch 00076: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0624 - val_loss: 0.0769
Epoch 78/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0623Epoch 00077: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0623 - val_loss: 0.0772
Epoch 79/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0620Epoch 00078: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0621 - val_loss: 0.0767
Epoch 80/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0620Epoch 00079: val_loss did not improve
8539/8539 [==============================] - 66s - loss: 0.0620 - val_loss: 0.0768
history: [(0.16307294084035565, None, 0.085975407735332021, None), (0.098306495693252352, None, 0.087476564250586239, None), (0.09159122837683624, None, 0.084582667347494062, None), (0.088255458730091357, None, 0.082648455468944573, None), (0.086030444402314415, None, 0.076575726543590697, None), (0.084732382440821097, None, 0.075925353682521499, None), (0.083292863651410323, None, 0.079399690987207949, None), (0.082386662827357293, None, 0.07553019753960899, None), (0.081704134209008891, None, 0.075119035475419996, None), (0.080852418015001523, None, 0.075308845729836621, None), (0.080387309462352077, None, 0.07558056444693835, None), (0.079810839487973309, None, 0.07664550295024565, None), (0.079621752585972733, None, 0.074628013230505441, None), (0.078728109941938781, None, 0.074121970369483967, None), (0.07809966736807869, None, 0.073809167950144611, None), (0.077675567646923724, None, 0.076392489038544259, None), (0.077655886194440429, None, 0.075247798155952283, None), (0.077033570299579662, None, 0.074298041534947831, None), (0.076670497030260576, None, 0.073923923266239658, None), (0.076443752737887949, None, 0.074460766690991304, None), (0.075927985376413487, None, 0.073075492030534983, None), (0.075546355543950214, None, 0.073302247885600982, None), (0.075422782850099374, None, 0.07493029076319474, None), (0.07491981131590171, None, 0.073039414954709489, None), (0.074778154288204932, None, 0.073436133208728965, None), (0.07424625286502852, None, 0.072516885760066277, None), (0.074188794565083538, None, 0.074248885769983786, None), (0.073831157944027642, None, 0.073588807777170737, None), (0.073694515823689702, None, 0.072792248138577945, None), (0.073331712008164768, None, 0.073180857268008562, None), (0.073097467827341819, None, 0.072764172003819391, None), (0.072781676979935525, None, 0.073202924686910475, None), (0.072484641422612808, None, 0.073762635935793866, None), (0.072348350421028731, None, 0.073098892966906234, None), (0.072081308034910141, None, 0.073518787548218889, None), (0.071713079624327353, None, 0.073517232723943476, None), (0.071506128017008064, None, 0.073002893545907055, None), (0.071600879703839576, None, 0.072923614483176566, None), (0.071122464628887758, None, 0.073327152283637079, None), (0.07094269123097216, None, 0.075150431621642338, None), (0.07057286788832598, None, 0.074544586295828275, None), (0.070518889556599518, None, 0.072803501653802269, None), (0.070293711954061366, None, 0.073580720594951091, None), (0.070038300352669502, None, 0.074922639044213202, None), (0.069702069191208679, None, 0.073461452956164713, None), (0.069484987671899631, None, 0.073039873915932557, None), (0.069279969154755344, None, 0.073646268892637534, None), (0.069001169812659746, None, 0.074089988656751399, None), (0.068681833531569231, None, 0.073609930964616627, None), (0.068592570443764295, None, 0.073757596041038362, None), (0.068428713284299392, None, 0.074012958604992532, None), (0.068157762939958719, None, 0.073747438880113453, None), (0.067863524246305165, None, 0.074039115437439504, None), (0.067716981218771122, None, 0.074453896382352808, None), (0.067509104762218053, None, 0.074310230602929878, None), (0.067422107704064926, None, 0.074414866720582104, None), (0.067079553631244376, None, 0.075781309042439793, None), (0.066776395530740607, None, 0.075322718356118534, None), (0.066602258232232064, None, 0.074812421813989297, None), (0.06599250800199985, None, 0.074991322671755761, None), (0.066080646080055788, None, 0.075253658460610079, None), (0.065957742620930071, None, 0.074854214126482993, None), (0.065674747102069886, None, 0.075335221794935375, None), (0.065246945463224765, None, 0.075531736289188536, None), (0.065176903938001851, None, 0.076059608150532837, None), (0.064871921012836176, None, 0.076196893804020935, None), (0.064404786749932594, None, 0.077168807933182065, None), (0.064384273730112837, None, 0.075935948735628367, None), (0.064099831404305127, None, 0.076060720606819621, None), (0.063917901468599464, None, 0.076309021466817617, None), (0.063717120424452225, None, 0.075912874342102712, None), (0.063495299943242559, None, 0.075961368424551826, None), (0.063244631186097994, None, 0.076760959139455368, None), (0.063127704816304878, None, 0.076783981815580923, None), (0.062807420319480015, None, 0.076569132261223846, None), (0.06262508020265653, None, 0.077033146151474538, None), (0.062353812212641226, None, 0.076871838816356314, None), (0.062261514367418135, None, 0.077178199867625807, None), (0.062055221879519964, None, 0.076725225472624919, None), (0.061964292488865695, None, 0.076782495110899532, None)]
0. 
patient tongue id: 04182205587528_5_1_7
label yaofang:
枳壳 薏苡仁 黄芪 白术 浙贝母 厚朴 地榆 槐花 北沙参 红豆杉 合欢皮 预知子 蛇舌草 稻芽
0.488511 0.418243 0.438189 0.376596 0.519889 0.563583 0.310273 0.407618 0.334757 0.359314 0.332883
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
1. 
patient tongue id: 05021508202689_1_4_7
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 天麻 桑寄生 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.487637 0.399348 0.455575 0.413532 0.383716
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
2. 
patient tongue id: 03312130132536_6_1_4
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 党参 酸枣仁 浙贝母 天麻 鳖甲 白前 麦芽 蒺藜 蜈蚣 天山雪莲 半枝莲
0.906741 0.455525 0.525804 0.486639 0.319582 0.40165 0.35293 0.438731
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.352941, error: 0.250000
3. 
patient tongue id: 02122107148190_4_7_1
label yaofang:
麻黄 甘草 黄芩 法半夏 前胡 桃仁 远志 五味子 细辛 干姜 鳖甲 白前 地龙 白花蛇舌
0.925047 0.48169 0.323584 0.557868 0.470049 0.313287 0.357067 0.479488 0.463131 0.490298 0.364637 0.37461 0.374362
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
4. 
patient tongue id: 06182030018322_2_1_3
label yaofang:
丹参 天冬 钩藤 天麻 北沙参 女贞子 赭石 首乌藤 玉米须 合欢皮 墨旱莲 罗布麻
0.350607 0.43187 0.388717 0.426474 0.331655 0.407613 0.367738
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
5. 
patient tongue id: 05162048197214_2
label yaofang:
甘草 太子参 生地黄 浙贝母 黄柏 细辛 砂仁 白芷 鳖甲 北沙参 辛夷 白花蛇舌 天山雪莲 蜂房 四季青
0.991382 0.506639 0.637193 0.40705 0.368577 0.644746 0.654339 0.617137 0.519797 0.5232 0.518305
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
6. 
patient tongue id: 05032209361836_6
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.763278 0.357097 0.42602 0.48408 0.443134 0.312855
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
7. 
patient tongue id: 02182252409847_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 黄连 延胡索 川楝子 郁金 砂仁 五灵脂 柿蒂 麦芽 佛手 合欢花
0.946159 0.310709 0.49163 0.305798 0.571272 0.441699 0.326449 0.351287 0.518322 0.517861 0.498177 0.413718 0.414709 0.402039
predicted yaofang:
甘草 白芍 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.142857, recall: 0.133333, error: 0.857143
8. 
patient tongue id: 04181948547886_4_6
label yaofang:
甘草 陈皮 法半夏 茯苓 羌活 独活 连翘 薏苡仁 远志 党参 苍术 厚朴 砂仁 莱菔子 麦芽
0.953537 0.485205 0.316592 0.585338 0.42414 0.36164 0.546355 0.535593 0.521418 0.431022 0.433243 0.430763
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
9. 
patient tongue id: 01062353212507_1_6
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.443678 0.364551 0.450151 0.437735 0.301177 0.316589
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
10. 
patient tongue id: 05172118379077_6_7
label yaofang:
甘草 川芎 茯苓 枸杞子 白术 生地黄 牡丹皮 杜仲 山药 山茱萸 天麻 桑寄生 麦芽 地龙
0.923566 0.476605 0.323317 0.545539 0.473231 0.305942 0.359255 0.464158 0.447209 0.498538 0.34336 0.351812 0.358298
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
11. 
patient tongue id: 02182258536887_2_6
label yaofang:
甘草 柴胡 白芍 川芎 枳壳 当归 何首乌 生地黄 黄柏 砂仁 菟丝子 五灵脂 桑寄生 益母草 艾叶
0.969225 0.48938 0.314101 0.589432 0.441148 0.357234 0.534217 0.53428 0.551375 0.409896 0.419889 0.408996
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.066667, error: 0.916667
12. 
patient tongue id: 02191628432476_6_1
label yaofang:
甘草 白芍 茯苓 薏苡仁 党参 生地黄 浙贝母 栀子 牡丹皮 山药 细辛 鳖甲 白花蛇舌 天山雪莲 骨碎补
0.730848 0.42842 0.478664 0.303119 0.366852 0.40789 0.302379
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 党参 款冬花

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
13. 
patient tongue id: 05191953551582_2_5
label yaofang:
甘草 黄芩 芦根 牛蒡子 浙贝母 栀子 乌梅 黄柏 天花粉 白花蛇舌草 北沙参 蜂房 醋鳖甲 岗梅
0.966607 0.489409 0.603981 0.413878 0.343977 0.541734 0.529482 0.498172 0.407859 0.413054 0.402142
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
14. 
patient tongue id: 04062010470215_4
label yaofang:
甘草 白芍 川芎 独活 牛膝 细辛 干姜 仙鹤草 地榆 蜈蚣 姜黄 海桐皮 鹿衔草
0.48248 0.404416 0.400972 0.387855 0.47811
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
15. 
patient tongue id: 03062145390911_1_5
label yaofang:
甘草 陈皮 桃仁 蒲公英 黄芪 延胡索 海螵蛸 浙贝母 厚朴 砂仁 白芷 火麻仁 鸡内金 蛤壳 土鳖虫 冬凌草
0.508219 0.394476 0.432293 0.492143 0.441527 0.312782
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
16. 
patient tongue id: 02120943315241_5_6_7
label yaofang:
甘草 枳壳 独活 薏苡仁 党参 黄柏 郁金 山药 桑寄生 鳖甲 茵陈 虎杖 土鳖虫 牛大力 千斤拔
0.979078 0.491986 0.60516 0.410784 0.347534 0.572103 0.539412 0.540734 0.399862 0.427995 0.425323
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
17. 
patient tongue id: 05172109374413_2_6
label yaofang:
甘草 茯苓 太子参 白术 酸枣仁 红花 山药 山茱萸 天麻 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.986423 0.499664 0.312562 0.62167 0.42662 0.307112 0.389112 0.625318 0.63649 0.595661 0.511219 0.51484 0.507728
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
18. 
patient tongue id: 03221823085790_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷
0.949109 0.340838 0.988785 0.725565 0.820716 0.96705 0.960511 0.893863 0.973934 0.989993 0.461417 0.592897 0.462269 0.835315
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.642857, recall: 0.600000, error: 0.357143
19. 
patient tongue id: 04122250094042_1_2
label yaofang:
甘草 川芎 党参 太子参 酸枣仁 生地黄 天麻 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.691037 0.423267 0.43877 0.427794 0.573205 0.309033
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
20. 
patient tongue id: 04132023570495_6_1_4
label yaofang:
甘草 茯苓 牡蛎 黄芪 白术 赤芍 浙贝母 厚朴 北沙参 合欢皮
0.463214 0.439408 0.377564 0.371368 0.456181 0.48512 0.338192 0.305615 0.352461
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.666667, recall: 0.600000, error: 0.333333
21. 
patient tongue id: 05022133435030_6_7_1
label yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 熟地黄 知母 山药 地骨皮 秦艽 淫羊藿 女贞子 浮小麦
0.991363 0.514159 0.306969 0.628701 0.419727 0.385739 0.652979 0.663304 0.627273 0.531219 0.536195 0.529222
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
22. 
patient tongue id: 04132019213277_1_7_6
label yaofang:
甘草 柴胡 白芍 黄芪 何首乌 丹参 枳实 郁金 小蓟 砂仁 珍珠母 浮小麦 首乌藤 百合
0.526762 0.320539 0.400003 0.420147 0.338486 0.448216
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
23. 
patient tongue id: 02190535322797_2_6_7
label yaofang:
甘草 远志 党参 酸枣仁 杜仲 地黄 天麻 桑寄生 白花蛇舌草 浮小麦 蜈蚣 合欢花 半枝莲 醋鳖甲
0.981495 0.49541 0.606009 0.421684 0.373974 0.617233 0.621716 0.597225 0.503496 0.511345 0.518893
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
24. 
patient tongue id: 05260620332210_6_7_2
label yaofang:
甘草 茯苓 党参 白术 山药 车前子 天麻 扁豆花 白花蛇舌草 建曲 蜈蚣 半枝莲 醋鳖甲 宽筋藤
0.989563 0.49072 0.63017 0.415022 0.373556 0.669943 0.662072 0.64109 0.526601 0.548282 0.575219
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
25. 
patient tongue id: 03232318493978_2_6
label yaofang:
甘草 茯苓 太子参 酸枣仁 栀子 乌梅 地黄 白花蛇舌草 首乌藤 蜂房 岗梅根 醋鳖甲
0.852008 0.474201 0.313302 0.522816 0.468329 0.307088 0.336527 0.398995 0.356921 0.425069
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.200000, recall: 0.166667, error: 0.800000
26. 
patient tongue id: 03161834396783_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.366012 0.868966 0.406535 0.954288 0.65966 0.741457 0.342618 0.323553 0.334477 0.908324 0.903876 0.839078 0.922608 0.958818 0.471624 0.574215 0.521098 0.769671
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.833333, recall: 1.000000, error: 0.166667
27. 
patient tongue id: 04252007349542_6_1
label yaofang:
甘草 柏子仁 干姜 砂仁 附片
0.335872 0.504746 0.325265 0.308639 0.338695 0.384922 0.304738 0.343738 0.378295 0.533648 0.62561 0.340873
predicted yaofang:
柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.166667, recall: 0.400000, error: 0.833333
28. 
patient tongue id: 04130230528083_5
label yaofang:
甘草 桔梗 金银花 连翘 蒲公英 紫花地丁 党参 丹参 地黄 白芷 麦芽 皂角刺 白鲜皮
0.705684 0.42765 0.458977 0.401526 0.533655 0.338405
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
29. 
patient tongue id: 05021437354414_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.466002 0.377458 0.301597 0.457379 0.542307 0.393522 0.339804 0.326704
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 牛膝 厚朴

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
30. 
patient tongue id: 05022101393382_6_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 黄连 胆南星 牛膝 山药 细辛 瓜蒌皮 王不留行 麸炒枳壳
0.92524 0.474002 0.556357 0.443832 0.301037 0.335364 0.458772 0.407158 0.440551 0.300492 0.31045 0.309334
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
31. 
patient tongue id: 05140630081675_7_6
label yaofang:
甘草 柴胡 白芍 川芎 枳壳 当归 桃仁 党参 生地黄 红花 川楝子 菟丝子 五灵脂 益母草
0.96872 0.302015 0.488615 0.605302 0.417606 0.302903 0.358679 0.58641 0.563824 0.537212 0.460574 0.467257 0.478806
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
32. 
patient tongue id: 05032232123576_1_2
label yaofang:
甘草 薏苡仁 党参 酸枣仁 山药 灯心草 天麻 鳖甲 扁豆花 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.961549 0.483099 0.598671 0.439574 0.353646 0.563125 0.555377 0.538584 0.448516 0.455995 0.464259
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
33. 
patient tongue id: 03171028358481_1_4
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.42548 0.372658 0.399292 0.376144
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.750000, recall: 0.250000, error: 0.250000
34. 
patient tongue id: 03180154085892_6
label yaofang:
柴胡 大枣 茯苓 防风 连翘 太子参 昆布 海藻 乌梅 石斛 白花蛇舌草 猫爪草 山慈菇
0.376557 0.333428 0.34693
predicted yaofang:
党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
35. 
patient tongue id: 04151235327602_2
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.358451 0.836874 0.404754 0.934019 0.642718 0.721793 0.33919 0.327488 0.343957 0.87425 0.875952 0.806603 0.898755 0.936639 0.479946 0.563525 0.509365 0.735827
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.812500, error: 0.277778
36. 
patient tongue id: 02120818547246_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 荆芥 鱼腥草 白术 浙贝母 白前 苦杏仁 紫苏子 贯众
0.801139 0.44656 0.48485 0.342917 0.51435 0.310953 0.372105
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 蜈蚣

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
37. 
patient tongue id: 05241938423799_6_1
label yaofang:
甘草 陈皮 法半夏 茯苓 党参 黄连 砂仁 天麻 鳖甲 麦芽 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.809186 0.429468 0.497518 0.458536
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.200000, error: 0.250000
38. 
patient tongue id: 05032237235067_1_4
label yaofang:
甘草 法半夏 茯苓 桔梗 党参 白术 浙贝母 山药 鳖甲 诃子 蜈蚣 白花蛇舌 天山雪莲 蜂房 四季青
0.819378 0.369658 0.391176 0.504266 0.411369 0.318949
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
39. 
patient tongue id: 04300917010231_2_4
label yaofang:
甘草 茯苓 党参 白术 熟附子 杜仲 乌药 山茱萸 泽泻 车前子 天麻 补骨脂 桑螵蛸 地龙 益智 泽兰
0.687156 0.438635 0.457001 0.316807 0.385065
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.250000, error: 0.200000
40. 
patient tongue id: 04211804461324_5
label yaofang:
黄芩 连翘 薄荷 薏苡仁 玄参 浙贝母 石菖蒲 茵陈 射干 豆蔻 马勃 广藿香 木蝴蝶
0.856627 0.464597 0.522385 0.432199 0.310878 0.394933 0.329557 0.380851
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
41. 
patient tongue id: 02131307249812_1_4_7
label yaofang:
白芍 金银花 桃仁 蒲公英 生地黄 苍术 百部 苦参 白鲜皮 辛夷 关黄柏 地肤子 苍耳子
0.356845 0.328743 0.31857 0.373346 0.356499 0.418567
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
42. 
patient tongue id: 06071857550090_5
label yaofang:
薏苡仁 黄芪 厚朴 佩兰 肉苁蓉 菟丝子 茵陈 金樱子 决明子 覆盆子
0.377552 0.353561 0.37048 0.336095 0.44429 0.529164 0.366978 0.39331 0.334993 0.3096 0.321356 0.30855 0.339806 0.338865
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 牛膝 钩藤 泽泻 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.142857, recall: 0.200000, error: 0.857143
43. 
patient tongue id: 01192151343234_1_5_6
label yaofang:
甘草 薏苡仁 党参 白术 杜仲 天麻 巴戟天 鳖甲 莪术 豆蔻 败酱草 蜈蚣 天山雪莲 半枝莲 红豆杉
0.95676 0.485433 0.338114 0.578819 0.477988 0.304851 0.373379 0.532816 0.531484 0.570422 0.422578 0.437336 0.447084
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
44. 
patient tongue id: 01052202049911_6_4_7
label yaofang:
黄芪 白术 海螵蛸 浙贝母 砂仁 桑寄生 北沙参 桑枝 土鳖虫 红豆杉 合欢皮 山慈菇 预知子 蛇舌草
0.55308 0.400745 0.387271 0.404043 0.54973 0.607381 0.393697 0.344219 0.33118
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 合欢皮

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
45. 
patient tongue id: 04271848465838_1_7
label yaofang:
桂枝 甘草 半夏 桃仁 蒲公英 黄芪 白术 浙贝母 厚朴 莪术 柿蒂 北沙参 赭石 蛇舌草
0.483615 0.392989 0.347352 0.384718 0.524167 0.566363 0.380608 0.310454 0.314594
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 合欢皮

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
46. 
patient tongue id: 04291609484219_4_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 丹参 川楝子 郁金 山药 猪苓 鳖甲 虎杖 麦芽 鹿衔草
0.917355 0.312054 0.441362 0.562633 0.424614 0.444251 0.373752 0.40106
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
47. 
patient tongue id: 04102052327469_2
label yaofang:
甘草 枳壳 桔梗 芦根 牛蒡子 麦冬 桑叶 菊花 白前 北沙参 苦杏仁 木蝴蝶 野马追 东风桔
0.544133 0.335491 0.392775 0.422979 0.437557
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
48. 
patient tongue id: 02182300481802_6_3
label yaofang:
甘草 法半夏 当归 茯苓 远志 党参 酸枣仁 红花 熟地黄 山药 石菖蒲 巴戟天 金樱子 锁阳 蜈蚣 合欢花
0.91939 0.482246 0.305603 0.545734 0.442167 0.341599 0.442572 0.400269 0.443646 0.302662
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.500000, recall: 0.312500, error: 0.500000
49. 
patient tongue id: 03101917247123_4
label yaofang:
甘草 川芎 当归 桔梗 龙骨 桃仁 柏子仁 生地黄 红花 赤芍 肉桂 北柴胡
0.312806 0.350773 0.338047 0.451682 0.352522 0.434645 0.346009
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 炙甘草 紫苏叶

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
50. 
patient tongue id: 05272343384152_4_7_5
label yaofang:
枳壳 黄芪 白术 海螵蛸 浙贝母 杜仲 白茅根 砂仁 补骨脂 鸡内金 紫苏梗 稻芽
0.495923 0.409555 0.432239 0.492265 0.419568 0.326955
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
51. 
patient tongue id: 01140005071438_2_6
label yaofang:
甘草 茯苓 党参 何首乌 丹参 山茱萸 天麻 鳖甲 决明子 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.965067 0.478882 0.317892 0.591643 0.457913 0.36913 0.555046 0.546781 0.563092 0.434505 0.444776 0.449888
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
52. 
patient tongue id: 05222036078681_5
label yaofang:
金银花 蒲公英 丹参 黄连 乌梅 郁金 灯心草 厚朴 王不留行 枇杷叶 木蝴蝶 土茯苓 青天葵
0.773513 0.443177 0.463192 0.300242 0.452933 0.320973 0.347209
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
53. 
patient tongue id: 05162026499288_6_4
label yaofang:
桂枝 甘草 柴胡 白芍 枳壳 薏苡仁 黄芪 丹参 五味子 虎杖 白花蛇舌草 制何首乌 田基黄
0.328277 0.498532 0.315332 0.31414 0.351427 0.367757 0.308607 0.327827 0.387097 0.529696 0.625552 0.322418
predicted yaofang:
柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
54. 
patient tongue id: 04130900128686_6_4
label yaofang:
甘草 茯苓 白术 酸枣仁 丹参 生地黄 赤芍 山茱萸 天麻 桑寄生 补骨脂 麦芽 天山雪莲
0.942523 0.482149 0.305422 0.556881 0.47568 0.336702 0.426446 0.406294 0.488066
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
55. 
patient tongue id: 03312046296299_2_6
label yaofang:
甘草 白芍 薏苡仁 熟附子 赤芍 郁金 山药 天麻 鳖甲 扁豆花 败酱草 续断 浮小麦 半枝莲 牛大力
0.911288 0.466334 0.547373 0.462376 0.323635 0.427975 0.377754 0.437015
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
56. 
patient tongue id: 05242239414775_6_4_2
label yaofang:
甘草 柴胡 白芍 茯苓 木香 党参 黄芪 白术 黄连 乌梅 山药 车前子 干姜 补骨脂 白扁豆 建曲 广升麻
0.93979 0.478516 0.304911 0.558203 0.437688 0.339235 0.474664 0.472042 0.493732 0.361146 0.361267 0.361676
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.294118, error: 0.583333
57. 
patient tongue id: 04130631448736_4_6
label yaofang:
甘草 川芎 党参 白术 生地黄 牡丹皮 杜仲 牛膝 山茱萸 钩藤 天麻 桑寄生 蒺藜 沙苑子 牛大力
0.984369 0.501363 0.312676 0.627487 0.431718 0.377909 0.621705 0.617269 0.591179 0.487586 0.502494 0.49422
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
58. 
patient tongue id: 06050804150416_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.412269 0.364741 0.351786 0.312236 0.467069 0.536491 0.319989 0.342246 0.392009 0.302718 0.300686 0.312301
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 白术 丹参 牛膝 莱菔子 夏枯草 制何首乌

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
59. 
patient tongue id: 05131449394558_7_6
label yaofang:
桂枝 甘草 川芎 当归 茯苓 金银花 桃仁 红花 赤芍 益母草 吴茱萸 建曲 土鳖虫
0.981711 0.495925 0.613887 0.40857 0.361528 0.595341 0.595901 0.559011 0.472419 0.473968 0.476508
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
60. 
patient tongue id: 03221959554521_5_6
label yaofang:
甘草 柴胡 白芍 香附 法半夏 茯苓 党参 白术 生地黄 栀子 牡丹皮 黄柏 淡竹叶 麦芽 浮小麦 百合
0.971132 0.496126 0.313603 0.590722 0.412493 0.366072 0.581038 0.561531 0.56072 0.450194 0.460361 0.453831
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
61. 
patient tongue id: 01180622047955_1
label yaofang:
甘草 茯苓 龙骨 薏苡仁 远志 党参 白术 酸枣仁 牛膝 山药 桑寄生 补骨脂 白扁豆 首乌藤 合欢花
0.943704 0.483692 0.305493 0.564564 0.435136 0.344108 0.495379 0.461588 0.481343 0.347899 0.361323 0.348693
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
62. 
patient tongue id: 02120806384943_1_4
label yaofang:
甘草 白芍 木香 党参 鸡血藤 山药 车前子 天麻 赤石脂 鳖甲 补骨脂 建曲 蜈蚣 天山雪莲 半枝莲
0.815641 0.335942 0.461484 0.504484 0.420886 0.307085 0.372534 0.302097 0.354073
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.666667, recall: 0.400000, error: 0.333333
63. 
patient tongue id: 01032105449163_6_4
label yaofang:
甘草 川芎 羌活 独活 鸡血藤 白术 赤芍 天麻 白花蛇舌草 麦芽 蜈蚣 半枝莲 醋鳖甲 骨碎补
0.730484 0.438212 0.49215 0.304618 0.40478 0.318039
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
64. 
patient tongue id: 02120815050441_6
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 当归 茯苓 桃仁 党参 白术 红花 山药 砂仁 豆蔻
0.898333 0.344893 0.441236 0.526668 0.42427 0.305535 0.36239 0.311445 0.345911
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
65. 
patient tongue id: 02151843111610_4
label yaofang:
甘草 白芍 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 炒僵蚕
0.390003 0.856159 0.39709 0.944562 0.6468 0.739641 0.356907 0.358339 0.361083 0.88809 0.895413 0.825331 0.911761 0.958331 0.479035 0.59989 0.522097 0.750321
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.111111, recall: 0.142857, error: 0.888889
66. 
patient tongue id: 03062124405515_1_4_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 砂仁 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲
0.98917 0.494657 0.304361 0.637028 0.408957 0.359108 0.640481 0.643031 0.610408 0.512507 0.5238 0.510815
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
67. 
patient tongue id: 02211433334613_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.420608 0.309411 0.3928 0.393829 0.347485 0.390493 0.384745
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
68. 
patient tongue id: 02210155059517_1_2
label yaofang:
桂枝 当归 黄芪 鸡血藤 阿胶 白术 砂仁 补骨脂 鸡内金 黄精 稻芽 红芪 红参
0.486402 0.42504 0.340232 0.399837 0.433334 0.32093
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
69. 
patient tongue id: 01041855275700_2_5
label yaofang:
柴胡 黄芩 当归 玄参 石膏 杏仁 薏仁 川朴
0.589347 0.38817 0.436464 0.350557 0.458633
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
70. 
patient tongue id: 04301136059351_2_6
label yaofang:
甘草 柴胡 白芍 木香 党参 太子参 黄连 延胡索 砂仁 五灵脂 麦芽 北沙参 鱼古 瓦楞子
0.976191 0.491295 0.607276 0.427823 0.357823 0.573357 0.552151 0.535914 0.430457 0.438381 0.435956
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
71. 
patient tongue id: 04112215261003_6_2
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 佛手 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.868492 0.451152 0.534003 0.446301 0.315996 0.412809 0.331421 0.393868
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.875000, recall: 0.500000, error: 0.125000
72. 
patient tongue id: 03291334143938_4_6
label yaofang:
桂枝 甘草 白芍 茯苓 桃仁 生地黄 牡丹皮 郁金 山药 山茱萸 泽泻 莪术 决明子 浮小麦 建曲
0.899318 0.461846 0.526114 0.480523 0.313259 0.388126 0.328125 0.429563
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
73. 
patient tongue id: 04141958349993_1_4
label yaofang:
甘草 黄芩 桔梗 芦根 麦冬 浙贝母 天麻 天花粉 鳖甲 诃子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.968547 0.499958 0.342036 0.604503 0.408756 0.30952 0.38212 0.600833 0.598635 0.571875 0.485391 0.498651 0.482827
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
74. 
patient tongue id: 04181951103840_2_1
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 车前子 砂仁 菟丝子 巴戟天 桑寄生 鹿角霜 续断 艾叶
0.381773 0.309093 0.448396 0.37282 0.402373 0.312312 0.379501 0.496074
predicted yaofang:
甘草 柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
75. 
patient tongue id: 04062017233514_1
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.801909 0.326533 0.433507 0.491845 0.463139 0.301243 0.308529
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
76. 
patient tongue id: 02281214483318_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.333123 0.349083 0.339392 0.326504 0.413397 0.456854 0.348114 0.349446 0.367096 0.304704 0.306844 0.3375
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 牛膝 钩藤 莱菔子 夏枯草 制何首乌

------Score: precision: 0.583333, recall: 0.583333, error: 0.416667
77. 
patient tongue id: 05031857245713_4
label yaofang:
桂枝 枳壳 茯苓 麦冬 酸枣仁 五味子 天冬 石斛 佛手 合欢皮 石榴皮
0.430166 0.371509 0.371374 0.362467 0.488257 0.302998
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
78. 
patient tongue id: 06190805299131_1_6
label yaofang:
甘草 茯苓 龙骨 远志 酸枣仁 龙眼肉 地黄 天麻 补骨脂 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲
0.789505 0.42165 0.501514 0.437983
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
79. 
patient tongue id: 02181604218231_6_2_4
label yaofang:
甘草 法半夏 茯苓 桔梗 酸枣仁 浙贝母 杜仲 天麻 鳖甲 紫菀 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.932344 0.472047 0.312829 0.558244 0.44034 0.342081 0.505074 0.484961 0.505049 0.379328 0.391635 0.400961
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
80. 
patient tongue id: 05260647373965_1_2_7
label yaofang:
甘草 党参 白术 酸枣仁 丹参 生地黄 天麻 鳖甲 首乌藤 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.961711 0.46413 0.591209 0.432321 0.306723 0.530682 0.498215 0.503995 0.393588 0.391184 0.409388
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
81. 
patient tongue id: 03302309265143_2_5
label yaofang:
甘草 麦冬 丹参 黄连 牡丹皮 僵蚕 麦芽 粉葛 百合 紫苏叶 黑枣 木蝴蝶 合欢皮 预知子
0.661093 0.430936 0.425318 0.345148 0.438744
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
82. 
patient tongue id: 03231215527335_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄 炒六神曲
0.324333 0.451876 0.426593 0.545222 0.355408 0.422592 0.352102 0.457388 0.449254 0.434758 0.568839 0.399118 0.605937 0.308591 0.379811
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 蜜麻黄

------Score: precision: 0.666667, recall: 0.714286, error: 0.333333
83. 
patient tongue id: 03240612596856_1_2_6
label yaofang:
甘草 白芍 川芎 陈皮 防风 枸杞子 白术 黄连 牛膝 地黄 干姜 天麻 酒女贞子 墨旱莲
0.977191 0.490838 0.615972 0.420845 0.374431 0.591708 0.570587 0.558649 0.444591 0.460695 0.463011
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
84. 
patient tongue id: 03111435096075_6
label yaofang:
甘草 柴胡 白芍 香附 生地黄 延胡索 赤芍 杜仲 天花粉 瓜蒌皮 皂角刺 续断 川木瓜 宽筋藤 田七末
0.969733 0.489064 0.599712 0.446948 0.351696 0.538742 0.541579 0.544364 0.419429 0.42054 0.428105
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.066667, error: 0.909091
85. 
patient tongue id: 03111714098381_6_5
label yaofang:
甘草 独活 酸枣仁 生地黄 延胡索 杜仲 山药 山茱萸 桑寄生 麦芽 威灵仙 川木瓜 土茯苓 牛大力 千斤拔
0.549894 0.411092 0.390277 0.438522 0.532899
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
86. 
patient tongue id: 03061506095891_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 延胡索 赤芍 海螵蛸 牛膝
0.354659 0.304405 0.446177 0.381875 0.392507 0.304367 0.399138 0.503537
predicted yaofang:
甘草 柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
87. 
patient tongue id: 03311648289040_4
label yaofang:
陈皮 桔梗 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 猫爪草 山慈菇
0.42315 0.325602 0.345624 0.415563 0.307189 0.401369
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
88. 
patient tongue id: 04122057576971_4_1_6
label yaofang:
甘草 当归 薏苡仁 党参 黄芪 鸡血藤 丹参 砂仁 天麻 鳖甲 补骨脂 莪术 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.956881 0.471922 0.318537 0.579281 0.466974 0.361602 0.539763 0.527231 0.566598 0.408816 0.430652 0.454314
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.470588, error: 0.333333
89. 
patient tongue id: 04211744048137_4
label yaofang:
白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.385654 0.760325 0.424111 0.875413 0.578714 0.672189 0.359693 0.363174 0.355348 0.798438 0.806077 0.750835 0.84307 0.336222 0.899745 0.456621 0.313883 0.549683 0.506274 0.689657
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
90. 
patient tongue id: 02181558053229_5
label yaofang:
甘草 川芎 黄芩 桔梗 金银花 浙贝母 细辛 白芷 蔓荆子 辛夷 广藿香 苍耳子
0.957182 0.487844 0.315058 0.576405 0.450593 0.301783 0.368998 0.535938 0.513709 0.531963 0.402073 0.41561 0.413489
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.166667, error: 0.846154
91. 
patient tongue id: 03022202171620_1
label yaofang:
柴胡 陈皮 枳壳 当归 木香 党参 黄芪 枸杞子 白术 青皮 川楝子 槟榔 牛膝 乌药 车前子 高良姜 小茴香 炙甘草 黄精
0.607227 0.377933 0.342701 0.456356 0.414439
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.105263, error: 0.600000
92. 
patient tongue id: 03012204468651_1_6_2
label yaofang:
甘草 茯苓 党参 白术 杜仲 山药 天麻 槐花 桑寄生 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.964818 0.306007 0.495431 0.324754 0.594098 0.427682 0.301469 0.321167 0.378816 0.580433 0.581885 0.543458 0.480431 0.481389 0.467416
predicted yaofang:
甘草 白芍 茯苓 薏苡仁 党参 白术 生地黄 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.533333, recall: 0.571429, error: 0.466667
93. 
patient tongue id: 04282038419013_1_6_5
label yaofang:
甘草 柴胡 白芍 黄芪 白术 丹参 延胡索 海螵蛸 枳实 砂仁 北沙参 广金钱草
0.524055 0.384797 0.471128 0.429493 0.332389 0.304244
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
94. 
patient tongue id: 05230811378034_1_2
label yaofang:
甘草 法半夏 桔梗 橘红 防风 金银花 太子参 藿香 白前 鸡内金 蜜百部 干鱼腥草
0.38815 0.331199 0.36166 0.460617 0.491589 0.346747 0.402384 0.306727 0.323066 0.307165 0.331115 0.351378
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.083333, recall: 0.083333, error: 0.916667
95. 
patient tongue id: 02201840047067_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.337444 0.826231 0.395926 0.921243 0.614889 0.70015 0.305924 0.302866 0.320012 0.855195 0.848102 0.78201 0.882916 0.926255 0.458667 0.529027 0.487281 0.712645
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
96. 
patient tongue id: 01111907510030_5
label yaofang:
陈皮 茯苓 前胡 桔梗 半夏 神曲 款冬花 紫菀 白前 百部 炙甘草 广藿香
0.374282 0.834421 0.415704 0.932213 0.636684 0.70881 0.334722 0.336541 0.331862 0.875739 0.876567 0.804068 0.899325 0.306072 0.945105 0.455289 0.565426 0.516221 0.740847
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.833333, error: 0.473684
97. 
patient tongue id: 04201858525959_4
label yaofang:
陈皮 茯苓 前胡 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄
0.350737 0.876553 0.391412 0.96076 0.666513 0.763916 0.337233 0.31577 0.32507 0.916904 0.916253 0.855984 0.934509 0.961077 0.480534 0.588791 0.515022 0.782348
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.555556, recall: 0.833333, error: 0.444444
98. 
patient tongue id: 02260649080182_1_6
label yaofang:
甘草 远志 党参 黄芪 白术 酸枣仁 生地黄 天麻 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.998576 0.520558 0.689241 0.37733 0.372363 0.767745 0.753112 0.716495 0.599014 0.620247 0.638233
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
99. 
patient tongue id: 04131818541667_2_1
label yaofang:
甘草 陈皮 茯苓 薏苡仁 党参 白术 五味子 天麻 鳖甲 补骨脂 莪术 蜈蚣 白花蛇舌 天山雪莲
0.727649 0.418244 0.480972 0.36022 0.455239
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
100. 
patient tongue id: 02181624531776_1
label yaofang:
甘草 柴胡 白芍 川芎 黄芪 天麻 蔓荆子 鳖甲 皂角刺 辛夷 蜈蚣 苍耳子 白花蛇舌 天山雪莲 半枝莲
0.964119 0.495434 0.598091 0.432429 0.366896 0.559289 0.544413 0.533548 0.428231 0.438562 0.438946
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
101. 
patient tongue id: 05162054544492_4_6
label yaofang:
甘草 柴胡 白芍 香附 黄芩 当归 茯苓 薄荷 白术 黄连 麦芽 广藿香
0.395898 0.303416 0.459181 0.384033 0.410597 0.322996 0.357315 0.493217
predicted yaofang:
甘草 柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
102. 
patient tongue id: 05161207246043_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.542962 0.383125 0.33989 0.495216 0.494322 0.336733 0.361423 0.306134 0.374907 0.306327 0.328092
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 红花 牛膝 莱菔子 天麻

------Score: precision: 0.545455, recall: 0.500000, error: 0.454545
103. 
patient tongue id: 05262359590639_6_7
label yaofang:
甘草 川芎 茯苓 党参 红花 赤芍 桑寄生 鳖甲 续断 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.956875 0.487967 0.309167 0.591671 0.4295 0.354354 0.543839 0.509951 0.505282 0.394874 0.40799 0.401796
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
104. 
patient tongue id: 03301959026757_4
label yaofang:
甘草 茯苓 半夏 牛蒡子 薏苡仁 鱼腥草 黄芪 白术 赤芍 浙贝母 杜仲 泽泻 僵蚕 白芷 蝉蜕 辛夷 紫苏叶 蜈蚣 猫爪草 冬凌草
0.498248 0.304895 0.445148 0.378419 0.36817 0.375324 0.327224
predicted yaofang:
甘草 法半夏 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.571429, recall: 0.200000, error: 0.428571
105. 
patient tongue id: 01061557292574_1_4
label yaofang:
桂枝 甘草 白芍 黄芪 白术 赤芍 山药 山茱萸 车前子 菟丝子 益母草 猪苓 桑螵蛸 益智 泽兰 广升麻
0.965252 0.484112 0.320993 0.589757 0.448819 0.361598 0.544852 0.533643 0.555103 0.411939 0.429193 0.429285
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
106. 
patient tongue id: 05042105441117_4
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.340407 0.303137 0.458577 0.348392 0.395206 0.354654 0.371136 0.560443 0.302651
predicted yaofang:
甘草 柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.333333, recall: 0.300000, error: 0.666667
107. 
patient tongue id: 06041129403541_2_4
label yaofang:
白芍 太子参 黄芪 枸杞子 柏子仁 郁金 石决明 北柴胡 煅牡蛎 北沙参 山萸肉 炙甘草 制远志 酒女贞子 煅龙骨 炒酸枣仁
0.38339 0.638054 0.409663 0.785779 0.488777 0.578793 0.695569 0.700732 0.629113 0.77393 0.36909 0.824443 0.384688 0.447862 0.424429 0.601388
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.125000, recall: 0.125000, error: 0.875000
108. 
patient tongue id: 05102023116065_9
label yaofang:
法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 麸炒白术
0.337933 0.520176 0.418222 0.644052 0.402645 0.459018 0.321148 0.541296 0.541598 0.454428 0.630465 0.399879 0.707737 0.314167 0.32481 0.417469
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.625000, recall: 0.666667, error: 0.375000
109. 
patient tongue id: 06191325531391_1_2
label yaofang:
甘草 茯苓 太子参 鸡血藤 白术 生地黄 浙贝母 山药 鳖甲 补骨脂 北沙参 白花蛇舌 蜂房 岗梅根 四季青
0.896317 0.475941 0.305142 0.552342 0.444589 0.311002 0.345946 0.459363 0.425415 0.453223 0.332911 0.338749 0.346706
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
110. 
patient tongue id: 03012313302163_5_6_1
label yaofang:
柴胡 白芍 陈皮 防风 党参 白术 黄连 生地黄 牡丹皮 乌梅 山药 仙鹤草 茜草 麦芽 炙甘草
0.890358 0.469371 0.306848 0.54486 0.411697 0.328274 0.456876 0.365234 0.395464
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
111. 
patient tongue id: 06111055447015_1_2_4
label yaofang:
甘草 桃仁 党参 鸡血藤 白术 酸枣仁 红花 延胡索 胆南星 杜仲 补骨脂 麦芽 续断 牛大力
0.980876 0.495077 0.610142 0.423487 0.354419 0.576399 0.571856 0.549146 0.448557 0.45577 0.453503
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
112. 
patient tongue id: 04291515533195_1_6_7
label yaofang:
甘草 白芍 防风 独活 党参 红花 延胡索 细辛 大黄 肉苁蓉 桑寄生 补骨脂 制川乌 天山雪莲 牛大力
0.653327 0.326507 0.378094 0.468751 0.449193
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
113. 
patient tongue id: 04202010497529_1
label yaofang:
茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁 火麻仁 柿蒂 鸡内金 枇杷叶 北沙参 辛夷 紫苏梗
0.449789 0.365738 0.350537 0.472243 0.463825 0.321142 0.348922 0.300666 0.375386 0.309472
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 红花 牛膝 莱菔子

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
114. 
patient tongue id: 06072000236399_6_5
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 丹参 黄连 郁金 山药 天麻 粉葛 沙苑子 合欢花
0.972942 0.497486 0.320605 0.603601 0.41819 0.304831 0.37441 0.59783 0.599743 0.562901 0.490118 0.492733 0.482944
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.384615, error: 0.615385
115. 
patient tongue id: 04182028119036_2_7
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.433297 0.418694 0.334102 0.389523 0.399823 0.314855 0.303579 0.464647
predicted yaofang:
甘草 白芍 茯苓 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.166667, error: 0.750000
116. 
patient tongue id: 01042328310873_1_7
label yaofang:
桂枝 甘草 茯苓 桃仁 党参 白术 丹参 牡丹皮 郁金 山药 地黄 菟丝子 益母草 莪术
0.968967 0.47822 0.301312 0.60279 0.427174 0.359376 0.593924 0.580295 0.57026 0.471267 0.481351 0.507307
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
117. 
patient tongue id: 01211225397343_2
label yaofang:
阿胶 生地黄 红花 白芷 冬瓜子 辛夷 苍耳子 猫爪草 风栗壳
0.542587 0.37947 0.388598 0.453433 0.438768 0.300332 0.317969
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
118. 
patient tongue id: 04061833511919_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.386591 0.785787 0.413375 0.907583 0.596876 0.668087 0.835926 0.842568 0.759223 0.879944 0.348424 0.920194 0.433311 0.525726 0.496422 0.718055
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.857143, error: 0.250000
119. 
patient tongue id: 04222314019689_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.388708 0.824826 0.412099 0.93217 0.625909 0.705959 0.345444 0.34564 0.337232 0.876006 0.874841 0.799057 0.898293 0.330877 0.942241 0.460375 0.554935 0.513412 0.742679
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
120. 
patient tongue id: 05262108284657_6_1
label yaofang:
甘草 白芍 陈皮 茯苓 防风 党参 白术 黄连 乌梅 山药 细辛 车前子 干姜 粉葛 建曲
0.986601 0.492412 0.302379 0.623324 0.408493 0.376849 0.669714 0.647285 0.624101 0.523239 0.540364 0.55579
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
121. 
patient tongue id: 03291614178929_2_5_6
label yaofang:
甘草 桔梗 羌活 紫花地丁 黄芪 浙贝母 白芷 鳖甲 款冬花 皂角刺 蜈蚣 白花蛇舌 龙葵果 广升麻 蒿苯
0.946424 0.489393 0.324026 0.581802 0.440271 0.366787 0.536015 0.529306 0.527472 0.42598 0.430886 0.426479
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
122. 
patient tongue id: 02241846021589_4_1
label yaofang:
防风 钩藤 荆芥穗 白芷 香薷 豆蔻 炙甘草 紫苏梗 广藿香 麸炒白术
0.348979 0.572001 0.439748 0.629847 0.450741 0.494447 0.550969 0.555081 0.526611 0.61166 0.351182 0.685106 0.389601 0.404946 0.368634 0.470595
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.187500, recall: 0.300000, error: 0.812500
123. 
patient tongue id: 03020812598367_5
label yaofang:
甘草 防风 金银花 桃仁 蒲公英 黄芪 黄连 生地黄 红花 荆芥穗 火麻仁 麦芽 白鲜皮 建曲 重楼
0.953423 0.312629 0.483267 0.580689 0.399795 0.333611 0.549275 0.508318 0.479669 0.400087 0.405344 0.407161
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.066667, error: 0.916667
124. 
patient tongue id: 06031127327540_2_5
label yaofang:
甘草 黄芩 桔梗 金银花 牛蒡子 麦冬 太子参 玄参 浙贝母 鳖甲 白花蛇舌 蜂房 岗梅根 四季青
0.966334 0.489413 0.311776 0.603569 0.418104 0.379666 0.587962 0.577194 0.54746 0.463194 0.472658 0.480152
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
125. 
patient tongue id: 04121849553094_2_5
label yaofang:
甘草 黄芪 白术 红花 赤芍 浙贝母 牡丹皮 杜仲 郁金 桑叶 莪术 麦芽 北沙参 蝉蜕 桑椹 木蝴蝶 预知子
0.549185 0.422621 0.456104 0.353167 0.519774 0.619538 0.316832 0.417253 0.34009 0.363552 0.32241
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.454545, recall: 0.294118, error: 0.545455
126. 
patient tongue id: 01192220409169_5_6
label yaofang:
甘草 川芎 茯苓 葛根 羌活 薏苡仁 远志 白术 杜仲 石膏 桑寄生 胡黄连 广藿香 骨碎补
0.918322 0.47008 0.313702 0.554497 0.449789 0.352805 0.475582 0.420723 0.479285 0.30989 0.33691 0.341043
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
127. 
patient tongue id: 06012008172050_1_6
label yaofang:
甘草 茯苓 桔梗 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.941629 0.320155 0.433703 0.564169 0.405453 0.466394 0.442406 0.439091 0.330077 0.340555 0.336694
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
128. 
patient tongue id: 05312318078421_6_4_2
label yaofang:
甘草 茯苓 远志 白术 酸枣仁 丹参 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.982989 0.492465 0.61792 0.410161 0.363316 0.637023 0.609509 0.578427 0.486962 0.501775 0.50238
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
129. 
patient tongue id: 05102211420047_1_2
label yaofang:
陈皮 法半夏 茯苓 前胡 麦冬 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.379885 0.783355 0.405821 0.91877 0.57543 0.684431 0.843912 0.854331 0.775596 0.895738 0.349557 0.939355 0.413305 0.52341 0.486672 0.717086
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.750000, error: 0.250000
130. 
patient tongue id: 05022019405311_2_6
label yaofang:
甘草 白芍 川芎 茯苓 木香 龙骨 远志 党参 酸枣仁 丹参 生地黄 天麻 浮小麦 首乌藤
0.975206 0.491661 0.609896 0.421563 0.36578 0.592669 0.589826 0.560138 0.471129 0.478844 0.466923
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
131. 
patient tongue id: 01070846255460_1_2
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 泽泻 干姜
0.404036 0.368993 0.396602 0.45779 0.355276
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 1.000000, recall: 0.416667, error: 0.000000
132. 
patient tongue id: 02202246296718_1_6_2
label yaofang:
甘草 白芍 枸杞子 酸枣仁 生地黄 山茱萸 菊花 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 木贼
0.915065 0.471567 0.310457 0.556008 0.426964 0.308171 0.347789 0.498693 0.450666 0.462546 0.35737 0.368108 0.363229
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
133. 
patient tongue id: 01121850319496_2
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.405276 0.732107 0.420091 0.862442 0.567922 0.645063 0.351818 0.348547 0.351843 0.790324 0.793693 0.718253 0.824281 0.360758 0.877456 0.450137 0.316176 0.526332 0.492942 0.668898
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
134. 
patient tongue id: 05232103420527_6_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 枳实 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.343184 0.341907 0.530799 0.305139 0.306449 0.370208 0.38138 0.363047 0.489782 0.58143
predicted yaofang:
甘草 柴胡 白芍 香附 牛蒡子 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.416667, error: 0.500000
135. 
patient tongue id: 04111959201922_1_4_7
label yaofang:
党参 黄芪 枸杞子 海螵蛸 杜仲 牛膝 乌药 生半夏 砂仁 僵蚕 菟丝子 鳖甲 莪术 紫苏梗 红豆杉 荔枝核
0.457412 0.417853 0.350167 0.404389 0.395116
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
136. 
patient tongue id: 02241440241654_1
label yaofang:
陈皮 桔梗 太子参 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.312711 0.385181 0.34201 0.449206 0.319225 0.327365 0.460901 0.32489
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.250000, recall: 0.181818, error: 0.750000
137. 
patient tongue id: 02191245186561_1_6_4
label yaofang:
甘草 薏苡仁 桃仁 党参 酸枣仁 红花 延胡索 天麻 五灵脂 瓜蒌皮 白花蛇舌草 蜈蚣 合欢花 醋鳖甲 姜黄 川贝母粉
0.989115 0.504514 0.300207 0.633974 0.43136 0.365777 0.620262 0.63308 0.610557 0.497301 0.505984 0.493189
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
138. 
patient tongue id: 02231415272573_2
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.39627 0.705791 0.42826 0.832799 0.541047 0.614258 0.340139 0.341639 0.33012 0.759673 0.756922 0.690095 0.803008 0.356179 0.853382 0.433014 0.503865 0.482851 0.653558
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 1.000000, error: 0.368421
139. 
patient tongue id: 05092106114917_2_1_7
label yaofang:
甘草 柴胡 白芍 葛根 党参 鸡血藤 山茱萸 天麻 白花蛇舌草 玉米须 蜈蚣 合欢花 半枝莲 醋鳖甲
0.971701 0.494646 0.317104 0.590326 0.461758 0.368653 0.542086 0.547375 0.571208 0.420104 0.425561 0.422775
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
140. 
patient tongue id: 03231846164081_2_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 威灵仙 蜜麻黄
0.386394 0.86107 0.410339 0.949969 0.658616 0.755085 0.342233 0.331726 0.344956 0.898207 0.904526 0.837628 0.920999 0.301991 0.961474 0.478083 0.60345 0.528842 0.765137
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
141. 
patient tongue id: 03152034413621_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.689646 0.42412 0.508952 0.338932 0.340438 0.374474
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
142. 
patient tongue id: 02260706016587_1_6
label yaofang:
甘草 川芎 茯苓 羌活 薏苡仁 牛膝 郁金 细辛 全蝎 白芷 蔓荆子 鳖甲 莪术 天山雪莲 半枝莲
0.811225 0.437919 0.301313 0.487327 0.340923 0.530976 0.41342
predicted yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
143. 
patient tongue id: 03271541493500_6
label yaofang:
麻黄 桂枝 柴胡 白芍 黄芩 法半夏 当归 葛根 桃仁 熟地黄 栀子 白茅根 水蛭 三七 旋覆花 炙甘草 赭石 红参
0.94794 0.305595 0.491519 0.316676 0.573131 0.377969 0.332466 0.548861 0.474088 0.45439 0.362474 0.364588 0.335219
predicted yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.076923, recall: 0.055556, error: 0.923077
144. 
patient tongue id: 05270757427920_2_4
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.435006 0.354734 0.425316 0.442885 0.415212
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
145. 
patient tongue id: 04222124581202_2
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.386016 0.8024 0.416922 0.915239 0.60838 0.694843 0.309486 0.31046 0.318094 0.848264 0.856228 0.774754 0.887039 0.343646 0.931806 0.440719 0.549856 0.502895 0.725309
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
146. 
patient tongue id: 02231832119362_2
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.396504 0.731538 0.414641 0.84081 0.566663 0.632094 0.365429 0.369734 0.366284 0.314307 0.769536 0.772023 0.701217 0.805618 0.336645 0.863902 0.455641 0.31527 0.526634 0.496091 0.65817
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
147. 
patient tongue id: 02150735084801_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.446342 0.418206 0.361134 0.421813 0.371426 0.327174
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
148. 
patient tongue id: 04181959442598_4_6
label yaofang:
甘草 前胡 防风 金银花 黄芪 白术 荆芥穗 天麻 鳖甲 茵陈 款冬花 蜈蚣 白花蛇舌 天山雪莲 半枝莲 大青叶
0.952196 0.487091 0.303185 0.582585 0.437846 0.305848 0.363768 0.537147 0.518022 0.504956 0.40793 0.416831 0.413763
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
149. 
patient tongue id: 04061332287399_4_7
label yaofang:
甘草 柴胡 黄芩 法半夏 茯苓 前胡 桔梗 桃仁 远志 浙贝母 细辛 款冬花 紫菀 白前 地龙
0.530472 0.407053 0.309835 0.417229 0.497455 0.490629 0.346898
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴

------Score: precision: 0.285714, recall: 0.133333, error: 0.714286
150. 
patient tongue id: 02110733330242_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.438834 0.373554 0.339057 0.300145 0.470483 0.440732 0.345756 0.354352
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 牛膝

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
151. 
patient tongue id: 04151229139078_1
label yaofang:
茯苓 防风 党参 太子参 黄芪 枸杞子 山药 芡实 豆蔻 北沙参 炒白扁豆 麸炒白术 炒稻芽 炒麦芽
0.379675 0.691101 0.414541 0.827321 0.530297 0.622573 0.330893 0.325354 0.343866 0.306688 0.751767 0.751528 0.692658 0.790962 0.315764 0.817437 0.465437 0.498785 0.461923 0.615993
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.214286, error: 0.850000
152. 
patient tongue id: 02211857272771_1_7
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.724497 0.398614 0.475742 0.410479
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
153. 
patient tongue id: 03231059309963_5_6
label yaofang:
甘草 法半夏 茯苓 薏苡仁 白术 栀子 佩兰 天麻 滑石 鳖甲 白花蛇舌草 麦芽 苦杏仁 蜈蚣 天山雪莲 半枝莲
0.919407 0.445477 0.302237 0.52179 0.53542 0.319229 0.371691 0.348205 0.491237
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.777778, recall: 0.437500, error: 0.222222
154. 
patient tongue id: 06011957532756_2_7_6
label yaofang:
甘草 白芍 党参 酸枣仁 生地黄 红花 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜 宽筋藤
0.989872 0.502553 0.629722 0.416824 0.368289 0.659703 0.654022 0.646238 0.526124 0.535917 0.56797
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
155. 
patient tongue id: 05290806100049_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 延胡索 浙贝母 郁金 天麻 瓜蒌皮 鳖甲 鸡内金 麦芽 皂角刺 蜈蚣 白花蛇舌 天山雪莲
0.965604 0.492119 0.589427 0.43208 0.300151 0.344553 0.534186 0.520101 0.516929 0.409326 0.409715 0.418162
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.529412, error: 0.250000
156. 
patient tongue id: 04211415191438_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.348828 0.894084 0.355215 0.971961 0.67115 0.820862 0.312994 0.323187 0.342297 0.926971 0.940695 0.886951 0.954942 0.981887 0.514515 0.641898 0.53905 0.794641
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
157. 
patient tongue id: 02211827570903_4_1
label yaofang:
大枣 党参 太子参 黄芪 枸杞子 山药 白芷 芡实 煅牡蛎 北沙参 辛夷 浮小麦 麸炒白术 煅龙骨
0.380336 0.780965 0.401796 0.909505 0.578314 0.694292 0.327869 0.321302 0.310279 0.839679 0.844362 0.782789 0.875781 0.323069 0.914137 0.461663 0.530996 0.486194 0.700904
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.105263, recall: 0.142857, error: 0.894737
158. 
patient tongue id: 02131323185418_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.389891 0.329077 0.344237 0.39115 0.367033 0.362189
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
159. 
patient tongue id: 03022149411791_1_6
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 王不留行 豆蔻 姜半夏 炙甘草 紫苏梗
0.383345 0.300643 0.469862 0.380607 0.384339 0.34676 0.381585 0.541416
predicted yaofang:
甘草 柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
160. 
patient tongue id: 03081839403859_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.68777 0.422986 0.720647 0.556456 0.536049 0.340523 0.330585 0.670885 0.637926 0.652557 0.704359 0.746152 0.405684 0.45832 0.536013 0.58592
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.687500, recall: 0.733333, error: 0.312500
161. 
patient tongue id: 03101737585550_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.375097 0.874386 0.384982 0.956497 0.664508 0.76213 0.330628 0.33468 0.332791 0.906086 0.910839 0.843333 0.932015 0.969385 0.467442 0.596518 0.523126 0.780288
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
162. 
patient tongue id: 05160624158637_5_4
label yaofang:
甘草 陈皮 茯苓 半夏 薏苡仁 浙贝母 杜仲 砂仁 僵蚕 芡实 金樱子 枇杷叶 蛤壳 鲜龙葵果
0.509987 0.413057 0.457374 0.363915 0.546865 0.591206 0.324282 0.43952 0.361824 0.378269 0.360859
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
163. 
patient tongue id: 06082001004237_1_7
label yaofang:
白芍 桃仁 麦冬 黄芪 丹参 红花 延胡索 牛膝 三七 珍珠母 北沙参 浮小麦 威灵仙 宽筋藤 黑老虎 制草乌
0.495918 0.415687 0.310139 0.364225 0.430492 0.527872 0.323194
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴

------Score: precision: 0.142857, recall: 0.062500, error: 0.857143
164. 
patient tongue id: 04282305449084_2_6
label yaofang:
甘草 薏苡仁 党参 酸枣仁 生地黄 栀子 天麻 鳖甲 莪术 北沙参 浮小麦 百合 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.967587 0.469234 0.588818 0.415858 0.333432 0.52887 0.523431 0.508402 0.400265 0.416326 0.411791
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
165. 
patient tongue id: 03061501301352_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.446961 0.389076 0.346382 0.368404 0.406709 0.321951 0.469815
predicted yaofang:
甘草 白芍 茯苓 党参 白术 干姜 炙甘草

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
166. 
patient tongue id: 05022116084396_1_6_2
label yaofang:
甘草 白芍 党参 鸡血藤 酸枣仁 丹参 生地黄 杜仲 天麻 鳖甲 麦芽 蜈蚣 天山雪莲 半枝莲
0.978226 0.508451 0.319548 0.607691 0.402808 0.365206 0.595773 0.591948 0.563665 0.474657 0.485742 0.475247
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
167. 
patient tongue id: 04020809330346_6_7_4
label yaofang:
甘草 川芎 桃仁 枸杞子 白术 酸枣仁 赤芍 牛膝 泽泻 天麻 磁石 地龙 佛手 粉葛 浮小麦 合欢花
0.425714 0.374554 0.342999 0.362084 0.359428 0.4451
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
168. 
patient tongue id: 03020800179926_3_5_7
label yaofang:
甘草 白芍 薏苡仁 太子参 郁金 山药 山茱萸 大腹皮 砂仁 鳖甲 补骨脂 莪术 白花蛇舌草 白扁豆 天山雪莲 泽兰
0.912893 0.438327 0.561589 0.432169 0.330541 0.500115 0.398143 0.45634 0.313895 0.335204
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
169. 
patient tongue id: 04071422593039_1_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.367817 0.830318 0.406307 0.934166 0.62639 0.707962 0.327415 0.339347 0.327931 0.87305 0.881161 0.799278 0.900237 0.946859 0.45752 0.575541 0.517439 0.748807
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 0.933333, error: 0.222222
170. 
patient tongue id: 04131821180308_2_1_6
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 丹参 地黄 天麻 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.779313 0.442054 0.471495 0.33848 0.511132 0.352914
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
171. 
patient tongue id: 05042033007056_6_1
label yaofang:
陈皮 桔梗 牛蒡子 海螵蛸 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.465876 0.319992 0.480581 0.397366 0.403246 0.324279 0.39444
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
172. 
patient tongue id: 01132136527130_5_6
label yaofang:
甘草 茯苓 生地黄 牡丹皮 杜仲 乌药 山药 山茱萸 泽泻 桑寄生 王不留行 桑螵蛸 益智 鹿角霜
0.886694 0.312092 0.454273 0.548193 0.43144 0.313295 0.463192 0.424742 0.435458 0.326903 0.342096 0.349225
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
173. 
patient tongue id: 06012108596980_6
label yaofang:
麻黄 甘草 黄芩 茯苓 黄芪 白术 杜仲 厚朴 僵蚕 辛夷 蜈蚣 猫爪草
0.513523 0.413795 0.494029 0.352437 0.573639 0.629006 0.360356 0.475429 0.389033 0.309948 0.379436 0.40031
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 僵蚕 北沙参 合欢皮

------Score: precision: 0.583333, recall: 0.583333, error: 0.416667
174. 
patient tongue id: 03221951480008_2
label yaofang:
甘草 白芍 桔梗 玉竹 太子参 酸枣仁 生地黄 浙贝母 鳖甲 北沙参 白花蛇舌 天山雪莲 合欢花 四季青
0.974725 0.496296 0.313587 0.604938 0.436662 0.300979 0.371465 0.579428 0.588546 0.574479 0.475779 0.477861 0.474948
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
175. 
patient tongue id: 01172253298583_2_5
label yaofang:
甘草 党参 生地黄 牛膝 郁金 细辛 天麻 鳖甲 莪术 北沙参 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.975404 0.496732 0.32918 0.605912 0.423761 0.383973 0.61713 0.613437 0.588775 0.498536 0.517672 0.508832
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
176. 
patient tongue id: 06132014119207_4
label yaofang:
麻黄 桂枝 甘草 牡蛎 葶苈子 太子参 黄芪 泽泻 厚朴 僵蚕 苦杏仁 黑枣 蜈蚣
0.438493 0.412732 0.421212 0.497621 0.502297 0.313406 0.375157
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
177. 
patient tongue id: 01041644254644_1
label yaofang:
木香 柏子仁 青皮 海螵蛸 川楝子 槟榔 乌药 车前子 高良姜 小茴香 附片
0.514437 0.395687 0.39404 0.363893 0.515157
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
178. 
patient tongue id: 02202241213647_4_7
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 牛蒡子 桃仁 远志 浙贝母 细辛 干姜 款冬花 射干 蝉蜕 威灵仙
0.965023 0.50624 0.32524 0.587909 0.427693 0.315875 0.374869 0.560699 0.575852 0.545227 0.469787 0.46511 0.454758
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.187500, error: 0.769231
179. 
patient tongue id: 02122216213472_5
label yaofang:
甘草 法半夏 当归 茯苓 前胡 黄连 黄柏 牛膝 石膏 细辛 砂仁 白芷 款冬花 麦芽 苦杏仁 广升麻
0.959372 0.482273 0.303026 0.593101 0.428699 0.357198 0.540423 0.494654 0.503475 0.369525 0.387246 0.398413
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.125000, error: 0.833333
180. 
patient tongue id: 04300911268862_1_4
label yaofang:
甘草 法半夏 前胡 桃仁 远志 五味子 细辛 天麻 鳖甲 白前 苦杏仁 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.918613 0.310806 0.490513 0.315255 0.53664 0.404129 0.325246 0.440319 0.426023 0.437084 0.32984 0.335691 0.310994
predicted yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
181. 
patient tongue id: 02171930431054_2_1
label yaofang:
麦冬 玉竹 黄芪 酸枣仁 天冬 柏子仁 杜仲 厚朴 砂仁 巴戟天 川贝母 鸡内金 珍珠母 麦芽 北沙参 首乌藤 百合 红豆杉 合欢皮 墨旱莲
0.477079 0.367472 0.347023 0.375572 0.550825 0.510928 0.350027 0.30978
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.375000, recall: 0.150000, error: 0.625000
182. 
patient tongue id: 05022023535253_6_4
label yaofang:
甘草 柴胡 白芍 茯苓 党参 延胡索 川楝子 天麻 五灵脂 鳖甲 麦芽 蜈蚣 天山雪莲 半枝莲 红豆杉
0.977338 0.49453 0.614662 0.414276 0.362281 0.589979 0.594386 0.557326 0.478691 0.480964 0.483796
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
183. 
patient tongue id: 06080138238120_4_6
label yaofang:
甘草 川芎 法半夏 茯苓 龙骨 远志 党参 鸡血藤 酸枣仁 龙眼肉 丹参 知母 浮小麦 合欢花
0.866768 0.44464 0.536034 0.445422 0.30344 0.399659 0.377216
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
184. 
patient tongue id: 06031040437174_2
label yaofang:
桂枝 甘草 白芍 茯苓 牡蛎 白术 天冬 生地黄 山药 山茱萸 泽泻 车前子 桑螵蛸 龟甲
0.976531 0.501506 0.313914 0.607001 0.430671 0.30665 0.380339 0.593455 0.598335 0.575209 0.480857 0.486231 0.485525
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
185. 
patient tongue id: 06072243261904_1_4
label yaofang:
甘草 木香 远志 党参 酸枣仁 生地黄 杜仲 天麻 鳖甲 补骨脂 首乌藤 蜈蚣 天山雪莲 半枝莲
0.958929 0.485977 0.317394 0.583281 0.447756 0.367846 0.554188 0.558549 0.556048 0.448387 0.453942 0.470519
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
186. 
patient tongue id: 02281841159432_4
label yaofang:
甘草 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 香薷 紫菀 百部 辛夷 紫苏梗 广藿香 苍耳子
0.370244 0.747491 0.414226 0.878213 0.554915 0.644136 0.311929 0.30963 0.317062 0.806652 0.807603 0.730658 0.85555 0.342817 0.886922 0.446692 0.502356 0.479516 0.679398
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.421053, recall: 0.533333, error: 0.578947
187. 
patient tongue id: 05232040382904_1_4_7
label yaofang:
陈皮 太子参 黄芪 枸杞子 白术 龙眼肉 杜仲 牛膝 乌药 厚朴 补骨脂 川贝母 莪术 麦芽 桑椹 紫苏叶 骨碎补 龟甲 预知子 荔枝核
0.478475 0.408629 0.375454 0.395905 0.520009 0.516701 0.390796 0.311504 0.330217 0.318477
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.300000, recall: 0.150000, error: 0.700000
188. 
patient tongue id: 03231232177847_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.663784 0.536984 0.45935 0.495349 0.404961 0.323321 0.332184 0.470261 0.391338 0.316044 0.351556 0.303711 0.308756
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 党参 款冬花 紫菀 白前 百部 炙甘草 广藿香

------Score: precision: 0.769231, recall: 0.769231, error: 0.230769
189. 
patient tongue id: 06171333445688_1_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.384471 0.424323 0.377828 0.421306 0.316215 0.328576 0.477724
predicted yaofang:
甘草 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
190. 
patient tongue id: 02211431393837_1_4_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.333221 0.400948 0.327266 0.434768 0.310721 0.331277
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
191. 
patient tongue id: 02212230165457_1_2_4
label yaofang:
茯苓 桔梗 橘红 芦根 浙贝母 莱菔子 鳖甲 扁豆花 紫苏子 浮小麦 白花蛇舌 蜂房 四季青 红豆杉
0.85072 0.463563 0.5227 0.458065 0.306865 0.348846 0.357938
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
192. 
patient tongue id: 04260746466167_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.30451 0.311651 0.385036 0.417503 0.320528 0.342556 0.343717 0.340013 0.306808 0.376198 0.307864 0.577564 0.311505 0.301363
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 干姜 紫菀 百部 炙甘草 紫苏梗 广藿香

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
193. 
patient tongue id: 03271928139865_1_4
label yaofang:
法半夏 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.389015 0.807014 0.409708 0.921828 0.594803 0.690739 0.31579 0.309366 0.315807 0.86107 0.861817 0.783617 0.89378 0.310812 0.929814 0.451507 0.533427 0.499571 0.719485
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.923077, error: 0.368421
194. 
patient tongue id: 03171053199903_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.43436 0.357971 0.388857 0.33642 0.485343 0.488579 0.391284 0.332513 0.401009 0.325946 0.340471 0.333544 0.357938 0.338157 0.355989 0.357373
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.687500, recall: 0.916667, error: 0.312500
195. 
patient tongue id: 04112042173492_6_5
label yaofang:
甘草 柴胡 白芍 木香 薏苡仁 白及 党参 白术 黄连 山药 益智仁 桑螵蛸 佛手 麸炒枳壳
0.969538 0.491425 0.311011 0.595707 0.416196 0.36504 0.582503 0.564447 0.548194 0.453017 0.456998 0.457946
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
196. 
patient tongue id: 05090831322810_1_3
label yaofang:
柴胡 茯苓 黄芪 茵陈 白花蛇舌草
0.409521 0.369701 0.448813 0.469517 0.316163 0.322342
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝

------Score: precision: 0.333333, recall: 0.400000, error: 0.666667
197. 
patient tongue id: 03211935355960_4
label yaofang:
柴胡 黄芩 党参 白术 侧柏叶 泽泻 天麻 姜半夏 炙甘草 续断
0.326715 0.53862 0.334012 0.340797 0.308037 0.381066 0.349814 0.349317 0.435974 0.623903 0.723652 0.368973
predicted yaofang:
柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.416667, recall: 0.500000, error: 0.583333
198. 
patient tongue id: 01201317515436_1_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 牛蒡子 浙贝母 茜草 天麻 鳖甲 诃子 蜈蚣 白花蛇舌 岗梅根 四季青
0.949897 0.48346 0.325971 0.582531 0.443764 0.313477 0.375614 0.542705 0.544544 0.541972 0.437499 0.441585 0.430903
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
199. 
patient tongue id: 06010233594224_4_7
label yaofang:
甘草 柴胡 白芍 茯苓 浙贝母 牡丹皮 郁金 茵陈 虎杖 决明子 蜂房 红曲
0.850018 0.455992 0.522639 0.468394 0.328225 0.401795 0.324605 0.412359
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.166667, error: 0.750000
200. 
patient tongue id: 06091835387355_5
label yaofang:
甘草 白芍 当归 独活 党参 槟榔 乌药 钩藤 车前子 天麻 全蝎 肉苁蓉 火麻仁 姜半夏 瓜蒌子 制枳实
0.809754 0.316698 0.404813 0.513834 0.421787 0.326158
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
201. 
patient tongue id: 03081819132815_1_4_7
label yaofang:
党参 黄芪 白术 海螵蛸 浙贝母 杜仲 厚朴 山楂 淫羊藿 火麻仁 鸡内金 桑螵蛸 北沙参 蜈蚣 鲜龙葵果
0.432895 0.398639 0.491308 0.347586 0.59412 0.558346 0.329078 0.472182 0.334694 0.303219 0.405544 0.381679
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
202. 
patient tongue id: 06072313215898_1_7_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桃仁 远志 细辛 款冬花 苦杏仁 炙麻黄 紫苏梗
0.976494 0.488644 0.60744 0.401805 0.352712 0.603748 0.585257 0.54804 0.466837 0.472764 0.478293
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.166667, error: 0.818182
203. 
patient tongue id: 03151852280477_1_4
label yaofang:
甘草 牛蒡子 浙贝母 射干 豆蔻 马勃 姜半夏 广藿香 龙脷叶
0.309991 0.492587 0.303623 0.32011 0.32708 0.34303 0.317868 0.307584 0.422026 0.552335 0.682984 0.311825
predicted yaofang:
柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.166667, recall: 0.222222, error: 0.833333
204. 
patient tongue id: 06041120382959_2_4
label yaofang:
茯苓 牡蛎 防风 麦冬 玉竹 党参 太子参 黄芪 枸杞子 白术 山药 芡实 北沙参 干石斛 煅龙骨
0.375422 0.753793 0.423787 0.856037 0.561305 0.618873 0.325778 0.322137 0.321411 0.780275 0.775532 0.709602 0.813104 0.310901 0.884388 0.421279 0.505942 0.486792 0.652658
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.157895, recall: 0.200000, error: 0.842105
205. 
patient tongue id: 01042304321914_4
label yaofang:
甘草 浙贝母 牛膝 苍术 干姜 草果 仙鹤草 淡竹叶 生石膏 豆蔻 姜半夏 川木通 龙脷叶
0.426586 0.309895 0.471451 0.392358 0.411286 0.302737 0.345274 0.472491
predicted yaofang:
甘草 柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
206. 
patient tongue id: 01312300226144_7_6_2
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 天麻 鳖甲 麦芽 首乌藤 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.955827 0.48486 0.595442 0.432493 0.359252 0.525897 0.499895 0.503789 0.378606 0.391207 0.403238
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
207. 
patient tongue id: 05140357551033_6
label yaofang:
甘草 龙骨 桃仁 党参 酸枣仁 丹参 红花 郁金 厚朴 天麻 全蝎 鳖甲 火麻仁 王不留行 瓜蒌子 浮小麦
0.912482 0.4747 0.30424 0.554252 0.497022 0.337961 0.421057 0.389266 0.491864 0.317366
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
208. 
patient tongue id: 06080218074044_6_1_4
label yaofang:
甘草 法半夏 前胡 桃仁 远志 党参 天麻 鳖甲 白前 苦杏仁 紫苏子 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.980004 0.494953 0.300945 0.604415 0.410584 0.367455 0.627865 0.6135 0.586665 0.496054 0.508076 0.522837
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
209. 
patient tongue id: 02170808596620_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.85469 0.459591 0.507628 0.313433 0.451523 0.354598 0.34539
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
210. 
patient tongue id: 03290703239550_6_1
label yaofang:
甘草 白芍 茯苓 木香 白术 生地黄 牡丹皮 山药 白茅根 泽泻 菟丝子 益母草 芡实 益智 蜈蚣 广金钱草
0.985009 0.503259 0.617591 0.403274 0.354198 0.602595 0.615485 0.570904 0.49616 0.486913 0.485446
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
211. 
patient tongue id: 02191026066517_2_7
label yaofang:
甘草 白芍 荆芥 防风 红花 地黄 天麻 火麻仁 白花蛇舌草 麦芽 白鲜皮 制何首乌 半枝莲 醋鳖甲
0.98406 0.495632 0.613037 0.40875 0.363117 0.620521 0.611874 0.580851 0.486634 0.494422 0.506584
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
212. 
patient tongue id: 04142239147562_6_4_1
label yaofang:
甘草 白芍 法半夏 茯苓 党参 酸枣仁 黄连 生地黄 山药 石菖蒲 鳖甲 首乌藤 白花蛇舌 天山雪莲 合欢花
0.975762 0.508079 0.30503 0.604571 0.384368 0.344658 0.59216 0.570313 0.521399 0.449037 0.449475 0.423237
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
213. 
patient tongue id: 01050644521371_1_2
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 菟丝子 益母草 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.901386 0.309582 0.427121 0.534381 0.43043 0.392329 0.336291 0.38189
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 1.000000, recall: 0.500000, error: 0.000000
214. 
patient tongue id: 02190542079680_6_4
label yaofang:
甘草 白芍 黄芩 茯苓 桔梗 金银花 浙贝母 天麻 鳖甲 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜
0.450958 0.423101 0.330147 0.40247 0.378591 0.318916 0.310273 0.452941
predicted yaofang:
甘草 白芍 茯苓 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
215. 
patient tongue id: 02281928283958_1
label yaofang:
茯苓 党参 白术 乌药 肉桂 白芷 益智仁 诃子 浮小麦 百合
0.355409 0.540643 0.342892 0.331694 0.324287 0.383274 0.337827 0.354171 0.404497 0.595319 0.664067 0.353218
predicted yaofang:
柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.166667, recall: 0.200000, error: 0.833333
216. 
patient tongue id: 04272305356455_6_4
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮
0.797327 0.324829 0.429458 0.504516 0.458192 0.309092
predicted yaofang:
甘草 白芍 茯苓 党参 白术 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
217. 
patient tongue id: 03242133426313_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.331168 0.516152 0.321303 0.325168 0.345288 0.384059 0.305986 0.327739 0.381853 0.5451 0.641253 0.330267
predicted yaofang:
柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.500000, recall: 0.545455, error: 0.500000
218. 
patient tongue id: 05172057505966_2_6
label yaofang:
甘草 柴胡 白芍 茯苓 白术 黄连 延胡索 川楝子 山药 泽泻 车前子 五灵脂 桑寄生 桑螵蛸
0.981336 0.491093 0.591715 0.41673 0.339635 0.551475 0.568339 0.549981 0.430811 0.442569 0.411561
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
219. 
patient tongue id: 03181805202709_2_6
label yaofang:
甘草 茯苓 太子参 白术 五味子 浙贝母 郁金 山药 山茱萸 天麻 鳖甲 淫羊藿 补骨脂 蜈蚣 白花蛇舌 天山雪莲 川加皮
0.478349 0.38474 0.427862 0.48606 0.439049
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.176471, error: 0.400000
220. 
patient tongue id: 03170916165006_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.458667 0.379068 0.449549 0.471566 0.360314 0.327755
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
221. 
patient tongue id: 05161913566401_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄
0.404831 0.742088 0.417361 0.864463 0.575754 0.660653 0.354996 0.362187 0.363275 0.307942 0.792682 0.797806 0.731189 0.83228 0.33362 0.889944 0.456562 0.316891 0.538236 0.498996 0.675536
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 1.000000, error: 0.285714
222. 
patient tongue id: 01041812199397_2
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 炒紫苏子 蜜麻黄 北海参 醋五味子
0.387749 0.343221 0.335259 0.31017 0.397246 0.524721 0.802527 0.300836 0.307838
predicted yaofang:
法半夏 茯苓 桔梗 防风 干姜 紫菀 炙甘草 紫苏梗 广藿香

------Score: precision: 0.444444, recall: 0.250000, error: 0.555556
223. 
patient tongue id: 02161834335559_1
label yaofang:
陈皮 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.393816 0.862234 0.404827 0.951572 0.658042 0.745635 0.357154 0.350704 0.345906 0.902582 0.904922 0.835609 0.921601 0.308085 0.960518 0.481508 0.588079 0.523673 0.766615
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
224. 
patient tongue id: 02211403126167_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.478332 0.391935 0.44845 0.405312 0.364402
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
225. 
patient tongue id: 05242002307658_1_7
label yaofang:
桂枝 甘草 川芎 茯苓 鸡血藤 白术 红花 赤芍 牡丹皮 天麻 全蝎 僵蚕
0.984052 0.502868 0.308641 0.61458 0.420194 0.37937 0.610517 0.612147 0.574544 0.485332 0.491827 0.481725
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
226. 
patient tongue id: 05162143340353_1_2
label yaofang:
甘草 白芍 川芎 茯苓 党参 枸杞子 白术 酸枣仁 生地黄 赤芍 细辛 天麻 白芷 菟丝子 益母草 建曲
0.980314 0.504892 0.305916 0.614683 0.418474 0.30196 0.363667 0.586532 0.592895 0.55374 0.476522 0.475459 0.461019
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
227. 
patient tongue id: 05261922343216_3
label yaofang:
白芍 桔梗 五味子 僵蚕 百部 苦杏仁 紫苏子 炙甘草 紫苏叶 紫苑
0.557424 0.415699 0.428055 0.425479 0.469308
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
228. 
patient tongue id: 03151853179476_6_1
label yaofang:
桂枝 柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.348741 0.553185 0.351074 0.328574 0.319117 0.368805 0.338933 0.317358 0.4177 0.607513 0.710924 0.341918
predicted yaofang:
柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.500000, recall: 0.545455, error: 0.500000
229. 
patient tongue id: 05221923039529_1
label yaofang:
陈皮 法半夏 大枣 茯苓 桔梗 牛蒡子 白术 大腹皮 厚朴 白芷 炙甘草 紫苏叶 广藿香 徐长卿
0.330665 0.517075 0.323273 0.331734 0.377911 0.313511 0.321742 0.414094 0.541904 0.660133 0.325809
predicted yaofang:
柴胡 白芍 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
230. 
patient tongue id: 04112045506199_2
label yaofang:
甘草 桔梗 鸡血藤 酸枣仁 丹参 生地黄 浙贝母 山茱萸 天花粉 鳖甲 补骨脂 麦芽 白花蛇舌 蜂房 四季青
0.965773 0.492277 0.598545 0.424705 0.358758 0.562033 0.546366 0.525977 0.433331 0.435553 0.437317
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
231. 
patient tongue id: 03100450513393_5_7
label yaofang:
甘草 白芍 茯苓 独活 党参 鸡血藤 生地黄 杜仲 细辛 桑寄生 三棱 莪术 制川乌 续断 牛大力
0.673133 0.44331 0.46213 0.363069 0.477479 0.320257
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
232. 
patient tongue id: 01200647149022_1_4
label yaofang:
甘草 薏苡仁 党参 白术 酸枣仁 砂仁 天麻 豆蔻 白花蛇舌草 白扁豆 建曲 蜈蚣 半枝莲 醋鳖甲
0.993786 0.492051 0.64294 0.398851 0.353957 0.677715 0.658312 0.640332 0.504693 0.52584 0.541442
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
233. 
patient tongue id: 01182133515805_6_4
label yaofang:
甘草 香附 党参 丹参 生地黄 郁金 薤白 天麻 瓜蒌皮 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲
0.818236 0.322487 0.448329 0.478367 0.415031 0.316286 0.30715
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
234. 
patient tongue id: 01250700390934_1_2_6
label yaofang:
甘草 党参 酸枣仁 丹参 生地黄 知母 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.931769 0.476435 0.544398 0.395561 0.335995 0.508 0.446383 0.456074 0.339172 0.351432 0.364433
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
235. 
patient tongue id: 05251947342804_7_5
label yaofang:
甘草 桃仁 玄参 赤芍 牡丹皮 厚朴 僵蚕 北沙参 板蓝根 蜈蚣 猫爪草 姜黄
0.562602 0.411862 0.411505 0.3941 0.528159 0.605067 0.320771 0.403903 0.339472 0.324587 0.321183
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
236. 
patient tongue id: 02242335338929_1_5_7
label yaofang:
牡蛎 生地黄 牡丹皮 杜仲 牛膝 山茱萸 砂仁 莪术 北沙参 白鲜皮 蜈蚣 红豆杉 土茯苓 山慈菇 蛇舌草 鸭脚艾
0.465122 0.395452 0.403388 0.46103 0.448055 0.304035
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
237. 
patient tongue id: 03282206494925_6_7
label yaofang:
甘草 白芍 川芎 茯苓 党参 白术 酸枣仁 生地黄 天麻 淡竹叶 麦芽 首乌藤 川木通
0.901383 0.452757 0.515222 0.481708 0.333827 0.390795
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.384615, error: 0.166667
238. 
patient tongue id: 03152050489573_1_4_7
label yaofang:
川芎 法半夏 防风 鸡血藤 乳香 胆南星 藿香 白芷 辛夷 苍耳子 芥子 醋没药
0.329408 0.857757 0.384754 0.944297 0.64137 0.736885 0.316472 0.304717 0.889649 0.887814 0.827343 0.914888 0.951954 0.467345 0.563063 0.521074 0.7648
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.176471, recall: 0.250000, error: 0.823529
239. 
patient tongue id: 02171852021553_4
label yaofang:
法半夏 前胡 防风 钩藤 荆芥穗 白芷 香薷 百部 炙甘草 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.384546 0.855618 0.406567 0.950788 0.645186 0.743096 0.330472 0.315487 0.324442 0.900581 0.904587 0.8344 0.922938 0.317049 0.955364 0.477984 0.580405 0.517938 0.763236
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.368421, recall: 0.538462, error: 0.631579
240. 
patient tongue id: 02171933452205_1_7_4
label yaofang:
桃仁 黄芪 鸡血藤 白术 浙贝母 杜仲 山药 砂仁 淫羊藿 莪术 玉米须 土鳖虫 合欢皮 山慈菇 预知子
0.553497 0.422093 0.412159 0.399431 0.445279
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
241. 
patient tongue id: 01182205204822_2
label yaofang:
甘草 桔梗 麦冬 太子参 酸枣仁 生地黄 浙贝母 知母 鳖甲 北沙参 浮小麦 白花蛇舌 蜂房 岗梅根 四季青
0.89983 0.458954 0.528696 0.392768 0.31169 0.464305 0.394585 0.402924 0.302636 0.304654
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.133333, error: 0.800000
242. 
patient tongue id: 04252302502287_3_4
label yaofang:
甘草 党参 酸枣仁 玄参 生地黄 牛膝 山药 山茱萸 白茅根 天麻 蔓荆子 鳖甲 皂角刺 益智 蜈蚣 白花蛇舌 天山雪莲
0.820672 0.461122 0.323532 0.519556 0.307861 0.451243 0.304372 0.344082 0.414664 0.328678 0.403208
predicted yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 浙贝母 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.545455, recall: 0.352941, error: 0.454545
243. 
patient tongue id: 03222003039851_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.346146 0.312936 0.47285 0.387763 0.381938 0.347749 0.453968 0.547288
predicted yaofang:
甘草 柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
244. 
patient tongue id: 03012245290835_6_5
label yaofang:
甘草 柴胡 白芍 葛根 木香 延胡索 川楝子 山药 砂仁 赤石脂 桑寄生 芡实 桑螵蛸 豆蔻 麸炒枳壳
0.979567 0.501996 0.312098 0.613658 0.413879 0.370351 0.602534 0.608461 0.58279 0.492649 0.493996 0.487644
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
245. 
patient tongue id: 05092110537960_6
label yaofang:
甘草 柴胡 枳壳 桔梗 黄芪 白术 枳实 槟榔 厚朴 肉苁蓉 火麻仁 紫菀
0.428376 0.311349 0.456008 0.309003 0.405641 0.411363 0.311519 0.352575 0.468318
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
246. 
patient tongue id: 03231026433328_4_6
label yaofang:
甘草 白芍 木香 薏苡仁 党参 白术 槟榔 砂仁 莱菔子 鳖甲 莪术 白扁豆 蜈蚣 白花蛇舌 红豆杉
0.87436 0.459106 0.307738 0.512093 0.436522 0.303014 0.394837 0.356955 0.427612
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.666667, recall: 0.400000, error: 0.333333
247. 
patient tongue id: 03041133174115_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.385855 0.758428 0.421043 0.861158 0.567462 0.640104 0.337586 0.348309 0.351133 0.785266 0.785035 0.714836 0.823268 0.316819 0.893951 0.443063 0.302686 0.52929 0.486665 0.661871
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
248. 
patient tongue id: 05232027564264_5
label yaofang:
陈皮 桔梗 鸡血藤 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 威灵仙 山慈菇
0.482995 0.42664 0.336274 0.398017 0.405125 0.397303
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
249. 
patient tongue id: 05272349588036_1_2_5
label yaofang:
茯苓 黄芪 白术 延胡索 海螵蛸 浙贝母 山药 砂仁 三七 补骨脂 枇杷叶 北沙参 紫苏梗
0.494846 0.407787 0.342966 0.386309 0.514526 0.560754 0.387238 0.313619 0.308485 0.32128
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.500000, recall: 0.384615, error: 0.500000
250. 
patient tongue id: 03011854019165_2_1
label yaofang:
陈皮 前胡 防风 太子参 黄芪 白前 百部 北沙参 蝉蜕 炙甘草 地肤子 蜜麻黄 麸炒白术 炒僵蚕
0.464202 0.334089 0.434275 0.342632 0.342886 0.304938
predicted yaofang:
甘草 法半夏 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
251. 
patient tongue id: 06111044584201_7_2
label yaofang:
甘草 芦根 桃仁 远志 酸枣仁 生地黄 浙贝母 天麻 鳖甲 紫菀 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫
0.968831 0.494204 0.315728 0.600624 0.428914 0.371636 0.580544 0.569149 0.543911 0.459434 0.462174 0.454669
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
252. 
patient tongue id: 05242236185036_2_6
label yaofang:
甘草 川芎 茯苓 党参 白术 生地黄 牛膝 天麻 磁石 蔓荆子 桑寄生 麦芽 女贞子 沙苑子 墨旱莲
0.98557 0.50766 0.613351 0.436523 0.351257 0.592688 0.608195 0.570353 0.472406 0.47563 0.470669
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
253. 
patient tongue id: 05032238237956_2_7
label yaofang:
甘草 茯苓 党参 郁金 山药 天麻 鳖甲 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 有瓜石斛
0.649608 0.316388 0.454186 0.44814 0.309977 0.420039
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
254. 
patient tongue id: 01041826151406_2
label yaofang:
法半夏 葛根 前胡 太子参 黄芪 细辛 干姜 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 蜜麻黄 麸炒白术 干石斛
0.371112 0.597565 0.435329 0.683908 0.471116 0.530079 0.316627 0.317296 0.615563 0.619103 0.557318 0.643791 0.337359 0.706209 0.399336 0.301241 0.432033 0.355903 0.495348
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.625000, error: 0.473684
255. 
patient tongue id: 04131713180758_1_3
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.341098 0.614 0.416499 0.728979 0.460864 0.55214 0.647864 0.64427 0.60615 0.707228 0.327429 0.736919 0.410288 0.420564 0.399546 0.549817
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
256. 
patient tongue id: 03231303089391_6_7
label yaofang:
甘草 川芎 茯苓 远志 党参 酸枣仁 知母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.94078 0.472356 0.307419 0.576186 0.43581 0.359838 0.553141 0.52524 0.532798 0.417376 0.430124 0.455465
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
257. 
patient tongue id: 04102037410659_4_6
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 白花蛇舌草 白扁豆 山慈菇
0.529526 0.317569 0.476056 0.315884 0.419868 0.409192 0.30539 0.314074 0.380449
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 浙贝母 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.363636, error: 0.555556
258. 
patient tongue id: 03231632217563_4
label yaofang:
茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香
0.401941 0.740751 0.434217 0.854827 0.556996 0.635159 0.345106 0.342944 0.326543 0.780929 0.790681 0.71696 0.82413 0.361171 0.886397 0.422798 0.303479 0.528371 0.489484 0.669817
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.923077, error: 0.400000
259. 
patient tongue id: 01070832228124_1_4_7
label yaofang:
人参 当归 黄芪 乌药 山药 肉苁蓉 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.436934 0.369663 0.387281 0.331689 0.473736 0.466532 0.375613 0.322911 0.402099 0.342863 0.335154 0.325327 0.355916 0.345169 0.353977 0.356319
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.062500, recall: 0.076923, error: 0.937500
260. 
patient tongue id: 01192238329015_4_1
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 酸枣仁 山药 天麻 鳖甲 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.990154 0.501752 0.307345 0.627677 0.39834 0.302953 0.386334 0.686946 0.664629 0.644447 0.544423 0.565929 0.576098
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
261. 
patient tongue id: 06070747395893_1_3_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌
0.404946 0.320622 0.316207 0.452349 0.509929 0.324021 0.348742
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
262. 
patient tongue id: 06140823214547_1_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 车前子 干姜
0.42082 0.354198 0.364947 0.308489 0.464979 0.461831 0.378827 0.300554 0.387791 0.327379 0.314975 0.338501 0.318226 0.317761 0.33183
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.333333, recall: 0.416667, error: 0.666667
263. 
patient tongue id: 06190755366257_1_7
label yaofang:
甘草 独活 党参 鸡血藤 白术 地黄 天麻 桑寄生 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 牛大力 千斤拔 络石藤
0.980964 0.485234 0.613443 0.398075 0.349708 0.627539 0.58899 0.558507 0.463319 0.477845 0.493187
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
264. 
patient tongue id: 03111445478244_7_6_1
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 酸枣仁 浙贝母 郁金 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫 红豆杉
0.841375 0.333421 0.304749 0.475572 0.33414 0.524149 0.4309 0.327106 0.356586 0.464704 0.411772 0.424932 0.3328 0.338173 0.331331
predicted yaofang:
甘草 白芍 法半夏 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.705882, error: 0.200000
265. 
patient tongue id: 02181606257339_6_4_7
label yaofang:
柴胡 白芍 茯苓 党参 酸枣仁 五味子 牡丹皮 山药 地黄 菟丝子 益母草 麦芽 首乌藤 酒黄精
0.986139 0.484624 0.623354 0.407403 0.372502 0.67367 0.658502 0.650323 0.533862 0.550865 0.590971
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
266. 
patient tongue id: 03230722168819_6_5_2
label yaofang:
甘草 白芍 川芎 法半夏 茯苓 麦冬 白术 酸枣仁 生地黄 牡丹皮 苍术 天麻 僵蚕 磁石 蒺藜 浮小麦
0.936491 0.474682 0.305651 0.5468 0.496851 0.333881 0.424084 0.427183 0.494094 0.310587 0.318291 0.317592
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
267. 
patient tongue id: 03290715081744_5
label yaofang:
甘草 黄芩 前胡 桔梗 薄荷 牛蒡子 桃仁 浙贝母 桑白皮 白前 枇杷叶 苦杏仁
0.742929 0.313246 0.459355 0.462948 0.389618 0.306224
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
268. 
patient tongue id: 02211955460387_6_4
label yaofang:
甘草 法半夏 牛蒡子 远志 党参 浙贝母 郁金 天麻 鳖甲 夏枯草 蜈蚣 白花蛇舌 四季青 猫爪草
0.950432 0.480007 0.579667 0.439112 0.34325 0.500327 0.424583 0.469844 0.302381 0.322372 0.333919
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
269. 
patient tongue id: 02122222429102_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 薏苡仁 白术 熟附子 延胡索 天麻 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.977852 0.490712 0.603518 0.416783 0.358841 0.568625 0.573963 0.548925 0.44753 0.453668 0.441734
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
270. 
patient tongue id: 06012133591797_6_4_7
label yaofang:
桂枝 甘草 茯苓 羌活 鸡血藤 白术 红花 赤芍 牡丹皮 天麻 僵蚕 粉葛 蜈蚣
0.977317 0.501461 0.30063 0.611471 0.425302 0.369681 0.582248 0.567395 0.544489 0.447378 0.454846 0.443834
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
271. 
patient tongue id: 05131633519116_7_1
label yaofang:
桂枝 甘草 独活 远志 党参 鸡血藤 白术 熟附子 红花 细辛 大黄 肉苁蓉 桑寄生 补骨脂 天山雪莲 牛大力
0.645907 0.433415 0.421203 0.397092 0.493373
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
272. 
patient tongue id: 05140846301133_5_2_8
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 薄荷 牛蒡子 浙贝母 鳖甲 诃子 紫苏梗 白花蛇舌 蜂房 岗梅根 四季青
0.593611 0.437044 0.46102 0.390961 0.44656
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
273. 
patient tongue id: 05130655189271_2_6
label yaofang:
甘草 枳壳 白术 玄参 生地黄 牛膝 厚朴 天麻 肉苁蓉 鳖甲 火麻仁 蜈蚣 天山雪莲 半枝莲
0.949385 0.479423 0.306235 0.578308 0.397771 0.357422 0.549252 0.523942 0.512098 0.40053 0.428331 0.4213
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
274. 
patient tongue id: 05311935319321_5
label yaofang:
甘草 桔梗 金银花 连翘 薄荷 芦根 牛蒡子 桑白皮 淡豆豉 淡竹叶 射干 板蓝根 龙脷叶
0.455878 0.388078 0.350613 0.355672 0.527073 0.552761 0.370067 0.313128
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 合欢皮

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
275. 
patient tongue id: 03101919528667_1
label yaofang:
陈皮 当归 党参 黄芪 白术 海螵蛸 白芷 升麻 北柴胡 炙甘草
0.347271 0.366921 0.353561 0.309228 0.33638 0.443981
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.666667, recall: 0.400000, error: 0.333333
276. 
patient tongue id: 05241946143005_4_6
label yaofang:
桂枝 甘草 白芍 茯苓 党参 白术 生地黄 熟附子 山药 山茱萸 车前子 大腹皮 干姜 猪苓
0.96873 0.480912 0.594933 0.436261 0.359511 0.566933 0.554733 0.550111 0.433319 0.444262 0.454907
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
277. 
patient tongue id: 02111400216355_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌
0.645464 0.422354 0.452888 0.436724 0.536535
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
278. 
patient tongue id: 01192127111734_5
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 防风 金银花 浙贝母 桑白皮 荆芥穗 款冬花 苦杏仁 紫苏子 炙麻黄 贯众
0.916834 0.471073 0.328924 0.549887 0.46497 0.353623 0.48288 0.458613 0.509938 0.356974 0.371925 0.377449
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.125000, error: 0.833333
279. 
patient tongue id: 02171823234001_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.396854 0.82519 0.413774 0.929908 0.617543 0.7139 0.332929 0.334498 0.327082 0.86911 0.877854 0.799703 0.901488 0.329958 0.948374 0.454471 0.573231 0.507205 0.739472
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
280. 
patient tongue id: 01032340551599_5_6
label yaofang:
甘草 法半夏 茯苓 党参 白术 杜仲 郁金 石菖蒲 天麻 桑寄生 麦芽 地龙 辛夷 合欢花
0.974738 0.495948 0.306875 0.597902 0.429821 0.308687 0.373632 0.576338 0.57545 0.564002 0.458794 0.46342 0.470964
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
281. 
patient tongue id: 01061929540850_9
label yaofang:
柴胡 前胡 半夏 防风 薄荷 荆芥穗 香薷 紫菀 白扁豆 辛夷 紫苏梗 广藿香 苍耳子
0.425998 0.40474 0.470259 0.348084 0.412265 0.36454 0.390313 0.39443 0.380439 0.475246 0.361685 0.537493 0.305178 0.303099
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 蜜麻黄

------Score: precision: 0.285714, recall: 0.307692, error: 0.714286
282. 
patient tongue id: 02201812563960_7_4
label yaofang:
甘草 白芍 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 炒僵蚕
0.373844 0.777216 0.406408 0.893534 0.581992 0.678428 0.324314 0.326581 0.338455 0.817266 0.82107 0.757794 0.853859 0.311619 0.90169 0.469958 0.534608 0.495095 0.684394
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.105263, recall: 0.142857, error: 0.894737
283. 
patient tongue id: 02211840585641_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.379299 0.426374 0.325462 0.406704 0.304883 0.304867
predicted yaofang:
甘草 茯苓 党参 黄芪 北沙参 炙甘草

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
284. 
patient tongue id: 03171219124535_1_2
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 黄芪 五味子 熟地黄 火麻仁 炙甘草 黑枣
0.458486 0.386804 0.340938 0.317627 0.480295 0.45159 0.354418 0.359419
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 牛膝

------Score: precision: 0.375000, recall: 0.272727, error: 0.625000
285. 
patient tongue id: 05261921069247_2
label yaofang:
柴胡 香附 半夏 龙骨 牡蛎 麦冬 太子参 五味子 肉苁蓉 首乌藤 黄精 合欢皮
0.454806 0.382394 0.362479 0.418403 0.466451
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
286. 
patient tongue id: 05182037284021_1_4
label yaofang:
柴胡 黄芩 党参 白术 泽泻 天麻 白芷 姜半夏 炙甘草 续断
0.306794 0.521186 0.303847 0.372738 0.316818 0.321388 0.433903 0.54094 0.709454 0.342535
predicted yaofang:
柴胡 白芍 牛蒡子 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.400000, recall: 0.400000, error: 0.600000
287. 
patient tongue id: 03040843554012_1
label yaofang:
甘草 薏苡仁 党参 白术 山药 砂仁 天麻 鳖甲 莪术 白扁豆 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花
0.868669 0.473962 0.321489 0.534591 0.458619 0.310559 0.342251 0.415782 0.391281 0.449232 0.300241 0.301898
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
288. 
patient tongue id: 05162140495729_1_2_6
label yaofang:
甘草 川芎 芦根 党参 浙贝母 天麻 白芷 蔓荆子 鳖甲 辛夷 广藿香 苍耳子 白花蛇舌 蜂房 四季青 红曲
0.956072 0.471626 0.575532 0.471346 0.337331 0.478268 0.468216 0.505858 0.34423 0.349451 0.3519
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
289. 
patient tongue id: 03141555139924_1_3_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.32772 0.324451 0.488424
predicted yaofang:
茯苓 党参 炙甘草

------Score: precision: 0.666667, recall: 0.153846, error: 0.333333
290. 
patient tongue id: 05131555385714_1_2_5
label yaofang:
甘草 柴胡 当归 薏苡仁 党参 黄芪 红花 赤芍 熟地黄 天麻 败酱草 皂角刺 女贞子 广升麻 墨旱莲
0.845808 0.451981 0.517235 0.316289 0.461723 0.310955 0.35195 0.375201
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
291. 
patient tongue id: 03311802088239_1_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 钩藤 细辛 白芷 辛夷 紫苏梗 广藿香 炒苍耳子 炒蔓荆子
0.399187 0.859817 0.403311 0.946544 0.65374 0.745216 0.358023 0.358562 0.351433 0.892134 0.900509 0.829662 0.916433 0.302266 0.964593 0.470529 0.304721 0.613585 0.526731 0.761541
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.642857, error: 0.550000
292. 
patient tongue id: 03142040163331_6
label yaofang:
白芍 香附 法半夏 党参 延胡索 海螵蛸 北柴胡 麦芽 炙甘草 紫苏梗 猫爪草
0.496186 0.42983 0.320043 0.412563 0.448073 0.309801 0.358643
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 炙甘草

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
293. 
patient tongue id: 03081417065857_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.412635 0.378316 0.436034 0.387731 0.307489 0.304161
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
294. 
patient tongue id: 02142142413946_6_2
label yaofang:
甘草 柴胡 白芍 槟榔 杜仲 天麻 肉苁蓉 火麻仁 补骨脂 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.94364 0.466197 0.538165 0.464123 0.310782 0.41241 0.34938 0.468076
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
295. 
patient tongue id: 05232034418153_6
label yaofang:
桂枝 柴胡 白芍 黄芩 党参 郁金 姜半夏 炙甘草 土茯苓
0.616335 0.442898 0.331173 0.45 0.419177 0.309996
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.333333, recall: 0.222222, error: 0.666667
296. 
patient tongue id: 03111502323218_6_7_2
label yaofang:
甘草 薏苡仁 党参 郁金 山药 天麻 鳖甲 莪术 北沙参 白扁豆 辛夷 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.974668 0.4966 0.305986 0.602375 0.430431 0.372303 0.583318 0.585154 0.56484 0.46974 0.474633 0.481236
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
297. 
patient tongue id: 03232317404929_4_6
label yaofang:
桂枝 甘草 防风 金银花 黄芪 白术 生地黄 红花 赤芍 石膏 水牛角 荆芥穗 火麻仁 麦芽 苦参 白鲜皮
0.938022 0.302143 0.481051 0.307347 0.574909 0.433333 0.312504 0.353415 0.518433 0.505297 0.502513 0.407636 0.408173 0.401021
predicted yaofang:
甘草 白芍 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.142857, recall: 0.125000, error: 0.857143
298. 
patient tongue id: 05162149375094_6_2_7
label yaofang:
甘草 茯苓 龙骨 党参 黄芪 酸枣仁 生地黄 牡丹皮 黄柏 山药 山茱萸 泽泻 仙鹤草 茜草 墨旱莲
0.974606 0.49383 0.332673 0.606972 0.426641 0.303202 0.319153 0.382729 0.59345 0.6108 0.56713 0.497343 0.506489 0.486728
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 生地黄 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.333333, error: 0.642857
299. 
patient tongue id: 01312313178519_1_2_7
label yaofang:
甘草 茯苓 薏苡仁 桃仁 太子参 五味子 山药 山茱萸 天麻 鳖甲 补骨脂 莪术 黄精 蜈蚣 白花蛇舌 红豆杉
0.975529 0.500473 0.322449 0.613063 0.400555 0.370685 0.604077 0.582443 0.559403 0.455666 0.475141 0.465223
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
300. 
patient tongue id: 04192228036581_2_4
label yaofang:
甘草 桔梗 远志 浙贝母 天麻 鳖甲 款冬花 紫菀 诃子 苦杏仁 蜈蚣 天山雪莲 半枝莲
0.902822 0.479225 0.323313 0.54765 0.445726 0.317088 0.351156 0.452757 0.439723 0.461949 0.349636 0.352137 0.343022
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.538462, error: 0.461538
301. 
patient tongue id: 04101908493569_2_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.33286 0.455733 0.443145 0.497211 0.377557 0.338494 0.399762 0.376456 0.428036 0.429359 0.377905 0.495379 0.410747 0.558571 0.30618 0.300772 0.333415
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 半夏 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.588235, recall: 0.714286, error: 0.411765
302. 
patient tongue id: 05031809059292_2
label yaofang:
茯苓 枸杞子 五味子 栀子 牡丹皮 黄柏 知母 山药 地黄 泽泻 地骨皮 菟丝子 山萸肉 女贞子 桑椹
0.621748 0.386943 0.446375 0.329381 0.493202
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
303. 
patient tongue id: 03061810071086_1_6_5
label yaofang:
甘草 白芍 陈皮 桔梗 防风 白术 浙贝母 鳖甲 豆蔻 粉葛 紫苏梗 广藿香 白花蛇舌 天山雪莲 蜂房
0.923843 0.312944 0.468715 0.544869 0.430933 0.321149 0.330403 0.479512 0.467487 0.463134 0.369306 0.378223 0.356462
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
304. 
patient tongue id: 05172117343802_4_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 蒲公英 白及 党参 黄连 胆南星 麦芽 浮小麦 鱼古 麸炒枳壳 煅瓦楞子
0.84708 0.432999 0.500938 0.327486 0.531832 0.308052 0.426489
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
305. 
patient tongue id: 02212005360808_2_7_6
label yaofang:
甘草 茯苓 龙骨 党参 黄芪 生地黄 牡丹皮 黄柏 山药 地骨皮 糯稻根 淫羊藿 仙茅 龟甲
0.979908 0.504669 0.311594 0.604867 0.421856 0.373145 0.598422 0.590335 0.573088 0.470887 0.483012 0.481001
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
306. 
patient tongue id: 02231812462867_2
label yaofang:
法半夏 茯苓 前胡 桔梗 黄芪 干姜 款冬花 白前 百部 北沙参 广藿香 蜜麻黄
0.393589 0.871971 0.390267 0.961617 0.65592 0.76197 0.34598 0.329265 0.346948 0.918255 0.920771 0.85341 0.93531 0.31057 0.965886 0.498172 0.59144 0.523662 0.774173
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.916667, error: 0.421053
307. 
patient tongue id: 03231055593855_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.371648 0.489985 0.441666 0.540101 0.415164 0.317683 0.443509 0.358687 0.481955 0.503364 0.438829 0.529793 0.400385 0.627211 0.331015 0.313747 0.363341 0.403042
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 半夏 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄

------Score: precision: 0.611111, recall: 0.733333, error: 0.388889
308. 
patient tongue id: 03020741466184_1_4
label yaofang:
甘草 茯苓 龙骨 党参 酸枣仁 生地黄 山药 砂仁 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.845971 0.449115 0.518767 0.463929 0.31559 0.385201 0.396295
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.857143, recall: 0.400000, error: 0.142857
309. 
patient tongue id: 01211253269110_1
label yaofang:
桂枝 柴胡 黄芩 桔梗 牡蛎 干姜 天花粉 苦杏仁 炙甘草 蜜枇杷叶 人参叶
0.346786 0.318799 0.361724 0.351011 0.38462
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
310. 
patient tongue id: 05182112481424_7
label yaofang:
甘草 柴胡 白芍 香附 当归 茯苓 薄荷 桃仁 白术 鳖甲 麦芽 广藿香 土茯苓
0.324514 0.301007 0.451012 0.369442 0.411321 0.326749 0.309434 0.442383 0.519772 0.326067
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
311. 
patient tongue id: 05131446234642_4_1_7
label yaofang:
甘草 柴胡 白芍 白及 党参 黄连 延胡索 川楝子 山药 天麻 建曲 蜈蚣 半枝莲 醋鳖甲
0.863372 0.443426 0.557785 0.396799 0.333829 0.48746 0.33139 0.369113
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
312. 
patient tongue id: 04061333245927_1_6
label yaofang:
甘草 黄芩 茯苓 羌活 牛蒡子 浙贝母 荆芥穗 天麻 鳖甲 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.856113 0.457998 0.524685 0.488573 0.315002 0.341952 0.398933
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
313. 
patient tongue id: 01042316416871_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.322351 0.315657 0.483289 0.36677 0.383368 0.380344 0.48186 0.591124
predicted yaofang:
甘草 柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.363636, error: 0.500000
314. 
patient tongue id: 04272312275186_1_4
label yaofang:
桂枝 甘草 牛蒡子 浙贝母 白芷 射干 紫菀 豆蔻 马勃 姜半夏 广藿香 龙脷叶
0.43855 0.320871 0.463804 0.39719 0.41055 0.30298 0.346424 0.421949
predicted yaofang:
甘草 柴胡 白芍 党参 白术 浙贝母 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
315. 
patient tongue id: 02150019020918_1_6_2
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 当归 茯苓 党参 白术 酸枣仁 生地黄 牡丹皮 巴戟天 佛手 合欢花
0.753552 0.432268 0.467652 0.41119
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.266667, error: 0.000000
316. 
patient tongue id: 04282327129540_5
label yaofang:
甘草 法半夏 茯苓 荆芥 金银花 党参 丹参 黄连 胆南星 黄柏 茵陈 麦芽 白鲜皮 地肤子 广金钱草
0.68115 0.434342 0.471058 0.390038 0.501478 0.303313
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
317. 
patient tongue id: 05140831507723_6_7_1
label yaofang:
甘草 川芎 党参 鸡血藤 杜仲 牛膝 山药 山茱萸 钩藤 泽泻 天麻 桑寄生 豆蔻 蒺藜 首乌藤
0.982004 0.502585 0.309541 0.619164 0.423911 0.370699 0.609859 0.61078 0.584864 0.487425 0.497029 0.485159
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
318. 
patient tongue id: 04272238542589_1_2
label yaofang:
陈皮 葛根 前胡 桔梗 防风 麦冬 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 干石斛
0.315152 0.33803 0.349373 0.382934 0.744735
predicted yaofang:
法半夏 茯苓 干姜 紫菀 炙甘草

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
319. 
patient tongue id: 04112057074681_1_6_4
label yaofang:
甘草 茯苓 牡蛎 太子参 黄芪 白术 丹参 五味子 海螵蛸 砂仁 地龙 首乌藤 合欢皮 墨旱莲 山慈菇
0.491182 0.401572 0.496791 0.353427 0.597307 0.624954 0.341891 0.479432 0.370184 0.388305 0.396978
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
320. 
patient tongue id: 05310801530018_1_5
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.476543 0.391223 0.46221 0.492793 0.401251 0.332255
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
321. 
patient tongue id: 05232054545245_6_7
label yaofang:
柴胡 大枣 茯苓 防风 连翘 牛蒡子 太子参 昆布 海藻 乌梅 石斛 白花蛇舌草 猫爪草 山慈菇
0.415294 0.431274 0.39973 0.394447 0.309011 0.420444
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
322. 
patient tongue id: 04020822519215_4_7
label yaofang:
甘草 法半夏 茯苓 牡蛎 党参 白术 丹参 薤白 水蛭 天麻 瓜蒌皮 三棱 莪术 首乌藤
0.974055 0.500353 0.320105 0.609573 0.412285 0.370733 0.592836 0.600431 0.55803 0.483777 0.497855 0.472237
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
323. 
patient tongue id: 03020753173007_6_1
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 杜仲 山药 天麻 鳖甲 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.947468 0.483107 0.580325 0.422025 0.342232 0.526251 0.485831 0.498545 0.380215 0.384898 0.40292
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.785714, error: 0.000000
324. 
patient tongue id: 02221233493656_1_3_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.374554 0.325576 0.432402 0.453475 0.329108
predicted yaofang:
甘草 茯苓 党参 黄芪 牛膝

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
325. 
patient tongue id: 04071907232122_1_4
label yaofang:
生姜 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 广藿香
0.45369 0.438964 0.400502 0.458328 0.44378 0.370655
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
326. 
patient tongue id: 04061353303932_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄 炒苍耳子
0.392253 0.856466 0.404155 0.944535 0.655686 0.739648 0.368285 0.37295 0.347038 0.889903 0.895948 0.827411 0.912585 0.964019 0.451045 0.304263 0.603241 0.521306 0.760732
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.875000, error: 0.263158
327. 
patient tongue id: 02212229056485_1_2_6
label yaofang:
甘草 桃仁 生地黄 红花 车前子 天麻 没药 鳖甲 淡竹叶 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木通
0.925895 0.460962 0.51639 0.371564 0.387161 0.340753 0.39512
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
328. 
patient tongue id: 02211144438626_4_1_7
label yaofang:
甘草 川芎 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.351883 0.351092 0.380006 0.319009 0.435727 0.458396 0.379747 0.300017 0.388242 0.359736 0.329716 0.330193 0.341076 0.330602 0.350994 0.364018
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.250000, recall: 0.333333, error: 0.750000
329. 
patient tongue id: 01211311185112_4
label yaofang:
陈皮 枳壳 大枣 茯苓 桃仁 太子参 白术 青皮 厚朴 佩兰 僵蚕 姜半夏 炙甘草 蜈蚣
0.37004 0.319042 0.345812 0.40386 0.31696 0.344764 0.369482
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
330. 
patient tongue id: 03301322253689_1_4
label yaofang:
茯苓 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 豆蔻 北沙参 炙甘草 广藿香 制远志 炒六神曲 煅龙骨 炒酸枣仁
0.380718 0.803962 0.429252 0.904238 0.60509 0.668581 0.347107 0.343072 0.33646 0.838689 0.838282 0.765954 0.866573 0.325607 0.918314 0.44495 0.546186 0.509458 0.709761
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.210526, recall: 0.266667, error: 0.789474
331. 
patient tongue id: 06072124090365_4_1
label yaofang:
甘草 枳壳 连翘 党参 白术 酸枣仁 山药 莱菔子 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.967464 0.485472 0.317889 0.603597 0.442271 0.374726 0.594582 0.592976 0.593005 0.486285 0.49039 0.517973
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
332. 
patient tongue id: 04281835261486_5
label yaofang:
法半夏 薏苡仁 通草 石菖蒲 厚朴 佩兰 滑石 淡竹叶 豆蔻 苦杏仁 广藿香 牛大力 五指毛桃
0.912623 0.317181 0.453544 0.545031 0.447004 0.305891 0.397779 0.354066 0.407506
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
333. 
patient tongue id: 04121812579452_1_4
label yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.39016 0.753551 0.42881 0.890298 0.567569 0.645638 0.814898 0.818547 0.738954 0.860986 0.370681 0.897308 0.421007 0.500313 0.484559 0.698887
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.800000, error: 0.250000
334. 
patient tongue id: 03020840403574_1_6_5
label yaofang:
甘草 白芍 薏苡仁 远志 白术 枳实 厚朴 天麻 火麻仁 莪术 败酱草 苦杏仁 蜈蚣 半枝莲 醋鳖甲 淡附片
0.96419 0.478548 0.596347 0.418637 0.348158 0.584934 0.559842 0.539707 0.448507 0.458848 0.477579
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
335. 
patient tongue id: 06190141062958_1_2
label yaofang:
甘草 葛根 党参 鸡血藤 枸杞子 熟地黄 杜仲 山茱萸 天麻 桑寄生 续断 威灵仙 宽筋藤 鹿衔草
0.965286 0.479684 0.30975 0.57701 0.450566 0.350649 0.523313 0.526824 0.548321 0.402725 0.413633 0.417083
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
336. 
patient tongue id: 05312149578032_4_1
label yaofang:
甘草 枳壳 茯苓 连翘 薏苡仁 党参 白术 苍术 灯心草 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.956816 0.466874 0.587295 0.409618 0.309153 0.544898 0.499253 0.484815 0.384462 0.400692 0.408222
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.625000, error: 0.090909
337. 
patient tongue id: 06181831490006_1
label yaofang:
甘草 白芍 茯苓 蒲公英 党参 黄芪 白术 熟附子 山药 干姜 砂仁 鳖甲 蜈蚣 天山雪莲 半枝莲
0.941008 0.488145 0.311094 0.567402 0.428972 0.311732 0.352161 0.503873 0.490675 0.488 0.380495 0.384057 0.370287
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
338. 
patient tongue id: 01041828217597_1_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.389477 0.805363 0.416698 0.908458 0.614631 0.69187 0.350755 0.352248 0.342684 0.844794 0.850052 0.780517 0.875067 0.331589 0.92812 0.460599 0.310418 0.570389 0.51214 0.717933
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
339. 
patient tongue id: 04071922199692_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.414358 0.404881 0.410702 0.348274 0.391125 0.335203 0.345383 0.379992 0.342702 0.396728 0.314002 0.55529
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
340. 
patient tongue id: 03091857572666_4_1
label yaofang:
甘草 法半夏 茯苓 白术 酸枣仁 淡豆豉 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.963764 0.46736 0.591472 0.407925 0.309635 0.558498 0.525203 0.510577 0.404054 0.412148 0.414092
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
341. 
patient tongue id: 04071905032294_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.393754 0.746645 0.413913 0.871365 0.558343 0.651373 0.306213 0.322406 0.314394 0.793293 0.800883 0.720858 0.845798 0.338238 0.907622 0.422294 0.523417 0.477992 0.676575
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.923077, error: 0.368421
342. 
patient tongue id: 01140758242523_4_1
label yaofang:
甘草 白芍 川芎 党参 黄芪 白术 酸枣仁 天麻 鳖甲 沙苑子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 蒿苯
0.992678 0.492974 0.637783 0.411701 0.369 0.684598 0.690161 0.658596 0.55763 0.567533 0.57654
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
343. 
patient tongue id: 04101944078380_1_4
label yaofang:
白芍 法半夏 前胡 桔梗 太子参 黄芪 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.386977 0.759606 0.412257 0.869294 0.570756 0.651852 0.323861 0.338348 0.343171 0.793227 0.798655 0.723974 0.83681 0.326156 0.900735 0.4388 0.30104 0.525692 0.488504 0.675402
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
344. 
patient tongue id: 01061626112081_1_2_7
label yaofang:
甘草 薏苡仁 玉竹 太子参 鸡血藤 山药 砂仁 天麻 鳖甲 补骨脂 莪术 黄精 蜈蚣 白花蛇舌 天山雪莲
0.904152 0.338504 0.309552 0.481893 0.325926 0.548028 0.426407 0.332676 0.36847 0.492956 0.492059 0.484343 0.410461 0.396682 0.406882
predicted yaofang:
甘草 白芍 法半夏 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.533333, recall: 0.533333, error: 0.466667
345. 
patient tongue id: 05171906218364_4
label yaofang:
茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.387685 0.591472 0.421892 0.67966 0.476532 0.541368 0.334353 0.350676 0.304965 0.609787 0.640498 0.564976 0.678711 0.356739 0.766961 0.383185 0.328745 0.469311 0.415898 0.556127
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.923077, error: 0.400000
346. 
patient tongue id: 04300954416695_6_4_2
label yaofang:
甘草 白芍 茯苓 牛蒡子 酸枣仁 生地黄 知母 山茱萸 青蒿 天麻 全蝎 地骨皮 秦艽 麦芽 浮小麦
0.968737 0.486951 0.591046 0.419869 0.345092 0.54736 0.516066 0.507944 0.393923 0.405882 0.399316
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
347. 
patient tongue id: 05312155104602_1_2_6
label yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 砂仁 莱菔子 天麻 白花蛇舌草 浮小麦 紫苏梗 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.986403 0.489614 0.619027 0.413417 0.353947 0.63817 0.609004 0.594612 0.485918 0.499207 0.534661
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
348. 
patient tongue id: 03081832260536_3_4
label yaofang:
甘草 茯苓 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 炒僵蚕
0.386359 0.737025 0.43024 0.84168 0.555878 0.641504 0.350845 0.353911 0.346448 0.302892 0.7594 0.773599 0.715574 0.809409 0.332498 0.880987 0.440015 0.313636 0.53974 0.498655 0.659114
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.142857, recall: 0.214286, error: 0.857143
349. 
patient tongue id: 04142238018815_1_6_5
label yaofang:
甘草 薏苡仁 黄芪 白术 玄参 熟附子 厚朴 天麻 鳖甲 火麻仁 败酱草 地龙 首乌藤 蜈蚣 天山雪莲 半枝莲
0.985612 0.514101 0.621341 0.422305 0.352515 0.583935 0.602126 0.568476 0.479485 0.475029 0.46554
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
350. 
patient tongue id: 02251243307279_2
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 炒紫苏子 蜜麻黄
0.383687 0.678875 0.445387 0.78881 0.521377 0.575858 0.328575 0.325178 0.323291 0.719847 0.712558 0.640781 0.754355 0.34012 0.810443 0.412411 0.473809 0.452554 0.608107
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
351. 
patient tongue id: 02142330545320_6
label yaofang:
甘草 川芎 茯苓 防风 党参 白术 酸枣仁 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.994664 0.502855 0.300597 0.652447 0.403742 0.374863 0.705728 0.697623 0.672091 0.562048 0.583425 0.593799
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
352. 
patient tongue id: 04142210398547_3_4
label yaofang:
白芍 川芎 陈皮 当归 茯苓 党参 白术 熟地黄 炙甘草 黑枣 狗脊
0.449167 0.39897 0.397526 0.526079 0.461628 0.341678
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.272727, error: 0.500000
353. 
patient tongue id: 05201449302679_5_6
label yaofang:
甘草 柴胡 白芍 酸枣仁 栀子 牡丹皮 车前子 天麻 磁石 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.958549 0.48709 0.311847 0.581219 0.460824 0.313178 0.359711 0.500122 0.513072 0.525905 0.398023 0.402075 0.392809
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
354. 
patient tongue id: 05251930261857_2
label yaofang:
甘草 蒲公英 浙贝母 郁金 生半夏 僵蚕 莪术 柿蒂 北沙参 赭石 蜈蚣 红豆杉 预知子 冬凌草
0.363611 0.407942 0.311194 0.36105 0.303083 0.320597 0.440271
predicted yaofang:
法半夏 茯苓 防风 黄芪 百部 北沙参 炙甘草

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
355. 
patient tongue id: 05160615177777_6_7_1
label yaofang:
黄芪 白术 丹参 砂仁 桑寄生 北沙参 炙甘草 女贞子 桑椹 首乌藤 合欢皮 墨旱莲 山慈菇 蛇舌草
0.488063 0.407422 0.369744 0.380334 0.497886 0.547545 0.365998 0.309842
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
356. 
patient tongue id: 06022206037285_1_4_7
label yaofang:
陈皮 当归 茯苓 半夏 党参 黄芪 阿胶 枸杞子 白术 海螵蛸 杜仲 厚朴 桑寄生 鸡内金 紫苏梗 骨碎补 预知子
0.426579 0.374235 0.379489 0.363105 0.569705 0.533568 0.397711 0.314149 0.309896
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参 合欢皮

------Score: precision: 0.666667, recall: 0.352941, error: 0.333333
357. 
patient tongue id: 02151923362184_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.356588 0.843917 0.397491 0.943353 0.632407 0.737519 0.30898 0.306144 0.304389 0.886714 0.888209 0.821346 0.916053 0.95336 0.468083 0.564282 0.500347 0.749215
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 1.000000, error: 0.222222
358. 
patient tongue id: 04131426475400_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.381193 0.336459 0.380165 0.443207 0.403398
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
359. 
patient tongue id: 05181249289956_6_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 厚朴 天麻 滑石 莪术 王不留行 白花蛇舌草 苦杏仁 蜈蚣 半枝莲 醋鳖甲
0.823648 0.450198 0.503343 0.305884 0.479655 0.35183 0.386228
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.857143, recall: 0.400000, error: 0.142857
360. 
patient tongue id: 04131918142645_1_2
label yaofang:
甘草 半夏 薏苡仁 黄芪 黄连 厚朴 砂仁 僵蚕 枇杷叶 蝉蜕 紫苏叶 木蝴蝶 合欢皮
0.470878 0.404963 0.380805 0.387254 0.516334 0.512281 0.392567 0.307773 0.339275 0.302968
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.600000, recall: 0.461538, error: 0.400000
361. 
patient tongue id: 03012321301472_6_2
label yaofang:
甘草 柴胡 白芍 红花 延胡索 川楝子 郁金 天麻 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲 红豆杉 田七末
0.973612 0.499336 0.33166 0.604565 0.425002 0.311992 0.384328 0.600108 0.610848 0.579217 0.500793 0.508266 0.494376
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
362. 
patient tongue id: 06031643240599_1_4
label yaofang:
法半夏 前胡 桔梗 防风 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.384887 0.896444 0.377869 0.969113 0.683325 0.788378 0.328889 0.337846 0.326529 0.926919 0.933325 0.870052 0.947642 0.981462 0.471044 0.631674 0.537098 0.797441
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 0.933333, error: 0.222222
363. 
patient tongue id: 02211844288534_1
label yaofang:
甘草 香附 茯苓 牛蒡子 党参 阿胶 白术 柏子仁 海螵蛸 肉桂 干姜 制川乌 附片 续断 紫苏梗 瓦楞子
0.909728 0.438943 0.553007 0.396608 0.485645 0.388724 0.419247 0.301525
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
364. 
patient tongue id: 06092011494812_1_4_7
label yaofang:
甘草 牡蛎 太子参 枸杞子 丹参 生地黄 赤芍 牛膝 郁金 山茱萸 女贞子 紫苏梗
0.520236 0.425708 0.411757 0.432256 0.511219 0.308449
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
365. 
patient tongue id: 04121911408692_1_7_4
label yaofang:
枳壳 木香 黄芪 赤芍 牡丹皮 泽泻 大腹皮 厚朴 茯苓皮 猪苓 柿蒂 吴茱萸 赭石 玉米须 土鳖虫 荔枝核 鸭脚艾
0.499789 0.407935 0.318298 0.400322 0.483243 0.494116 0.325661 0.315019
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.250000, recall: 0.117647, error: 0.750000
366. 
patient tongue id: 02131308025090_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.395164 0.363446 0.427151 0.350606
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
367. 
patient tongue id: 05232036129587_1
label yaofang:
柴胡 半夏 连翘 牛蒡子 党参 黄芪 枸杞子 白术 杜仲 砂仁 补骨脂 莪术 北沙参
0.387724 0.407372 0.44395 0.486695 0.481256 0.320783 0.37322
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
368. 
patient tongue id: 03221300257418_2_4
label yaofang:
甘草 茯苓 薏苡仁 党参 五味子 浙贝母 厚朴 淫羊藿 补骨脂 莪术 紫菀 仙茅 地龙 苦杏仁 鹿角霜 紫苏叶
0.951437 0.300214 0.484136 0.581395 0.423896 0.344438 0.514968 0.495685 0.482617 0.382056 0.388978 0.381842
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
369. 
patient tongue id: 03221638298071_1_2_3
label yaofang:
当归 半夏 橘红 连翘 黄芪 鸡血藤 白术 补骨脂 鸡内金 枇杷叶 红芪 红参
0.593721 0.433651 0.345111 0.402447 0.459025 0.522761 0.302628 0.347764 0.318958 0.332325
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.300000, recall: 0.250000, error: 0.700000
370. 
patient tongue id: 04122159577912_2_5
label yaofang:
甘草 黄芪 黄连 赤芍 栀子 杜仲 苍术 山药 山茱萸 天麻 天花粉 桑寄生 牛大力
0.841583 0.320724 0.452082 0.516898 0.42184 0.312792 0.303049 0.416377 0.328941 0.375123
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.300000, recall: 0.230769, error: 0.700000
371. 
patient tongue id: 02202324079714_5_2
label yaofang:
甘草 黄芩 鱼腥草 海螵蛸 僵蚕 川贝母 紫菀 鸡内金 枇杷叶 地龙 北沙参 苦杏仁 炙麻黄 紫苏梗
0.368788 0.42597 0.391669 0.448476 0.362898 0.389479
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
372. 
patient tongue id: 02231915359185_1
label yaofang:
白芍 川芎 茯苓 防风 丹参 钩藤 天麻 白芷 石决明 炙甘草 首乌藤 威灵仙 炒蔓荆子 棉萆薢
0.391602 0.781428 0.418729 0.896618 0.587462 0.669979 0.329382 0.332133 0.323222 0.826125 0.830844 0.757113 0.865551 0.331584 0.916631 0.443087 0.538449 0.497766 0.703401
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.157895, recall: 0.214286, error: 0.842105
373. 
patient tongue id: 02281251245109_1_3
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.517839 0.409506 0.391431 0.301034 0.317611
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
374. 
patient tongue id: 01122213131920_1_5
label yaofang:
甘草 白芍 龙骨 防风 金银花 黄芪 白术 五味子 红花 荆芥穗 麦芽 白鲜皮 蒺藜 浮小麦 地肤子
0.70846 0.467112 0.459309 0.319914 0.414399
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
375. 
patient tongue id: 03011105569254_1
label yaofang:
甘草 白芍 川芎 独活 牛膝 细辛 干姜 补骨脂 蜈蚣 姜黄 海桐皮 鹿衔草
0.413333 0.36109 0.392644 0.355139 0.449991 0.311058 0.304334
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
376. 
patient tongue id: 03091907518402_4_1
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 丹参 生地黄 天麻 鳖甲 莪术 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.972787 0.483588 0.602541 0.447052 0.35698 0.590825 0.599047 0.596438 0.477707 0.48055 0.509147
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.625000, error: 0.090909
377. 
patient tongue id: 04132029475968_6
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 浙贝母 郁金 山药 天麻 鳖甲 莪术 虎杖 蜈蚣 白花蛇舌 天山雪莲 广金钱草
0.984773 0.505881 0.309616 0.613241 0.425404 0.370211 0.611957 0.609546 0.588596 0.486369 0.488611 0.487869
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.625000, error: 0.166667
378. 
patient tongue id: 01182144042412_6_5
label yaofang:
甘草 白芍 桔梗 党参 浙贝母 郁金 山药 山茱萸 泽泻 菟丝子 益母草 鳖甲 夏枯草 浮小麦 合欢花
0.826587 0.300833 0.307138 0.476324 0.317883 0.517781 0.41923 0.307198 0.338374 0.410976 0.3545 0.398317
predicted yaofang:
甘草 白芍 法半夏 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
379. 
patient tongue id: 01052146502452_2_6
label yaofang:
甘草 柴胡 白芍 茯苓 龙骨 酸枣仁 牡丹皮 山药 山茱萸 地黄 菟丝子 益母草 浮小麦 首乌藤
0.991618 0.480211 0.637935 0.416232 0.364578 0.6821 0.675757 0.662273 0.528173 0.558266 0.596648
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
380. 
patient tongue id: 04222122526706_4
label yaofang:
麻黄 柴胡 前胡 桔梗 半夏 防风 薄荷 青蒿 荆芥穗 款冬花 紫菀 白前 百部 紫苏子 炙甘草 紫苏梗
0.374736 0.775993 0.404798 0.900474 0.584882 0.68494 0.310371 0.320475 0.323834 0.82603 0.833818 0.762974 0.8725 0.321483 0.926942 0.434085 0.542649 0.496564 0.70635
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.562500, error: 0.526316
381. 
patient tongue id: 03062147483742_6_1
label yaofang:
甘草 陈皮 枳壳 茯苓 半夏 连翘 党参 白术 厚朴 山楂 鸡内金 紫苏梗 红曲
0.490747 0.399473 0.466825 0.351481 0.552964 0.590279 0.427937 0.344371 0.37837 0.352268
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.600000, recall: 0.461538, error: 0.400000
382. 
patient tongue id: 03232306582218_3_2_7
label yaofang:
甘草 茯苓 独活 党参 黄芪 丹参 赤芍 山药 山茱萸 水蛭 桑寄生 补骨脂 鹿角霜 川加皮 牛大力
0.96859 0.485511 0.602096 0.410938 0.353676 0.575459 0.539115 0.530398 0.415977 0.433967 0.427008
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
383. 
patient tongue id: 04241931050225_1
label yaofang:
白芍 木香 桃仁 麦冬 玉竹 太子参 丹参 玄参 赤芍 枳实 地黄 车前子 厚朴 莱菔子 火麻仁 北沙参 苦杏仁
0.833033 0.443016 0.491692 0.449104 0.321617 0.349937
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
384. 
patient tongue id: 01042347533030_1_6
label yaofang:
甘草 党参 白术 赤芍 山药 地黄 天麻 菟丝子 益母草 补骨脂 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.968366 0.492352 0.303106 0.59 0.447177 0.357357 0.540488 0.531655 0.547605 0.407996 0.415575 0.419186
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
385. 
patient tongue id: 04252004191718_4_7
label yaofang:
柴胡 黄芩 羌活 党参 白术 泽泻 天麻 白芷 姜半夏 炙甘草 续断
0.436383 0.332996 0.45764 0.322706 0.414394 0.45196 0.310678 0.317091 0.310211 0.391076 0.427655 0.306165
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 海螵蛸 浙贝母 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.416667, recall: 0.454545, error: 0.583333
386. 
patient tongue id: 04141833295593_1_4_7
label yaofang:
荆芥 党参 黄芪 枸杞子 白术 丹参 浙贝母 牛膝 山药 僵蚕 莪术 紫苏子 紫苏叶 预知子
0.422278 0.401195 0.378866 0.354981 0.52163 0.478935 0.368621 0.346602
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
387. 
patient tongue id: 02182307154975_6_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 黄连 山药 干姜 砂仁 佛手 合欢花
0.970114 0.49039 0.302081 0.585084 0.423865 0.302467 0.361629 0.570378 0.566279 0.549295 0.449585 0.457175 0.451264
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.384615, error: 0.615385
388. 
patient tongue id: 06091834178904_1
label yaofang:
桂枝 白芍 茯苓 木香 防风 茯神 黄芪 白术 郁金 通草 白芷 瓜蒌皮 西洋参 炙甘草
0.908377 0.328339 0.430366 0.55941 0.422265 0.415388 0.342 0.378634
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
389. 
patient tongue id: 06031129285832_2
label yaofang:
甘草 黄芩 桔梗 金银花 党参 生地黄 浙贝母 杜仲 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.935184 0.317274 0.469457 0.560332 0.418486 0.316955 0.35133 0.504175 0.469182 0.448453 0.363266 0.368042 0.354589
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
390. 
patient tongue id: 03021242120180_1_4_7
label yaofang:
甘草 川芎 茯苓 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.478819 0.307372 0.406728 0.431371 0.31779 0.362891
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
391. 
patient tongue id: 03081758252928_1_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.409775 0.359423 0.392029 0.465115 0.431609
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
392. 
patient tongue id: 05131621556198_1_2_7
label yaofang:
甘草 白芍 橘红 太子参 黄芪 浙贝母 山茱萸 天麻 鳖甲 地龙 北沙参 蜈蚣 白花蛇舌 蜂房 岗梅根 四季青
0.908908 0.470377 0.561047 0.461526 0.306674 0.347265 0.475861 0.438823 0.482751 0.344295 0.35614 0.364082
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
393. 
patient tongue id: 01032103396994_1_6
label yaofang:
甘草 茯苓 党参 枸杞子 酸枣仁 天麻 鳖甲 蒺藜 浮小麦 沙苑子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川加皮
0.977132 0.499238 0.608076 0.429303 0.361755 0.570121 0.568355 0.555706 0.4463 0.446093 0.450497
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
394. 
patient tongue id: 01040552439394_6_2
label yaofang:
甘草 白芍 川芎 党参 黄芪 枸杞子 酸枣仁 生地黄 杜仲 牛膝 知母 天麻 桑寄生 首乌藤 土鳖虫
0.993756 0.497291 0.656278 0.374854 0.35909 0.675044 0.662286 0.620421 0.50897 0.527065 0.514786
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
395. 
patient tongue id: 04182147536236_2
label yaofang:
甘草 黄芩 桔梗 芦根 太子参 生地黄 浙贝母 乌梅 天花粉 鳖甲 北沙参 白花蛇舌 蜂房 四季青
0.98991 0.499242 0.639649 0.412611 0.381669 0.64112 0.649985 0.602754 0.518218 0.522278 0.521097
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
396. 
patient tongue id: 02142343086820_4_1
label yaofang:
甘草 白芍 薏苡仁 白术 赤芍 附子 天麻 僵蚕 鳖甲 木瓜 败酱草 蜈蚣 半枝莲 宽筋藤
0.883601 0.428408 0.558756 0.456561 0.305301 0.432503 0.388702 0.433759 0.307914
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.666667, recall: 0.428571, error: 0.333333
397. 
patient tongue id: 04182037524552_1_4
label yaofang:
甘草 川芎 陈皮 枳壳 茯苓 龙骨 牡蛎 牛蒡子 远志 柏子仁 竹茹 紫菀 姜半夏
0.361201 0.54586 0.364257 0.354263 0.327253 0.412976 0.348344 0.378385 0.416481 0.597235 0.664476 0.389746
predicted yaofang:
柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
398. 
patient tongue id: 06080205247722_1_7_4
label yaofang:
甘草 川芎 法半夏 前胡 桃仁 远志 黄芪 赤芍 细辛 桑白皮 款冬花 地龙 苦杏仁 炙麻黄
0.986743 0.495193 0.62293 0.405346 0.360899 0.637148 0.616452 0.584163 0.488594 0.501265 0.515583
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
399. 
patient tongue id: 03291313308548_6_1
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗
0.335791 0.528177 0.322078 0.324339 0.336414 0.343185 0.319015 0.306098 0.409449 0.56578 0.682655 0.301011
predicted yaofang:
柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.500000, recall: 0.500000, error: 0.500000
400. 
patient tongue id: 06071920220519_6_1
label yaofang:
桂枝 柴胡 白芍 当归 半夏 龙骨 牡蛎 酸枣仁 乌梅 知母 山药 砂仁 麦芽 北沙参 合欢皮 预知子
0.69235 0.312963 0.45405 0.424858 0.33744 0.405879
predicted yaofang:
甘草 法半夏 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
401. 
patient tongue id: 02221313095060_1_7
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 郁金 三棱 鸡内金 白花蛇舌草 浮小麦 首乌藤 制远志
0.390647 0.412841 0.310283 0.328402 0.330249 0.340689 0.324077 0.313771 0.54452
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 黄芪 紫菀 北沙参 炙甘草

------Score: precision: 0.222222, recall: 0.166667, error: 0.777778
402. 
patient tongue id: 03021300301145_2
label yaofang:
陈皮 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.377017 0.798894 0.413094 0.904657 0.60442 0.680026 0.341703 0.331866 0.33339 0.838173 0.837129 0.766275 0.870211 0.31313 0.91556 0.451035 0.544588 0.506194 0.712861
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.923077, error: 0.368421
403. 
patient tongue id: 02170951465389_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.523819 0.419909 0.438097 0.378692 0.317914
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
404. 
patient tongue id: 02182224440174_1_2_6
label yaofang:
甘草 白及 地黄 天麻 没药 胡黄连 淡竹叶 白花蛇舌草 麦芽 广藿香 蜈蚣 半枝莲 醋鳖甲 川木通
0.916288 0.32178 0.483905 0.551079 0.427072 0.313003 0.323072 0.460879 0.417366 0.425766 0.321651 0.32552 0.322361
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
405. 
patient tongue id: 01132314555324_4_7
label yaofang:
白芍 延胡索 牛膝 全蝎 苏木 炙甘草 紫苏梗 蜈蚣 两面针
0.402396 0.392407 0.383329 0.322478 0.392029 0.385751
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.166667, recall: 0.111111, error: 0.833333
406. 
patient tongue id: 06111047385908_2_4
label yaofang:
甘草 川芎 桃仁 党参 杜仲 黄柏 肉桂 山药 菟丝子 益智仁 益母草 桑螵蛸 麦芽 醋香附 合欢花
0.979965 0.491552 0.61493 0.416338 0.371716 0.595189 0.601512 0.566753 0.477874 0.480226 0.485607
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
407. 
patient tongue id: 05130653138212_2_1
label yaofang:
甘草 荆芥 防风 金银花 黄芪 白术 红花 天麻 火麻仁 白花蛇舌草 麦芽 白鲜皮 地肤子 蜈蚣 半枝莲 醋鳖甲
0.95712 0.482442 0.319259 0.587999 0.422953 0.306331 0.37505 0.576948 0.557842 0.536284 0.44948 0.466866 0.466276
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
408. 
patient tongue id: 03012315474186_4
label yaofang:
甘草 香附 茯苓 龙骨 麦冬 太子参 酸枣仁 丹参 五味子 薤白 砂仁 瓜蒌皮 浮小麦 首乌藤 降香 合欢花
0.975116 0.489652 0.326456 0.606602 0.426493 0.302792 0.381344 0.614745 0.612477 0.585691 0.504047 0.513849 0.506422
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.125000, error: 0.846154
409. 
patient tongue id: 06072128582792_4_1
label yaofang:
甘草 茯苓 连翘 白术 地黄 砂仁 莱菔子 天麻 淡竹叶 白花蛇舌草 麦芽 蜈蚣 半枝莲 醋鳖甲
0.951598 0.470498 0.580959 0.442377 0.336346 0.528148 0.523325 0.529267 0.410141 0.412485 0.440396
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
410. 
patient tongue id: 01180603274291_1_2_7
label yaofang:
甘草 茯苓 党参 白术 生地黄 浙贝母 郁金 山茱萸 天麻 鳖甲 夏枯草 麦芽 蜈蚣 白花蛇舌 红豆杉
0.966205 0.501597 0.334905 0.598005 0.422122 0.316724 0.381654 0.591323 0.585244 0.5666 0.484939 0.490192 0.476599
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
411. 
patient tongue id: 02181627186318_1_5
label yaofang:
甘草 防风 金银花 黄芪 红花 浙贝母 牡丹皮 水牛角 荆芥穗 麦芽 皂角刺 白鲜皮 地肤子
0.944074 0.463 0.585029 0.420689 0.302362 0.481422 0.414111 0.443421 0.316396 0.313716
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.076923, error: 0.900000
412. 
patient tongue id: 05260633148369_1_7_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 砂仁 天麻 鳖甲 麦芽 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.977163 0.487156 0.598553 0.40811 0.356407 0.614378 0.594812 0.565164 0.474523 0.486549 0.500445
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
413. 
patient tongue id: 05271844333055_1
label yaofang:
甘草 柴胡 陈皮 太子参 黄芪 鸡血藤 白术 乌药 山药 升麻 火麻仁 虎杖 紫苏梗
0.517982 0.411236 0.336251 0.420373 0.489706 0.529197 0.364291 0.30654 0.300776
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
414. 
patient tongue id: 03311657470159_1_6
label yaofang:
甘草 白芍 川芎 独活 牛蒡子 牛膝 细辛 干姜 蜈蚣 姜黄 海桐皮 鹿衔草
0.313957 0.412883 0.371147 0.396772 0.32675 0.305241 0.420845 0.50938 0.317106
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
415. 
patient tongue id: 02190512460989_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 木香 党参 白术 郁金 砂仁 海金沙 鸡内金 虎杖 麦芽 紫苏梗
0.590851 0.344255 0.418535 0.445433 0.382987
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.333333, error: 0.000000
416. 
patient tongue id: 02142125062181_5_7_1
label yaofang:
甘草 陈皮 茯苓 薏苡仁 白及 党参 山药 茜草 天麻 鳖甲 紫菀 苦杏仁 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.942124 0.480791 0.311416 0.569697 0.427404 0.355376 0.511036 0.489008 0.500287 0.385585 0.388058 0.39123
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
417. 
patient tongue id: 05032309180340_6_1
label yaofang:
甘草 茯苓 麦冬 酸枣仁 柏子仁 生地黄 知母 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.981127 0.49919 0.302262 0.610831 0.421022 0.370169 0.619331 0.626118 0.594403 0.506852 0.509718 0.520811
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
418. 
patient tongue id: 01201949464024_3_5_7
label yaofang:
甘草 白芍 薏苡仁 熟附子 郁金 大腹皮 干姜 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 川木瓜 土鳖虫
0.928659 0.327223 0.488064 0.302289 0.520779 0.366953 0.316249 0.458757 0.431275 0.422308 0.326764 0.31902
predicted yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
419. 
patient tongue id: 04061954104522_1_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.341255 0.377095 0.350522 0.436001 0.324263 0.309309 0.467524 0.337819
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
420. 
patient tongue id: 05181042310199_6_2_1
label yaofang:
甘草 荆芥 防风 金银花 红花 地黄 水牛角 天麻 紫草 火麻仁 白花蛇舌草 麦芽 白鲜皮 蜈蚣 半枝莲 醋鳖甲
0.993825 0.493656 0.645481 0.402179 0.382153 0.716815 0.69701 0.680346 0.573718 0.582146 0.622461
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
421. 
patient tongue id: 06132016220438_2_1
label yaofang:
甘草 党参 太子参 阿胶 枸杞子 黄连 浙贝母 杜仲 莪术 北沙参 赭石 紫苏叶 浮石
0.359622 0.554566 0.408153 0.675385 0.433883 0.480327 0.587558 0.581514 0.521837 0.661961 0.364115 0.726749 0.332578 0.375626 0.323629 0.477586
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.062500, recall: 0.076923, error: 0.937500
422. 
patient tongue id: 03021330328397_1_4
label yaofang:
麻黄 桂枝 白芍 前胡 半夏 太子参 黄芪 五味子 细辛 干姜 紫菀 北沙参 紫苏子 炙甘草
0.382973 0.674065 0.441673 0.762642 0.526438 0.583085 0.309757 0.360289 0.360672 0.371069 0.320519 0.692312 0.68385 0.633225 0.731582 0.348858 0.787816 0.444076 0.32428 0.487963 0.475129 0.606569
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.318182, recall: 0.500000, error: 0.681818
423. 
patient tongue id: 02202247302805_5_6
label yaofang:
甘草 黄芩 法半夏 茯苓 薏苡仁 桃仁 远志 细辛 桑白皮 干姜 款冬花 苇茎 苦杏仁 紫苏子 辛夷 炙麻黄
0.977478 0.490045 0.605122 0.426242 0.355241 0.562238 0.547081 0.533402 0.419046 0.421961 0.423684
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
424. 
patient tongue id: 05092218467250_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 款冬花 白前 苦杏仁 炙麻黄
0.979695 0.489441 0.61107 0.41742 0.363586 0.599386 0.602325 0.56337 0.483413 0.482758 0.48537
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.166667, error: 0.818182
425. 
patient tongue id: 01141832049702_1_5_6
label yaofang:
甘草 茯苓 党参 白术 生地黄 牡丹皮 杜仲 山药 山茱萸 白茅根 茜草 女贞子 续断 广金钱草
0.985324 0.482457 0.617937 0.457347 0.356722 0.593754 0.5762 0.604496 0.430079 0.452246 0.467914
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
426. 
patient tongue id: 03231443000575_1_4
label yaofang:
陈皮 茯苓 前胡 防风 太子参 黄芪 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄 麸炒白术
0.387658 0.334369 0.529453 0.455324 0.571395 0.429394 0.4366 0.530886 0.485411 0.445588 0.539244 0.347017 0.539911 0.352198 0.362197 0.31863 0.438539
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.588235, recall: 0.769231, error: 0.411765
427. 
patient tongue id: 04131911060805_2
label yaofang:
甘草 蒲公英 枸杞子 黄连 红花 赤芍 海螵蛸 牡丹皮 山茱萸 桑叶 天麻 麦芽 北沙参 续断 紫苏叶 蛇舌草
0.452354 0.36889 0.371416 0.505917 0.460747
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
428. 
patient tongue id: 04282024049490_1_4
label yaofang:
甘草 前胡 薏苡仁 五味子 桑叶 细辛 天麻 莪术 紫菀 百部 白花蛇舌草 蜈蚣 蜜麻黄 醋鳖甲
0.989027 0.503516 0.639552 0.406825 0.360602 0.618103 0.631732 0.588162 0.498836 0.502431 0.491313
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
429. 
patient tongue id: 05181057498679_5
label yaofang:
甘草 法半夏 前胡 桔梗 金银花 连翘 浙贝母 细辛 款冬花 苦杏仁 辛夷 炙麻黄 苍耳子 四季青
0.910635 0.478058 0.531981 0.454186 0.32861 0.407884 0.383775 0.435121
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.125000, recall: 0.071429, error: 0.875000
430. 
patient tongue id: 03192241522104_4_6
label yaofang:
甘草 独活 桃仁 党参 鸡血藤 白术 红花 延胡索 赤芍 牛膝 桑寄生 决明子 续断 威灵仙 牛大力
0.977357 0.497364 0.313263 0.60265 0.438854 0.366619 0.579241 0.591143 0.57659 0.465981 0.475445 0.466729
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
431. 
patient tongue id: 05102007465151_2_1
label yaofang:
法半夏 葛根 前胡 桔梗 麦冬 玉竹 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 人参叶
0.340804 0.588144 0.41005 0.761744 0.432671 0.541374 0.657014 0.659003 0.578783 0.757702 0.375536 0.779967 0.353515 0.374867 0.348848 0.541201
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.562500, recall: 0.642857, error: 0.437500
432. 
patient tongue id: 02122055325978_1
label yaofang:
甘草 茯苓 党参 白术 黄连 牛膝 山药 茜草 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.710882 0.423402 0.495108 0.35947 0.302219
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 1.000000, recall: 0.357143, error: 0.000000
433. 
patient tongue id: 04062030120916_4
label yaofang:
甘草 陈皮 法半夏 前胡 防风 细辛 干姜 木瓜 款冬花 紫菀 白前 百部 紫苏梗 蜜麻黄
0.397993 0.75827 0.419255 0.86789 0.581371 0.65156 0.359193 0.373316 0.358097 0.312113 0.795047 0.80225 0.721321 0.828836 0.329583 0.901174 0.446793 0.32097 0.546886 0.49171 0.677978
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.571429, recall: 0.857143, error: 0.428571
434. 
patient tongue id: 05232111404798_1_4_6
label yaofang:
甘草 陈皮 当归 茯苓 半夏 木香 远志 党参 白术 杜仲 山药 僵蚕 桑寄生 瓜蒌皮 芡实 苦杏仁
0.737544 0.435528 0.460452 0.40935 0.537263 0.326045
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
435. 
patient tongue id: 04122133579679_6_4
label yaofang:
甘草 香附 茯苓 薏苡仁 党参 郁金 天麻 鳖甲 扁豆花 莪术 浮小麦 蜈蚣 白花蛇舌 天山雪莲
0.994436 0.484826 0.650026 0.424888 0.37151 0.691666 0.680844 0.682359 0.528799 0.546049 0.593768
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
436. 
patient tongue id: 03211945576371_6
label yaofang:
白芍 香附 法半夏 党参 延胡索 海螵蛸 枳实 北柴胡 麦芽 炙甘草 紫苏梗
0.361455 0.322965 0.468049 0.386975 0.417611 0.324618 0.342054 0.44924 0.516394 0.316724
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.400000, recall: 0.363636, error: 0.600000
437. 
patient tongue id: 04150713556260_4_7
label yaofang:
甘草 白芍 薏苡仁 远志 白术 红花 牛膝 细辛 天麻 制川乌 忍冬藤 续断 威灵仙 川木瓜 骨碎补
0.956798 0.494257 0.326508 0.582597 0.437475 0.310375 0.364802 0.543016 0.550446 0.530863 0.442936 0.446468 0.430519
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
438. 
patient tongue id: 03302000466483_3_4
label yaofang:
桂枝 白芍 麦冬 党参 枸杞子 丹参 五味子 山茱萸 三七 珍珠母 蒺藜 广藿香
0.442617 0.382544 0.38741 0.432105 0.512331
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
439. 
patient tongue id: 03081201070705_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.493598 0.370236 0.300224 0.479983 0.415707 0.32014 0.317704
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
440. 
patient tongue id: 03282202528898_4
label yaofang:
桂枝 甘草 白芍 川芎 羌活 独活 细辛 干姜 蜈蚣 姜黄 海桐皮 鹿衔草
0.441465 0.41183 0.329036 0.401501 0.375481 0.314751 0.431892
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
441. 
patient tongue id: 05232110526965_1_4_7
label yaofang:
陈皮 茯苓 半夏 党参 黄芪 枸杞子 白术 海螵蛸 杜仲 牛膝 山药 厚朴 僵蚕 菟丝子 鸡内金 紫苏梗 骨碎补 红豆杉
0.59231 0.425503 0.427959 0.433697 0.537192
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.222222, error: 0.200000
442. 
patient tongue id: 01062347510090_1_3_8
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.376674 0.337736 0.348436 0.307374 0.439418 0.468584 0.354694 0.362837 0.315773 0.306791 0.308877
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 牛膝 钩藤 莱菔子 制何首乌

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
443. 
patient tongue id: 01201948462277_1_7_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 丹参 郁金 天麻 桑寄生 鳖甲 续断 浮小麦 蜈蚣 天山雪莲 合欢花 半枝莲 红豆杉
0.977838 0.49265 0.321732 0.604363 0.421957 0.319058 0.314859 0.394988 0.625392 0.635684 0.597237 0.525982 0.529508 0.523628
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 生地黄 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.428571, recall: 0.352941, error: 0.571429
444. 
patient tongue id: 04121947295996_5
label yaofang:
甘草 枸杞子 杜仲 黄柏 山药 泽泻 车前子 砂仁 菟丝子 桑寄生 金樱子 虎杖 紫苏梗 广藿香 沙苑子
0.997368 0.500199 0.681828 0.382239 0.375651 0.758855 0.734885 0.709632 0.5909 0.609506 0.652768
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
445. 
patient tongue id: 06031050525671_3_4_6
label yaofang:
甘草 枳壳 法半夏 茯苓 薏苡仁 党参 砂仁 鳖甲 莪术 枇杷叶 麦芽 紫苏梗 广藿香 白花蛇舌 天山雪莲
0.903124 0.475107 0.522965 0.422304 0.306745 0.417642 0.351095 0.400341
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
446. 
patient tongue id: 03281926256817_6
label yaofang:
柴胡 白芍 黄芩 法半夏 大枣 当归 茯苓 葛根 桃仁 党参 五味子 熟地黄 牡丹皮 细辛 干姜 炙甘草
0.944049 0.347264 0.484132 0.305243 0.573547 0.436059 0.30485 0.337303 0.362081 0.51556 0.526341 0.495563 0.426958 0.420609 0.411349
predicted yaofang:
甘草 白芍 茯苓 薏苡仁 党参 白术 生地黄 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.187500, error: 0.800000
447. 
patient tongue id: 04111541121879_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.385814 0.35783 0.335956 0.439769 0.480604 0.317536 0.310822 0.383137
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
448. 
patient tongue id: 01061910374305_4
label yaofang:
法半夏 葛根 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 人参叶
0.394628 0.632547 0.420318 0.760492 0.491971 0.57672 0.313609 0.328154 0.319304 0.680622 0.684599 0.626966 0.737937 0.371283 0.793461 0.422008 0.310267 0.461479 0.428996 0.580133
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.733333, error: 0.450000
449. 
patient tongue id: 01031828329629_1
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.317028 0.833841 0.402951 0.923254 0.605866 0.656048 0.310261 0.863283 0.850339 0.768865 0.876538 0.924225 0.414819 0.496225 0.450421 0.697426
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.812500, recall: 0.928571, error: 0.187500
450. 
patient tongue id: 03111738251908_5_2
label yaofang:
甘草 党参 黄连 生地黄 赤芍 栀子 牛膝 石膏 肉桂 山药 山茱萸 细辛 砂仁 白芷 粉葛
0.911606 0.477096 0.318413 0.548626 0.455082 0.307039 0.355441 0.465256 0.423988 0.467346 0.325406 0.33945 0.333892
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.200000, error: 0.769231
451. 
patient tongue id: 03151914205977_1
label yaofang:
白芍 香附 法半夏 党参 丹参 延胡索 乳香 海螵蛸 砂仁 北柴胡 麦芽 炙甘草 紫苏梗
0.371398 0.300202 0.466944 0.365777 0.443772 0.312783 0.402233 0.505174
predicted yaofang:
甘草 柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
452. 
patient tongue id: 03091829490414_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.317012 0.42592 0.417294 0.412629 0.344383 0.402085 0.361971 0.357137 0.366172 0.371398 0.4307 0.355447 0.529178 0.329127
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷

------Score: precision: 0.714286, recall: 0.714286, error: 0.285714
453. 
patient tongue id: 05222120136358_5_6
label yaofang:
甘草 白芍 牡蛎 麦冬 黄芪 白术 五味子 厚朴 全蝎 女贞子 首乌藤 合欢皮 墨旱莲
0.501051 0.39684 0.487445 0.341403 0.608407 0.642642 0.331983 0.47472 0.36858 0.36876 0.390095
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
454. 
patient tongue id: 03141621180999_1_3_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.428382 0.344023 0.366594 0.480785 0.434928 0.361172 0.313217 0.378651 0.312918 0.319447 0.323931 0.319828 0.318613
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 夏枯草 制何首乌

------Score: precision: 0.692308, recall: 0.750000, error: 0.307692
455. 
patient tongue id: 04112039564553_6_5_7
label yaofang:
甘草 枳壳 法半夏 茯苓 龙骨 党参 白术 丹参 黄连 竹茹 牛膝 石菖蒲 砂仁 白芷 合欢花
0.925584 0.443688 0.581836 0.405458 0.320037 0.496473 0.390679 0.417879
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
456. 
patient tongue id: 03221310464845_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 白术 槟榔 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.979696 0.499452 0.311498 0.606964 0.413967 0.382507 0.622079 0.61678 0.579691 0.502837 0.506229 0.505369
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.692308, error: 0.250000
457. 
patient tongue id: 03282204574308_2_4
label yaofang:
甘草 黄芩 法半夏 茯苓 桃仁 远志 党参 浙贝母 山药 厚朴 紫菀 地龙 苦杏仁 紫苏子 鹿角霜 蜜麻黄
0.836931 0.453208 0.509504 0.385964 0.381949
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
458. 
patient tongue id: 06012047482035_2_5
label yaofang:
甘草 枳壳 牡蛎 薏苡仁 太子参 赤芍 郁金 厚朴 僵蚕 莪术 蛤壳 蜈蚣 山慈菇 蛇舌草
0.427733 0.399432 0.426906 0.340216 0.54121 0.572755 0.417276 0.322174 0.341782 0.357871
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
459. 
patient tongue id: 03301918329611_4
label yaofang:
法半夏 前胡 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.408333 0.647998 0.422396 0.752693 0.507596 0.59675 0.320893 0.363626 0.381898 0.369434 0.331461 0.677033 0.694549 0.637981 0.736176 0.361902 0.80668 0.441052 0.351427 0.512194 0.463539 0.598932
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.636364, recall: 1.000000, error: 0.363636
460. 
patient tongue id: 03311630316639_1_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.327417 0.356242 0.521714 0.340004 0.334723 0.363466 0.393594 0.324138 0.317597 0.404535 0.507559 0.608691 0.323471
predicted yaofang:
甘草 柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
461. 
patient tongue id: 05232015307386_4_7
label yaofang:
半夏 薏苡仁 赤芍 杜仲 牛膝 郁金 僵蚕 莪术 北沙参 赭石 蜈蚣 骨碎补 土鳖虫 冬凌草 鸭脚艾
0.434123 0.402639 0.436272 0.324599 0.526447 0.52722 0.392425 0.384349 0.307472
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参 合欢皮

------Score: precision: 0.222222, recall: 0.133333, error: 0.777778
462. 
patient tongue id: 01062031413347_1_5
label yaofang:
甘草 黄芩 桔梗 芦根 麦冬 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 蜂房 岗梅根 四季青
0.969514 0.489103 0.594518 0.406304 0.341714 0.541436 0.517523 0.498235 0.394662 0.405225 0.392902
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
463. 
patient tongue id: 06130800337287_1_4_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.358863 0.327304 0.413197 0.339783 0.464636 0.501651 0.400278 0.333263 0.434662 0.367795 0.355517 0.337807 0.409579 0.395423 0.4008 0.430171
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.312500, recall: 0.416667, error: 0.687500
464. 
patient tongue id: 04131920486583_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.316736 0.550436 0.437298 0.632297 0.444524 0.456595 0.555842 0.533844 0.468967 0.618097 0.35333 0.65772 0.32971 0.347386 0.317574 0.469787
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.800000, error: 0.250000
465. 
patient tongue id: 06022255192274_1_4_6
label yaofang:
甘草 陈皮 半夏 荆芥 枸杞子 浙贝母 僵蚕 白前 百部 苦杏仁 紫苏子 蝉蜕 炙麻黄 紫苏叶 紫苑 芥子
0.467881 0.389371 0.45581 0.356496 0.59399 0.588788 0.314695 0.450909 0.342832 0.358558 0.352109
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
466. 
patient tongue id: 03311646558715_9
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.439195 0.332943 0.417595 0.328349 0.324272 0.401605 0.555573 0.325574
predicted yaofang:
白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
467. 
patient tongue id: 03101911360727_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.359669 0.303855 0.465854 0.373947 0.399788 0.304499 0.310613 0.436009 0.499748
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
468. 
patient tongue id: 03041418156287_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 黄连 生地黄 牡丹皮 黄柏 知母 山药 浮小麦 土鳖虫
0.925607 0.322765 0.459181 0.57156 0.428182 0.300554 0.455597 0.426503 0.417979 0.328193 0.333051 0.326429
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.250000, error: 0.750000
469. 
patient tongue id: 03101734585745_4_1
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.36018 0.555418 0.42747 0.615401 0.443162 0.495704 0.543396 0.559602 0.50117 0.601603 0.341148 0.721586 0.350956 0.408156 0.32856 0.433222
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.857143, error: 0.250000
470. 
patient tongue id: 03021207575038_1_2_7
label yaofang:
甘草 法半夏 橘红 防风 金银花 太子参 藿香 白前 鸡内金 辛夷 蜜百部 干鱼腥草
0.397328 0.35143 0.404531 0.497996 0.404279
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
471. 
patient tongue id: 05140644029785_6_2
label yaofang:
甘草 龙骨 太子参 白术 酸枣仁 山茱萸 桑叶 天麻 糯稻根 鳖甲 白花蛇舌草 蜈蚣 天山雪莲 半枝莲
0.96931 0.48596 0.303015 0.593612 0.428722 0.361267 0.59569 0.591577 0.576734 0.483181 0.490806 0.516159
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
472. 
patient tongue id: 05091925331925_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.381324 0.865588 0.407888 0.949151 0.649348 0.735489 0.327109 0.331364 0.332668 0.896423 0.900002 0.826313 0.919047 0.305695 0.966933 0.444031 0.587257 0.521581 0.762608
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
473. 
patient tongue id: 05042040199607_4_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 姜半夏 百合 紫苏叶 独脚金
0.375632 0.334799 0.492054 0.320111 0.304686 0.379868 0.395133 0.351639 0.458119 0.543674
predicted yaofang:
甘草 柴胡 白芍 香附 牛蒡子 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.166667, error: 0.800000
474. 
patient tongue id: 02182317302905_1_2
label yaofang:
甘草 柴胡 白芍 枳壳 薏苡仁 远志 党参 栀子 郁金 山药 砂仁 莱菔子 天麻 鳖甲 蜈蚣 半枝莲
0.957792 0.493421 0.308153 0.568666 0.41733 0.355495 0.526387 0.502397 0.50908 0.399042 0.396625 0.388893
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
475. 
patient tongue id: 03061828217784_2_1_6
label yaofang:
甘草 黄芩 桔梗 生地黄 浙贝母 白芷 天花粉 鳖甲 麦芽 苦杏仁 广藿香 苍耳子 白花蛇舌 蜂房 四季青
0.978318 0.501565 0.305197 0.609287 0.428585 0.304586 0.367928 0.575569 0.572874 0.562288 0.458315 0.459187 0.456217
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
476. 
patient tongue id: 03012014039796_2
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.395552 0.685247 0.430561 0.777735 0.524588 0.58347 0.314829 0.364333 0.375889 0.352832 0.318935 0.707982 0.720593 0.64167 0.746097 0.345766 0.826856 0.430569 0.324554 0.50765 0.481964 0.618467
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.636364, recall: 1.000000, error: 0.363636
477. 
patient tongue id: 03141624023390_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.473932 0.366742 0.461678 0.511349 0.385696 0.319754
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 牛膝

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
478. 
patient tongue id: 01172252199814_6_4
label yaofang:
甘草 茯苓 龙骨 麦冬 党参 太子参 酸枣仁 丹参 五味子 生地黄 山药 山茱萸 补骨脂 鹿角霜
0.981269 0.499562 0.309632 0.612444 0.423805 0.372458 0.610347 0.609714 0.591933 0.484843 0.493298 0.496349
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
479. 
patient tongue id: 05022047456811_1_2
label yaofang:
甘草 枳壳 茯苓 木香 党参 白术 酸枣仁 柏子仁 黄连 厚朴 桑寄生 火麻仁 浮小麦 合欢花 牛大力
0.893941 0.316455 0.468906 0.326066 0.542784 0.451151 0.32914 0.360399 0.483955 0.457227 0.472258 0.365673 0.372247 0.365135
predicted yaofang:
甘草 白芍 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.266667, error: 0.714286
480. 
patient tongue id: 03090823503274_1_4
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 黄芪 白术 乌药 石菖蒲 泽泻 砂仁 菟丝子 益智仁 芡实 棉萆薢
0.894496 0.481217 0.324024 0.555688 0.43124 0.302194 0.308892 0.376304 0.497285 0.488378 0.478043 0.394798 0.397303 0.404545
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 生地黄 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.333333, error: 0.642857
481. 
patient tongue id: 05152048066585_1_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.574602 0.367057 0.395341 0.450617 0.431864 0.30482
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
482. 
patient tongue id: 05102208194674_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄
0.349338 0.53032 0.430797 0.645716 0.435169 0.474648 0.302423 0.566339 0.552495 0.499573 0.63936 0.382877 0.66829 0.3483 0.381671 0.356026 0.49404
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.928571, error: 0.235294
483. 
patient tongue id: 01101808493959_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.329304 0.306022 0.389541 0.424535 0.333489 0.338033 0.327468 0.341561 0.302088 0.346893 0.314 0.305303 0.526655
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 百部 北沙参 炙甘草

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
484. 
patient tongue id: 04141903599650_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.37482 0.778635 0.416561 0.901112 0.580243 0.659635 0.306981 0.300696 0.302381 0.834546 0.835294 0.748501 0.870465 0.333785 0.907149 0.432891 0.518079 0.490624 0.707129
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
485. 
patient tongue id: 05032129043639_4
label yaofang:
桂枝 柴胡 白芍 黄芩 羌活 党参 郁金 姜半夏 炙甘草 土鳖虫 土茯苓
0.333705 0.50719 0.345815 0.323549 0.353185 0.376159 0.315462 0.331938 0.395421 0.537513 0.631296 0.329659
predicted yaofang:
柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.416667, recall: 0.454545, error: 0.583333
486. 
patient tongue id: 05022046307967_2_6
label yaofang:
甘草 茯苓 木香 党参 生地黄 山药 天麻 鳖甲 扁豆花 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.949458 0.481983 0.566041 0.413256 0.325824 0.491621 0.47141 0.459996 0.356683 0.364077 0.351126
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
487. 
patient tongue id: 01180614395208_1_6
label yaofang:
甘草 法半夏 茯苓 党参 白术 黄连 赤芍 川楝子 郁金 砂仁 麦芽 佛手 合欢花 鱼古 瓦楞子
0.978764 0.493564 0.30287 0.609073 0.413059 0.370056 0.583761 0.603446 0.566921 0.483776 0.474763 0.484719
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
488. 
patient tongue id: 04020807275265_6
label yaofang:
甘草 柴胡 白芍 川芎 党参 栀子 牡丹皮 牛膝 山药 天麻 菟丝子 蔓荆子 益母草 女贞子 浮小麦 墨旱莲
0.93985 0.486979 0.32499 0.574622 0.423874 0.302453 0.361468 0.533137 0.499085 0.488845 0.396781 0.402787 0.387651
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.250000, error: 0.692308
489. 
patient tongue id: 05251933137327_6_7
label yaofang:
甘草 枳壳 牡蛎 薏苡仁 太子参 赤芍 牡丹皮 郁金 厚朴 僵蚕 莪术 蛤壳 蜈蚣 山慈菇
0.454408 0.39327 0.532476 0.307473 0.60055 0.624391 0.351703 0.480382 0.377656 0.326813 0.415113 0.423362
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 僵蚕 北沙参 合欢皮

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
490. 
patient tongue id: 06062249232509_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 连翘 薄荷 芦根 牛蒡子 浙贝母 淡竹叶 皂角刺 粉葛 紫苏梗 大青叶
0.861458 0.331393 0.440977 0.513222 0.427142 0.308275 0.335564 0.331465
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 蜈蚣

------Score: precision: 0.375000, recall: 0.187500, error: 0.625000
491. 
patient tongue id: 01040702212149_2_6
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 丹参 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.969043 0.493466 0.315175 0.597069 0.424705 0.360619 0.560354 0.549879 0.54133 0.434893 0.441498 0.429684
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
492. 
patient tongue id: 02241428006805_4_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草
0.328087 0.323471 0.499278 0.301935 0.31353 0.368946 0.361649 0.304725 0.403856 0.492301 0.62086
predicted yaofang:
甘草 柴胡 白芍 香附 牛蒡子 党参 白术 柏子仁 干姜 姜半夏 炙甘草

------Score: precision: 0.363636, recall: 0.333333, error: 0.636364
493. 
patient tongue id: 02151852074477_1_4
label yaofang:
陈皮 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.37542 0.889873 0.39678 0.96658 0.678613 0.763958 0.333825 0.325874 0.315433 0.924634 0.92654 0.862893 0.941034 0.97293 0.47226 0.599116 0.530363 0.796223
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 1.000000, error: 0.222222
494. 
patient tongue id: 01132124333258_6_1
label yaofang:
甘草 川芎 党参 红花 赤芍 地黄 天麻 菟丝子 益母草 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲 乌梢蛇
0.899038 0.475489 0.332382 0.55113 0.453079 0.356787 0.482777 0.418675 0.474742 0.322251 0.337018 0.350665
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
495. 
patient tongue id: 06181704221521_2_1
label yaofang:
甘草 半夏 黄芪 枸杞子 黄连 牡丹皮 杜仲 僵蚕 莪术 柿蒂 枇杷叶 北沙参 赭石 紫苏叶 合欢皮 蛇舌草
0.611736 0.426264 0.38081 0.301082 0.4129 0.479718 0.585534 0.328505 0.371564 0.342612 0.311108 0.313372
predicted yaofang:
甘草 茯苓 半夏 薏苡仁 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参 蜈蚣

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
496. 
patient tongue id: 05232036098741_4_1
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 豆蔻 蝉蜕 姜半夏 炙甘草 紫苏梗 黄皮果核
0.307128 0.328105 0.472332 0.303849 0.354143 0.425787 0.360443 0.342785 0.472598 0.544495 0.36779
predicted yaofang:
甘草 柴胡 白芍 牛蒡子 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
497. 
patient tongue id: 06140819237844_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.6876 0.391538 0.516291 0.358203 0.309023 0.353922
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
498. 
patient tongue id: 03141622395435_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.399743 0.323547 0.348952 0.474056 0.43339 0.347857 0.374958 0.307517 0.316122
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 车前子 制何首乌

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
499. 
patient tongue id: 05092208485915_4_1
label yaofang:
法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.388839 0.774648 0.39463 0.891949 0.591272 0.68076 0.336634 0.35166 0.345661 0.817975 0.823882 0.75188 0.859836 0.323092 0.918411 0.440274 0.302595 0.547792 0.490791 0.693601
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
------Average Score: average precision: 0.442374, average recall: 0.356777, error: 0.557626