5216/8539 [=================>............] - ETA: 38s - loss: 0.18102017-10-20 17:50:58.556304: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:247] PoolAllocator: After 31583 get requests, put_count=31582 evicted_count=1000 eviction_rate=0.0316636 and unsatisfied allocation rate=0.0348605
2017-10-20 17:50:58.556366: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
8512/8539 [============================>.] - ETA: 0s - loss: 0.1516Epoch 00000: val_loss improved from inf to 0.08858, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 100s - loss: 0.1515 - val_loss: 0.0886
Epoch 2/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0961Epoch 00001: val_loss improved from 0.08858 to 0.07920, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0961 - val_loss: 0.0792
Epoch 3/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0906Epoch 00002: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0906 - val_loss: 0.0793
Epoch 4/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0874Epoch 00003: val_loss improved from 0.07920 to 0.07698, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0874 - val_loss: 0.0770
Epoch 5/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0854Epoch 00004: val_loss improved from 0.07698 to 0.07549, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0854 - val_loss: 0.0755
Epoch 6/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0842Epoch 00005: val_loss improved from 0.07549 to 0.07546, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0842 - val_loss: 0.0755
Epoch 7/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0829Epoch 00006: val_loss improved from 0.07546 to 0.07507, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0829 - val_loss: 0.0751
Epoch 8/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0819Epoch 00007: val_loss improved from 0.07507 to 0.07497, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0818 - val_loss: 0.0750
Epoch 9/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0812Epoch 00008: val_loss improved from 0.07497 to 0.07412, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0812 - val_loss: 0.0741
Epoch 10/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0806Epoch 00009: val_loss improved from 0.07412 to 0.07388, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 96s - loss: 0.0806 - val_loss: 0.0739
Epoch 11/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0799Epoch 00010: val_loss improved from 0.07388 to 0.07337, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0799 - val_loss: 0.0734
Epoch 12/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0793Epoch 00011: val_loss improved from 0.07337 to 0.07264, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 96s - loss: 0.0793 - val_loss: 0.0726
Epoch 13/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0790Epoch 00012: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0790 - val_loss: 0.0736
Epoch 14/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0787Epoch 00013: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0787 - val_loss: 0.0728
Epoch 15/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0780Epoch 00014: val_loss improved from 0.07264 to 0.07230, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0780 - val_loss: 0.0723
Epoch 16/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0775Epoch 00015: val_loss improved from 0.07230 to 0.07180, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0775 - val_loss: 0.0718
Epoch 17/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0771Epoch 00016: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0771 - val_loss: 0.0720
Epoch 18/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0767Epoch 00017: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0767 - val_loss: 0.0720
Epoch 19/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0764Epoch 00018: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0764 - val_loss: 0.0727
Epoch 20/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0762Epoch 00019: val_loss improved from 0.07180 to 0.07139, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0762 - val_loss: 0.0714
Epoch 21/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0760Epoch 00020: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0760 - val_loss: 0.0715
Epoch 22/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0755Epoch 00021: val_loss improved from 0.07139 to 0.07130, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0755 - val_loss: 0.0713
Epoch 23/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0752Epoch 00022: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0752 - val_loss: 0.0721
Epoch 24/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0751Epoch 00023: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0751 - val_loss: 0.0714
Epoch 25/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0744Epoch 00024: val_loss improved from 0.07130 to 0.07111, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0744 - val_loss: 0.0711
Epoch 26/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0742Epoch 00025: val_loss improved from 0.07111 to 0.07078, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0742 - val_loss: 0.0708
Epoch 27/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0740Epoch 00026: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0740 - val_loss: 0.0716
Epoch 28/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0737Epoch 00027: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0737 - val_loss: 0.0711
Epoch 29/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0734Epoch 00028: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0734 - val_loss: 0.0715
Epoch 30/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0734Epoch 00029: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0734 - val_loss: 0.0714
Epoch 31/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0730Epoch 00030: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0730 - val_loss: 0.0714
Epoch 32/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0727Epoch 00031: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0728 - val_loss: 0.0711
Epoch 33/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0725Epoch 00032: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0725 - val_loss: 0.0712
Epoch 34/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0722Epoch 00033: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0722 - val_loss: 0.0712
Epoch 35/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0719Epoch 00034: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0719 - val_loss: 0.0711
Epoch 36/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0716Epoch 00035: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0717 - val_loss: 0.0718
Epoch 37/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0715Epoch 00036: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0715 - val_loss: 0.0714
Epoch 38/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0714Epoch 00037: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0714 - val_loss: 0.0712
Epoch 39/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0711Epoch 00038: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0711 - val_loss: 0.0715
Epoch 40/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0707Epoch 00039: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0707 - val_loss: 0.0711
Epoch 41/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0706Epoch 00040: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0706 - val_loss: 0.0714
Epoch 42/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0704Epoch 00041: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0703 - val_loss: 0.0720
Epoch 43/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0701Epoch 00042: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0701 - val_loss: 0.0713
Epoch 44/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0699Epoch 00043: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0699 - val_loss: 0.0714
Epoch 45/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0696Epoch 00044: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0696 - val_loss: 0.0719
Epoch 46/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0695Epoch 00045: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0694 - val_loss: 0.0716
Epoch 47/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0692Epoch 00046: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0693 - val_loss: 0.0721
Epoch 48/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0689Epoch 00047: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0689 - val_loss: 0.0727
Epoch 49/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0687Epoch 00048: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0687 - val_loss: 0.0724
Epoch 50/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0686Epoch 00049: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0686 - val_loss: 0.0719
Epoch 51/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0683Epoch 00050: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0683 - val_loss: 0.0720
Epoch 52/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0681Epoch 00051: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0680 - val_loss: 0.0728
Epoch 53/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0680Epoch 00052: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0680 - val_loss: 0.0724
Epoch 54/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0677Epoch 00053: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0677 - val_loss: 0.0720
Epoch 55/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0674Epoch 00054: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0674 - val_loss: 0.0724
Epoch 56/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0670Epoch 00055: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0670 - val_loss: 0.0726
Epoch 57/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0669Epoch 00056: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0669 - val_loss: 0.0724
Epoch 58/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0668Epoch 00057: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0668 - val_loss: 0.0731
Epoch 59/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0666Epoch 00058: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0666 - val_loss: 0.0726
Epoch 60/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0661Epoch 00059: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0661 - val_loss: 0.0729
Epoch 61/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0659Epoch 00060: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0659 - val_loss: 0.0734
Epoch 62/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0659Epoch 00061: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0659 - val_loss: 0.0730
Epoch 63/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0656Epoch 00062: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0656 - val_loss: 0.0731
Epoch 64/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0653Epoch 00063: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0652 - val_loss: 0.0726
Epoch 65/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0650Epoch 00064: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0650 - val_loss: 0.0736
Epoch 66/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0648Epoch 00065: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0648 - val_loss: 0.0736
Epoch 67/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0646Epoch 00066: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0646 - val_loss: 0.0739
Epoch 68/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0645Epoch 00067: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0645 - val_loss: 0.0737
Epoch 69/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0642Epoch 00068: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0642 - val_loss: 0.0735
Epoch 70/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0640Epoch 00069: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0640 - val_loss: 0.0741
Epoch 71/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0638Epoch 00070: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0638 - val_loss: 0.0736
Epoch 72/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0636Epoch 00071: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0637 - val_loss: 0.0741
Epoch 73/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0634Epoch 00072: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0634 - val_loss: 0.0737
Epoch 74/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0633Epoch 00073: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0633 - val_loss: 0.0748
Epoch 75/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0629Epoch 00074: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0629 - val_loss: 0.0743
Epoch 76/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0626Epoch 00075: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0627 - val_loss: 0.0750
Epoch 77/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0626Epoch 00076: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0625 - val_loss: 0.0745
Epoch 78/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0622Epoch 00077: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0622 - val_loss: 0.0746
Epoch 79/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0621Epoch 00078: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0621 - val_loss: 0.0744
Epoch 80/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0620Epoch 00079: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0619 - val_loss: 0.0756
history: [(0.1514694181702039, None, 0.088575616751835021, None), (0.096066902987445205, None, 0.079203899335730202, None), (0.090596032466873352, None, 0.079272872294152613, None), (0.087408162062739672, None, 0.076980613417677826, None), (0.085350038373145032, None, 0.075491116774497019, None), (0.084222380227626015, None, 0.075457271556932853, None), (0.082856944936132076, None, 0.075065590604975987, None), (0.081842678613783623, None, 0.074966879445554579, None), (0.081219655213918343, None, 0.074115863281401087, None), (0.08061630953644712, None, 0.073878520383284643, None), (0.079901316672273875, None, 0.073367224508152779, None), (0.079280421753819816, None, 0.07264174166179839, None), (0.078963028935606278, None, 0.073572425751677356, None), (0.078725170556576698, None, 0.07276497311862834, None), (0.078041967434261311, None, 0.072298931647023876, None), (0.077494970177624092, None, 0.071796110657217735, None), (0.077106694340887363, None, 0.071955475969847305, None), (0.076745373638511916, None, 0.071962714413583498, None), (0.076403005898264056, None, 0.072657120055877239, None), (0.076153043837719855, None, 0.071389296293367835, None), (0.076007033220874806, None, 0.071516465300168752, None), (0.075480358838504527, None, 0.071300158434080121, None), (0.075213387577116861, None, 0.072097111861784385, None), (0.075083528354891377, None, 0.071449731486839252, None), (0.074448600313691118, None, 0.071111895635232819, None), (0.074247222286865547, None, 0.070781509340791915, None), (0.074028455843927157, None, 0.071570100651665053, None), (0.073715396504663785, None, 0.0711288313234682, None), (0.073404615386990696, None, 0.071502283679478335, None), (0.073394905127927845, None, 0.071444848709272382, None), (0.072970568233301919, None, 0.071443006560042668, None), (0.072774714193797552, None, 0.0710532545715898, None), (0.072469519412214606, None, 0.071239514883621277, None), (0.072200595296850412, None, 0.071175483529602651, None), (0.071944129748490446, None, 0.07113544859892719, None), (0.071652931270400844, None, 0.071784670959353009, None), (0.071512102443798603, None, 0.071363466235744216, None), (0.071403430892818351, None, 0.071191023939695119, None), (0.07112334528856136, None, 0.071481843857647304, None), (0.070705908187373295, None, 0.071054469316433638, None), (0.070607713355938767, None, 0.071350360937389265, None), (0.070339520663522087, None, 0.071991743049123785, None), (0.070140390663323435, None, 0.071314895109379245, None), (0.069899545511529021, None, 0.071447971130247076, None), (0.069593117089527867, None, 0.071867630267754584, None), (0.069449559078344714, None, 0.07161132202589468, None), (0.069255650902062482, None, 0.072084532225088316, None), (0.068899167134235773, None, 0.072735311947899423, None), (0.068658182802559378, None, 0.07235617340702713, None), (0.068630757601915338, None, 0.071903443939629053, None), (0.068338311469614929, None, 0.071952583125004396, None), (0.068048587107961328, None, 0.072774002021485637, None), (0.067963067179545547, None, 0.072370263232743787, None), (0.0676988758088303, None, 0.071961492300033569, None), (0.067434543527558927, None, 0.072433494713716892, None), (0.066997944206672974, None, 0.072612209961964533, None), (0.066928313102951401, None, 0.072365450662570996, None), (0.066797070579529369, None, 0.073141674664649339, None), (0.066561935337537181, None, 0.072562665088381953, None), (0.06611339189657521, None, 0.0728974081439413, None), (0.065928476263068428, None, 0.073371989945898122, None), (0.065850112397437044, None, 0.07303216418885923, None), (0.065648822020292139, None, 0.073087157183514412, None), (0.065235244849046067, None, 0.072622567851901493, None), (0.064966881093864129, None, 0.073601185988921389, None), (0.064818263343575822, None, 0.073586494685747683, None), (0.064625326111705059, None, 0.073934730619956285, None), (0.064483317350989444, None, 0.073664719641426984, None), (0.064196273895655243, None, 0.07350367405912378, None), (0.064023356966736278, None, 0.074096813402223932, None), (0.063839861058856584, None, 0.073609824787020245, None), (0.063659956683765215, None, 0.074061947987302312, None), (0.063393674721056378, None, 0.073749549386702182, None), (0.063294400708927237, None, 0.074769159608380695, None), (0.062930017205406544, None, 0.074300176713056179, None), (0.062650987239963957, None, 0.074976584495423909, None), (0.062546844379864047, None, 0.074540643451305538, None), (0.062244485869579647, None, 0.074640376936821712, None), (0.06210269185337379, None, 0.074404048204640333, None), (0.061930197762136284, None, 0.075645699906043515, None)]
0. 
patient tongue id: 05100745112850_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.502516 0.345667 0.369802 0.468862 0.375017 0.35934 0.329791 0.313688 0.319543
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 车前子 天麻

------Score: precision: 0.555556, recall: 0.416667, error: 0.444444
1. 
patient tongue id: 01051857204053_4
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.432447 0.774578 0.344818 0.925324 0.493035 0.606248 0.340658 0.337985 0.348749 0.360114 0.831147 0.878935 0.821122 0.894165 0.332815 0.95485 0.385385 0.497459 0.579377 0.790291
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
2. 
patient tongue id: 05241940056489_4_6
label yaofang:
甘草 法半夏 茯苓 龙骨 牡蛎 远志 党参 白术 酸枣仁 知母 砂仁 首乌藤 建曲 合欢花
0.897569 0.326549 0.45902 0.534621 0.397081 0.305337 0.416446 0.400317 0.403729 0.335388 0.309676
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
3. 
patient tongue id: 04281837391158_5
label yaofang:
甘草 桔梗 荆芥 芦根 薏苡仁 瓜蒌皮 紫菀 百部 地龙 苦杏仁 蝉蜕 蜜麻黄 蒸陈皮
0.33982 0.313268 0.368913 0.300532 0.333896 0.305072 0.334817 0.319669 0.556954
predicted yaofang:
白芍 茯苓 党参 黄芪 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
4. 
patient tongue id: 03101757071025_4_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.414878 0.706969 0.384981 0.862492 0.470638 0.547769 0.357802 0.334482 0.340117 0.344849 0.752974 0.796652 0.738776 0.821515 0.3559 0.907724 0.357952 0.4689 0.531551 0.716143
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
5. 
patient tongue id: 03291953364807_5_2_7
label yaofang:
甘草 桃仁 丹参 赤芍 牡丹皮 厚朴 射干 柿蒂 北沙参 苦杏仁 赭石 木蝴蝶 山豆根 岗梅
0.572034 0.346977 0.433722 0.365143 0.364913
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
6. 
patient tongue id: 04222142282904_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.419724 0.881034 0.319147 0.973112 0.573944 0.688072 0.334037 0.362081 0.374721 0.360576 0.924882 0.953911 0.917776 0.951148 0.310759 0.988931 0.365985 0.548864 0.634153 0.887487
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
7. 
patient tongue id: 03291954460128_2_5
label yaofang:
甘草 半夏 牛蒡子 枸杞子 白术 玄参 浙贝母 杜仲 僵蚕 补骨脂 射干 北沙参 蝉蜕 百合 蜈蚣 木蝴蝶 冬凌草 山豆根 岗梅
0.318377 0.321792 0.372751 0.449707 0.366275
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.105263, error: 0.600000
8. 
patient tongue id: 04081707176344_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.401655 0.333404 0.362798 0.501478 0.428927
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
9. 
patient tongue id: 03312110476682_5
label yaofang:
甘草 茯苓 连翘 丹参 牡丹皮 黄柏 知母 山药 山茱萸 地黄 泽泻 白芷 麦芽 皂角刺
0.98378 0.489678 0.606871 0.350903 0.353863 0.594467 0.566218 0.548931 0.412038 0.481656 0.487609
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
10. 
patient tongue id: 01111908317862_1
label yaofang:
甘草 陈皮 茯苓 防风 白术 苍术 神曲 佩兰 麦芽 白扁豆 广藿香 布渣叶 稻芽
0.32511 0.383729 0.310913 0.354339 0.302151 0.31579 0.361446 0.452855
predicted yaofang:
法半夏 茯苓 前胡 黄芪 白前 百部 北沙参 炙甘草

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
11. 
patient tongue id: 05242233148828_6_4_2
label yaofang:
白芍 陈皮 木香 防风 白术 黄连 天麻 赤石脂 糯稻根 鳖甲 补骨脂 豆蔻 建曲 蜈蚣 天山雪莲 半枝莲
0.961674 0.480104 0.580407 0.362651 0.349754 0.502074 0.490298 0.465094 0.36806 0.404247 0.372349
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
12. 
patient tongue id: 03231304165875_1_2
label yaofang:
甘草 白芍 桃仁 白术 柏子仁 天麻 肉苁蓉 鳖甲 火麻仁 补骨脂 浮小麦 蜈蚣 天山雪莲 半枝莲
0.973963 0.484436 0.579569 0.357629 0.338289 0.574026 0.521507 0.520056 0.375377 0.447236 0.47421
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
13. 
patient tongue id: 05092017387395_1_6
label yaofang:
甘草 香附 茯苓 葛根 牛蒡子 党参 白术 海螵蛸 桑螵蛸 益智 紫苏梗 覆盆子 瓦楞子 猫爪草
0.358501 0.346924 0.441662 0.310096 0.318422
predicted yaofang:
党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
14. 
patient tongue id: 03152037588709_1_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 白术 五味子 熟附子 车前子 干姜 鸡内金
0.456964 0.363973 0.355235 0.482694 0.451486 0.303459
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
15. 
patient tongue id: 06191333198312_2_5
label yaofang:
甘草 黄芩 茯苓 桔梗 太子参 白术 浙贝母 黄柏 山药 白花蛇舌草 北沙参 蜂房 醋鳖甲 岗梅
0.912734 0.474772 0.545826 0.403975 0.367289 0.468024 0.45631 0.445908 0.366164 0.387804 0.367282
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
16. 
patient tongue id: 04142004310967_6
label yaofang:
甘草 茯苓 太子参 赤芍 浙贝母 郁金 天麻 鳖甲 佛手 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.968694 0.483586 0.57459 0.355015 0.345999 0.519091 0.51292 0.483027 0.373524 0.422061 0.402372
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
17. 
patient tongue id: 01122348252149_1_6
label yaofang:
甘草 桔梗 薏苡仁 远志 浙贝母 郁金 天麻 鳖甲 麦芽 苦杏仁 佛手 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.987106 0.500249 0.621951 0.330232 0.366668 0.609468 0.569004 0.530577 0.418119 0.477303 0.469309
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
18. 
patient tongue id: 03012212494887_2_5_6
label yaofang:
甘草 香附 黄芩 茯苓 连翘 党参 白术 酸枣仁 丹参 生地黄 山药 地骨皮 白芷 菟丝子 益母草 皂角刺
0.969165 0.490739 0.579599 0.357402 0.33915 0.530446 0.509508 0.494025 0.382867 0.422265 0.41511
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
19. 
patient tongue id: 05312158139754_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 桃仁 党参 生地黄 山药 泽泻 菟丝子 益母草 茵陈 王不留行
0.926521 0.308397 0.44229 0.566149 0.37081 0.483554 0.407173 0.423458 0.349349 0.339611
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
20. 
patient tongue id: 01201302183388_2_5
label yaofang:
甘草 桔梗 枸杞子 浙贝母 钩藤 天麻 鳖甲 火麻仁 女贞子 辛夷 蜈蚣 白花蛇舌 蜂房 岗梅根 四季青 墨旱莲
0.806861 0.419239 0.528863 0.303825 0.334182
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
21. 
patient tongue id: 05080845513695_1_3_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.442226 0.310718 0.350301 0.44277 0.460637 0.365494 0.323608
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
22. 
patient tongue id: 05092108299408_5_1_6
label yaofang:
甘草 陈皮 枳壳 茯苓 薏苡仁 蒲公英 白术 黄连 黄柏 苍术 荆芥穗 天麻 槐花 百部 苦参 五倍子
0.955751 0.473928 0.562329 0.378464 0.331096 0.511737 0.503434 0.498168 0.378231 0.425505 0.423353
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
23. 
patient tongue id: 04300921020223_1_2
label yaofang:
甘草 法半夏 茯苓 前胡 党参 黄芪 白术 浙贝母 黄柏 山药 桑白皮 地骨皮 补骨脂 紫菀 桑螵蛸 丝瓜络
0.919295 0.343858 0.494556 0.487539 0.300047 0.354767 0.380953 0.327393
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.312500, error: 0.375000
24. 
patient tongue id: 04011953317462_2
label yaofang:
甘草 川芎 桔梗 荆芥 防风 芦根 牛蒡子 桑叶 菊花 紫苏叶 黑枣 木蝴蝶 四季青
0.662926 0.408681 0.408812 0.359163 0.476135
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
25. 
patient tongue id: 04071254186242_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.451303 0.890721 0.338868 0.976239 0.59638 0.695411 0.34017 0.390104 0.397967 0.383449 0.924626 0.956309 0.911591 0.953332 0.988667 0.381002 0.548781 0.622893 0.880568
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
26. 
patient tongue id: 03291858263740_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.30164 0.421792 0.411631 0.347193 0.370534 0.496177
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
27. 
patient tongue id: 03221949248449_6_1_2
label yaofang:
甘草 党参 鸡血藤 郁金 山药 天麻 益母草 瓜蒌皮 王不留行 白花蛇舌草 白扁豆 蜈蚣 半枝莲 醋鳖甲
0.974334 0.490928 0.599084 0.351927 0.346175 0.542108 0.502783 0.484665 0.376269 0.414606 0.395648
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
28. 
patient tongue id: 06121803043895_5
label yaofang:
甘草 桔梗 薄荷 芦根 牛蒡子 桑叶 菊花 射干 苦杏仁 野马追 东风桔
0.473575 0.354834 0.351379 0.452504 0.5117
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
29. 
patient tongue id: 03232047507844_2_6
label yaofang:
甘草 独活 白术 熟地黄 杜仲 山药 山茱萸 天麻 桑寄生 白花蛇舌草 续断 蜈蚣 半枝莲 醋鳖甲
0.966468 0.490124 0.567985 0.356132 0.30686 0.481808 0.494251 0.478238 0.364011 0.401957 0.374871
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
30. 
patient tongue id: 05242111474718_6_7_2
label yaofang:
桂枝 甘草 柴胡 白芍 茯苓 羌活 酸枣仁 延胡索 牡丹皮 天麻 鳖甲 补骨脂 莪术 蜈蚣 天山雪莲 半枝莲
0.972746 0.483807 0.587891 0.364959 0.350521 0.518673 0.499616 0.476831 0.367081 0.412031 0.388555
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
31. 
patient tongue id: 03192238272841_1_4
label yaofang:
甘草 川芎 法半夏 茯苓 枸杞子 白术 酸枣仁 杜仲 牛膝 天麻 桑寄生 益母草 麦芽 蒺藜
0.761988 0.397654 0.451261 0.315909 0.436527
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
32. 
patient tongue id: 01211256352872_2_1
label yaofang:
甘草 茯苓 玉竹 赤芍 牡丹皮 车前子 秦艽 地龙 嫩桑枝 紫苏叶 宽筋藤 鹿衔草 三七粉 络石藤
0.504596 0.369605 0.448147 0.323804 0.384309
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
33. 
patient tongue id: 03231106409765_2
label yaofang:
甘草 陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 广藿香 炒紫苏子 蜜麻黄
0.422081 0.702876 0.392428 0.848494 0.4927 0.550376 0.362408 0.35254 0.35699 0.372783 0.748923 0.786546 0.737221 0.799188 0.34556 0.885469 0.392548 0.46467 0.51838 0.707212
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
34. 
patient tongue id: 06131956397110_6
label yaofang:
甘草 半夏 黄芪 酸枣仁 黄连 海螵蛸 淡豆豉 砂仁 莪术 柿蒂 北沙参 紫苏叶 合欢皮 蛇舌草
0.777639 0.409624 0.393915 0.348768 0.517745 0.307025
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
35. 
patient tongue id: 04301125556084_6_1
label yaofang:
甘草 茯苓 党参 酸枣仁 黄连 浙贝母 砂仁 鳖甲 枇杷叶 麦芽 紫苏梗 广藿香 白花蛇舌 天山雪莲 合欢花
0.977295 0.495364 0.59336 0.356732 0.345823 0.537871 0.542273 0.506015 0.409898 0.45942 0.430412
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
36. 
patient tongue id: 05080848357997_1_3
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.440983 0.352534 0.403458 0.409223 0.36763
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
37. 
patient tongue id: 01211234484870_7_4_5
label yaofang:
甘草 桔梗 蒲公英 紫花地丁 知母 僵蚕 蝉蜕 姜黄
0.357146 0.357979 0.322047 0.391284 0.34618 0.334817 0.506889
predicted yaofang:
甘草 白芍 茯苓 党参 白术 干姜 炙甘草

------Score: precision: 0.142857, recall: 0.125000, error: 0.857143
38. 
patient tongue id: 04182145431436_2
label yaofang:
甘草 黄芩 桔梗 芦根 太子参 浙贝母 乌梅 天花粉 鳖甲 麦芽 白花蛇舌 蜂房 岗梅根 四季青
0.975127 0.498291 0.587828 0.348938 0.347368 0.553617 0.527768 0.494641 0.399446 0.44476 0.424616
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
39. 
patient tongue id: 02212043269290_6_4
label yaofang:
甘草 白芍 党参 白术 生地黄 山茱萸 天麻 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲 广金钱草 车前草
0.901754 0.322964 0.476438 0.531152 0.386741 0.353203 0.427318 0.38449 0.38506 0.309563
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
40. 
patient tongue id: 02142134156207_1_2
label yaofang:
甘草 茯苓 鸡血藤 白术 酸枣仁 赤芍 山药 山茱萸 地黄 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.973359 0.46407 0.567586 0.388561 0.368662 0.565506 0.53686 0.56628 0.395272 0.463642 0.523624
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
41. 
patient tongue id: 04202209073596_6
label yaofang:
甘草 茯苓 党参 鸡血藤 酸枣仁 生地黄 杜仲 天麻 鳖甲 续断 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.869895 0.422662 0.462318 0.304302 0.458325 0.323119 0.318337 0.345522
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 天麻 蜈蚣

------Score: precision: 0.625000, recall: 0.312500, error: 0.375000
42. 
patient tongue id: 03101935570478_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.401738 0.746715 0.375777 0.874691 0.495999 0.555323 0.357037 0.356407 0.37522 0.362279 0.767626 0.824417 0.763626 0.83066 0.306561 0.929306 0.351337 0.479646 0.517024 0.749681
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
43. 
patient tongue id: 04251837548905_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.424168 0.822147 0.366105 0.94538 0.528468 0.617497 0.342629 0.361502 0.366035 0.354955 0.866693 0.906148 0.84697 0.910262 0.309944 0.964542 0.366742 0.501767 0.576519 0.816283
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
44. 
patient tongue id: 02161948344560_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 郁金 鸡内金 豆蔻 姜半夏 炙甘草 紫苏梗
0.449306 0.337724 0.3671 0.427765 0.303044 0.382404 0.314215
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
45. 
patient tongue id: 04061838468395_4_1
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.425104 0.845443 0.356337 0.952548 0.546768 0.626286 0.34376 0.370482 0.375498 0.365217 0.87901 0.921083 0.866856 0.918582 0.975558 0.356226 0.514848 0.57332 0.840528
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
46. 
patient tongue id: 04132033179956_2_5_7
label yaofang:
甘草 柴胡 白芍 枳壳 桔梗 太子参 浙贝母 砂仁 天花粉 五灵脂 鳖甲 北沙参 鹿角霜 白花蛇舌 蜂房 四季青
0.849574 0.33256 0.429509 0.522186 0.398225 0.365883 0.322645 0.363962
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.187500, error: 0.625000
47. 
patient tongue id: 04300923133554_6_4_7
label yaofang:
甘草 法半夏 当归 桃仁 党参 黄芪 鸡血藤 酸枣仁 生地黄 赤芍 郁金 补骨脂 虎杖 豆蔻
0.967687 0.482941 0.570907 0.373467 0.347083 0.522225 0.506254 0.488704 0.383051 0.423584 0.411128
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
48. 
patient tongue id: 06190649376376_1
label yaofang:
甘草 茯苓 党参 黄芪 黄连 熟地黄 地黄 天麻 糯稻根 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.824568 0.31784 0.419939 0.492104 0.43053 0.319957 0.357045
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
49. 
patient tongue id: 05131655594782_6_2
label yaofang:
甘草 茯苓 羌活 党参 白术 酸枣仁 山药 细辛 天麻 白芷 鳖甲 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.98478 0.472133 0.597496 0.363327 0.362423 0.618441 0.565437 0.582238 0.410383 0.491563 0.545198
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.687500, error: 0.000000
50. 
patient tongue id: 02191235515942_6_5
label yaofang:
甘草 法半夏 茯苓 桔梗 牛蒡子 白术 栀子 牡丹皮 桑叶 鳖甲 白花蛇舌草 天山雪莲 贯众
0.896791 0.428082 0.54362 0.375746 0.421004 0.357115
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
51. 
patient tongue id: 04192235441841_1_2_4
label yaofang:
甘草 薏苡仁 党参 白术 生地黄 天麻 鳖甲 莪术 续断 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 牛大力
0.966678 0.497498 0.586098 0.361292 0.353543 0.543994 0.524009 0.497092 0.400631 0.443156 0.428953
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
52. 
patient tongue id: 03221632159824_5_7
label yaofang:
半夏 薏苡仁 桃仁 黄芪 白术 砂仁 桑寄生 王不留行 橘核 土鳖虫 红豆杉 墨旱莲 山慈菇 蛇舌草
0.631678 0.376987 0.358417 0.423243 0.485709
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
53. 
patient tongue id: 03292035477734_1_4
label yaofang:
法半夏 前胡 防风 麦冬 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.425733 0.510646 0.451902 0.513519 0.381087 0.343194 0.303429 0.447424 0.444229 0.396597 0.400498 0.505552 0.314751 0.357302
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.714286, recall: 0.714286, error: 0.285714
54. 
patient tongue id: 03101914511801_3
label yaofang:
桂枝 牛蒡子 党参 白术 附子 车前子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.43708 0.324212 0.394933 0.342042 0.439973
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
55. 
patient tongue id: 05251953177126_2
label yaofang:
甘草 枸杞子 赤芍 浙贝母 牡丹皮 山茱萸 水蛭 厚朴 僵蚕 莪术 北沙参 女贞子 辛夷 紫苏叶 蜈蚣 土鳖虫 合欢皮
0.328074 0.337624 0.496929 0.555226 0.309797 0.310655 0.321403 0.339347
predicted yaofang:
甘草 茯苓 黄芪 白术 海螵蛸 厚朴 砂仁 北沙参

------Score: precision: 0.375000, recall: 0.176471, error: 0.625000
56. 
patient tongue id: 05242246480904_5_6
label yaofang:
甘草 法半夏 前胡 桔梗 鱼腥草 浙贝母 细辛 天麻 鳖甲 款冬花 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.969502 0.488733 0.580824 0.365411 0.347552 0.522836 0.517384 0.492986 0.391408 0.43427 0.407274
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
57. 
patient tongue id: 04272326183583_6_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.385216 0.533566
predicted yaofang:
白术 炙甘草

------Score: precision: 0.500000, recall: 0.100000, error: 0.500000
58. 
patient tongue id: 05182117323801_4_6
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 补骨脂 豆蔻 姜半夏 炙甘草 紫苏梗
0.316103 0.354312 0.30461 0.438519 0.311299
predicted yaofang:
甘草 党参 黄芪 白术 炙甘草

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
59. 
patient tongue id: 04121925515437_2_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 栀子 天麻 鳖甲 佛手 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.817659 0.395728 0.420374 0.344791 0.519027 0.326514
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
60. 
patient tongue id: 01061623430389_1_2_6
label yaofang:
甘草 茯苓 党参 酸枣仁 郁金 地黄 天麻 白花蛇舌草 佛手 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.980443 0.494718 0.598585 0.338074 0.350516 0.554819 0.534568 0.495638 0.383939 0.444912 0.419391
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
61. 
patient tongue id: 02260709320621_5_1_6
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 桔梗 党参 浙贝母 细辛 砂仁 鳖甲 款冬花 苦杏仁 炙麻黄 白花蛇舌 四季青
0.963952 0.468243 0.571996 0.378205 0.360034 0.544718 0.502886 0.516324 0.363435 0.432713 0.461417
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
62. 
patient tongue id: 02150731549245_1_2
label yaofang:
甘草 法半夏 茯苓 桔梗 橘红 金银花 桃仁 党参 黄芪 丹参 枳实 竹茹 厚朴
0.368177 0.422847 0.453743 0.420032 0.421586 0.333669 0.3889 0.342586 0.369328 0.396832 0.400162 0.35105 0.402775 0.386426
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.357143, recall: 0.384615, error: 0.642857
63. 
patient tongue id: 04151218075798_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.386937 0.401429 0.387573 0.309864 0.310333 0.330502 0.401996 0.340631 0.38223 0.57677 0.314834
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 蜜麻黄

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
64. 
patient tongue id: 01130647343298_6_4
label yaofang:
甘草 柴胡 白芍 白术 苍术 山药 车前子 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.980547 0.473919 0.59165 0.35869 0.373691 0.591316 0.556848 0.541621 0.399595 0.474329 0.489756
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
65. 
patient tongue id: 03230708316571_5_2
label yaofang:
甘草 法半夏 茯苓 葛根 连翘 党参 白术 牡丹皮 苍术 山茱萸 佩兰 莱菔子 天花粉
0.945705 0.459436 0.544359 0.387819 0.319339 0.473624 0.452839 0.466165 0.321272 0.377495 0.377434
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
66. 
patient tongue id: 03171354538015_2
label yaofang:
白芍 茯苓 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 炙甘草 制远志 酒女贞子 煅龙骨 炒酸枣仁
0.430723 0.797234 0.364287 0.924776 0.511161 0.600701 0.345262 0.372823 0.384965 0.361644 0.831324 0.881717 0.820416 0.889196 0.952475 0.377646 0.493801 0.573884 0.78679
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.157895, recall: 0.214286, error: 0.842105
67. 
patient tongue id: 04122037540621_1_2_4
label yaofang:
甘草 茯苓 桔梗 桃仁 党参 浙贝母 天麻 天花粉 鳖甲 诃子 蜈蚣 木蝴蝶 白花蛇舌 天山雪莲 半枝莲
0.959022 0.462566 0.554998 0.392708 0.359612 0.549285 0.524981 0.556803 0.387341 0.464083 0.515572
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
68. 
patient tongue id: 01122320493067_6_2
label yaofang:
甘草 川芎 羌活 党参 白术 酸枣仁 赤芍 牛膝 细辛 天麻 全蝎 白花蛇舌草 半枝莲 醋鳖甲
0.986864 0.497237 0.603574 0.334927 0.362533 0.607644 0.578481 0.553865 0.439639 0.493371 0.494061
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
69. 
patient tongue id: 02182254352178_6_2
label yaofang:
甘草 独活 红花 延胡索 山药 山茱萸 地黄 天麻 巴戟天 桑寄生 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 乌梢蛇 宽筋藤
0.957319 0.471054 0.567285 0.375582 0.342945 0.489244 0.448 0.448422 0.33292 0.362688 0.342304
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
70. 
patient tongue id: 02141948495689_1_6
label yaofang:
甘草 肉桂 干姜 附片
0.651812 0.311977 0.377772 0.481997 0.350748
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
71. 
patient tongue id: 02212002549775_1_6
label yaofang:
甘草 茯苓 党参 黄芪 白术 山药 干姜 砂仁 天麻 鳖甲 豆蔻 白扁豆 蜈蚣 天山雪莲 半枝莲
0.881337 0.439812 0.487796 0.462484 0.346229 0.357059 0.357462 0.445527
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 1.000000, recall: 0.533333, error: 0.000000
72. 
patient tongue id: 06132202214822_6_4
label yaofang:
甘草 香附 茯苓 党参 白术 海螵蛸 莪术 柿蒂 紫苏梗 瓦楞子 猫爪草
0.31264 0.457656 0.322443 0.384421 0.335878 0.304625 0.389757 0.545865 0.668283
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.363636, error: 0.555556
73. 
patient tongue id: 04271824466548_2
label yaofang:
甘草 白芍 半夏 薏苡仁 黄芪 海螵蛸 杜仲 神曲 厚朴 砂仁 巴戟天 莪术 麦芽 女贞子 紫苏叶 蜈蚣 墨旱莲 蛇舌草
0.390394 0.389588 0.339047 0.382355 0.365311 0.307203 0.361672
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.285714, recall: 0.111111, error: 0.714286
74. 
patient tongue id: 05161940495927_3
label yaofang:
白芍 川芎 当归 独活 党参 黄芪 细辛 防己 桑寄生 木瓜 川牛膝 炙甘草 续断 威灵仙 盐菟丝子
0.369486 0.570952 0.375562 0.738939 0.403984 0.466355 0.334284 0.628041 0.673192 0.658201 0.713813 0.40108 0.834315 0.318931 0.386723 0.457442 0.641271
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.058824, recall: 0.066667, error: 0.941176
75. 
patient tongue id: 03041055583592_4
label yaofang:
白芍 川芎 大枣 当归 党参 太子参 黄芪 枸杞子 熟地黄 肉桂 煅牡蛎 山萸肉 炙甘草 续断 酒女贞子 煅龙骨
0.406924 0.711613 0.373818 0.850343 0.481292 0.544404 0.368681 0.361301 0.382403 0.361496 0.739634 0.800644 0.746556 0.813607 0.337909 0.917168 0.353634 0.474589 0.518159 0.733272
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.125000, error: 0.900000
76. 
patient tongue id: 03022137597482_6
label yaofang:
柴胡 陈皮 当归 龙骨 党参 黄芪 白术 车前子 砂仁 升麻 炙甘草
0.624481 0.312995 0.381412 0.487244 0.346861
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
77. 
patient tongue id: 04282231092623_5_6
label yaofang:
甘草 荆芥 防风 金银花 连翘 蒲公英 白术 丹参 地黄 白芷 麦芽 皂角刺 白鲜皮
0.986158 0.50203 0.620718 0.328356 0.355129 0.599848 0.570424 0.538789 0.420178 0.481815 0.469177
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
78. 
patient tongue id: 03290705187173_5_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 金银花 连翘 党参 白术 丹参 栀子 牡丹皮 山药 白芷 皂角刺
0.965578 0.477469 0.580386 0.370726 0.330745 0.506133 0.498042 0.486828 0.364497 0.413508 0.398331
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
79. 
patient tongue id: 03291929425188_5_2
label yaofang:
甘草 枳壳 黄芩 黄连 红花 赤芍 牡丹皮 石膏 厚朴 北沙参 赭石 土茯苓 预知子 蛇舌草 龙胆
0.523281 0.360995 0.410079 0.335218 0.422473
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
80. 
patient tongue id: 05130656261672_5_1_6
label yaofang:
甘草 法半夏 茯苓 龙骨 牡蛎 远志 党参 酸枣仁 丹参 黄连 郁金 山药 合欢花
0.955753 0.471982 0.573684 0.365981 0.340302 0.501369 0.485779 0.469296 0.362714 0.405301 0.384771
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
81. 
patient tongue id: 02151742445560_1_7_2
label yaofang:
甘草 黄芪 白术 海螵蛸 杜仲 泽泻 生半夏 砂仁 石斛 鸡内金 北沙参 红豆杉 山慈菇 蛇舌草 红景天
0.460703 0.348262 0.340761 0.504326 0.47288 0.304444 0.307326
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
82. 
patient tongue id: 06111025399712_3_4
label yaofang:
甘草 白芍 川芎 香附 黄芩 当归 党参 丹参 杜仲 菟丝子 桑寄生 淫羊藿 仙茅
0.987586 0.489832 0.616673 0.336958 0.344827 0.59607 0.567397 0.543025 0.412618 0.475122 0.468471
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
83. 
patient tongue id: 05290750503091_6_2_4
label yaofang:
甘草 川芎 法半夏 茯苓 白术 酸枣仁 牡丹皮 川楝子 杜仲 牛膝 天麻 桑寄生 蒺藜
0.948463 0.312295 0.491959 0.556447 0.356592 0.329386 0.449972 0.419823 0.398976 0.313089 0.3324
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
84. 
patient tongue id: 04112006166540_2_1_6
label yaofang:
甘草 川芎 葛根 太子参 黄连 山茱萸 地黄 砂仁 天麻 天花粉 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.973405 0.485358 0.603718 0.34353 0.360681 0.568324 0.489 0.486665 0.344348 0.4098 0.406001
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
85. 
patient tongue id: 04241911025061_4_3
label yaofang:
甘草 白芍 薏苡仁 延胡索 干姜 厚朴 地榆 槐花 补骨脂 吴茱萸 广藿香 黑枣 萎凌菜
0.330599 0.305433 0.321338 0.362272 0.308678 0.399294 0.438978
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
86. 
patient tongue id: 04101915294867_4
label yaofang:
川芎 独活 党参 黄芪 细辛 防己 木瓜 豆蔻 川牛膝 炙甘草 续断 首乌藤 威灵仙 盐菟丝子
0.429677 0.730053 0.383624 0.878815 0.498917 0.586195 0.363289 0.364299 0.375963 0.379433 0.77678 0.832617 0.779621 0.842439 0.359234 0.92196 0.39267 0.483912 0.554761 0.75291
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.142857, error: 0.900000
87. 
patient tongue id: 04141248234842_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄 炒苍耳子
0.411163 0.877106 0.341192 0.971033 0.565085 0.688599 0.359234 0.345826 0.341328 0.905722 0.947462 0.900345 0.944026 0.981534 0.369029 0.524619 0.595237 0.874132
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.555556, recall: 0.833333, error: 0.444444
88. 
patient tongue id: 06022219240417_1_4_7
label yaofang:
陈皮 茯苓 半夏 党参 阿胶 枸杞子 海螵蛸 杜仲 牛膝 山药 厚朴 僵蚕 菟丝子 紫苏子 紫苏叶 木蝴蝶 骨碎补 红豆杉
0.778645 0.41004 0.423281 0.359444 0.503187 0.306745 0.343898
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 蜈蚣

------Score: precision: 0.428571, recall: 0.166667, error: 0.571429
89. 
patient tongue id: 01180415541807_2
label yaofang:
甘草 茯苓 前胡 太子参 白术 天花粉 川贝母 紫菀 白前 枇杷叶 北沙参 木蝴蝶
0.812184 0.304726 0.456771 0.427145 0.305664
predicted yaofang:
甘草 法半夏 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
90. 
patient tongue id: 03141256460545_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.35241 0.372349 0.34329 0.39767 0.301913 0.313723
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
91. 
patient tongue id: 03022128075146_6_2
label yaofang:
黄芩 茯苓 栀子 杜仲 牛膝 钩藤 天麻 石决明 桑寄生 首乌藤 玉米须
0.424248 0.407485 0.308706 0.438275 0.40222 0.376648
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
92. 
patient tongue id: 04211939347865_4_7_6
label yaofang:
黄芪 白术 丹参 延胡索 杜仲 郁金 厚朴 砂仁 鸡内金 北沙参 首乌藤 广金钱草
0.366568 0.302464 0.390309 0.416625 0.32556
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
93. 
patient tongue id: 03230717337546_1_6_4
label yaofang:
甘草 香附 薏苡仁 丹参 生地黄 延胡索 郁金 青蒿 天麻 地骨皮 鳖甲 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲
0.907671 0.455802 0.519291 0.414005 0.34285 0.40056 0.393807 0.431949 0.31733 0.307545
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.312500, error: 0.500000
94. 
patient tongue id: 03292031353328_4
label yaofang:
麻黄 甘草 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 香薷 辛夷 紫苏梗 广藿香 炒苍耳子 木贼
0.433753 0.824177 0.359445 0.944492 0.541736 0.642961 0.349872 0.371172 0.375815 0.380429 0.868289 0.898655 0.848789 0.900789 0.960314 0.407218 0.515258 0.588873 0.795786
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.315789, recall: 0.400000, error: 0.684211
95. 
patient tongue id: 02251238316858_4
label yaofang:
法半夏 前胡 防风 细辛 款冬花 白前 百部 炙甘草 广藿香 炒紫苏子 炒苍耳子
0.331824 0.499119 0.376969 0.599331 0.352817 0.381804 0.309467 0.481909 0.520832 0.52665 0.592372 0.347294 0.699863 0.306463 0.350766 0.507462
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.562500, recall: 0.818182, error: 0.437500
96. 
patient tongue id: 01031826203635_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 炒苍耳子
0.334207 0.300624 0.355573 0.398272 0.322182 0.319398 0.307233 0.304209 0.378973 0.313622 0.53196 0.300802
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 干姜 紫菀 百部 炙甘草 广藿香

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
97. 
patient tongue id: 06191213367631_4_6
label yaofang:
甘草 陈皮 茯苓 前胡 牛蒡子 桃仁 远志 天麻 鳖甲 川贝母 苦杏仁 紫苏子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.954007 0.501051 0.570334 0.366151 0.362875 0.498224 0.491316 0.452577 0.37736 0.407832 0.359071
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
98. 
patient tongue id: 06031128334657_5_1
label yaofang:
法半夏 茯苓 桔梗 金银花 连翘 薄荷 芦根 党参 玄参 浙贝母 鳖甲 皂角刺 板蓝根 白花蛇舌 岗梅根 四季青 广升麻
0.735157 0.354697 0.485174 0.401627 0.331841
predicted yaofang:
甘草 法半夏 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.176471, error: 0.400000
99. 
patient tongue id: 05022016103916_6
label yaofang:
甘草 川芎 茯苓 党参 酸枣仁 黄柏 牛膝 细辛 天麻 全蝎 白芷 菟丝子 女贞子 浮小麦 墨旱莲
0.960673 0.481909 0.581819 0.356382 0.351345 0.53302 0.524179 0.498278 0.395637 0.445335 0.417327
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
100. 
patient tongue id: 04112059353325_3_1_5
label yaofang:
牡蛎 黄芪 白术 酸枣仁 海螵蛸 白茅根 当归尾 砂仁 鸡内金 首乌藤 合欢皮 山慈菇 石上柏 稻芽 鲜龙葵果
0.447748 0.342354 0.320364 0.568345 0.608441 0.3192 0.406291 0.389642 0.363783 0.376073 0.333317
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
101. 
patient tongue id: 03111448100551_7_6
label yaofang:
甘草 白芍 川芎 生地黄 赤芍 牛膝 天麻 全蝎 白芷 淡竹叶 麦芽 川木通
0.874216 0.445863 0.49944 0.454767 0.31349 0.345269 0.32243 0.404383
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.166667, error: 0.750000
102. 
patient tongue id: 05242114524473_6_4_2
label yaofang:
甘草 当归 茯苓 党参 黄连 浙贝母 白芷 菟丝子 天花粉 益母草 鳖甲 续断 白花蛇舌 蜂房 四季青 红豆杉
0.976479 0.488075 0.591589 0.348849 0.344152 0.50991 0.509346 0.47029 0.36494 0.40895 0.372541
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
103. 
patient tongue id: 03161323096291_4_1
label yaofang:
法半夏 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.382619 0.374942 0.401935 0.324867 0.36476 0.351876 0.384729 0.312903 0.513353 0.311929
predicted yaofang:
法半夏 茯苓 前胡 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
104. 
patient tongue id: 01100307014357_4_1
label yaofang:
桂枝 白芍 大枣 葛根 党参 延胡索 全蝎 炙甘草 蜈蚣
0.537093 0.403413 0.399746 0.377674
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.111111, error: 0.750000
105. 
patient tongue id: 02021014574530_6_7
label yaofang:
龙骨 太子参 白术 酸枣仁 砂仁 僵蚕 糯稻根 王不留行 珍珠母 桑椹 首乌藤 百合 合欢皮 墨旱莲
0.475104 0.386878 0.431346 0.4926 0.348528
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
106. 
patient tongue id: 06012001292120_1_2_6
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 地黄 天麻 菟丝子 益母草 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.978042 0.473967 0.590191 0.35782 0.366502 0.603574 0.551691 0.561146 0.415125 0.491524 0.530056
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
107. 
patient tongue id: 03020752023074_6_7_1
label yaofang:
桂枝 甘草 白芍 大枣 桃仁 葶苈子 五味子 细辛 大腹皮 桑白皮 补骨脂 麦芽 紫苏子 川加皮
0.981313 0.475141 0.576691 0.374686 0.335347 0.577373 0.541039 0.557225 0.387347 0.462684 0.509944
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
108. 
patient tongue id: 02191636266781_5_6
label yaofang:
甘草 枳壳 法半夏 木香 连翘 党参 白术 槟榔 砂仁 莱菔子 款冬花 莪术 麦芽 建曲 独脚金
0.973901 0.484137 0.589702 0.355007 0.347489 0.53554 0.531459 0.501887 0.395302 0.438954 0.418773
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
109. 
patient tongue id: 02110737425536_1_3_2
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 知母 山药 天花粉 北沙参 玉米须
0.393583 0.380561 0.402059 0.392554 0.303672
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
110. 
patient tongue id: 02272235373251_6_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 天花粉 麦芽 百合 紫苏叶 独脚金
0.315624 0.434943 0.422389 0.347342 0.337659 0.372293 0.560818
predicted yaofang:
甘草 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
111. 
patient tongue id: 01190621199806_2_1_6
label yaofang:
甘草 白芍 茯苓 远志 党参 枸杞子 牡丹皮 黄柏 山药 山茱萸 泽泻 菟丝子 金樱子 蛇床子 沙苑子 合欢花
0.992407 0.473785 0.633123 0.322186 0.362673 0.666052 0.599739 0.586746 0.416004 0.50881 0.541734
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
112. 
patient tongue id: 06080153395109_2
label yaofang:
甘草 白芍 金银花 连翘 丹参 生地黄 栀子 牡丹皮 石膏 淡竹叶 广藿香 黄精 天山雪莲 木贼 有瓜石斛 谷精子
0.992286 0.485424 0.620733 0.325171 0.371546 0.669609 0.606841 0.604094 0.439952 0.529894 0.57249
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
113. 
patient tongue id: 01042342160471_1_2_6
label yaofang:
甘草 茯苓 薏苡仁 杜仲 牛膝 天麻 桑寄生 扁豆花 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲 乌梢蛇
0.961504 0.451566 0.563295 0.39986 0.370343 0.543996 0.500899 0.528877 0.368455 0.429341 0.458149
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
114. 
patient tongue id: 03012056043088_1_7_4
label yaofang:
甘草 茯苓 桃仁 黄芪 白术 红花 延胡索 薤白 天麻 高良姜 瓜蒌皮 地龙 首乌藤 麸炒枳壳
0.835716 0.314509 0.452432 0.533319 0.358191 0.40339 0.304661
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
115. 
patient tongue id: 03222035515458_1_7_4
label yaofang:
黄芪 白术 杜仲 山药 当归尾 砂仁 桑寄生 补骨脂 芡实 金樱子 鸡内金 益智 首乌藤
0.407044 0.318367 0.412434 0.328631
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
116. 
patient tongue id: 05162147413915_1_7
label yaofang:
甘草 枳壳 茯苓 桃仁 麦冬 党参 丹参 五味子 红花 山茱萸 补骨脂 鹿角霜 川加皮
0.983074 0.507233 0.610457 0.321744 0.349424 0.547848 0.554459 0.488704 0.413135 0.448376 0.400235
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
117. 
patient tongue id: 03141248099589_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.753102 0.363317 0.47264 0.404887
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.230769, error: 0.250000
118. 
patient tongue id: 04101911255745_4
label yaofang:
茯苓 防风 白术 钩藤 荆芥穗 白芷 芡实 炙甘草 首乌藤 广藿香 威灵仙 炒六神曲 棉萆薢
0.395004 0.712882 0.376144 0.858262 0.468691 0.532533 0.349212 0.331646 0.339882 0.339197 0.753692 0.798698 0.751827 0.819018 0.343505 0.905939 0.351659 0.444177 0.517179 0.735321
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.384615, error: 0.750000
119. 
patient tongue id: 03242144586725_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 细辛 干姜 白芷 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.866216 0.333102 0.434944 0.522484 0.348503 0.330568
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
120. 
patient tongue id: 06050837381660_1_3_7
label yaofang:
桂枝 白芍 当归 党参 黄芪 熟附子 乌药 山药 干姜 淫羊藿 仙茅 益智 鹿角霜
0.474039 0.368519 0.342094 0.514499 0.56859 0.360434 0.358309 0.309544 0.310375
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.222222, recall: 0.153846, error: 0.777778
121. 
patient tongue id: 03022216261981_5_6
label yaofang:
甘草 白术 生地黄 延胡索 天麻 五灵脂 鳖甲 忍冬藤 桑枝 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.943105 0.465666 0.563362 0.384227 0.344729 0.487198 0.460132 0.457338 0.344612 0.383774 0.373775
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
122. 
patient tongue id: 03290702293897_6_2
label yaofang:
甘草 白芍 当归 白术 黄连 生地黄 茜草 赤石脂 鳖甲 火麻仁 蜈蚣 天山雪莲 半枝莲
0.944013 0.449174 0.593938 0.324331 0.35347 0.527769 0.35725 0.363914
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
123. 
patient tongue id: 05201459047007_1_2_6
label yaofang:
甘草 防风 金银花 黄芪 酸枣仁 红花 荆芥穗 天麻 鳖甲 白鲜皮 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红条紫草
0.857844 0.39643 0.501406 0.490347 0.322583 0.343817 0.331097 0.310054
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
124. 
patient tongue id: 02020954233530_1_4
label yaofang:
甘草 白芍 川芎 法半夏 党参 白术 赤芍 钩藤 天麻 木瓜 决明子 地龙 首乌藤 沙苑子 宽筋藤
0.980205 0.494535 0.601875 0.327716 0.335855 0.575536 0.510195 0.496428 0.365137 0.424823 0.429247
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
125. 
patient tongue id: 02021008074132_2_5
label yaofang:
甘草 橘红 麦冬 黄芪 白术 浙贝母 侧柏叶 桑白皮 厚朴 仙鹤草 火麻仁 枇杷叶 北沙参 蛤壳 冬凌草
0.36983 0.325882 0.324622 0.565258 0.531254 0.345089 0.41244 0.349437 0.369939 0.324546 0.331359
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
126. 
patient tongue id: 01040644032083_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 橘红 金银花 芦根 浙贝母 莱菔子 白前 紫苏子
0.920547 0.323577 0.480551 0.531826 0.37362 0.360135 0.44911 0.43353 0.410244 0.328132 0.353462 0.318018
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
127. 
patient tongue id: 02190817004069_1_2_7
label yaofang:
甘草 茯苓 党参 黄芪 生地黄 牡丹皮 黄柏 山药 山茱萸 白茅根 泽泻 茜草 桑寄生 女贞子 墨旱莲
0.982146 0.476265 0.596149 0.351055 0.371332 0.608777 0.557838 0.550449 0.414894 0.48039 0.511026
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
128. 
patient tongue id: 03020651485405_6_2_7
label yaofang:
甘草 白芍 党参 酸枣仁 丹参 生地黄 浙贝母 白芷 鳖甲 皂角刺 鹿角霜 首乌藤 白花蛇舌 天山雪莲
0.981292 0.489067 0.598459 0.361956 0.361844 0.568352 0.547274 0.528158 0.411517 0.459131 0.451025
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
129. 
patient tongue id: 03101802096959_1_4
label yaofang:
白芍 川芎 当归 党参 太子参 黄芪 枸杞子 熟地黄 郁金 干姜 北柴胡 炙甘草 续断 盐菟丝子 酒女贞子
0.330968 0.542898 0.384992 0.661423 0.390673 0.428823 0.310877 0.541721 0.585415 0.566377 0.634929 0.306755 0.733058 0.317954 0.363119 0.42516 0.569477
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.117647, recall: 0.133333, error: 0.882353
130. 
patient tongue id: 05290818271347_2_1_5
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 天麻 菟丝子 糯稻根 益母草 鳖甲 女贞子 蜈蚣 天山雪莲 半枝莲 墨旱莲
0.932645 0.478502 0.571501 0.365602 0.343267 0.495524 0.477897 0.456781 0.362644 0.408192 0.38807
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
131. 
patient tongue id: 02241840065207_2
label yaofang:
法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.398148 0.708636 0.36228 0.863805 0.466305 0.533432 0.346169 0.326751 0.348769 0.326443 0.744139 0.803757 0.748483 0.823005 0.330387 0.910594 0.352023 0.439903 0.540207 0.728584
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.875000, error: 0.300000
132. 
patient tongue id: 03272237452032_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.659887 0.376087 0.312567 0.505197 0.310288 0.325791 0.38727
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 天麻

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
133. 
patient tongue id: 05222105422188_1_4
label yaofang:
当归 党参 黄芪 白术 海螵蛸 浙贝母 杜仲 砂仁 鸡内金 北沙参 合欢皮 稻芽
0.390103 0.371329 0.453182 0.486737 0.366685
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
134. 
patient tongue id: 05262220138816_1_5
label yaofang:
甘草 枳壳 茯苓 党参 白术 山药 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 稻芽
0.992618 0.508546 0.637205 0.318233 0.350742 0.640976 0.59705 0.568416 0.435248 0.506486 0.503677
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.785714, error: 0.000000
135. 
patient tongue id: 03311626104365_1_2_3
label yaofang:
牡蛎 玉竹 黄芪 白术 海螵蛸 乌梅 杜仲 附子 山茱萸 厚朴 砂仁 肉苁蓉 火麻仁 北沙参 猫爪草 冬凌草
0.317828 0.300953 0.342144 0.34432 0.492542
predicted yaofang:
白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
136. 
patient tongue id: 05201450448481_4_6
label yaofang:
甘草 法半夏 茯苓 桃仁 蒲公英 党参 白术 黄连 熟附子 山药 干姜 厚朴 紫苏梗 威灵仙 川木瓜
0.971948 0.487942 0.576906 0.362712 0.344489 0.548461 0.533986 0.5173 0.400583 0.452586 0.453329
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
137. 
patient tongue id: 03311819282012_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香
0.389209 0.679933 0.38077 0.824173 0.464665 0.531949 0.34452 0.318739 0.327422 0.340063 0.722439 0.754006 0.719049 0.780312 0.345917 0.853279 0.374263 0.445757 0.498195 0.697227
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
138. 
patient tongue id: 06190941028380_1_6
label yaofang:
甘草 远志 党参 白术 熟附子 杜仲 天麻 桑寄生 鳖甲 淫羊藿 仙茅 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.95525 0.449952 0.568068 0.387975 0.333705 0.502124 0.450599 0.483692 0.317898 0.382951 0.407214
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
139. 
patient tongue id: 02142344282102_2_7
label yaofang:
甘草 龙骨 延胡索 山药 山茱萸 地黄 天麻 白花蛇舌草 麦芽 忍冬藤 续断 蜈蚣 半枝莲 醋鳖甲 骨碎补 络石藤
0.944307 0.457181 0.549548 0.41687 0.377706 0.523332 0.488503 0.517707 0.373494 0.426806 0.460245
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
140. 
patient tongue id: 05232043293154_1_4_7
label yaofang:
甘草 陈皮 当归 茯苓 半夏 党参 枸杞子 白术 杜仲 牛膝 山药 厚朴 菟丝子 鸡内金 紫苏叶 骨碎补 红豆杉
0.723589 0.416854 0.482843 0.319527 0.440488
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.235294, error: 0.200000
141. 
patient tongue id: 05092118240753_3_4
label yaofang:
甘草 香附 法半夏 茯苓 党参 丹参 黄连 熟附子 红花 郁金 车前子 瓜蒌皮 莪术 鹿角霜 玉米须
0.942493 0.4762 0.551278 0.401737 0.351545 0.495274 0.489845 0.496372 0.370433 0.424881 0.422879
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
142. 
patient tongue id: 02182221458479_1_5_7
label yaofang:
甘草 薏苡仁 党参 黄连 山药 天麻 鳖甲 莪术 吴茱萸 蜈蚣 白花蛇舌 天山雪莲 红豆杉 瓦楞子
0.972333 0.475425 0.582009 0.372266 0.35204 0.533063 0.529545 0.51126 0.394984 0.445164 0.444748
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
143. 
patient tongue id: 01110250424161_6
label yaofang:
柴胡 白芍 当归 茯苓 葛根 防风 薄荷 白术 炙甘草
0.362573 0.340842 0.389858 0.335352 0.392137 0.31698
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
144. 
patient tongue id: 03221301248881_1_2_6
label yaofang:
甘草 玉竹 太子参 山药 天麻 天花粉 鳖甲 北沙参 白扁豆 蜈蚣 白花蛇舌 天山雪莲 合欢花 红豆杉 猫爪草
0.971233 0.489669 0.578457 0.368102 0.360317 0.522457 0.527626 0.494168 0.396939 0.441844 0.410427
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
145. 
patient tongue id: 04071248000353_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.45745 0.898387 0.33758 0.978426 0.595067 0.700555 0.31999 0.360085 0.368457 0.383024 0.934457 0.954074 0.91605 0.954977 0.987888 0.410493 0.555732 0.621014 0.878983
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
146. 
patient tongue id: 05182040268841_1
label yaofang:
甘草 川芎 陈皮 枳壳 茯苓 龙骨 牡蛎 远志 酸枣仁 竹茹 姜半夏
0.343652 0.35643 0.316398 0.342563 0.346158 0.605549
predicted yaofang:
白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
147. 
patient tongue id: 03111717214324_6_7
label yaofang:
甘草 薏苡仁 党参 酸枣仁 牡丹皮 郁金 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.984008 0.49395 0.598092 0.34301 0.33616 0.561351 0.538102 0.516545 0.38229 0.443215 0.433534
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
148. 
patient tongue id: 04061910090044_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.839381 0.303153 0.333767 0.477211 0.483891 0.343864 0.35624
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
149. 
patient tongue id: 02202310125396_1_2
label yaofang:
甘草 当归 茯苓 党参 黄芪 鸡血藤 白术 砂仁 赤石脂 鳖甲 北沙参 黄精 蜈蚣 白花蛇舌 天山雪莲
0.956848 0.490188 0.564956 0.375971 0.342248 0.477436 0.485758 0.461916 0.364779 0.402122 0.372748
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
150. 
patient tongue id: 02201305074808_6_4
label yaofang:
甘草 柴胡 白芍 香附 枳壳 龙骨 柏子仁 海螵蛸 浙贝母 肉桂 豆蔻 制川乌 姜半夏 炙甘草 紫苏梗
0.320278 0.332518 0.306038 0.520908
predicted yaofang:
茯苓 党参 干姜 炙甘草

------Score: precision: 0.250000, recall: 0.066667, error: 0.750000
151. 
patient tongue id: 05231925462449_1_2
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.395452 0.717039 0.370813 0.875243 0.469272 0.545234 0.344506 0.315813 0.32785 0.328085 0.766949 0.821268 0.770638 0.839997 0.370513 0.92398 0.336109 0.454563 0.530376 0.762414
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
152. 
patient tongue id: 02212222303733_5
label yaofang:
麻黄 桂枝 甘草 茯苓 前胡 桔梗 防风 独活 金银花 浙贝母 桑白皮 荆芥穗 苦杏仁 贯众
0.961119 0.479009 0.566861 0.390598 0.361072 0.511298 0.513903 0.495699 0.393614 0.436459 0.426345
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
153. 
patient tongue id: 01092337478772_4
label yaofang:
桂枝 白芍 大枣 茯苓 附子 苍术 炙甘草
0.416283 0.327484 0.326609
predicted yaofang:
党参 黄芪 炙甘草

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
154. 
patient tongue id: 04282308231656_2_6
label yaofang:
甘草 白芍 茯苓 太子参 酸枣仁 知母 地黄 天麻 白花蛇舌草 浮小麦 首乌藤 建曲 蜈蚣 半枝莲 醋鳖甲
0.903392 0.310455 0.442031 0.558012 0.365466 0.434441 0.349173 0.38111
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.333333, error: 0.375000
155. 
patient tongue id: 06082042297182_5
label yaofang:
甘草 连翘 薏苡仁 蒲公英 黄连 赤芍 浙贝母 牡丹皮 水蛭 僵蚕 莪术 北沙参 忍冬藤 蜂房 猫爪草 姜黄 山慈菇 冬凌草
0.468102 0.372023 0.467651 0.507141 0.367518
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.400000, recall: 0.111111, error: 0.600000
156. 
patient tongue id: 01312135531440_1_6
label yaofang:
甘草 党参 生地黄 杜仲 砂仁 天麻 桑寄生 鳖甲 补骨脂 扁豆花 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.961457 0.483043 0.58555 0.361351 0.349972 0.525668 0.50406 0.478311 0.375316 0.424868 0.409113
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
157. 
patient tongue id: 03282244217415_7_4
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 莪术 白扁豆 广藿香
0.421649 0.397317 0.423375 0.370017 0.371882
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.272727, error: 0.400000
158. 
patient tongue id: 06031649134171_1_2
label yaofang:
茯苓 防风 钩藤 荆芥穗 白芷 香薷 炙甘草 首乌藤 紫苏梗 广藿香 威灵仙 炒蔓荆子
0.394869 0.658665 0.372724 0.830959 0.452624 0.532481 0.342495 0.305391 0.326708 0.32286 0.713798 0.769342 0.733485 0.807394 0.372183 0.886489 0.355956 0.43072 0.532869 0.719655
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.416667, error: 0.750000
159. 
patient tongue id: 02182315244472_3_6
label yaofang:
甘草 川芎 陈皮 法半夏 茯苓 党参 枸杞子 熟附子 赤芍 干姜 天麻 全蝎 益智 女贞子 沙苑子
0.969623 0.480957 0.58127 0.369184 0.345471 0.503952 0.493693 0.471988 0.359327 0.395015 0.37491
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
160. 
patient tongue id: 01041835008275_1_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.303976 0.416134 0.382546 0.467943 0.322556 0.341626 0.381956 0.442621 0.402527 0.45318 0.314594 0.601472 0.369504
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
161. 
patient tongue id: 05192005215361_1_2_4
label yaofang:
甘草 川芎 茯苓 薏苡仁 党参 黄连 生地黄 赤芍 山药 桑寄生 补骨脂 白花蛇舌 土鳖虫 牛大力
0.944983 0.463657 0.555118 0.367131 0.321618 0.432319 0.44731 0.407686 0.324288 0.352325 0.301561
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
162. 
patient tongue id: 03242117063212_2_1
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 牛膝 茵陈 麦芽 赭石 浮小麦 龟甲
0.31317 0.388493 0.400779 0.309523 0.44905
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
163. 
patient tongue id: 06191327578966_1
label yaofang:
甘草 茯苓 党参 白术 山药 干姜 天麻 鳖甲 麦芽 佛手 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.959149 0.487951 0.576792 0.370238 0.359682 0.519873 0.497745 0.474333 0.375376 0.425029 0.392503
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
164. 
patient tongue id: 05242003317502_2_7
label yaofang:
甘草 茯苓 党参 玄参 浙贝母 牡丹皮 郁金 山药 山茱萸 地黄 天麻 白花蛇舌草 蜈蚣 醋鳖甲
0.917246 0.309588 0.454292 0.555019 0.386176 0.314803 0.451721 0.403328 0.420606 0.336646 0.318866
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
165. 
patient tongue id: 05032318024074_5_2
label yaofang:
甘草 法半夏 茯苓 桔梗 金银花 牛蒡子 浙贝母 杜仲 天麻 款冬花 扁豆花 决明子 麦芽 首乌藤
0.926858 0.458552 0.53842 0.415152 0.351633 0.466994 0.42326 0.465095 0.309145 0.365543 0.390004
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
166. 
patient tongue id: 03141544521724_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.345898 0.314513 0.32744 0.401206 0.459937 0.333428 0.317079
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
167. 
patient tongue id: 01041850181715_4
label yaofang:
柴胡 白芍 黄芩 当归 玄参 石膏 细辛 干姜 大黄 厚朴 滑石 法夏 北杏 制枳实
0.51882 0.326178 0.36394 0.391129 0.372472
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
168. 
patient tongue id: 05191836060471_5
label yaofang:
当归 荆芥 牛蒡子 知母 石膏 苍术 通草 地黄 火麻仁 蝉蜕 苦参 蜂房
0.697593 0.386832 0.35954 0.489279 0.396131
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
169. 
patient tongue id: 03231453046121_4
label yaofang:
法半夏 茯苓 前胡 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.409344 0.740536 0.382968 0.883633 0.4929 0.556631 0.357644 0.344292 0.347133 0.351034 0.780127 0.825398 0.771358 0.835942 0.341722 0.920122 0.35625 0.463038 0.527981 0.745472
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 1.000000, error: 0.400000
170. 
patient tongue id: 03170925189826_1_4_7
label yaofang:
薏苡仁 桃仁 鸡血藤 赤芍 牡丹皮 苍术 泽泻 萹蓄 炙甘草 威灵仙 土茯苓
0.422386 0.38221 0.339644 0.330055
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
171. 
patient tongue id: 02260835060493_5_7
label yaofang:
甘草 党参 黄柏 苍术 天麻 补骨脂 白花蛇舌草 麦芽 忍冬藤 续断 蜈蚣 半枝莲 醋鳖甲 三七粉
0.957793 0.483386 0.56192 0.396196 0.35558 0.526811 0.502082 0.506983 0.385386 0.433715 0.448603
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
172. 
patient tongue id: 06132011445371_5_2
label yaofang:
甘草 半夏 太子参 枸杞子 生地黄 赤芍 海螵蛸 牡丹皮 郁金 莪术 北沙参 赭石 蜈蚣 半枝莲 山慈菇 鸭脚艾
0.474481 0.374795 0.330312 0.541164 0.574098 0.309808 0.382649 0.37106 0.35783 0.410638 0.30087
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
173. 
patient tongue id: 03282250569541_1
label yaofang:
甘草 黄芪 海螵蛸 肉桂 干姜 砂仁 附片 辛夷
0.367201 0.307521 0.440297 0.42155 0.372473 0.311386 0.451102
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.125000, error: 0.857143
174. 
patient tongue id: 01070845425061_1_4_7
label yaofang:
甘草 橘红 木香 党参 丹参 厚朴 莱菔子 鸡内金 草豆蔻 麦芽 六神曲 牡荆子
0.301531 0.407055 0.370997 0.448741 0.311844 0.315548 0.363838 0.35267 0.358342 0.373119 0.415673 0.311884
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 蜜麻黄

------Score: precision: 0.083333, recall: 0.083333, error: 0.916667
175. 
patient tongue id: 03312132522417_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 芦根 浙贝母 细辛 桑白皮 款冬花 紫菀 苦杏仁 炙麻黄
0.967061 0.482228 0.581121 0.363171 0.343498 0.511187 0.508124 0.479519 0.371908 0.419004 0.398486
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
176. 
patient tongue id: 05092136143168_5_6
label yaofang:
甘草 白芍 茯苓 薏苡仁 党参 丹参 苍术 山药 泽泻 厚朴 砂仁 茵陈 扁豆花 虎杖 麦芽
0.964464 0.472619 0.576102 0.354752 0.326761 0.515362 0.488584 0.46559 0.352395 0.409419 0.385413
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
177. 
patient tongue id: 01132331390212_4_3
label yaofang:
柴胡 黄芩 大枣 党参 神曲 大腹皮 山楂 鸡内金 麦芽 姜半夏 炙甘草
0.38722 0.392795 0.361159 0.307369 0.303427 0.312592 0.300024 0.381547 0.318092 0.323183 0.550381
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 干姜 款冬花 紫菀 白前 百部 炙甘草

------Score: precision: 0.090909, recall: 0.090909, error: 0.909091
178. 
patient tongue id: 02190504547687_6_2
label yaofang:
甘草 白芍 川芎 茯苓 龙骨 党参 何首乌 酸枣仁 牛膝 知母 天麻 桑寄生 地龙 首乌藤 合欢花 谷精子
0.966113 0.488813 0.595449 0.356301 0.364115 0.536988 0.536493 0.488963 0.409426 0.44261 0.415614
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
179. 
patient tongue id: 03261602571237_4_3
label yaofang:
桂枝 陈皮 枳壳 半夏 芦根 薏苡仁 麦冬 石菖蒲 厚朴 瓜蒌皮 炙甘草 广藿香 土茯苓 芥子 青果
0.375184 0.359797 0.509908 0.510115 0.323947 0.327222 0.307646 0.401465
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.125000, recall: 0.066667, error: 0.875000
180. 
patient tongue id: 03061820504062_1_4
label yaofang:
甘草 柴胡 白芍 党参 延胡索 川楝子 山药 天麻 茵陈 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.953745 0.490351 0.559801 0.379448 0.341332 0.486349 0.488139 0.466763 0.37215 0.404843 0.38103
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
181. 
patient tongue id: 06072254240635_1_4_7
label yaofang:
甘草 柴胡 薏苡仁 党参 赤芍 郁金 山药 天麻 菟丝子 益母草 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 红豆杉
0.942657 0.464399 0.560584 0.379462 0.33016 0.49705 0.434119 0.457395 0.30404 0.364871 0.370268
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
182. 
patient tongue id: 05022124494123_2_7_6
label yaofang:
甘草 白芍 陈皮 茯苓 党参 白术 延胡索 赤芍 山药 天麻 五灵脂 鳖甲 蜈蚣 天山雪莲 半枝莲
0.984517 0.49799 0.600549 0.345442 0.354304 0.58064 0.55999 0.5252 0.419367 0.46492 0.455059
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
183. 
patient tongue id: 02161851439473_4
label yaofang:
白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.343878 0.394076 0.32736 0.316226 0.324621 0.300019 0.3271 0.313118 0.476203
predicted yaofang:
法半夏 茯苓 前胡 黄芪 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.777778, recall: 0.466667, error: 0.222222
184. 
patient tongue id: 05290807051922_2_4
label yaofang:
甘草 法半夏 茯苓 桃仁 党参 五味子 山药 厚朴 款冬花 补骨脂 苦杏仁 紫苏梗 威灵仙
0.970319 0.491445 0.591583 0.354031 0.34747 0.548895 0.521562 0.500133 0.389745 0.43949 0.422464
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
185. 
patient tongue id: 05222052079645_1_4
label yaofang:
甘草 陈皮 茯苓 党参 白术 五味子 厚朴 生半夏 僵蚕 诃子 枇杷叶 地龙 北沙参
0.679168 0.395524 0.393374 0.369974 0.4845
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
186. 
patient tongue id: 05140637361075_6_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 延胡索 川楝子 天麻 菟丝子 益母草 蜈蚣 合欢花 半枝莲 醋鳖甲
0.989809 0.4746 0.614892 0.347323 0.37172 0.650872 0.599426 0.602872 0.437082 0.514306 0.568845
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
187. 
patient tongue id: 02120811327690_4_1
label yaofang:
甘草 羌活 独活 薏苡仁 党参 白术 杜仲 牛膝 天麻 金樱子 桑螵蛸 粉葛 威灵仙 川木瓜 土茯苓
0.961323 0.479272 0.576702 0.389282 0.367236 0.53185 0.503653 0.494843 0.383215 0.434892 0.430835
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
188. 
patient tongue id: 03101838511953_1_2
label yaofang:
当归 黄芪 鸡血藤 白术 厚朴 砂仁 补骨脂 鸡内金 女贞子 骨碎补 稻芽
0.433891 0.340991 0.400943 0.475838 0.342345
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
189. 
patient tongue id: 06132026496071_1_4_7
label yaofang:
桂枝 川芎 当归 龙眼肉 赤芍 附子 山药 山茱萸 芡实 莲子
0.517572 0.362106 0.340625 0.515109 0.553865 0.34699 0.333988 0.317587
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
190. 
patient tongue id: 05140957086338_4_6
label yaofang:
甘草 柴胡 当归 茯苓 黄芪 白术 酸枣仁 杜仲 桑寄生 桑螵蛸 益智 紫苏梗 广藿香
0.927224 0.468693 0.553582 0.368561 0.417891 0.379928 0.377596
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
191. 
patient tongue id: 01211235237934_2_1
label yaofang:
当归 茯苓 党参 鸡血藤 枸杞子 白术 黄柏 知母 炙甘草 续断 土鳖虫 狗脊 龟甲
0.435522 0.340535 0.438604 0.343715
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.230769, error: 0.250000
192. 
patient tongue id: 05090818132346_1_4_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.439272 0.417243 0.445943 0.548418 0.405543 0.377705 0.313227 0.305614 0.374077 0.328533 0.369606 0.309848
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.416667, recall: 0.416667, error: 0.583333
193. 
patient tongue id: 04120719446605_5_7
label yaofang:
甘草 白芍 独活 党参 生地黄 延胡索 杜仲 细辛 桑寄生 忍冬藤 首乌藤 牛大力 千斤拔
0.967976 0.485293 0.575808 0.355582 0.352734 0.543559 0.517587 0.495841 0.376985 0.435442 0.421045
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
194. 
patient tongue id: 03032006079647_1_7_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子
0.422157 0.813048 0.37097 0.935997 0.523831 0.599092 0.350089 0.364135 0.367585 0.350968 0.849766 0.892511 0.830177 0.896179 0.311323 0.95833 0.3607 0.48537 0.564235 0.799355
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
195. 
patient tongue id: 05182116326559_1_4
label yaofang:
桂枝 甘草 白芍 川芎 独活 牛膝 细辛 干姜 补骨脂 蜈蚣 姜黄 海桐皮 鹿衔草
0.305245 0.416467 0.367846 0.375945 0.30941 0.35541 0.462297 0.62032
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
196. 
patient tongue id: 01202004249571_3_2_6
label yaofang:
半夏 龙骨 太子参 枸杞子 白术 海螵蛸 山药 砂仁 北沙参 桑枝 紫苏梗 土鳖虫 夏天无
0.474469 0.394508 0.336544 0.387084 0.402452 0.321245
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
197. 
patient tongue id: 04201853124129_9
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.404639 0.768435 0.362911 0.910456 0.502358 0.56874 0.361635 0.343656 0.365094 0.342341 0.815437 0.865949 0.80641 0.875746 0.34879 0.955208 0.330421 0.484113 0.542972 0.799475
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.923077, error: 0.400000
198. 
patient tongue id: 03240559184418_1
label yaofang:
桂枝 甘草 法半夏 大枣 茯苓 龙骨 牡蛎 黄芪 白术 泽泻 干姜 滑石 糯稻根 猪苓
0.834267 0.45338 0.524447 0.370409 0.315815 0.391262 0.331648 0.33758
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
199. 
patient tongue id: 03311615410420_5
label yaofang:
荆芥 防风 金银花 连翘 党参 枇杷叶 北沙参 蝉蜕 辛夷 东风桔 咸竹蜂
0.356004 0.335213 0.356869 0.478858 0.428878
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
200. 
patient tongue id: 03292133154570_1
label yaofang:
甘草 枳壳 茯苓 牡蛎 党参 太子参 酸枣仁 丹参 生地黄 竹茹 浙贝母 郁金 扁豆花 麦芽
0.985555 0.489991 0.605057 0.345078 0.351873 0.580362 0.557117 0.534848 0.410229 0.460497 0.454859
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
201. 
patient tongue id: 03020812029207_6
label yaofang:
甘草 柴胡 香附 枳壳 法半夏 茯苓 酸枣仁 青皮 郁金 扁豆花 王不留行 续断 天山雪莲 木棉花
0.988518 0.488255 0.609963 0.340168 0.353084 0.641161 0.576257 0.576692 0.414793 0.504281 0.537806
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
202. 
patient tongue id: 03020742579548_1_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 干姜 鸡内金
0.359444 0.301343 0.35531 0.482672 0.441698
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 1.000000, recall: 0.416667, error: 0.000000
203. 
patient tongue id: 03022120000643_1_4_7
label yaofang:
薏苡仁 黄芪 枸杞子 白术 浙贝母 厚朴 砂仁 北沙参 首乌藤 蜈蚣 红豆杉 预知子
0.319438 0.302293 0.366666 0.504774 0.351544
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
204. 
patient tongue id: 06072127345717_1_4
label yaofang:
甘草 枳壳 独活 党参 山茱萸 天麻 菟丝子 桑寄生 鳖甲 补骨脂 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.945053 0.459439 0.542915 0.426736 0.337796 0.47211 0.457592 0.503061 0.335691 0.397053 0.42552
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
205. 
patient tongue id: 06072116185055_4
label yaofang:
甘草 陈皮 薏苡仁 远志 党参 白术 牛膝 苍术 厚朴 佩兰 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.964094 0.482047 0.584256 0.357218 0.307872 0.377293 0.589094 0.466414 0.479295 0.328202 0.395097 0.438442
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
206. 
patient tongue id: 03091856563127_1_6_2
label yaofang:
甘草 茯苓 葛根 党参 黄芪 黄连 石膏 苍术 白芷 蔓荆子 皂角刺 辛夷 炒苍耳子 合欢花
0.912367 0.309052 0.461237 0.525134 0.37203 0.438931 0.406605 0.418425 0.331099 0.33228
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
207. 
patient tongue id: 03091906502111_1_2
label yaofang:
甘草 川芎 党参 黄芪 枸杞子 酸枣仁 石菖蒲 天麻 地龙 蒺藜 女贞子 粉葛 首乌藤
0.893085 0.329032 0.450249 0.53275 0.384897 0.423089 0.354577 0.386826
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
208. 
patient tongue id: 03192240356696_6_4
label yaofang:
甘草 白芍 茯苓 党参 酸枣仁 玄参 柏子仁 黄连 生地黄 山茱萸 厚朴 火麻仁 麦芽 郁李仁 合欢花
0.817255 0.439707 0.470262 0.427462 0.312167
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
209. 
patient tongue id: 02190547182585_2_7_6
label yaofang:
甘草 党参 酸枣仁 丹参 生地黄 延胡索 郁金 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲 红豆杉
0.95968 0.477699 0.567283 0.374217 0.360379 0.556342 0.520062 0.526348 0.393501 0.453052 0.474124
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
210. 
patient tongue id: 04102107280674_3
label yaofang:
川芎 陈皮 桃仁 太子参 黄芪 丹参 红花 水蛭 升麻 三七 决明子 益智
0.775638 0.442436 0.450336 0.392799
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
211. 
patient tongue id: 03020740302209_6_4
label yaofang:
甘草 法半夏 茯苓 桔梗 木香 连翘 党参 白术 浙贝母 山药 砂仁 莱菔子 麦芽 紫苏梗 广藿香 稻芽
0.923497 0.438678 0.554487 0.365629 0.444614 0.334873 0.375749
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
212. 
patient tongue id: 03012255584283_7_4_6
label yaofang:
甘草 独活 薏苡仁 红花 杜仲 黄柏 苍术 山药 僵蚕 桑寄生 续断 威灵仙 乌梢蛇 牛大力 千斤拔
0.972559 0.48803 0.608055 0.345069 0.354329 0.549856 0.519458 0.470159 0.38075 0.435234 0.394859
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
213. 
patient tongue id: 05140653362992_2_6
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 柏子仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.951771 0.301008 0.486041 0.582894 0.367672 0.355699 0.509129 0.511258 0.482268 0.398875 0.436585 0.406426
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
214. 
patient tongue id: 04072012325713_1_2
label yaofang:
甘草 茯苓 橘红 牡蛎 麦冬 玉竹 党参 黄芪 白术 浙贝母 山药 生半夏 砂仁 全蝎 芡实 莲子 枇杷叶 北沙参 百合 猫爪草 合欢皮 冬凌草
0.39302 0.314942 0.308576 0.485969 0.550557
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 1.000000, recall: 0.227273, error: 0.000000
215. 
patient tongue id: 05162146419364_2_5
label yaofang:
白芍 茯苓 生地黄 牡丹皮 黄柏 知母 山药 山茱萸 白茅根 小蓟 泽泻 车前子 白花蛇舌 鹿衔草
0.872686 0.464118 0.502725 0.335986 0.368385 0.306563
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
216. 
patient tongue id: 05140703045838_1_4
label yaofang:
甘草 白芍 陈皮 法半夏 茯苓 党参 山药 仙鹤草 茜草 天麻 赤石脂 鳖甲 蜈蚣 天山雪莲 半枝莲 红豆杉
0.939902 0.490407 0.560696 0.364345 0.336569 0.443807 0.419405 0.400367 0.306978 0.332978
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.800000, recall: 0.500000, error: 0.200000
217. 
patient tongue id: 05252215319386_1_4_2
label yaofang:
法半夏 茯苓 葛根 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 人参叶
0.413043 0.857554 0.379144 0.951578 0.54101 0.619556 0.341754 0.365419 0.35679 0.357826 0.882194 0.918203 0.863572 0.916939 0.969151 0.357633 0.507438 0.558216 0.846317
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.714286, error: 0.473684
218. 
patient tongue id: 06190147384190_3_4
label yaofang:
甘草 茯苓 党参 杜仲 肉桂 山茱萸 泽泻 干姜 桑寄生 淫羊藿 王不留行 仙茅 沙苑子 覆盆子 酒女贞子 墨旱莲 艾叶
0.977825 0.489987 0.604759 0.345401 0.371382 0.573399 0.567066 0.519721 0.433458 0.478813 0.446907
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.176471, error: 0.727273
219. 
patient tongue id: 02111328575441_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.440826 0.32823 0.352737 0.608968 0.617538 0.338727 0.435217 0.390276 0.420788 0.404474 0.357642
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
220. 
patient tongue id: 01312049250652_1_3
label yaofang:
茯苓 桃仁 太子参 白术 厚朴 白芷 肉苁蓉 火麻仁 北沙参 辛夷 紫苏叶 苍耳子 骨碎补 土鳖虫 狗脊
0.511225 0.412319 0.324676
predicted yaofang:
甘草 茯苓 白术

------Score: precision: 0.666667, recall: 0.133333, error: 0.333333
221. 
patient tongue id: 01052137548111_1_2
label yaofang:
甘草 川芎 党参 白术 生地黄 赤芍 天麻 鳖甲 忍冬藤 桑枝 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.959642 0.462173 0.572167 0.372978 0.372276 0.562382 0.498459 0.515762 0.359745 0.428148 0.458967
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
222. 
patient tongue id: 04200207109391_6_4
label yaofang:
甘草 法半夏 茯苓 党参 白术 黄连 砂仁 天麻 鳖甲 麦芽 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.906346 0.470278 0.552047 0.382223 0.351694 0.45817 0.390923 0.404276 0.315018 0.301092
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.562500, error: 0.100000
223. 
patient tongue id: 04112044339466_6
label yaofang:
甘草 川芎 法半夏 茯苓 党参 白术 生地黄 牛膝 天麻 扁豆花 麦芽 益智 首乌藤
0.980416 0.465231 0.602629 0.372714 0.365362 0.566617 0.516574 0.507191 0.373979 0.424527 0.429338
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
224. 
patient tongue id: 01172226295780_1_2_4
label yaofang:
甘草 法半夏 茯苓 桔梗 桃仁 党参 鸡血藤 浙贝母 山药 鳖甲 诃子 紫苏梗 白花蛇舌 天山雪莲 蜂房 岗梅根
0.772599 0.372192 0.462987 0.391373
predicted yaofang:
甘草 法半夏 茯苓 党参

------Score: precision: 1.000000, recall: 0.250000, error: 0.000000
225. 
patient tongue id: 01140803113088_4_6_1
label yaofang:
甘草 黄芩 法半夏 桔梗 浙贝母 天麻 天花粉 槐花 鳖甲 火麻仁 诃子 蜈蚣 白花蛇舌 蜂房 四季青
0.89334 0.425858 0.525066 0.407114 0.34309 0.444537 0.38351
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
226. 
patient tongue id: 05252151193279_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.402567 0.628211 0.401984 0.775068 0.452801 0.512091 0.375603 0.329833 0.343416 0.34614 0.672839 0.713198 0.684243 0.74694 0.399615 0.837468 0.366069 0.438675 0.509008 0.678257
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
227. 
patient tongue id: 02191626355080_6_7
label yaofang:
桂枝 甘草 白芍 川芎 防风 桃仁 鸡血藤 酸枣仁 生地黄 红花 赤芍 牡丹皮 吴茱萸 麦芽 地龙
0.944117 0.462267 0.557429 0.372609 0.314182 0.44821 0.414944 0.426935 0.327904 0.307094
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.066667, error: 0.900000
228. 
patient tongue id: 01042331106423_1_6
label yaofang:
甘草 薏苡仁 丹参 山药 天麻 鳖甲 茵陈 莪术 虎杖 麦芽 蜈蚣 白花蛇舌 天山雪莲
0.973516 0.482728 0.588252 0.368714 0.358609 0.572356 0.520377 0.516326 0.382294 0.444612 0.469266
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.538462, error: 0.363636
229. 
patient tongue id: 01101820477482_1_4
label yaofang:
川芎 法半夏 前胡 木香 太子参 郁金 北柴胡 白前 百部 豆蔻 北沙参 炙甘草 麸炒白术 甘松 麸炒枳壳 姜厚朴
0.40123 0.59979 0.4039 0.739803 0.434322 0.494714 0.358648 0.335293 0.34987 0.352253 0.639734 0.681074 0.645456 0.712497 0.376236 0.789676 0.37854 0.424957 0.484893 0.629619
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.437500, error: 0.650000
230. 
patient tongue id: 01182125572738_2_4_6
label yaofang:
甘草 枳壳 茯苓 连翘 党参 白术 浙贝母 郁金 山药 砂仁 鳖甲 火麻仁 鸡内金 苦杏仁 白花蛇舌 天山雪莲
0.945144 0.481282 0.557868 0.383019 0.348932 0.468694 0.470436 0.452099 0.356888 0.387013 0.365751
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
231. 
patient tongue id: 06191321271345_1_7
label yaofang:
甘草 陈皮 茯苓 薏苡仁 桃仁 党参 红花 浙贝母 山药 天麻 鳖甲 白扁豆 丝瓜络 蜈蚣 白花蛇舌 天山雪莲
0.95038 0.300537 0.481848 0.569608 0.36407 0.339087 0.494545 0.480562 0.460385 0.361057 0.395549 0.365588
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
232. 
patient tongue id: 04131859043930_2_5
label yaofang:
甘草 柴胡 黄芩 麦冬 丹参 赤芍 牡丹皮 僵蚕 麦芽 百合 紫苏叶 黑枣 合欢皮 预知子
0.702065 0.394766 0.416577 0.324472 0.482907
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
233. 
patient tongue id: 03011102469277_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.305463 0.41442 0.394385 0.368358 0.316616 0.36363 0.441818 0.587933
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
234. 
patient tongue id: 01172240231385_2_4_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 延胡索 赤芍 杜仲 天麻 五灵脂 桑寄生 补骨脂 桑枝 威灵仙 罗布麻
0.929811 0.478464 0.530267 0.405093 0.349471 0.434194 0.438628 0.442177 0.32673 0.366666 0.340372
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
235. 
patient tongue id: 03012334427796_6
label yaofang:
茯苓 党参 酸枣仁 栀子 牡丹皮 山药 山茱萸 地黄 泽泻 桑寄生 桑螵蛸 炙甘草 浮小麦 首乌藤 合欢花
0.960715 0.490954 0.5737 0.359377 0.339296 0.515553 0.492855 0.477174 0.362495 0.40707 0.398617
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
236. 
patient tongue id: 03311828582555_4_1
label yaofang:
桂枝 白芍 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 紫菀 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.419922 0.832451 0.369643 0.947182 0.532373 0.629633 0.349506 0.373183 0.36756 0.35473 0.872552 0.911517 0.856902 0.913363 0.30675 0.966838 0.368055 0.496468 0.583057 0.824945
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.733333, error: 0.450000
237. 
patient tongue id: 06111034471979_2_1_6
label yaofang:
甘草 太子参 酸枣仁 生地黄 山药 天麻 鳖甲 北沙参 蜈蚣 白花蛇舌 天山雪莲 蜂房 岗梅根 四季青
0.98133 0.501966 0.604085 0.347899 0.367168 0.569679 0.553129 0.526049 0.411494 0.465629 0.44696
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
238. 
patient tongue id: 03012203260906_1_2
label yaofang:
甘草 茯苓 党参 白术 生地黄 栀子 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.958522 0.48784 0.559712 0.369197 0.366085 0.506118 0.505118 0.485192 0.3803 0.418209 0.398704
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
239. 
patient tongue id: 05032146365840_4_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.839386 0.341443 0.396692 0.554227 0.350855
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
240. 
patient tongue id: 03111449141949_6
label yaofang:
甘草 柴胡 白芍 川芎 茯苓 葛根 黄芪 酸枣仁 赤芍 牛膝 天麻 全蝎 木瓜 浮小麦 宽筋藤
0.980135 0.486516 0.59983 0.347007 0.343446 0.577866 0.548892 0.525571 0.39826 0.463515 0.463638
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
241. 
patient tongue id: 02251129516936_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.405669 0.632045 0.405148 0.781243 0.465333 0.544191 0.346145 0.34054 0.337625 0.363521 0.676918 0.708631 0.674602 0.735163 0.347944 0.79271 0.401524 0.456733 0.488394 0.638684
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
242. 
patient tongue id: 04282228485198_2_4
label yaofang:
甘草 茯苓 前胡 党参 浙贝母 鳖甲 款冬花 紫菀 诃子 枇杷叶 北沙参 苦杏仁 白花蛇舌 蜂房 四季青
0.985193 0.499884 0.609936 0.334396 0.353851 0.575065 0.569673 0.527035 0.414197 0.472121 0.446067
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
243. 
patient tongue id: 04020808231942_5_2_6
label yaofang:
甘草 黄芩 法半夏 大枣 茯苓 薏苡仁 桃仁 葶苈子 细辛 桑白皮 厚朴 莱菔子 款冬花 苇茎 紫苏子
0.858438 0.449342 0.520069 0.378433 0.37007 0.329351
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
244. 
patient tongue id: 03291335116635_6_1
label yaofang:
甘草 柴胡 白芍 川芎 黄芩 法半夏 茯苓 桔梗 党参 浙贝母 山药 荆芥穗 虎杖 建曲 贯众
0.968613 0.498757 0.569149 0.358095 0.34313 0.517294 0.496284 0.473714 0.372682 0.418992 0.386015
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
245. 
patient tongue id: 05270747509341_1_4_7
label yaofang:
枳壳 茯苓 桃仁 党参 黄芪 海螵蛸 牛膝 泽泻 车前子 厚朴 炙甘草 土茯苓 粉萆薢
0.427128 0.371946 0.379653 0.415704 0.359658
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
246. 
patient tongue id: 01130644230738_6_4_1
label yaofang:
甘草 茯苓 木香 白术 黄连 山药 天麻 鳖甲 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.976403 0.495949 0.591019 0.344406 0.344936 0.553062 0.527903 0.501138 0.382141 0.442577 0.431889
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
247. 
patient tongue id: 06031116549851_6
label yaofang:
甘草 川芎 茯苓 远志 党参 枸杞子 酸枣仁 生地黄 牡丹皮 牛膝 蔓荆子 女贞子 浮小麦 墨旱莲
0.980549 0.487791 0.599093 0.358544 0.363432 0.573486 0.557612 0.530146 0.422258 0.471078 0.462146
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
248. 
patient tongue id: 01110254011062_4_2_3
label yaofang:
当归 茯苓 党参 枸杞子 白术 生地黄 黄柏 牛膝 知母 炙甘草 续断 玉米须 狗脊 龟甲
0.335771 0.435355 0.320039 0.306494 0.411831
predicted yaofang:
茯苓 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
249. 
patient tongue id: 03081805229731_7
label yaofang:
当归 桃仁 党参 黄芪 白术 丹参 生地黄 猪苓 鳖甲 虎杖 白花蛇舌草 瓦楞子
0.454984 0.301339 0.326875 0.445766 0.321842
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
250. 
patient tongue id: 04020755337352_2_7_6
label yaofang:
甘草 白芍 茯苓 党参 酸枣仁 丹参 黄连 生地黄 山茱萸 益母草 北沙参 粉葛
0.942666 0.304229 0.479756 0.56544 0.369615 0.324728 0.49999 0.46574 0.466556 0.340879 0.393278 0.384824
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
251. 
patient tongue id: 02161844419121_1
label yaofang:
甘草 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 紫菀 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.443779 0.838803 0.341779 0.954507 0.545473 0.653441 0.352824 0.394546 0.375409 0.380403 0.888443 0.918966 0.861409 0.921128 0.969094 0.384662 0.522987 0.576711 0.808776
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.642857, error: 0.526316
252. 
patient tongue id: 04142010222300_6_2
label yaofang:
甘草 龙骨 党参 枸杞子 生地黄 天麻 鳖甲 女贞子 粉葛 沙苑子 蜈蚣 白花蛇舌 天山雪莲 墨旱莲
0.96048 0.489481 0.575533 0.370534 0.364718 0.525482 0.506728 0.475442 0.394056 0.427879 0.403046
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
253. 
patient tongue id: 05032229113666_2_6
label yaofang:
甘草 茯苓 党参 黄芪 白术 酸枣仁 天麻 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.949538 0.475062 0.561249 0.391229 0.345005 0.550142 0.51164 0.525556 0.387126 0.462479 0.500119
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
254. 
patient tongue id: 05130651155924_4_6
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 酸枣仁 丹参 生地黄 天麻 全蝎 鳖甲 浮小麦 首乌藤 白花蛇舌 红豆杉
0.942531 0.483341 0.580035 0.343368 0.358992 0.51308 0.426035 0.41029 0.345263 0.311409
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
255. 
patient tongue id: 02181634142968_1_7
label yaofang:
桂枝 甘草 川芎 茯苓 羌活 党参 鸡血藤 白术 生地黄 红花 天麻 益母草 粉葛 天山雪莲 乌梢蛇
0.941744 0.341838 0.497505 0.505689 0.302983 0.311259 0.441612 0.392185 0.359131
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.555556, recall: 0.333333, error: 0.444444
256. 
patient tongue id: 06190152201086_2_3
label yaofang:
甘草 茯苓 党参 黄连 熟附子 赤芍 熟地黄 牡丹皮 肉桂 山药 山茱萸 泽泻 粉葛
0.974505 0.498641 0.610441 0.334906 0.388704 0.583692 0.538241 0.493701 0.405463 0.451725 0.416288
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
257. 
patient tongue id: 04201901250307_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 芡实 北沙参 炙甘草 炒紫苏子
0.402684 0.77581 0.370425 0.916961 0.487068 0.568106 0.346792 0.328211 0.342093 0.333429 0.825174 0.868457 0.814995 0.884351 0.343401 0.951111 0.342206 0.469257 0.548889 0.802406
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
258. 
patient tongue id: 05272329338201_6_2_7
label yaofang:
甘草 枳壳 牡蛎 黄芪 白术 丹参 郁金 厚朴 火麻仁 柿蒂 鸡内金 苍耳子
0.486419 0.310285 0.402656 0.36121 0.425467
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
259. 
patient tongue id: 01050659559265_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 枸杞子 白术 牛膝 山药 砂仁 天麻 决明子 蒺藜 沙苑子 木贼
0.989963 0.484678 0.621432 0.337168 0.359441 0.635806 0.586407 0.584683 0.421064 0.500567 0.537759
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
260. 
patient tongue id: 04062003304008_5
label yaofang:
黄芩 防风 金银花 蒲公英 紫花地丁 牡丹皮 菊花 天花粉 蝉蜕 辛夷
0.349632 0.353516 0.360031 0.424986 0.322492
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
261. 
patient tongue id: 06082039086320_5
label yaofang:
甘草 蒲公英 黄连 砂仁 北沙参 赭石 紫苏叶 蜈蚣 土鳖虫 红豆杉 预知子 冬凌草
0.34771 0.36848 0.431852 0.466659 0.393517 0.328586
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
262. 
patient tongue id: 05232112099092_1_7
label yaofang:
陈皮 茯苓 半夏 牛蒡子 党参 枸杞子 白术 海螵蛸 杜仲 牛膝 厚朴 僵蚕 莪术 鸡内金 紫苏子 紫苏叶 骨碎补 红豆杉
0.804423 0.400965 0.426084 0.487228
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.166667, error: 0.250000
263. 
patient tongue id: 05091932579472_2_4
label yaofang:
茯苓 防风 麦冬 钩藤 荆芥穗 白芷 豆蔻 北沙参 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.398955 0.819896 0.358631 0.940678 0.516426 0.584892 0.342045 0.341052 0.354115 0.317902 0.854881 0.900428 0.843752 0.903857 0.305965 0.972466 0.301701 0.48249 0.545673 0.823402
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.428571, error: 0.700000
264. 
patient tongue id: 02161943417027_1_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 柏子仁 海螵蛸 肉桂 白芷 附片 辛夷 紫苏梗 瓦楞子
0.754603 0.428488 0.524744 0.329448 0.417678
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
265. 
patient tongue id: 04062009404521_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.413041 0.40654 0.323185 0.370856 0.512026
predicted yaofang:
白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
266. 
patient tongue id: 05262157348249_1_2_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 芦根 牛蒡子 党参 黄连 熟附子 天花粉 鳖甲 白花蛇舌 蜂房 四季青 广升麻
0.930799 0.481657 0.553537 0.387757 0.356088 0.486956 0.479222 0.468682 0.367639 0.398669 0.389097
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
267. 
patient tongue id: 04182033523404_4_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 浮小麦 紫苏梗
0.318908 0.438378 0.308252 0.380468 0.368327 0.312972 0.354432 0.502626 0.632082
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.666667, recall: 0.545455, error: 0.333333
268. 
patient tongue id: 05161915383921_1
label yaofang:
茯苓 防风 太子参 黄芪 钩藤 白芷 北沙参 炙甘草 首乌藤 广藿香 威灵仙 麸炒白术 炒蔓荆子 棉萆薢
0.365574 0.626328 0.390475 0.7706 0.416307 0.470578 0.33792 0.300933 0.6634 0.675647 0.649601 0.722661 0.348147 0.797493 0.341002 0.389643 0.438635 0.632611
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.388889, recall: 0.500000, error: 0.611111
269. 
patient tongue id: 04202213572291_1_6
label yaofang:
甘草 茯苓 远志 党参 青蒿 天麻 地骨皮 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲 龟甲
0.956229 0.467035 0.562462 0.389651 0.353878 0.525098 0.4895 0.504156 0.359703 0.425809 0.440028
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
270. 
patient tongue id: 04200617324629_2_1_4
label yaofang:
甘草 桔梗 党参 红花 浙贝母 车前子 天麻 猪苓 鳖甲 诃子 鹿角霜 蜈蚣 木蝴蝶 天山雪莲 半枝莲
0.951842 0.484394 0.577824 0.370494 0.35366 0.524859 0.499048 0.48082 0.377077 0.418286 0.40833
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
271. 
patient tongue id: 03151931535160_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.402948 0.302471 0.396491 0.458374 0.419526 0.392988 0.308698 0.354377 0.336432 0.369681 0.357171 0.322374 0.358893 0.337592
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.714286, recall: 0.833333, error: 0.285714
272. 
patient tongue id: 02211900061224_6
label yaofang:
木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.334327 0.402105 0.397745 0.395058 0.330323 0.505626
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
273. 
patient tongue id: 04121333145860_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.405929 0.787147 0.369029 0.92497 0.508557 0.580072 0.348289 0.346447 0.358039 0.342914 0.83296 0.882045 0.821234 0.887451 0.351009 0.957347 0.333645 0.489757 0.554995 0.813864
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
274. 
patient tongue id: 05261926540414_4
label yaofang:
薏苡仁 鸡血藤 赤芍 黄柏 泽泻 天麻 升麻 茵陈 蝉蜕 苦参 五倍子 白鲜皮 土茯苓 五指毛桃 灯盏细辛 羚羊骨
0.965184 0.470385 0.576628 0.349141 0.356346 0.574667 0.49062 0.491937 0.347382 0.419133 0.4433
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.062500, error: 0.909091
275. 
patient tongue id: 03192248029764_5_6
label yaofang:
甘草 薏苡仁 酸枣仁 牡丹皮 杜仲 黄柏 厚朴 天麻 桑寄生 鳖甲 豆蔻 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.929199 0.466592 0.572838 0.34415 0.354283 0.504526 0.372545 0.381817 0.303943
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.555556, recall: 0.312500, error: 0.444444
276. 
patient tongue id: 03020819058545_1_2
label yaofang:
甘草 木香 党参 太子参 山药 砂仁 麦芽 北沙参 白扁豆 女贞子 粉葛 建曲 墨旱莲 木棉花
0.977437 0.455053 0.572348 0.392662 0.380726 0.609729 0.560395 0.594901 0.411802 0.494941 0.56319
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
277. 
patient tongue id: 02120807425567_6
label yaofang:
桂枝 甘草 柴胡 白芍 龙骨 防风 党参 黄芪 白术 五味子 黄连 山茱萸 干姜 补骨脂 建曲 川木瓜
0.978107 0.469106 0.575159 0.358894 0.349498 0.539574 0.525696 0.514114 0.384174 0.431228 0.429
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
278. 
patient tongue id: 04202055410215_4
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 砂仁 升麻 益母草 白花蛇舌草 炙甘草 覆盆子 墨旱莲
0.393294 0.359414 0.308989 0.416837 0.386419 0.348924
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
279. 
patient tongue id: 06082012305238_1_2
label yaofang:
甘草 薏苡仁 枸杞子 白术 赤芍 海螵蛸 牡丹皮 杜仲 郁金 厚朴 莪术 蜈蚣 土鳖虫 预知子 荔枝核
0.532531 0.380223 0.383334 0.452774 0.433918 0.334271
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
280. 
patient tongue id: 04291500458045_1_2_6
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 山药 山茱萸 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.971801 0.462704 0.561826 0.390375 0.331557 0.502408 0.477928 0.492871 0.327829 0.393712 0.40913
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
281. 
patient tongue id: 04121904079039_7
label yaofang:
甘草 枳壳 黄芪 枸杞子 白术 赤芍 牡丹皮 杜仲 山茱萸 水蛭 厚朴 桑寄生 麦芽 地龙 续断
0.525426 0.332942 0.472481 0.363747
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.500000, recall: 0.133333, error: 0.500000
282. 
patient tongue id: 03021141467808_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.483913 0.330241 0.410266 0.34362 0.406538
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
283. 
patient tongue id: 05191941044539_7_2
label yaofang:
甘草 白芍 川芎 龙骨 桃仁 生地黄 红花 赤芍 山药 山茱萸 补骨脂 浮小麦 首乌藤 川木瓜
0.952508 0.476696 0.573269 0.390197 0.34463 0.472966 0.484881 0.474136 0.358969 0.401468 0.390814
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
284. 
patient tongue id: 03271542283845_7
label yaofang:
桂枝 柴胡 白芍 黄芩 当归 茯苓 龙骨 黄芪 白术 黄连 熟地黄 胆南星 黄柏 白茅根 干姜 鸡内金 姜半夏 浮小麦 淡附片
0.803167 0.31436 0.449015 0.512221 0.386183 0.334959 0.302179
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.157895, error: 0.571429
285. 
patient tongue id: 03302010244226_5
label yaofang:
甘草 枳壳 薏苡仁 桃仁 蒲公英 赤芍 牡丹皮 厚朴 石韦 北沙参 蜈蚣 土鳖虫 蛇舌草 冬凌草 鸭脚艾
0.400785 0.352222 0.433135 0.328526 0.303865
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
286. 
patient tongue id: 04142232323334_1_4
label yaofang:
桂枝 甘草 茯苓 党参 黄芪 白术 熟附子 泽泻 天麻 鳖甲 败酱草 建曲 蜈蚣 天山雪莲 半枝莲
0.962699 0.48743 0.579895 0.360614 0.328366 0.459379 0.444405 0.417889 0.318884 0.35316 0.303081
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
287. 
patient tongue id: 06050802305263_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.395084 0.320239 0.345549 0.506214 0.412677
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
288. 
patient tongue id: 03020740287195_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.485822 0.349289 0.359989 0.453594 0.372812
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
289. 
patient tongue id: 03242124433797_4
label yaofang:
甘草 牛蒡子 肉桂 干姜 砂仁 紫菀 附片 辛夷
0.442668 0.375879 0.326568 0.424881 0.390841 0.368143
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.125000, error: 0.833333
290. 
patient tongue id: 05182255463550_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 麸炒白术 木贼
0.374994 0.538911 0.364469 0.711965 0.40146 0.490261 0.348618 0.311756 0.610508 0.64666 0.643426 0.716655 0.40944 0.77057 0.370738 0.399203 0.489568 0.63057
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.812500, error: 0.277778
291. 
patient tongue id: 05172126065300_1_7
label yaofang:
甘草 茯苓 党参 白术 红花 山药 地黄 天麻 磁石 白花蛇舌草 佛手 蜈蚣 合欢花 半枝莲 醋鳖甲
0.916826 0.340957 0.408325 0.539167 0.39011 0.400068 0.319865 0.394152
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.400000, error: 0.250000
292. 
patient tongue id: 02271856063865_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄
0.454699 0.469071 0.415541 0.481727 0.353536 0.334862 0.425698 0.397688 0.354906 0.361529 0.381489
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
293. 
patient tongue id: 03021142565277_1_4_7
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 五味子 熟地黄 补骨脂 吴茱萸 草豆蔻 炙甘草 黑枣
0.335045 0.450046 0.459706 0.43444 0.435255 0.347867 0.40633 0.371161 0.394291 0.45227 0.431235 0.40025 0.445194 0.435168
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.071429, recall: 0.083333, error: 0.928571
294. 
patient tongue id: 03240623345822_5_1
label yaofang:
薏苡仁 桃仁 太子参 黄芪 白术 浙贝母 杜仲 生半夏 砂仁 芡实 土鳖虫 合欢皮 山慈菇 蛇舌草 鲜龙葵果
0.568743 0.408924 0.357688 0.376872 0.458658
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
295. 
patient tongue id: 03231132255868_5_7
label yaofang:
甘草 黄芩 防风 金银花 黄芪 白术 五味子 生地黄 浙贝母 牡丹皮 茜草 荆芥穗 紫苏梗 贯众
0.91725 0.301124 0.448946 0.547852 0.368493 0.407215 0.31086 0.353087
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
296. 
patient tongue id: 04192248048897_4_7
label yaofang:
甘草 白芍 党参 白术 生地黄 红花 延胡索 杜仲 细辛 桑寄生 补骨脂 浮小麦 威灵仙
0.965674 0.480299 0.577195 0.369554 0.34592 0.526899 0.509259 0.489165 0.381003 0.425128 0.412967
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
297. 
patient tongue id: 01122343534689_6_5
label yaofang:
桂枝 甘草 柴胡 白芍 茯苓 桃仁 白术 栀子 牡丹皮 郁金 地黄 菟丝子 益母草 麦芽
0.972758 0.480945 0.579554 0.357496 0.332052 0.513954 0.504974 0.475953 0.367616 0.416896 0.392414
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
298. 
patient tongue id: 03142053002413_6
label yaofang:
陈皮 桔梗 海螵蛸 大腹皮 干姜 厚朴 砂仁 白芷 姜半夏 紫苏叶 广藿香
0.664465 0.415544 0.33021 0.48067 0.37481
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
299. 
patient tongue id: 05311933031883_4
label yaofang:
桂枝 陈皮 茯苓 牡蛎 神曲 山药 厚朴 佩兰 山楂 鸡内金 麦芽 炙甘草 浮小麦 广藿香 煅龙骨
0.497109 0.370336 0.329921 0.4899 0.502808 0.323526 0.310366 0.328636
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.250000, recall: 0.133333, error: 0.750000
300. 
patient tongue id: 05032111505126_4
label yaofang:
桂枝 甘草 白芍 香附 当归 防风 生地黄 荆芥穗 紫草 白花蛇舌草 蒺藜 制何首乌 徐长卿
0.343841 0.4766 0.364729 0.359219 0.37216 0.341774 0.391223 0.587177 0.702711 0.333734
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.200000, recall: 0.153846, error: 0.800000
301. 
patient tongue id: 02120825167029_1_4
label yaofang:
甘草 柴胡 白芍 陈皮 龙骨 防风 白术 天麻 糯稻根 白花蛇舌草 醋龟甲 蜈蚣 半枝莲 醋鳖甲
0.987279 0.508513 0.607194 0.338005 0.333159 0.595549 0.566853 0.544475 0.413859 0.479621 0.479451
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
302. 
patient tongue id: 03312117577276_5
label yaofang:
甘草 法半夏 桔梗 金银花 连翘 芦根 牛蒡子 浙贝母 诃子 麦芽 苦杏仁 板蓝根 炙麻黄 四季青
0.978913 0.476966 0.593562 0.365502 0.365589 0.595307 0.560909 0.563936 0.418583 0.482142 0.519261
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
303. 
patient tongue id: 06031635553995_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.427093 0.857621 0.350276 0.955472 0.558915 0.653953 0.342142 0.382046 0.398705 0.375839 0.888371 0.924803 0.875943 0.922947 0.976638 0.375007 0.533763 0.594508 0.846683
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.687500, error: 0.421053
304. 
patient tongue id: 06031042369423_6_2
label yaofang:
甘草 茯苓 党参 鸡血藤 白术 山药 地黄 天麻 三七 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲
0.849848 0.315343 0.474413 0.487257 0.325381 0.320357
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
305. 
patient tongue id: 05102009118590_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.445946 0.904293 0.319617 0.981961 0.599744 0.736025 0.326765 0.375523 0.368314 0.383207 0.942303 0.964109 0.93207 0.962337 0.990802 0.416602 0.581108 0.65589 0.897106
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
306. 
patient tongue id: 05262210400938_5_7_1
label yaofang:
甘草 当归 金银花 紫花地丁 党参 黄芪 鸡血藤 白术 生地黄 红花 赤芍 牡丹皮 细辛 白芷 吴茱萸 麦芽 忍冬藤 白花蛇舌
0.743095 0.402285 0.518674 0.313611 0.376721
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.166667, error: 0.400000
307. 
patient tongue id: 01201715420540_6
label yaofang:
甘草 白芍 川芎 羌活 酸枣仁 赤芍 牛膝 细辛 天麻 全蝎 白芷
0.953331 0.4837 0.571071 0.367465 0.346283 0.49913 0.495085 0.464632 0.370536 0.413877 0.386865
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.181818, error: 0.818182
308. 
patient tongue id: 05251945253474_5
label yaofang:
甘草 柴胡 薏苡仁 桃仁 蒲公英 黄连 红花 赤芍 栀子 牡丹皮 郁金 麦芽 北沙参 百合 蜈蚣 合欢皮 预知子 稻芽
0.622109 0.391292 0.379182 0.424422 0.518251
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.055556, error: 0.800000
309. 
patient tongue id: 05262204569733_1_2_7
label yaofang:
甘草 太子参 黄芪 鸡血藤 枸杞子 白术 酸枣仁 生地黄 山药 天麻 地龙 女贞子 沙苑子 威灵仙 灯盏细辛
0.848044 0.321439 0.469173 0.514257 0.373228 0.307075 0.39492 0.341226 0.359175
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.444444, recall: 0.266667, error: 0.555556
310. 
patient tongue id: 03221618540357_1_4
label yaofang:
甘草 薏苡仁 远志 党参 白术 牡丹皮 天麻 鳖甲 款冬花 补骨脂 莪术 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.974468 0.492742 0.595219 0.357687 0.351104 0.542964 0.528933 0.502001 0.402561 0.439941 0.420676
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
311. 
patient tongue id: 02182144582851_4_6
label yaofang:
桂枝 甘草 陈皮 法半夏 茯苓 前胡 桔梗 党参 浙贝母 细辛 白前 苦杏仁 粉葛 炙麻黄 贯众
0.416562 0.46113 0.43989 0.469466 0.339955 0.305688 0.396747 0.372091 0.346722 0.353608 0.40365
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
312. 
patient tongue id: 06181840070430_1_2
label yaofang:
甘草 葛根 党参 黄连 赤芍 山药 山茱萸 天麻 白花蛇舌草 玉米须 蜈蚣 半枝莲 醋鳖甲 南杏仁
0.976508 0.48756 0.588041 0.347331 0.348465 0.562911 0.552357 0.523983 0.40964 0.464501 0.45709
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
313. 
patient tongue id: 06191154442697_2_6
label yaofang:
甘草 川芎 枳壳 法半夏 白术 酸枣仁 槟榔 杜仲 牛膝 砂仁 天麻 桑寄生 麦芽 合欢花
0.969136 0.468054 0.593182 0.351839 0.30331 0.47456 0.476138 0.435555 0.344212 0.377051 0.326647
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
314. 
patient tongue id: 02190459031249_5_6
label yaofang:
甘草 防风 金银花 黄芪 白术 黄连 生地黄 红花 桑白皮 水牛角 荆芥穗 火麻仁 白鲜皮 地肤子 土茯苓 蛇蜕
0.741272 0.312927 0.442704 0.476206 0.353715 0.309031
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
315. 
patient tongue id: 04241931404755_3
label yaofang:
大枣 当归 木香 茯神 远志 白术 酸枣仁 龙眼肉 熟地黄 山药 升麻 山萸肉 浮小麦 首乌藤 炙黄芪
0.775557 0.323542 0.435164 0.496053 0.38382 0.353105
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.066667, error: 0.833333
316. 
patient tongue id: 01061607383470_6_4_7
label yaofang:
桂枝 甘草 党参 黄芪 何首乌 白术 生地黄 红花 赤芍 天麻 桑寄生 地龙 桑枝 骨碎补 土茯苓
0.898039 0.458354 0.529818 0.371501 0.390146 0.336914 0.352752
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
317. 
patient tongue id: 01190143040110_1_4_6
label yaofang:
甘草 枳壳 大枣 桔梗 葶苈子 党参 浙贝母 郁金 厚朴 鳖甲 莪术 诃子 白花蛇舌 天山雪莲 蜂房 红豆杉
0.895424 0.457504 0.517277 0.421288 0.356294 0.409668 0.369066 0.408546 0.30136 0.30402
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
318. 
patient tongue id: 05260700431303_6_2
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 生地黄 知母 山药 女贞子 浮小麦 首乌藤 合欢花
0.977349 0.483683 0.585375 0.368664 0.352548 0.572415 0.533462 0.545691 0.396942 0.463268 0.497855
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
319. 
patient tongue id: 01041307169732_5
label yaofang:
桂枝 白芍 茯苓 桃仁 阿胶 海螵蛸 牡丹皮 茜草
0.387256 0.35772 0.361122 0.547386 0.702252
predicted yaofang:
白芍 党参 干姜 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.125000, error: 0.800000
320. 
patient tongue id: 04130632494196_2_7
label yaofang:
甘草 桃仁 党参 枸杞子 酸枣仁 丹参 生地黄 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989022 0.490261 0.616402 0.339751 0.365796 0.601816 0.565214 0.537517 0.41304 0.473577 0.466044
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
321. 
patient tongue id: 04291506135523_6_4_2
label yaofang:
甘草 茯苓 龙骨 远志 酸枣仁 知母 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986611 0.472849 0.601612 0.350076 0.352987 0.62909 0.574529 0.587363 0.414196 0.500592 0.556691
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
322. 
patient tongue id: 03261702068428_3_2
label yaofang:
芦根 桃仁 麦冬 太子参 玄参 生地黄 乌药 决明子 珍珠母 百合 紫苏梗 合欢皮 青果 土牛膝
0.549352 0.344459 0.411949 0.304187 0.359273
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
323. 
patient tongue id: 02122118376482_2_6
label yaofang:
甘草 白芍 当归 枸杞子 白术 牛膝 山药 山茱萸 地黄 天麻 肉苁蓉 火麻仁 补骨脂 制何首乌
0.878843 0.461196 0.301199 0.480812 0.429162 0.357753 0.368914 0.335081 0.392652
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
324. 
patient tongue id: 02190456571456_5_6
label yaofang:
甘草 柴胡 川芎 黄芩 桔梗 金银花 白术 浙贝母 白芷 皂角刺 辛夷 苍耳子 蜂房
0.951282 0.492613 0.559772 0.379641 0.3528 0.500855 0.49808 0.478146 0.384921 0.42608 0.406498
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
325. 
patient tongue id: 03291857372147_1
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.392986 0.385372 0.376386 0.303645 0.30259 0.392826 0.551476
predicted yaofang:
白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
326. 
patient tongue id: 01192129410257_6_5_2
label yaofang:
甘草 枳壳 连翘 玉竹 太子参 山药 山茱萸 泽泻 茵陈 扁豆花 麦芽 北沙参 建曲 稻芽
0.641888 0.407098 0.463503 0.325987 0.426142
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
327. 
patient tongue id: 05162033334007_1
label yaofang:
大枣 当归 茯苓 木香 牛蒡子 远志 党参 黄芪 白术 柏子仁 淫羊藿 仙茅 炙甘草
0.342495 0.380714 0.405434 0.359508 0.401291
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
328. 
patient tongue id: 05031849508342_1_3
label yaofang:
甘草 香附 茯苓 龙骨 牡蛎 何首乌 酸枣仁 熟地黄 山茱萸 磁石 菟丝子 珍珠母 浮小麦 黑枣 龟甲
0.36235 0.335274 0.540187 0.525729 0.350697 0.330666 0.336565 0.360131
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.250000, recall: 0.133333, error: 0.750000
329. 
patient tongue id: 05190810194013_1_4_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.538107 0.342367 0.396046 0.480651 0.413053 0.398426 0.320614 0.357187 0.300203 0.311404 0.34201 0.33713 0.320642
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 夏枯草

------Score: precision: 0.307692, recall: 0.307692, error: 0.692308
330. 
patient tongue id: 06091952380161_1_4_7
label yaofang:
甘草 陈皮 茯苓 半夏 木香 党参 枸杞子 白术 杜仲 山药 厚朴 桑寄生 鸡内金 紫苏叶 广藿香
0.345032 0.343358 0.39835 0.311977 0.350443 0.343318 0.399958
predicted yaofang:
甘草 法半夏 茯苓 前胡 黄芪 北沙参 炙甘草

------Score: precision: 0.285714, recall: 0.133333, error: 0.714286
331. 
patient tongue id: 01211320313922_2_4
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 红花 牡丹皮 干姜 茜草 天花粉 旋覆花 炙甘草
0.307014 0.411994 0.313695
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
332. 
patient tongue id: 03012047207357_6_2
label yaofang:
甘草 白芍 茯苓 桔梗 浙贝母 山茱萸 桑叶 荷叶 磁石 天花粉 白花蛇舌草 沙苑子 蜂房 醋鳖甲
0.932188 0.303499 0.47829 0.554884 0.398538 0.362712 0.482512 0.483864 0.469343 0.379071 0.41498 0.402932
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
333. 
patient tongue id: 03221817596943_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.406159 0.743937 0.411761 0.869297 0.50216 0.559108 0.351202 0.360346 0.354894 0.357311 0.765095 0.809819 0.751951 0.81049 0.315592 0.901692 0.360296 0.463408 0.513612 0.720997
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
334. 
patient tongue id: 05252014335896_4_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 豆蔻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.487584 0.408801 0.321211 0.458364 0.399469 0.315154
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
335. 
patient tongue id: 04101851509337_4
label yaofang:
甘草 法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.474332 0.911297 0.343974 0.984147 0.62391 0.752828 0.340588 0.411123 0.379375 0.414845 0.948247 0.968739 0.932038 0.967955 0.990041 0.415876 0.608661 0.637142 0.898574
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.714286, error: 0.473684
336. 
patient tongue id: 04020813015921_1_5_6
label yaofang:
甘草 法半夏 桃仁 生地黄 浙贝母 鳖甲 淡竹叶 瓜蒌子 蜈蚣 白花蛇舌 蜂房 四季青 川木通 红豆杉
0.992832 0.504325 0.641132 0.318729 0.345998 0.633009 0.601634 0.57349 0.429417 0.505286 0.497821
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
337. 
patient tongue id: 05092108072209_2_6
label yaofang:
桂枝 当归 枸杞子 熟地黄 杜仲 山药 山茱萸 菟丝子 制川乌 鹿角霜 覆盆子
0.449297 0.343304 0.378153 0.378529 0.403877
predicted yaofang:
甘草 白芍 茯苓 党参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
338. 
patient tongue id: 03240711434948_3_7
label yaofang:
茯苓 黄芪 白术 五味子 熟地黄 牡丹皮 杜仲 山药 山茱萸 石菖蒲 泽泻 砂仁 磁石
0.41316 0.352104 0.334523 0.482181 0.497114
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
339. 
patient tongue id: 06062300403636_2_6
label yaofang:
甘草 茯苓 木香 龙骨 党参 太子参 酸枣仁 丹参 黄连 生地黄 山茱萸 火麻仁 补骨脂 浮小麦
0.957954 0.474291 0.576883 0.37203 0.338975 0.526379 0.503414 0.493102 0.376714 0.432453 0.422316
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
340. 
patient tongue id: 05162038421755_6_2
label yaofang:
柴胡 白芍 当归 茯苓 熟地黄 栀子 牡丹皮 山药 泽泻 鳖甲 白花蛇舌草 酒萸肉
0.304182 0.443826 0.40453 0.347757 0.320482 0.440394 0.560429
predicted yaofang:
柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
341. 
patient tongue id: 01041642503947_4
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 升麻 炙甘草 覆盆子 广金钱草 徐长卿
0.45381 0.310515 0.339987 0.493081 0.519967
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.272727, error: 0.400000
342. 
patient tongue id: 02191249286384_5_6
label yaofang:
甘草 当归 连翘 薏苡仁 蒲公英 杜仲 牛膝 钩藤 莱菔子 天麻 白芷 桑寄生 决明子 麦芽 首乌藤
0.948491 0.310013 0.485597 0.581501 0.375561 0.358858 0.514404 0.492775 0.472942 0.389192 0.416872 0.390385
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
343. 
patient tongue id: 03231058256534_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 桃仁 酸枣仁 黄连 竹茹 浙贝母 牡丹皮 天花粉 威灵仙 合欢花
0.953978 0.449386 0.519993 0.459233 0.339478 0.457989 0.384673 0.508787 0.320289 0.388142
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
344. 
patient tongue id: 06091945367639_5
label yaofang:
甘草 金银花 赤芍 茵陈 香薷 板蓝根 白扁豆 土茯苓 羚羊骨
0.397979 0.333935 0.322414 0.470231 0.544275
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.111111, error: 0.800000
345. 
patient tongue id: 05092051534023_1_4_6
label yaofang:
麻黄 桂枝 白芍 羌活 牛蒡子 五味子 浙贝母 细辛 干姜 荷叶 射干 紫菀 炙甘草
0.343981 0.386548 0.307502 0.397761 0.37683 0.462212
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
346. 
patient tongue id: 02171830080765_4_1
label yaofang:
法半夏 前胡 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.436234 0.742882 0.348815 0.89704 0.482507 0.617962 0.364346 0.343514 0.349922 0.380829 0.805842 0.8422 0.806659 0.866894 0.352121 0.933107 0.415106 0.491141 0.578937 0.75532
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
347. 
patient tongue id: 03242120296952_1
label yaofang:
甘草 柴胡 白芍 香附 当归 茯苓 薄荷 白术 胆南星 白芷 蔓荆子 麦芽 广藿香 山慈菇
0.346581 0.301777 0.415875 0.30177 0.426058 0.378036 0.309722 0.373825 0.489063
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
348. 
patient tongue id: 05092243531358_1_2
label yaofang:
黄芪 白术 熟地黄 浙贝母 牡丹皮 山茱萸 厚朴 砂仁 肉苁蓉 北沙参 桑枝 合欢皮 冬凌草
0.404825 0.340168 0.486224 0.539883 0.3156
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
349. 
patient tongue id: 03061806377584_5
label yaofang:
甘草 川芎 黄芩 桔梗 黄芪 浙贝母 石膏 白芷 蔓荆子 皂角刺 辛夷 广藿香 苍耳子
0.969778 0.481984 0.59257 0.369095 0.359849 0.542947 0.52061 0.50536 0.396704 0.440543 0.436501
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.076923, error: 0.909091
350. 
patient tongue id: 05221859575912_1_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒苍耳子
0.400843 0.717127 0.377767 0.873955 0.478408 0.568354 0.331949 0.324274 0.332519 0.346844 0.769473 0.82118 0.770083 0.839008 0.351459 0.911435 0.371155 0.467768 0.5289 0.747718
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
351. 
patient tongue id: 02211411418224_1_7_6
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.400791 0.3106 0.32861 0.541223 0.459607 0.300058
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
352. 
patient tongue id: 03081807286240_1_6
label yaofang:
桂枝 白芍 川芎 法半夏 大枣 龙骨 麦冬 党参 柏子仁 牡丹皮 吴茱萸
0.47041 0.347412 0.419563 0.427708
predicted yaofang:
甘草 白芍 党参 白术

------Score: precision: 0.500000, recall: 0.181818, error: 0.500000
353. 
patient tongue id: 01041316071294_4
label yaofang:
甘草 桔梗 阿胶 生地黄 红花 冬瓜子 人参叶
0.377151 0.356465
predicted yaofang:
甘草 茯苓

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
354. 
patient tongue id: 01130632137243_6_5
label yaofang:
甘草 茯苓 独活 薏苡仁 党参 白术 赤芍 山药 桑寄生 鳖甲 茵陈 虎杖 土鳖虫 牛大力 千斤拔 木棉花
0.928232 0.312565 0.482051 0.529673 0.348982 0.331969 0.398881 0.352063 0.347386
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.666667, recall: 0.375000, error: 0.333333
355. 
patient tongue id: 02212011270440_2
label yaofang:
甘草 白芍 当归 白术 栀子 牡丹皮 牛膝 山药 山茱萸 地黄 天麻 肉苁蓉 火麻仁 珍珠母 浮小麦 制何首乌
0.946584 0.479537 0.56252 0.378082 0.353573 0.494285 0.491342 0.469508 0.379733 0.408705 0.395842
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
356. 
patient tongue id: 03161713206874_2
label yaofang:
前胡 桔梗 麦冬 太子参 荷叶 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子
0.393119 0.555387 0.373405 0.719189 0.401546 0.467137 0.35374 0.31438 0.317846 0.602303 0.66348 0.636994 0.718742 0.407977 0.823153 0.343267 0.399621 0.484411 0.647584
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.833333, error: 0.473684
357. 
patient tongue id: 02281659408475_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.385104 0.325476 0.341955 0.421033 0.429825 0.352645 0.31341 0.318845
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 车前子

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
358. 
patient tongue id: 03012139128664_6_1
label yaofang:
甘草 茯苓 远志 党参 白术 山药 砂仁 天麻 赤石脂 鳖甲 建曲 蜈蚣 天山雪莲 半枝莲
0.966883 0.487912 0.592969 0.352182 0.368999 0.533014 0.52511 0.480146 0.40621 0.438204 0.393663
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
359. 
patient tongue id: 01140806328188_5_6
label yaofang:
甘草 川芎 茯苓 党参 白术 丹参 赤芍 杜仲 牛膝 天麻 蔓荆子 桑寄生 地龙 蒺藜
0.927274 0.465631 0.534022 0.36758 0.336857 0.471877 0.453535 0.454026 0.328012 0.367765 0.375774
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
360. 
patient tongue id: 03192301282720_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 金银花 牛蒡子 浙贝母 细辛 桑白皮 瓜蒌皮 款冬花 苦杏仁
0.9271 0.311701 0.467208 0.557515 0.368494 0.311352 0.455642 0.408302 0.413095 0.331362 0.307948
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
361. 
patient tongue id: 02281828451555_4_2
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.410871 0.71334 0.38399 0.864722 0.489946 0.551069 0.347743 0.345004 0.353799 0.353841 0.757733 0.805937 0.75099 0.821873 0.33215 0.89566 0.378527 0.448496 0.522057 0.717179
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
362. 
patient tongue id: 03021435064873_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.386725 0.362164 0.474769 0.306233
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.750000, recall: 0.250000, error: 0.250000
363. 
patient tongue id: 01200558357134_1_2_6
label yaofang:
甘草 龙骨 牡蛎 酸枣仁 山茱萸 地黄 天麻 火麻仁 白花蛇舌草 建曲 蜈蚣 半枝莲 醋鳖甲 五加皮
0.9526 0.464018 0.561701 0.393145 0.352669 0.528455 0.482112 0.499597 0.36162 0.425264 0.442917
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
364. 
patient tongue id: 04251951159999_1_4
label yaofang:
陈皮 桔梗 太子参 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.327923 0.402818 0.320401 0.413341
predicted yaofang:
白芍 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
365. 
patient tongue id: 04272308485765_6
label yaofang:
麻黄 桂枝 甘草 白芍 牡蛎 薏苡仁 桃仁 丹参 红花 赤芍 熟地黄 益母草 夏枯草 鹿角霜 姜炭 芥子
0.448431 0.421567 0.313899 0.426367 0.378217 0.39921
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
366. 
patient tongue id: 02281255405354_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.391003 0.310831 0.328918 0.420675 0.434273 0.33342 0.310656
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
367. 
patient tongue id: 02221311493797_1_4_7
label yaofang:
甘草 枳壳 木香 太子参 丹参 海螵蛸 厚朴 莱菔子 高良姜 鸡内金 草豆蔻 六神曲
0.399272 0.318328 0.468761 0.46316 0.471217 0.460527 0.386818 0.433535 0.403798 0.411278 0.424974 0.46898 0.307718 0.422063 0.46534 0.4484
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.250000, error: 0.812500
368. 
patient tongue id: 05162106199672_2_6_7
label yaofang:
甘草 丹参 杜仲 郁金 天麻 桑寄生 鳖甲 莪术 诃子 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.952589 0.466906 0.553368 0.386709 0.355893 0.49965 0.468872 0.480796 0.331115 0.394086 0.400717
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
369. 
patient tongue id: 05181825178638_6
label yaofang:
麦冬 酸枣仁 丹参 钩藤 灯心草 三七 煅牡蛎 煅龙骨 红景天 毛冬青
0.631079 0.383045 0.437468 0.418968
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
370. 
patient tongue id: 06070641418291_6_2
label yaofang:
甘草 酸枣仁 生地黄 牡丹皮 山药 山茱萸 仙鹤草 天麻 槐花 鳖甲 五倍子 蜈蚣 天山雪莲 半枝莲
0.96751 0.485581 0.578728 0.360237 0.346403 0.548812 0.533766 0.517343 0.402676 0.456797 0.448119
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
371. 
patient tongue id: 04192245499946_2_4_6
label yaofang:
甘草 法半夏 茯苓 党参 酸枣仁 牡丹皮 杜仲 山茱萸 佩兰 桑寄生 补骨脂 鹿角霜 蜈蚣 土茯苓
0.91942 0.30248 0.464636 0.557314 0.349228 0.455459 0.380086 0.387145 0.310687
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
372. 
patient tongue id: 02161924210806_4_7
label yaofang:
桂枝 薏苡仁 黄芪 白术 杜仲 水蛭 砂仁 红豆杉 穿破石 山慈菇 石上柏
0.351385 0.34065 0.31612 0.509121 0.463162 0.320238 0.304841 0.336246
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.250000, recall: 0.181818, error: 0.750000
373. 
patient tongue id: 03141951083772_3
label yaofang:
茯苓 前胡 桔梗 防风 薄荷 钩藤 荆芥穗 白芷 香薷 百部 炙甘草 首乌藤 广藿香 威灵仙
0.366468 0.663078 0.355606 0.80092 0.442804 0.499457 0.341651 0.332147 0.376095 0.327249 0.674916 0.757378 0.698523 0.766448 0.311617 0.912506 0.302001 0.437351 0.493645 0.692551
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.571429, error: 0.600000
374. 
patient tongue id: 06130818199397_1_2
label yaofang:
川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.355981 0.376174 0.504491 0.347864
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
375. 
patient tongue id: 02181621581257_5_1_6
label yaofang:
甘草 香附 法半夏 茯苓 党参 白术 山药 薤白 厚朴 砂仁 瓜蒌皮 柿蒂 麦芽 佛手 鱼古 瓦楞子
0.972028 0.485203 0.591255 0.357849 0.37093 0.568129 0.536828 0.504981 0.403817 0.44785 0.435251
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
376. 
patient tongue id: 02151810038457_1_4_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 高良姜 鸡内金 草豆蔻 六神曲
0.441783 0.32393 0.336327 0.440338 0.444549 0.33551 0.32244
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
377. 
patient tongue id: 01012053145200_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.344767 0.349704 0.363623 0.393586
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 1.000000, recall: 0.307692, error: 0.000000
378. 
patient tongue id: 01061854494532_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.351798 0.4984 0.366422 0.654932 0.376281 0.445262 0.319673 0.549046 0.559174 0.577753 0.643512 0.39638 0.688995 0.337634 0.345133 0.411699 0.546678
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.866667, error: 0.235294
379. 
patient tongue id: 03311619563889_6_7
label yaofang:
甘草 半夏 橘红 牡蛎 薏苡仁 党参 白术 浙贝母 鸡内金 浮小麦 黑枣 合欢皮 墨旱莲
0.38729 0.326036 0.365112 0.49502 0.428702
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
380. 
patient tongue id: 01051903009901_1_5
label yaofang:
法半夏 前胡 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.463098 0.837514 0.352797 0.952274 0.57274 0.692536 0.359423 0.400579 0.395481 0.425756 0.889891 0.918049 0.873834 0.922194 0.320774 0.964393 0.454367 0.550726 0.62133 0.82608
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
381. 
patient tongue id: 05221927067473_4_6
label yaofang:
甘草 白芍 川芎 羌活 独活 牛膝 细辛 干姜 白芷 蜈蚣 姜黄 海桐皮 鹿衔草
0.317855 0.457118 0.32123 0.367424 0.389875 0.350685 0.363177 0.521683 0.660375 0.309536
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.200000, recall: 0.153846, error: 0.800000
382. 
patient tongue id: 02211954346969_1_2
label yaofang:
甘草 白芍 茯苓 党参 枸杞子 白术 生地黄 牡丹皮 牛膝 山药 山茱萸 白茅根 菟丝子 益母草 麦芽
0.875291 0.457187 0.510823 0.439766 0.347378 0.387377 0.322298 0.397762
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.333333, error: 0.375000
383. 
patient tongue id: 04122149059520_1_4
label yaofang:
甘草 白芍 赤芍 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜 宽筋藤 田七末
0.966251 0.456683 0.565233 0.403734 0.349043 0.546267 0.498292 0.551488 0.350171 0.435432 0.499975
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
384. 
patient tongue id: 05252221545381_1
label yaofang:
川芎 当归 茯苓 防风 党参 太子参 黄芪 枸杞子 熟地黄 白芷 炙甘草 续断 首乌藤 麸炒白术 盐菟丝子 酒女贞子
0.37827 0.700361 0.393434 0.831649 0.454991 0.522498 0.354136 0.336603 0.335948 0.328388 0.724395 0.762679 0.717569 0.787571 0.336614 0.87059 0.340428 0.446005 0.513284 0.717162
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.312500, error: 0.750000
385. 
patient tongue id: 04020819469960_1_4_6
label yaofang:
甘草 茯苓 薏苡仁 党参 郁金 仙鹤草 茜草 天麻 赤石脂 鳖甲 蜈蚣 半枝莲 艾叶
0.986317 0.493665 0.616116 0.339836 0.356775 0.598558 0.564063 0.537382 0.41602 0.473151 0.467446
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.538462, error: 0.363636
386. 
patient tongue id: 05040340157053_2_5
label yaofang:
甘草 茯苓 金银花 麦冬 党参 玄参 生地黄 白茅根 水牛角 白花蛇舌草 白扁豆 白鲜皮 女贞子 建曲 天山雪莲
0.401645 0.349724 0.337903 0.431129 0.46093
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
387. 
patient tongue id: 06191153252984_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 远志 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.931494 0.472317 0.549594 0.363891 0.350195 0.496604 0.447183 0.440983 0.324148 0.374656 0.364868
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
388. 
patient tongue id: 03152024532951_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.445315 0.377781 0.368914 0.446471 0.394263 0.300758
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
389. 
patient tongue id: 05260645141054_2_6
label yaofang:
甘草 枳壳 白术 玄参 生地黄 牛膝 天麻 肉苁蓉 鳖甲 火麻仁 补骨脂 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.99468 0.486935 0.62108 0.338196 0.3443 0.679883 0.613864 0.637627 0.418377 0.52971 0.602351
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
390. 
patient tongue id: 01041810433628_3
label yaofang:
法半夏 茯苓 前胡 防风 荆芥穗 款冬花 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子 紫苑
0.356657 0.489525 0.372918 0.654188 0.360032 0.430566 0.325067 0.535934 0.562626 0.575044 0.660209 0.397472 0.722176 0.31501 0.349327 0.430964 0.566022
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.588235, recall: 0.714286, error: 0.411765
391. 
patient tongue id: 05162129531434_1_4
label yaofang:
甘草 川芎 茯苓 党参 黄芪 白术 赤芍 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤
0.947039 0.301005 0.481117 0.572465 0.369911 0.334683 0.495553 0.45999 0.454247 0.350412 0.390029 0.363831
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
392. 
patient tongue id: 02211948551441_1
label yaofang:
甘草 太子参 白术 黄连 山药 白茅根 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 合欢花 红豆杉
0.89537 0.435693 0.521771 0.393669 0.348492 0.306711
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
393. 
patient tongue id: 06031110344577_1_2_4
label yaofang:
甘草 防风 薏苡仁 党参 黄芪 白术 五味子 厚朴 砂仁 补骨脂 扁豆花 麦芽 紫苏梗 木棉花
0.979528 0.490775 0.599507 0.344153 0.353093 0.552641 0.549796 0.509862 0.405456 0.456568 0.432004
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
394. 
patient tongue id: 03231032101261_1_2
label yaofang:
甘草 白芍 川芎 茯苓 党参 枸杞子 白术 丹参 山药 地黄 菟丝子 浮小麦 合欢花
0.979444 0.495741 0.594931 0.339295 0.357101 0.585716 0.556942 0.528563 0.413727 0.474408 0.469436
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
395. 
patient tongue id: 01202010470170_7_5
label yaofang:
桃仁 黄芪 白术 赤芍 浙贝母 杜仲 厚朴 砂仁 莪术 北沙参 土鳖虫 红豆杉 合欢皮 蛇舌草
0.691594 0.407452 0.342724 0.409047 0.572939 0.313064
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 砂仁

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
396. 
patient tongue id: 04121310514640_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.410568 0.709263 0.363883 0.860287 0.476178 0.562687 0.3553 0.344227 0.361008 0.34708 0.749767 0.809456 0.765986 0.825422 0.344639 0.913292 0.372887 0.459685 0.543103 0.737563
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 1.000000, error: 0.400000
397. 
patient tongue id: 03111508488463_2_1
label yaofang:
甘草 川芎 茯苓 麦冬 太子参 白术 五味子 牛膝 郁金 山药 补骨脂 莪术 浮小麦
0.963249 0.471539 0.565542 0.384383 0.356227 0.515982 0.499959 0.494197 0.372319 0.42058 0.414157
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
398. 
patient tongue id: 04130019502437_1_6
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.964136 0.447656 0.544121 0.426781 0.317197 0.472085 0.446352 0.520955 0.30124 0.383288 0.423276
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.769231, error: 0.090909
399. 
patient tongue id: 04300934023356_4_6
label yaofang:
甘草 茯苓 羌活 独活 薏苡仁 党参 郁金 天麻 鳖甲 补骨脂 粉葛 威灵仙 蜈蚣 白花蛇舌 天山雪莲
0.930851 0.466257 0.561755 0.363531 0.44092 0.386223 0.386877 0.311534
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.875000, recall: 0.466667, error: 0.125000
400. 
patient tongue id: 04210650146115_6
label yaofang:
甘草 龙骨 白术 酸枣仁 生地黄 知母 山茱萸 天麻 地骨皮 糯稻根 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.976791 0.467502 0.576156 0.392806 0.360324 0.571794 0.521476 0.557817 0.375335 0.453039 0.505681
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
401. 
patient tongue id: 04202053147183_6
label yaofang:
甘草 柴胡 川芎 香附 防风 桃仁 白术 柏子仁 赤芍 荆芥穗 郁李仁 芥子
0.569132 0.385698 0.326606 0.459431 0.392556
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
402. 
patient tongue id: 04260652227646_4_7
label yaofang:
甘草 川芎 法半夏 桃仁 白术 红花 细辛 天麻 全蝎 僵蚕 麦芽 蒺藜
0.98455 0.499753 0.603459 0.340916 0.333741 0.561668 0.548871 0.519991 0.404968 0.44885 0.431566
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
403. 
patient tongue id: 03242127541579_6_4
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 白花蛇舌草 白扁豆 广藿香
0.321563 0.45595 0.311389 0.382799 0.386021 0.328205 0.349395 0.51137 0.633904 0.318733
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.200000, recall: 0.181818, error: 0.800000
404. 
patient tongue id: 04111859059501_1_4
label yaofang:
法半夏 前胡 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.447406 0.892066 0.350658 0.974054 0.582004 0.684411 0.345457 0.359217 0.369024 0.380207 0.922906 0.951444 0.91066 0.951711 0.306429 0.986865 0.373915 0.550756 0.610508 0.887051
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
405. 
patient tongue id: 03152048311128_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.348497 0.331504 0.362421 0.414724 0.337267
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
406. 
patient tongue id: 06111024184873_2_6
label yaofang:
甘草 柴胡 白芍 延胡索 郁金 天麻 鳖甲 鸡内金 虎杖 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 广金钱草
0.973792 0.481786 0.583353 0.356595 0.317622 0.511257 0.505851 0.485356 0.37377 0.420853 0.396833
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
407. 
patient tongue id: 03222002337521_1_7
label yaofang:
甘草 薏苡仁 党参 鸡血藤 黄连 生地黄 砂仁 天麻 鳖甲 补骨脂 麦芽 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.95215 0.474544 0.560231 0.372847 0.371388 0.500651 0.485026 0.462107 0.375331 0.404507 0.382066
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
408. 
patient tongue id: 03151853495905_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.418644 0.76961 0.369152 0.90192 0.509383 0.575515 0.359362 0.373278 0.393022 0.370811 0.799535 0.861184 0.798276 0.863459 0.320055 0.950198 0.356759 0.494105 0.537871 0.777312
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
409. 
patient tongue id: 01132141507251_6_1
label yaofang:
甘草 党参 白术 酸枣仁 丹参 大腹皮 砂仁 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.869601 0.421688 0.506285 0.447405 0.323281 0.393696 0.343919 0.438394 0.314359
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.777778, recall: 0.466667, error: 0.222222
410. 
patient tongue id: 01211317407833_3_7
label yaofang:
白芍 远志 太子参 天麻 三七 鳖甲
0.455546 0.328193 0.467641 0.316449 0.303682
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
411. 
patient tongue id: 02201310078907_2
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 金樱子 麦芽 百合 紫苏叶
0.379105 0.415056 0.302127 0.40244 0.399617 0.305712 0.454243
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
412. 
patient tongue id: 04271535117913_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.313575 0.356375 0.311352 0.469477
predicted yaofang:
法半夏 茯苓 黄芪 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
413. 
patient tongue id: 04061943587990_2_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 麦芽 百合 紫苏叶
0.791959 0.340576 0.385769 0.517099 0.392921
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.111111, error: 0.800000
414. 
patient tongue id: 02181617184194_4_7_6
label yaofang:
黄芪 白术 砂仁 莪术 鸡内金 珍珠母 麦芽 橘核 桑椹 首乌藤 红豆杉 合欢皮 墨旱莲
0.648355 0.413211 0.351847 0.374443 0.500321
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
415. 
patient tongue id: 02120926570077_1_6_5
label yaofang:
甘草 白芍 法半夏 茯苓 木香 防风 党参 白术 黄连 郁金 山药 厚朴 白花蛇舌草 醋鳖甲 麸炒枳壳
0.971695 0.489073 0.603434 0.341452 0.363637 0.56102 0.539274 0.500283 0.405626 0.452477 0.423158
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
416. 
patient tongue id: 01211241234361_1_7
label yaofang:
桂枝 柴胡 黄芩 桔梗 牡蛎 藕节 干姜 天花粉 苦杏仁 炙甘草 蜜枇杷叶 人参叶
0.413008 0.389155 0.384299 0.372533 0.371612
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
417. 
patient tongue id: 02122232354163_2_5
label yaofang:
甘草 当归 牛蒡子 太子参 黄芪 鸡血藤 丹参 黄连 生地黄 鳖甲 补骨脂 虎杖 白花蛇舌 蜂房 广升麻
0.981661 0.480903 0.598659 0.359375 0.344085 0.548254 0.52762 0.511978 0.382263 0.431147 0.427633
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
418. 
patient tongue id: 01250658303561_6_2
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 桑白皮 款冬花 紫菀 苇茎 苦杏仁 板蓝根
0.957923 0.470769 0.573828 0.384304 0.345677 0.517078 0.496498 0.492896 0.367868 0.422411 0.430764
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
419. 
patient tongue id: 01062340548391_1_4_7
label yaofang:
黄芩 金银花 牛蒡子 蒲公英 麦冬 细辛 山楂 蔓荆子 鸡内金 干鱼腥草 苍耳子 炒六神曲
0.354317 0.601177 0.418158 0.691936 0.425007 0.452786 0.329838 0.318395 0.320936 0.321268 0.581511 0.613952 0.576256 0.629113 0.725038 0.335117 0.393512 0.399844 0.549082
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.052632, recall: 0.083333, error: 0.947368
420. 
patient tongue id: 03291319498197_1_6
label yaofang:
柴胡 白芍 香附 枳壳 龙骨 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 浮小麦 紫苏梗
0.339345 0.469559 0.359055 0.355485 0.369347 0.363795 0.39953 0.611385 0.71951 0.333796
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.600000, recall: 0.500000, error: 0.400000
421. 
patient tongue id: 05112036489343_1_4_5
label yaofang:
枳壳 太子参 黄芪 白术 赤芍 海螵蛸 牛膝 厚朴 砂仁 鸡内金 红豆杉 土茯苓 山慈菇 稻芽
0.331748 0.362013 0.475387 0.453449 0.397628
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
422. 
patient tongue id: 04121904528489_3
label yaofang:
枳壳 薏苡仁 黄芪 白术 海螵蛸 杜仲 牛膝 附子 泽泻 厚朴 桑寄生 麦芽 续断 紫苏叶 骨碎补 土鳖虫 狗脊
0.731573 0.408592 0.438848 0.332479 0.454699
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.117647, error: 0.600000
423. 
patient tongue id: 03062137564464_1_6
label yaofang:
甘草 茯苓 党参 白术 山药 砂仁 天麻 赤石脂 鳖甲 麦芽 紫苏梗 蜈蚣 天山雪莲 半枝莲
0.988265 0.502563 0.620604 0.330527 0.353507 0.607071 0.584443 0.548646 0.427568 0.486054 0.477517
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
424. 
patient tongue id: 04150748083599_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.330456 0.561882 0.461536 0.459949 0.527561 0.463424 0.484925 0.520555 0.505839 0.514765 0.598813 0.323783 0.517384 0.629072 0.626108
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
425. 
patient tongue id: 04131552072948_1_4_7
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.332016 0.318621 0.326551 0.399157 0.443847 0.327813 0.31152 0.302543
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 车前子

------Score: precision: 0.250000, recall: 0.181818, error: 0.750000
426. 
patient tongue id: 03261716512378
label yaofang:
陈皮 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 莱菔子 鸡内金 莲子 炙甘草 紫苏梗
0.648602 0.375748 0.466642 0.39504
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.230769, error: 0.250000
427. 
patient tongue id: 04122152532197_4_6
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 酸枣仁 栀子 天麻 鳖甲 扁豆花 首乌藤 蜈蚣 天山雪莲 半枝莲 红豆杉
0.823267 0.434143 0.478926 0.300096 0.441143 0.327135 0.346016 0.348659
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 天麻 蜈蚣

------Score: precision: 0.625000, recall: 0.333333, error: 0.375000
428. 
patient tongue id: 05161918251176_4
label yaofang:
陈皮 前胡 半夏 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.392082 0.848292 0.434463 0.946682 0.542866 0.616327 0.318243 0.341276 0.333985 0.877106 0.879413 0.823053 0.880817 0.929673 0.372885 0.494206 0.506145 0.777982
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.800000, error: 0.333333
429. 
patient tongue id: 03101848314575_4
label yaofang:
陈皮 桔梗 牛蒡子 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.401359 0.38997 0.360636 0.310099 0.396283 0.542817
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
430. 
patient tongue id: 05131312072449_2_1_6
label yaofang:
甘草 木香 黄连 浙贝母 天麻 赤石脂 糯稻根 鳖甲 补骨脂 豆蔻 粉葛 建曲 蜈蚣 天山雪莲 半枝莲 龟甲
0.936365 0.486636 0.551499 0.370477 0.33576 0.467443 0.449874 0.431565 0.343823 0.369864 0.334918
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
431. 
patient tongue id: 05032240225166_1_4_7
label yaofang:
甘草 茯苓 赤芍 杜仲 车前子 天麻 桑寄生 鳖甲 鹿角霜 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫
0.972618 0.46387 0.574312 0.380061 0.33522 0.550498 0.515207 0.531039 0.371623 0.449759 0.477148
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
432. 
patient tongue id: 01040251058404_7_6_5
label yaofang:
甘草 薏苡仁 党参 白术 延胡索 细辛 天麻 鳖甲 补骨脂 三棱 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.948293 0.490602 0.581305 0.341897 0.354226 0.520175 0.479204 0.444294 0.349844 0.396954 0.382307
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
433. 
patient tongue id: 05022100069039_6_7
label yaofang:
甘草 茯苓 龙骨 党参 酸枣仁 牡丹皮 黄柏 菟丝子 益母草 淫羊藿 仙茅 浮小麦 酒女贞子 墨旱莲
0.983849 0.487264 0.609929 0.335803 0.340839 0.583828 0.557813 0.525683 0.410051 0.466336 0.456616
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
434. 
patient tongue id: 03221324312196_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子 木贼 素馨花
0.333202 0.504563 0.419644 0.562845 0.371244 0.382514 0.472543 0.519005 0.455464 0.510019 0.302548 0.657164 0.330831 0.381473
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.785714, recall: 0.687500, error: 0.214286
435. 
patient tongue id: 03062132360335_2
label yaofang:
甘草 白芍 川芎 香附 枳壳 黄芩 党参 白术 丹参 生地黄 菟丝子 桑寄生
0.938346 0.307675 0.43737 0.563304 0.363913 0.413117 0.34845 0.385464
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
436. 
patient tongue id: 01012049183656_1_3
label yaofang:
甘草 白芍 桔梗 金银花 连翘 薄荷 蒲公英 麦冬 玄参 生地黄 浙贝母 牡丹皮 败酱草
0.444274 0.335383 0.458526 0.341764
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
437. 
patient tongue id: 01250653068283_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 薏苡仁 党参 黄芪 白术 丹参 砂仁 五灵脂 黄精 白花蛇舌 合欢花
0.929511 0.442325 0.546993 0.380388 0.327818 0.470124 0.401005 0.415644 0.323508 0.326143
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
438. 
patient tongue id: 04291504543648_7_2_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 桔梗 防风 玉竹 党参 浙贝母 款冬花 麦芽 北沙参 百合 大青叶
0.98887 0.470138 0.59761 0.375605 0.35979 0.635703 0.584568 0.619494 0.412294 0.510974 0.587172
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
439. 
patient tongue id: 03290232393996_2
label yaofang:
甘草 柴胡 白芍 茯苓 党参 山药 天麻 鳖甲 扁豆花 佛手 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.974085 0.486139 0.606373 0.3444 0.331143 0.541367 0.507014 0.487531 0.364274 0.419946 0.396462
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
440. 
patient tongue id: 03151915350566_4
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 半枝莲 土茵陈
0.331574 0.316189 0.320126 0.413926 0.429774 0.329822 0.315847 0.315731
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 车前子

------Score: precision: 0.125000, recall: 0.083333, error: 0.875000
441. 
patient tongue id: 01052214499946_4
label yaofang:
丹参 三七 西洋参
0.372718 0.395093 0.393077 0.312053 0.383332
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
442. 
patient tongue id: 03291355470417_1_2
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 丹参 生地黄 山药 桑叶 泽泻 地骨皮 糯稻根 胡黄连 淫羊藿 仙茅 龟甲
0.968145 0.482441 0.589641 0.345885 0.329468 0.518706 0.513998 0.48568 0.376409 0.426156 0.404812
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
443. 
patient tongue id: 03302130480924_1_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 党参 浙贝母 莱菔子 天麻 莪术 紫菀 白花蛇舌草 蜈蚣 醋鳖甲
0.915864 0.447422 0.551051 0.409752 0.327004 0.436913 0.413778 0.43706 0.34508 0.344704
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
444. 
patient tongue id: 04102041194722_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗 广金钱草
0.421384 0.374929 0.334248 0.372816 0.468878 0.637206
predicted yaofang:
白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.300000, error: 0.500000
445. 
patient tongue id: 01202007072002_3_1
label yaofang:
桂枝 当归 黄芪 白术 黄连 知母 附子 山茱萸 厚朴 补骨脂 鸡内金 玉米须 稻芽 积雪草
0.382784 0.402016 0.418797 0.348618 0.419147
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
446. 
patient tongue id: 03231218459984_4
label yaofang:
陈皮 法半夏 茯苓 党参 黄芪 海螵蛸 郁金 北柴胡 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 甘松
0.371002 0.554752 0.384477 0.678715 0.404476 0.468992 0.335458 0.310904 0.578569 0.594774 0.582644 0.625931 0.360421 0.727478 0.33235 0.376777 0.378209 0.534575
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.277778, recall: 0.357143, error: 0.722222
447. 
patient tongue id: 06091943578110_5
label yaofang:
甘草 金银花 麦冬 玉竹 桑叶 荷叶 天花粉 火麻仁 茵陈 香薷 扁豆花 鸡内金 夏枯草 麦芽 北沙参 广藿香
0.490959 0.377127 0.39285 0.40972 0.416847
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
448. 
patient tongue id: 05242115541267_1_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 五味子 细辛 天麻 鳖甲 款冬花 苦杏仁 炙麻黄 紫苏梗 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.981514 0.494117 0.609269 0.346975 0.358281 0.584215 0.570381 0.542805 0.430019 0.489553 0.47834
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
449. 
patient tongue id: 05221906133315_1_2_4
label yaofang:
葛根 玉竹 太子参 黄芪 枸杞子 柏子仁 山药 芡实 莲子 北沙参 百合 制远志 人参叶 干石斛
0.393124 0.705859 0.373429 0.871193 0.453666 0.546965 0.326625 0.304542 0.313847 0.757371 0.805497 0.756938 0.836035 0.337493 0.900066 0.360096 0.4308 0.519591 0.729208
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.105263, recall: 0.142857, error: 0.894737
450. 
patient tongue id: 02020850314113_4_6
label yaofang:
甘草 桔梗 白术 浙贝母 牛膝 天麻 桑寄生 鳖甲 款冬花 紫菀 苦杏仁 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.984859 0.486451 0.593632 0.350798 0.307862 0.385207 0.635022 0.586742 0.586623 0.438793 0.506946 0.54254
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
451. 
patient tongue id: 04102112264740_5
label yaofang:
甘草 桔梗 连翘 薄荷 芦根 牛蒡子 浙贝母 桑叶 菊花 射干 百部 苦杏仁 木蝴蝶 青果
0.922126 0.446824 0.551918 0.359509 0.320713 0.426415 0.304393
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
452. 
patient tongue id: 05201507280681_2_6_1
label yaofang:
甘草 枳壳 橘红 玉竹 太子参 砂仁 天麻 鳖甲 火麻仁 茵陈 苦杏仁 蜈蚣 白花蛇舌 天山雪莲
0.672823 0.380345 0.465921 0.301889 0.436293 0.365621
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 白术

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
453. 
patient tongue id: 03151831550977_4
label yaofang:
茯苓 前胡 半夏 防风 神曲 白芷 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 苍耳子
0.305214 0.464258 0.373568 0.517873 0.335515 0.376075 0.314989 0.304652 0.407023 0.44006 0.479422 0.494918 0.340471 0.618417 0.351523 0.429326
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

------Score: precision: 0.375000, recall: 0.461538, error: 0.625000
454. 
patient tongue id: 02021011368988_6_2_1
label yaofang:
牡蛎 党参 白术 牛膝 厚朴 砂仁 地榆 槐花 地龙 北沙参 橘络 首乌藤 合欢皮 墨旱莲
0.526022 0.404946 0.339566 0.336858 0.459911
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
455. 
patient tongue id: 02182159201703_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 桃仁 远志 浙贝母 细辛 干姜 厚朴 款冬花 苦杏仁 炙麻黄
0.904306 0.313664 0.463535 0.528222 0.398911 0.303242 0.407736 0.383575 0.400688 0.318571
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.200000, recall: 0.133333, error: 0.800000
456. 
patient tongue id: 02221227455801_1_3
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.362674 0.536837 0.471019 0.46543 0.518568 0.446888 0.471583 0.484128 0.479661 0.48868 0.557102 0.329308 0.498917 0.570617 0.563883
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
457. 
patient tongue id: 03142013409163_6
label yaofang:
白芍 香附 黄芩 法半夏 大枣 党参 延胡索 海螵蛸 北柴胡 麦芽 炙甘草 紫苏梗
0.322354 0.444356 0.311303 0.379048 0.364699 0.322683 0.374332 0.503135 0.645218 0.301656
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.500000, recall: 0.416667, error: 0.500000
458. 
patient tongue id: 01041827451344_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.331753 0.364621 0.353789 0.328524 0.464211
predicted yaofang:
法半夏 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
459. 
patient tongue id: 02120748346639_4
label yaofang:
甘草 茯苓 半夏 橘红 薏苡仁 太子参 白术 苍术 鸡内金 枇杷叶 辛夷 稻芽
0.303654 0.416892 0.406116 0.479361 0.323628 0.3483 0.40268 0.427507 0.426213 0.476812 0.334317 0.570251 0.412321
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.076923, recall: 0.083333, error: 0.923077
460. 
patient tongue id: 06141841599626_5
label yaofang:
甘草 桃仁 红花 赤芍 牡丹皮 杜仲 僵蚕 肉苁蓉 莪术 北沙参 蜈蚣 合欢皮 蛇舌草 鸭脚艾
0.521605 0.383612 0.406463 0.312819 0.375017
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
461. 
patient tongue id: 04112002415134_6_1
label yaofang:
甘草 党参 丹参 生地黄 延胡索 天麻 鳖甲 补骨脂 佛手 浮小麦 威灵仙 蜈蚣 半枝莲 红豆杉
0.983167 0.504143 0.604847 0.344473 0.359053 0.585558 0.552016 0.526256 0.412068 0.468724 0.459795
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
462. 
patient tongue id: 02232010093512_1_4
label yaofang:
陈皮 法半夏 茯苓 防风 佩兰 荆芥穗 白芷 豆蔻 炙甘草 紫苏梗 广藿香 麸炒白术 炒六神曲 醋香附
0.395546 0.691762 0.377658 0.845355 0.474274 0.542781 0.355259 0.356931 0.377763 0.346669 0.733186 0.787713 0.730644 0.806706 0.316787 0.880821 0.38125 0.449498 0.516441 0.708741
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.500000, error: 0.650000
463. 
patient tongue id: 05032145036954_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.491697 0.379121 0.323081 0.434595 0.398287 0.312637
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
464. 
patient tongue id: 04131944088081_5
label yaofang:
甘草 桔梗 金银花 连翘 薄荷 牛蒡子 紫花地丁 淡豆豉 淡竹叶 四季青
0.455962 0.359538 0.416137 0.330689 0.357732
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
465. 
patient tongue id: 05222018064920_4_2
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 龙脷叶
0.336269 0.458499 0.351779 0.358153 0.344229 0.367266 0.414918 0.609953 0.725079 0.344465
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.600000, recall: 0.500000, error: 0.400000
466. 
patient tongue id: 01041635054330_6_1
label yaofang:
龙骨 牛蒡子 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 蜈蚣 合欢皮
0.658021 0.387654 0.416478 0.434478
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
467. 
patient tongue id: 05032230145191_5
label yaofang:
甘草 黄芩 法半夏 桔梗 金银花 芦根 牛蒡子 浙贝母 桑白皮 天花粉 淡竹叶 款冬花 枇杷叶 苦杏仁
0.99076 0.4768 0.606071 0.350462 0.345419 0.649533 0.582818 0.608688 0.406604 0.511852 0.583681
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
468. 
patient tongue id: 04221926339968_2_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.426477 0.802294 0.357353 0.935117 0.531039 0.62137 0.352836 0.366186 0.374735 0.370169 0.852626 0.900489 0.846498 0.900416 0.3356 0.964759 0.369383 0.512636 0.575547 0.818252
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
469. 
patient tongue id: 04120002442167_7_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.303775 0.333187 0.365871 0.395235 0.445724
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
470. 
patient tongue id: 03101855254948_1
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 车前子 砂仁 升麻 炙甘草 浮小麦
0.375147 0.3864 0.356633 0.33328 0.314669 0.408477 0.563136
predicted yaofang:
白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
471. 
patient tongue id: 04182019209745_1
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.494049 0.337777 0.463326
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
472. 
patient tongue id: 02222059261226_1_2
label yaofang:
陈皮 枳壳 当归 黄芪 白术 海螵蛸 浙贝母 厚朴 生半夏 火麻仁 鸡内金 北沙参 山慈菇 蛇舌草
0.312377 0.385815 0.40357 0.357036 0.362671
predicted yaofang:
甘草 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
473. 
patient tongue id: 03081819332794_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.38865 0.703623 0.370621 0.839605 0.462274 0.547589 0.34584 0.322582 0.339402 0.331882 0.720186 0.75967 0.726849 0.794548 0.301134 0.878318 0.369933 0.430156 0.521681 0.688103
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
474. 
patient tongue id: 05102016137759_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.384264 0.641034 0.382602 0.80229 0.435036 0.508368 0.346295 0.323078 0.327992 0.316427 0.683305 0.740184 0.696753 0.769439 0.353097 0.854918 0.350561 0.419191 0.509396 0.6858
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
475. 
patient tongue id: 01200501306087_2_6
label yaofang:
甘草 川芎 葛根 枸杞子 酸枣仁 地黄 天麻 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲 酒女贞子 墨旱莲
0.791796 0.304481 0.340329 0.457009 0.418894
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
476. 
patient tongue id: 05162033021700_2
label yaofang:
桂枝 大枣 龙骨 党参 黄连 生地黄 干姜 淫羊藿 火麻仁 炙甘草 覆盆子
0.441022 0.392128 0.31038 0.448647 0.367855 0.335475
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
477. 
patient tongue id: 03141229351042_1_4_7
label yaofang:
甘草 白芍 桔梗 金银花 连翘 薄荷 蒲公英 麦冬 玄参 生地黄 鸡内金
0.432569 0.322498 0.382664 0.473349 0.358363
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
478. 
patient tongue id: 03151920512881_6_7
label yaofang:
柴胡 白芍 香附 枳壳 木香 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.554411 0.320327 0.359192 0.456682 0.355867
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
479. 
patient tongue id: 02270751520827_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.647276 0.411602 0.488047 0.331686
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
480. 
patient tongue id: 03081826358732_1_4
label yaofang:
生姜 茯苓 防风 钩藤 荆芥穗 白芷 香薷 炙甘草 辛夷 首乌藤 紫苏梗 广藿香 威灵仙 麸炒白术 炒六神曲
0.355741 0.564092 0.392685 0.691778 0.405362 0.443376 0.34075 0.303059 0.576085 0.618321 0.601176 0.664828 0.358675 0.765369 0.319985 0.37946 0.444311 0.601656
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.277778, recall: 0.333333, error: 0.722222
481. 
patient tongue id: 04181933476013_1_2
label yaofang:
甘草 法半夏 麦冬 太子参 黄连 砂仁 天麻 鳖甲 麦芽 北沙参 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.969942 0.487128 0.569265 0.36561 0.323871 0.502616 0.485166 0.471771 0.354249 0.401292 0.386011
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
482. 
patient tongue id: 02122221457940_5
label yaofang:
甘草 茯苓 薏苡仁 党参 黄连 生地黄 赤芍 牛膝 石膏 山药 山茱萸 细辛 白芷 粉葛 广升麻
0.968282 0.485744 0.586478 0.362965 0.347632 0.513122 0.49361 0.466988 0.361053 0.404061 0.384303
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
483. 
patient tongue id: 02191450327385_6_4_2
label yaofang:
川芎 薏苡仁 党参 鸡血藤 白术 红花 赤芍 山药 地黄 天麻 白花蛇舌草 蜈蚣 醋鳖甲 乌梢蛇
0.932504 0.305512 0.462586 0.549901 0.383174 0.346205 0.504932 0.456566 0.457511 0.330781 0.387184 0.398424
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
484. 
patient tongue id: 02281931253064_4
label yaofang:
大枣 党参 海藻 苍术 泽泻 荷叶 决明子 紫苏叶 焦山楂 芥子
0.429502 0.425037 0.318072 0.384784 0.484725
predicted yaofang:
白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
485. 
patient tongue id: 06091950127204_3
label yaofang:
当归 枸杞子 熟地黄 杜仲 附子 肉桂 山药 山茱萸 菟丝子 巴戟天 芡实 鹿角霜 广藿香 沙苑子
0.590964 0.384427 0.359973 0.393206 0.531939
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
486. 
patient tongue id: 04300931383558_1_6
label yaofang:
甘草 白芍 陈皮 木香 防风 党参 白术 黄连 天麻 鳖甲 粉葛 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.938381 0.481543 0.546946 0.391391 0.345208 0.447847 0.45453 0.43642 0.345897 0.36866 0.343076
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
487. 
patient tongue id: 04260637226146_4
label yaofang:
甘草 茯苓 远志 党参 浙贝母 蔓荆子 鳖甲 广藿香 苍耳子 白花蛇舌 蜂房 岗梅根 四季青 红豆杉
0.954299 0.475552 0.55228 0.39323 0.353248 0.503995 0.505064 0.495816 0.391339 0.425169 0.424994
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
488. 
patient tongue id: 04071908376449_4_1
label yaofang:
甘草 陈皮 茯苓 前胡 半夏 防风 黄芪 白术 白芷 白前 百部 紫苏梗 广藿香
0.402285 0.783829 0.356382 0.928336 0.496473 0.594658 0.327876 0.309301 0.309035 0.325446 0.843012 0.877395 0.823413 0.888922 0.320372 0.949666 0.361334 0.464215 0.543074 0.789608
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.615385, error: 0.600000
489. 
patient tongue id: 05262051059841_1_6
label yaofang:
甘草 黄芩 法半夏 前胡 桔梗 浙贝母 细辛 桑白皮 天麻 鳖甲 款冬花 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.962852 0.46362 0.563807 0.391319 0.370562 0.554232 0.5126 0.543063 0.380538 0.449487 0.500486
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
490. 
patient tongue id: 03221956354977_1_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 延胡索 天麻 五灵脂 鳖甲 蜈蚣 天山雪莲 合欢花 半枝莲 姜黄
0.960471 0.478668 0.577163 0.381347 0.374509 0.517556 0.506647 0.48919 0.389347 0.421872 0.404731
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
491. 
patient tongue id: 03111731563864_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 连翘 芦根 牛蒡子 浙贝母 栀子 牡丹皮 决明子 化橘红
0.952115 0.485956 0.569857 0.376213 0.348497 0.499377 0.489573 0.466454 0.368809 0.406237 0.38379
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
492. 
patient tongue id: 02182156019208_5
label yaofang:
甘草 枳壳 黄芩 茯苓 木香 党参 白术 黄连 槟榔 山药 砂仁 扁豆花 粉葛 建曲
0.839288 0.320288 0.424764 0.516407 0.399188 0.349103 0.327726
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
493. 
patient tongue id: 01211213086112_5
label yaofang:
白芍 当归 麦冬 党参 白术 五味子 熟地黄 杜仲 肉苁蓉 巴戟天 补骨脂
0.360777 0.347946 0.314667 0.357891 0.397278 0.650915
predicted yaofang:
白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.272727, error: 0.500000
494. 
patient tongue id: 03311823203178_4
label yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.419765 0.815549 0.350858 0.940643 0.540665 0.634809 0.344614 0.361756 0.370307 0.363878 0.869359 0.90851 0.859413 0.90694 0.322519 0.967816 0.380734 0.514421 0.585878 0.822904
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
495. 
patient tongue id: 03311621410847_5_4_7
label yaofang:
牡蛎 薏苡仁 桃仁 黄芪 白术 浙贝母 杜仲 牛膝 厚朴 砂仁 北沙参 土鳖虫 红豆杉 山慈菇 蛇舌草
0.788061 0.419829 0.40074 0.360093 0.533677 0.337238
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
496. 
patient tongue id: 04211341312324_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.416376 0.718924 0.381049 0.875543 0.487469 0.589588 0.343981 0.325269 0.320011 0.35588 0.784696 0.815573 0.773561 0.836317 0.357931 0.90328 0.398285 0.483811 0.541918 0.733636
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.812500, error: 0.350000
497. 
patient tongue id: 05262053546021_2_6
label yaofang:
甘草 白术 酸枣仁 生地黄 杜仲 天麻 糯稻根 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 田七末
0.989776 0.487243 0.607506 0.343643 0.349648 0.643788 0.586701 0.596557 0.412245 0.509681 0.558357
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
498. 
patient tongue id: 02020820063498_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 款冬花 紫菀 白前 苇茎 苦杏仁 蜜麻黄 化橘红
0.979463 0.466407 0.589232 0.365012 0.355551 0.561087 0.536087 0.529045 0.387248 0.446532 0.454755
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
499. 
patient tongue id: 03161305353494_2
label yaofang:
麻黄 陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 紫苏子 炙甘草
0.401858 0.749265 0.394546 0.887299 0.492993 0.565267 0.338616 0.34734 0.350667 0.353472 0.782878 0.825341 0.76065 0.837956 0.308086 0.903545 0.376667 0.467622 0.51675 0.73568
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
------Average Score: average precision: 0.449020, average recall: 0.332537, error: 0.550980
