20544/20571 [============================>.] - ETA: 0s - loss: 0.1236Epoch 00000: val_loss improved from inf to 0.07964, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 116s - loss: 0.1235 - val_loss: 0.0796
Epoch 2/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0885Epoch 00001: val_loss did not improve
20571/20571 [==============================] - 113s - loss: 0.0885 - val_loss: 0.0832
Epoch 3/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0849Epoch 00002: val_loss improved from 0.07964 to 0.07655, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 113s - loss: 0.0849 - val_loss: 0.0766
Epoch 4/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0830Epoch 00003: val_loss improved from 0.07655 to 0.07613, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 113s - loss: 0.0830 - val_loss: 0.0761
Epoch 5/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0818Epoch 00004: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0818 - val_loss: 0.0781
Epoch 6/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0807Epoch 00005: val_loss improved from 0.07613 to 0.07480, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 113s - loss: 0.0807 - val_loss: 0.0748
Epoch 7/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0798Epoch 00006: val_loss improved from 0.07480 to 0.07457, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0798 - val_loss: 0.0746
Epoch 8/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0793Epoch 00007: val_loss improved from 0.07457 to 0.07441, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 113s - loss: 0.0793 - val_loss: 0.0744
Epoch 9/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0788Epoch 00008: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0788 - val_loss: 0.0747
Epoch 10/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0781Epoch 00009: val_loss improved from 0.07441 to 0.07430, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0781 - val_loss: 0.0743
Epoch 11/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0777Epoch 00010: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0777 - val_loss: 0.0743
Epoch 12/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0773Epoch 00011: val_loss improved from 0.07430 to 0.07415, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0773 - val_loss: 0.0741
Epoch 13/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0769Epoch 00012: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0769 - val_loss: 0.0744
Epoch 14/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0764Epoch 00013: val_loss improved from 0.07415 to 0.07266, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0764 - val_loss: 0.0727
Epoch 15/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0760Epoch 00014: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0760 - val_loss: 0.0745
Epoch 16/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0754Epoch 00015: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0754 - val_loss: 0.0735
Epoch 17/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0752Epoch 00016: val_loss improved from 0.07266 to 0.07250, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0751 - val_loss: 0.0725
Epoch 18/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0747Epoch 00017: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0747 - val_loss: 0.0744
Epoch 19/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0743Epoch 00018: val_loss improved from 0.07250 to 0.07235, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0743 - val_loss: 0.0723
Epoch 20/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0740Epoch 00019: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0740 - val_loss: 0.0731
Epoch 21/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0736Epoch 00020: val_loss improved from 0.07235 to 0.07202, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0736 - val_loss: 0.0720
Epoch 22/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0733Epoch 00021: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0734 - val_loss: 0.0729
Epoch 23/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0731Epoch 00022: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0731 - val_loss: 0.0725
Epoch 24/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0728Epoch 00023: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0728 - val_loss: 0.0739
Epoch 25/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0725Epoch 00024: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0725 - val_loss: 0.0725
Epoch 26/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0721Epoch 00025: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0721 - val_loss: 0.0725
Epoch 27/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0718Epoch 00026: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0718 - val_loss: 0.0723
Epoch 28/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0715Epoch 00027: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0715 - val_loss: 0.0728
Epoch 29/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0710Epoch 00028: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0710 - val_loss: 0.0725
Epoch 30/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0707Epoch 00029: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0707 - val_loss: 0.0723
Epoch 31/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0705Epoch 00030: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0705 - val_loss: 0.0725
Epoch 32/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0701Epoch 00031: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0701 - val_loss: 0.0723
Epoch 33/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0697Epoch 00032: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0697 - val_loss: 0.0726
Epoch 34/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0692Epoch 00033: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0692 - val_loss: 0.0728
Epoch 35/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0690Epoch 00034: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0690 - val_loss: 0.0726
Epoch 36/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0687Epoch 00035: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0687 - val_loss: 0.0730
Epoch 37/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0683Epoch 00036: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0683 - val_loss: 0.0730
Epoch 38/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0679Epoch 00037: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0679 - val_loss: 0.0734
Epoch 39/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0676Epoch 00038: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0676 - val_loss: 0.0732
Epoch 40/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0671Epoch 00039: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0671 - val_loss: 0.0745
Epoch 41/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0669Epoch 00040: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0669 - val_loss: 0.0734
Epoch 42/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0664Epoch 00041: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0664 - val_loss: 0.0736
Epoch 43/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0661Epoch 00042: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0661 - val_loss: 0.0738
Epoch 44/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0658Epoch 00043: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0658 - val_loss: 0.0744
Epoch 45/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0655Epoch 00044: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0655 - val_loss: 0.0738
Epoch 46/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0651Epoch 00045: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0651 - val_loss: 0.0738
Epoch 47/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0648Epoch 00046: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0648 - val_loss: 0.0743
Epoch 48/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0644Epoch 00047: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0644 - val_loss: 0.0742
Epoch 49/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0641Epoch 00048: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0641 - val_loss: 0.0751
Epoch 50/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0638Epoch 00049: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0638 - val_loss: 0.0747
Epoch 51/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0636Epoch 00050: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0636 - val_loss: 0.0750
Epoch 52/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0632Epoch 00051: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0632 - val_loss: 0.0743
Epoch 53/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0630Epoch 00052: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0630 - val_loss: 0.0750
Epoch 54/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0627Epoch 00053: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0627 - val_loss: 0.0754
Epoch 55/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0624Epoch 00054: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0624 - val_loss: 0.0759
Epoch 56/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0621Epoch 00055: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0621 - val_loss: 0.0766
Epoch 57/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0619Epoch 00056: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0619 - val_loss: 0.0758
Epoch 58/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0617Epoch 00057: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0617 - val_loss: 0.0766
Epoch 59/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0614Epoch 00058: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0613 - val_loss: 0.0760
Epoch 60/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0611Epoch 00059: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0611 - val_loss: 0.0754
Epoch 61/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0610Epoch 00060: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0610 - val_loss: 0.0757
Epoch 62/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0608Epoch 00061: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0608 - val_loss: 0.0763
Epoch 63/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0606Epoch 00062: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0606 - val_loss: 0.0761
Epoch 64/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0603Epoch 00063: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0603 - val_loss: 0.0761
Epoch 65/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0602Epoch 00064: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0602 - val_loss: 0.0758
Epoch 66/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0599Epoch 00065: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0599 - val_loss: 0.0766
Epoch 67/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0597Epoch 00066: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0597 - val_loss: 0.0774
Epoch 68/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0596Epoch 00067: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0596 - val_loss: 0.0762
Epoch 69/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0593Epoch 00068: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0593 - val_loss: 0.0766
Epoch 70/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0590Epoch 00069: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0590 - val_loss: 0.0777
Epoch 71/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0590Epoch 00070: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0590 - val_loss: 0.0765
Epoch 72/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0586Epoch 00071: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0586 - val_loss: 0.0768
Epoch 73/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0585Epoch 00072: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0585 - val_loss: 0.0767
Epoch 74/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0582Epoch 00073: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0582 - val_loss: 0.0765
Epoch 75/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0581Epoch 00074: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0581 - val_loss: 0.0766
Epoch 76/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0578Epoch 00075: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0578 - val_loss: 0.0773
Epoch 77/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0576Epoch 00076: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0576 - val_loss: 0.0778
Epoch 78/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0573Epoch 00077: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0573 - val_loss: 0.0767
Epoch 79/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0573Epoch 00078: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0573 - val_loss: 0.0772
Epoch 80/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0570Epoch 00079: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0571 - val_loss: 0.0772
history: [(0.12353252803025866, None, 0.079642067330250088, None), (0.088535284388714955, None, 0.083174468957942366, None), (0.084933669678894028, None, 0.076553749031127855, None), (0.082964531905272906, None, 0.076127448560077485, None), (0.081787635101454814, None, 0.078059386490323956, None), (0.080672903142782179, None, 0.074795585403522213, None), (0.079807374924298166, None, 0.074573153819849136, None), (0.079327270189761698, None, 0.074408721728774871, None), (0.078770001239650514, None, 0.074657954819942723, None), (0.078139108363786181, None, 0.074295433541501851, None), (0.077686613873186941, None, 0.074335218405796155, None), (0.077285428296090627, None, 0.074147477281057306, None), (0.076860101779907541, None, 0.074430981500689483, None), (0.076401450710960508, None, 0.072660282889276159, None), (0.075962430114927704, None, 0.074526368301571597, None), (0.07544644189709028, None, 0.073467986315171291, None), (0.075149082641965834, None, 0.072501527936491242, None), (0.074683814698301543, None, 0.074380732267596048, None), (0.074344950762118875, None, 0.072348135269758723, None), (0.073953558383393167, None, 0.073116734011532514, None), (0.073560347908709481, None, 0.072021164669112347, None), (0.073359612432180324, None, 0.07290436540655168, None), (0.073083039200938754, None, 0.072472535130458704, None), (0.072786054370539005, None, 0.073942194416370566, None), (0.072464513681475121, None, 0.072493242607359828, None), (0.072129642147833253, None, 0.07251513486265955, None), (0.071806935582167442, None, 0.072322047543761578, None), (0.071510403475499015, None, 0.072750023907813127, None), (0.071048775976206388, None, 0.072454667662921024, None), (0.070696678848359548, None, 0.072294903819873094, None), (0.070494093166408991, None, 0.072511750405237552, None), (0.070086643838649487, None, 0.072318410310933945, None), (0.069720122301652698, None, 0.072608956145732192, None), (0.069245941846060435, None, 0.072772277839470489, None), (0.06898971827212956, None, 0.072575928663191361, None), (0.068722276480942798, None, 0.072959460601596166, None), (0.068280877574179402, None, 0.073012156267416528, None), (0.067880799755462032, None, 0.073384262065727776, None), (0.067553788958490693, None, 0.07316735198599382, None), (0.067102408996298726, None, 0.074529634377546325, None), (0.066867285504285959, None, 0.073353558087004195, None), (0.066424896843069681, None, 0.073584557475473961, None), (0.066148317087001446, None, 0.073787552195415468, None), (0.065807495035666103, None, 0.074357166909010258, None), (0.065483619757824227, None, 0.073794038509850821, None), (0.065134196344222114, None, 0.073846819466107508, None), (0.064790704642397556, None, 0.074306039255866541, None), (0.064380169239678042, None, 0.074202664479998875, None), (0.064114267594439014, None, 0.075054977945359688, None), (0.063812161932294775, None, 0.074661613463266802, None), (0.063590773048849011, None, 0.074970594801496329, None), (0.063238624793199236, None, 0.074270634142231173, None), (0.063006885590968092, None, 0.0750283278649619, None), (0.062695774753853684, None, 0.075404862562815353, None), (0.062361703768092198, None, 0.075871621115385493, None), (0.062123014793509117, None, 0.076567843057430682, None), (0.061864681989946942, None, 0.075754453432342231, None), (0.06168156563236047, None, 0.076627909377376055, None), (0.061341485747733654, None, 0.075974489580641416, None), (0.061119496965059465, None, 0.075379396903596518, None), (0.061023667474458816, None, 0.075697530803796542, None), (0.060776759067785811, None, 0.076286553622108622, None), (0.06057018000357442, None, 0.076110500813982074, None), (0.060295696116001996, None, 0.076071535876443219, None), (0.060176517832507243, None, 0.075795705539360075, None), (0.059861556326828387, None, 0.076648769948399045, None), (0.059654744969008411, None, 0.077403454180903261, None), (0.059559831017892077, None, 0.07617359817640422, None), (0.059337510864751225, None, 0.076625446467185498, None), (0.058986289378422756, None, 0.077717765825524171, None), (0.058972860333664077, None, 0.076525817496228624, None), (0.058605675971344029, None, 0.07677709595888535, None), (0.058531300736519055, None, 0.076659643611497894, None), (0.058174564752273741, None, 0.076483747072778704, None), (0.058103188469945867, None, 0.07660703165981142, None), (0.057796101887500728, None, 0.07726114339661562, None), (0.057617176526049217, None, 0.077820621771083037, None), (0.05732098632265259, None, 0.076680567302660305, None), (0.057282032319846438, None, 0.077200279093405613, None), (0.057055504123442291, None, 0.077166758806556685, None)]
0. 
patient tongue id: 04061401153382_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.373164 0.766212 0.370431 0.919928 0.542528 0.758033 0.338126 0.415134 0.408005 0.302749 0.460267 0.82503 0.843414 0.768155 0.851713 0.335647 0.928594 0.488441 0.743335 0.601063 0.706451
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
1. 
patient tongue id: 05201454420097_4_6
label yaofang:
甘草 川芎 法半夏 远志 枸杞子 白术 红花 牛膝 石菖蒲 泽泻 天麻 地龙 粉葛 首乌藤 沙苑子
0.972936 0.539057 0.570399 0.415519 0.310821 0.646932 0.519824 0.567957 0.38292 0.444017 0.464195
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
2. 
patient tongue id: 03231851332564_4
label yaofang:
陈皮 法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.344225 0.705281 0.391005 0.869845 0.485223 0.697259 0.322899 0.39048 0.379285 0.415938 0.751113 0.775713 0.685418 0.78632 0.321007 0.892013 0.424684 0.68877 0.547815 0.65099
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
3. 
patient tongue id: 02241401190370_1_4
label yaofang:
当归 茯苓 薏苡仁 黄芪 白术 浙贝母 厚朴 生半夏 砂仁 鸡内金 山慈菇 蛇舌草 稻芽 红曲
0.85092 0.489616 0.454388 0.353067 0.445751 0.365397
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
4. 
patient tongue id: 05260658381721_1_7
label yaofang:
甘草 柴胡 党参 赤芍 杜仲 山药 菟丝子 益母草 鳖甲 茵陈 虎杖 麦芽 广金钱草 土鳖虫 鹿衔草
0.970453 0.308534 0.524738 0.579153 0.407444 0.311076 0.638819 0.547262 0.57865 0.406289 0.48837 0.506683
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
5. 
patient tongue id: 03291852082375_4_7
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.393815 0.305035 0.361138 0.444528 0.586776
predicted yaofang:
白芍 党参 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.800000, recall: 0.363636, error: 0.200000
6. 
patient tongue id: 03151334468792_4
label yaofang:
陈皮 法半夏 前胡 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.328351 0.531634 0.421484 0.640141 0.392081 0.496751 0.322713 0.313297 0.336346 0.545554 0.548252 0.474717 0.563601 0.325315 0.694308 0.324484 0.506477 0.392609 0.457835
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.733333, error: 0.421053
7. 
patient tongue id: 04271431013097_1_2_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 赤芍 牛膝 郁金 六神曲
0.476521 0.34309 0.325644 0.394468 0.432352 0.320634 0.349155 0.302596
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
8. 
patient tongue id: 02120742076074_1_4
label yaofang:
枳壳 太子参 黄芪 白术 海螵蛸 浙贝母 杜仲 山药 生半夏 菟丝子 鸡内金 紫苏梗 五指毛桃 稻芽
0.31076 0.30027 0.368485 0.404761 0.395003 0.35976 0.347104 0.315466 0.34547 0.318272 0.385737 0.378784 0.517835 0.350168
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香

------Score: precision: 0.071429, recall: 0.071429, error: 0.928571
9. 
patient tongue id: 03290232393996_2
label yaofang:
甘草 柴胡 白芍 茯苓 党参 山药 天麻 鳖甲 扁豆花 佛手 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.904178 0.339897 0.445507 0.541338 0.408203 0.512691 0.364162 0.448127 0.309106 0.316432
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.600000, error: 0.100000
10. 
patient tongue id: 05232103420527_6_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 枳实 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.353174 0.452943 0.319354 0.312191 0.346594 0.540136 0.628611
predicted yaofang:
柴胡 白芍 香附 党参 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.857143, recall: 0.500000, error: 0.142857
11. 
patient tongue id: 04052201208638_5_2
label yaofang:
甘草 茯苓 太子参 黄芪 枸杞子 白术 黄连 赤芍 牡丹皮 杜仲 茜草 水牛角 北沙参 板蓝根 赭石 蜈蚣
0.701627 0.395126 0.442637 0.313823 0.494327 0.328065 0.347274
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
12. 
patient tongue id: 04130627481246_1_6
label yaofang:
甘草 茯苓 天冬 生地黄 浙贝母 乌梅 天麻 鳖甲 火麻仁 北沙参 蜈蚣 白花蛇舌 蜂房 四季青
0.966425 0.316484 0.509193 0.570091 0.399394 0.312752 0.63777 0.540473 0.570532 0.405201 0.479974 0.497145
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
13. 
patient tongue id: 06080206336466_1_2_6
label yaofang:
甘草 茯苓 蒲公英 党参 酸枣仁 丹参 生地黄 红花 山药 山茱萸 荆芥穗 麦芽 鹿角霜 首乌藤 地肤子 川加皮
0.975907 0.53028 0.596357 0.405735 0.344646 0.343062 0.321749 0.697897 0.588616 0.607842 0.445488 0.52551 0.55445
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.375000, error: 0.538462
14. 
patient tongue id: 06072246202358_4_2_6
label yaofang:
甘草 川芎 红花 赤芍 浙贝母 郁金 地黄 菟丝子 益母草 瓜蒌皮 王不留行 桑椹 紫苏梗 制何首乌 醋鳖甲 猫爪草
0.919405 0.314846 0.475919 0.548529 0.391737 0.575593 0.424417 0.469018 0.308074 0.35937 0.373994
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.062500, error: 0.909091
15. 
patient tongue id: 04142241088618_1_5
label yaofang:
甘草 防风 金银花 黄芪 何首乌 白术 五味子 生地黄 红花 牡丹皮 荆芥穗 麦芽 白鲜皮 地肤子 红条紫草
0.946989 0.516378 0.565351 0.406297 0.309283 0.313108 0.303921 0.609832 0.504552 0.529018 0.387209 0.443964 0.44974
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.200000, error: 0.769231
16. 
patient tongue id: 05262203011744_1_2
label yaofang:
甘草 茯苓 桔梗 芦根 牛蒡子 太子参 浙贝母 山药 鳖甲 射干 皂角刺 苍耳子 白花蛇舌 蜂房 四季青
0.8817 0.312345 0.448774 0.488743 0.420127 0.429733 0.340939 0.432572
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
17. 
patient tongue id: 04151216301567_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.354868 0.656597 0.404076 0.814521 0.458335 0.662973 0.33776 0.368982 0.366675 0.400703 0.695763 0.715435 0.641353 0.737282 0.34804 0.854333 0.406689 0.655991 0.533106 0.606722
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
18. 
patient tongue id: 06091948466459_6
label yaofang:
甘草 柴胡 白芍 川芎 香附 远志 枳实 泽泻 磁石 首乌藤 黑枣 合欢皮
0.825822 0.323106 0.435247 0.487305 0.421856 0.405966 0.3936
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
19. 
patient tongue id: 04271522448958_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.441452 0.335855 0.353183 0.392268 0.391404 0.350624 0.311213 0.363973 0.314998
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 车前子

------Score: precision: 0.555556, recall: 0.416667, error: 0.444444
20. 
patient tongue id: 04131852433615_1
label yaofang:
甘草 薏苡仁 桃仁 党参 赤芍 牡丹皮 白茅根 泽泻 水蛭 僵蚕 柿蒂 北沙参 赭石 半边莲 守宫
0.312817 0.386708 0.402082 0.355459 0.321436
predicted yaofang:
甘草 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
21. 
patient tongue id: 05092208485915_4_1
label yaofang:
法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.352594 0.695896 0.39424 0.859737 0.509981 0.685761 0.347579 0.402772 0.403042 0.305112 0.422126 0.753428 0.777037 0.68014 0.773623 0.331979 0.897988 0.421317 0.682878 0.524111 0.638455
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
22. 
patient tongue id: 02110733330242_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.540463 0.390904 0.337752 0.420094 0.387152 0.329454 0.312073 0.333649 0.349246
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 天麻

------Score: precision: 0.555556, recall: 0.416667, error: 0.444444
23. 
patient tongue id: 01101812592766_1
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 白芷 紫菀 白前 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄 醋五味子
0.369387 0.624485 0.392571 0.800868 0.45643 0.634899 0.319152 0.386509 0.391374 0.398306 0.693207 0.716657 0.636108 0.720237 0.321038 0.833567 0.431754 0.618455 0.50799 0.594898
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.812500, error: 0.350000
24. 
patient tongue id: 06162212564758_1_2
label yaofang:
茯苓 防风 党参 太子参 黄芪 枸杞子 柏子仁 山药 芡实 煅牡蛎 北沙参 制远志 麸炒白术 煅龙骨
0.321607 0.461954 0.410605 0.547648 0.338292 0.449288 0.32068 0.437777 0.444144 0.410832 0.500259 0.401827 0.633027 0.436654 0.32543 0.382411
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.285714, error: 0.750000
25. 
patient tongue id: 03170957243964_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.458754 0.337333 0.399773 0.397434 0.424319 0.394255 0.357415 0.40181 0.301116 0.3359 0.350259 0.352284 0.300343 0.330156 0.321528 0.345308
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
26. 
patient tongue id: 03151943481008_4_7
label yaofang:
甘草 茯苓 半夏 薏苡仁 桃仁 白术 浙贝母 厚朴 莪术 北沙参 土鳖虫 猫爪草 合欢皮 山慈菇 蛇舌草
0.486076 0.364999 0.358791 0.413537 0.376804
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
27. 
patient tongue id: 04271848044926_6
label yaofang:
甘草 茯苓 半夏 蒲公英 黄连 海螵蛸 郁金 砂仁 柿蒂 赭石 紫苏叶 蜈蚣 合欢皮 预知子 蛇舌草 素馨花
0.814165 0.471206 0.466259 0.394163 0.408345 0.326825
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
28. 
patient tongue id: 01110256462326_5_7
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 鸡血藤 牡丹皮 干姜 全蝎 天花粉 炙甘草 蜈蚣 土鳖虫 狗脊
0.784036 0.335708 0.417841 0.438806 0.360753 0.316792
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.117647, error: 0.666667
29. 
patient tongue id: 04241932291250_1
label yaofang:
茯苓 木香 党参 白术 赤芍 砂仁 炙甘草 醋香附 蒸陈皮 制枳壳
0.389598 0.398798 0.303749 0.340586 0.327991 0.329562 0.524946
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.400000, error: 0.428571
30. 
patient tongue id: 05270629295847_2
label yaofang:
柴胡 白芍 陈皮 茯苓 党参 黄芪 枸杞子 白术 熟地黄 山药 山茱萸 炙甘草 女贞子 粉葛 沙苑子 广升麻 墨旱莲
0.946019 0.308535 0.491256 0.556455 0.407166 0.572255 0.472647 0.513748 0.348908 0.411007 0.428948
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.235294, error: 0.636364
31. 
patient tongue id: 06190146232816_2_7_4
label yaofang:
甘草 党参 生地黄 槟榔 山药 山茱萸 车前子 天麻 益母草 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 泽兰 红豆杉
0.957122 0.32986 0.50153 0.572353 0.420963 0.302589 0.317639 0.615541 0.525948 0.565285 0.398487 0.470273 0.484383
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.529412, error: 0.307692
32. 
patient tongue id: 04182142477272_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 杜仲 郁金 地黄 天麻 桑寄生 续断 浮小麦 玉米须 蜈蚣 醋鳖甲
0.9792 0.533693 0.593558 0.3989 0.328673 0.33728 0.315972 0.687854 0.584296 0.603696 0.441407 0.519311 0.534851
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.400000, error: 0.538462
33. 
patient tongue id: 06022222548736_1_4_7
label yaofang:
甘草 当归 茯苓 半夏 党参 黄芪 枸杞子 白术 海螵蛸 杜仲 牛膝 郁金 山药 厚朴 鸡内金 紫苏叶 黄精 红豆杉
0.545827 0.38154 0.305421 0.316765 0.480386 0.548923 0.382066 0.309924 0.348027
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.777778, recall: 0.388889, error: 0.222222
34. 
patient tongue id: 06132018267438_1_4_7
label yaofang:
甘草 陈皮 当归 茯苓 半夏 远志 麦冬 党参 黄芪 白术 海螵蛸 杜仲 厚朴 莪术 鸡内金 合欢花 红豆杉 预知子
0.488978 0.366038 0.30879 0.446524 0.518374 0.329759
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 1.000000, recall: 0.333333, error: 0.000000
35. 
patient tongue id: 01062034216746_2_7_5
label yaofang:
甘草 白芍 黄芩 玄参 生地黄 赤芍 牛膝 钩藤 天麻 补骨脂 决明子 麦芽 首乌藤 川木瓜
0.956181 0.306067 0.511277 0.557559 0.412485 0.311988 0.316518 0.304302 0.617964 0.511588 0.551079 0.390275 0.450209 0.468596
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.285714, error: 0.714286
36. 
patient tongue id: 01180620443032_1_6
label yaofang:
甘草 川芎 法半夏 茯苓 羌活 生地黄 牛膝 山药 细辛 天麻 全蝎 白芷 蔓荆子 补骨脂
0.973303 0.528367 0.303688 0.581059 0.428015 0.321832 0.321416 0.323895 0.658321 0.563048 0.597463 0.427804 0.494216 0.505487
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.357143, error: 0.642857
37. 
patient tongue id: 03261558212237_5
label yaofang:
甘草 桔梗 连翘 薄荷 芦根 桃仁 酸枣仁 桑叶 菊花 莱菔子 白前 鸡内金 苦杏仁 野马追
0.52189 0.317311 0.31835 0.377391 0.39933
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
38. 
patient tongue id: 01050702588982_1_2
label yaofang:
甘草 当归 茯苓 党参 黄芪 鸡血藤 生地黄 赤芍 山药 天麻 鳖甲 补骨脂 蜈蚣 天山雪莲 半枝莲
0.969797 0.508818 0.578848 0.42026 0.342072 0.311837 0.314339 0.670925 0.532857 0.576918 0.40407 0.46468 0.486481
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.666667, error: 0.230769
39. 
patient tongue id: 04062001420669_4
label yaofang:
陈皮 桔梗 牛蒡子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.336474 0.334362 0.426216 0.33606 0.325548 0.451036 0.542573
predicted yaofang:
甘草 柴胡 白芍 党参 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.100000, error: 0.857143
40. 
patient tongue id: 04112258168299_3
label yaofang:
桂枝 党参 白术 附子 干姜 桑寄生 淫羊藿 炙甘草 紫苏叶 鹿衔草
0.570512 0.309966 0.423382 0.310371 0.385889 0.327699 0.355381
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.428571, recall: 0.300000, error: 0.571429
41. 
patient tongue id: 02211402073496_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 淡竹叶 北沙参
0.479072 0.344146 0.365869 0.380005 0.4888 0.358199 0.31077 0.388382
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
42. 
patient tongue id: 05092032105143_1_6
label yaofang:
桂枝 甘草 白芍 大枣 桃仁 党参 郁金 北柴胡 淫羊藿 虎杖 白花蛇舌草 土茯苓
0.419154 0.315386 0.399518 0.381556 0.341981 0.351919 0.420243
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
43. 
patient tongue id: 01172334379834_1_2
label yaofang:
甘草 白芍 薏苡仁 太子参 浙贝母 郁金 天麻 鳖甲 莪术 佛手 黄精 蜈蚣 白花蛇舌 天山雪莲
0.926009 0.308961 0.488034 0.519768 0.399773 0.51742 0.409246 0.472017 0.347431 0.345256
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.428571, error: 0.400000
44. 
patient tongue id: 06031129285832_2
label yaofang:
甘草 黄芩 桔梗 金银花 党参 生地黄 浙贝母 杜仲 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.557986 0.3834 0.328429 0.396136 0.341603 0.320846
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
45. 
patient tongue id: 02241402106682_1_7_4
label yaofang:
黄芪 白术 厚朴 当归尾 砂仁 桑寄生 火麻仁 莪术 鸡内金 北沙参 女贞子 红豆杉 墨旱莲 稻芽
0.473631 0.367786 0.306465 0.447221 0.421944
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
46. 
patient tongue id: 05262157348249_1_2_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 芦根 牛蒡子 党参 黄连 熟附子 天花粉 鳖甲 白花蛇舌 蜂房 四季青 广升麻
0.965706 0.314991 0.51839 0.566765 0.399596 0.301142 0.318348 0.637538 0.544267 0.569664 0.412871 0.481822 0.492476
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
47. 
patient tongue id: 03301946158645_4
label yaofang:
麻黄 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗
0.337963 0.797238 0.347795 0.952254 0.524694 0.797783 0.394837 0.374911 0.433553 0.866527 0.891739 0.785753 0.891116 0.962245 0.453991 0.782111 0.599159 0.739917
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.600000, error: 0.500000
48. 
patient tongue id: 04181955087196_6_2
label yaofang:
甘草 川芎 茯苓 桃仁 酸枣仁 浙贝母 牛膝 天麻 全蝎 诃子 紫苏梗 合欢花 猫爪草
0.953314 0.310889 0.512359 0.555826 0.400686 0.307056 0.609831 0.521936 0.541775 0.399491 0.460288 0.465576
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
49. 
patient tongue id: 03161325592714_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.329667 0.583791 0.420306 0.694641 0.43508 0.566586 0.324497 0.325587 0.345299 0.36076 0.586393 0.604415 0.544704 0.615359 0.323207 0.749811 0.362226 0.561512 0.468602 0.518937
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
50. 
patient tongue id: 02170953502522_1_3
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.44425 0.355822 0.320428 0.465506 0.406966 0.305097
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
51. 
patient tongue id: 01052200569275_6_1
label yaofang:
牡蛎 黄芪 白术 赤芍 浙贝母 砂仁 菟丝子 桑寄生 莪术 北沙参 首乌藤 土鳖虫 红豆杉 合欢皮
0.853791 0.45418 0.441241 0.462414 0.416189 0.381716
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
52. 
patient tongue id: 05022011050090_4
label yaofang:
麻黄 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗
0.351566 0.87048 0.326269 0.97749 0.594892 0.857591 0.431021 0.41166 0.465524 0.918847 0.933889 0.853988 0.933749 0.981822 0.498913 0.844431 0.645883 0.787188
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.444444, recall: 0.571429, error: 0.555556
53. 
patient tongue id: 01182101099533_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 天麻 鳖甲 佛手 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.991353 0.548795 0.624791 0.412634 0.326462 0.342835 0.309054 0.731776 0.626941 0.662308 0.465093 0.559106 0.574993
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.666667, error: 0.230769
54. 
patient tongue id: 03311828582555_4_1
label yaofang:
桂枝 白芍 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 紫菀 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.367554 0.706972 0.390388 0.871293 0.50673 0.70252 0.354356 0.390083 0.393971 0.435506 0.759922 0.786796 0.701394 0.794749 0.354163 0.895577 0.440646 0.702591 0.570435 0.66151
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.733333, error: 0.450000
55. 
patient tongue id: 03231632217563_4
label yaofang:
茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香
0.337835 0.654689 0.408482 0.797421 0.458073 0.625943 0.319406 0.339008 0.34587 0.379132 0.676339 0.681412 0.619871 0.704368 0.329029 0.8244 0.387252 0.626812 0.506503 0.561238
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.923077, error: 0.400000
56. 
patient tongue id: 02191636266781_5_6
label yaofang:
甘草 枳壳 法半夏 木香 连翘 党参 白术 槟榔 砂仁 莱菔子 款冬花 莪术 麦芽 建曲 独脚金
0.961395 0.515721 0.577345 0.41064 0.317555 0.310919 0.635571 0.50886 0.541054 0.376462 0.442811 0.465431
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
57. 
patient tongue id: 04241844023475_6_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗
0.30131 0.336301 0.443497 0.315092 0.34615 0.492716 0.592031
predicted yaofang:
甘草 柴胡 白芍 党参 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.714286, recall: 0.454545, error: 0.285714
58. 
patient tongue id: 04020758504249_1_2_7
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 远志 仙鹤草 天麻 磁石 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.984745 0.535589 0.618538 0.423249 0.3397 0.340274 0.317519 0.711761 0.607838 0.639592 0.46003 0.542344 0.57003
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
59. 
patient tongue id: 04261352455223_1_2_4
label yaofang:
茯苓 半夏 黄芪 白术 杜仲 山药 砂仁 鸡内金 佛手 骨碎补 田基黄
0.433339 0.319778 0.341945 0.473851 0.431146 0.31448
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.272727, error: 0.500000
60. 
patient tongue id: 05131312072449_2_1_6
label yaofang:
甘草 木香 黄连 浙贝母 天麻 赤石脂 糯稻根 鳖甲 补骨脂 豆蔻 粉葛 建曲 蜈蚣 天山雪莲 半枝莲 龟甲
0.889123 0.324123 0.469992 0.518657 0.396118 0.512198 0.368872 0.426393 0.310068 0.313413
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.375000, error: 0.400000
61. 
patient tongue id: 05232119406283_1_4_7
label yaofang:
陈皮 茯苓 半夏 党参 黄芪 枸杞子 白术 海螵蛸 杜仲 牛膝 郁金 山药 厚朴 菟丝子 炙甘草 紫苏叶 红豆杉
0.878552 0.455766 0.485045 0.467288 0.463131 0.33601 0.457838
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.176471, error: 0.571429
62. 
patient tongue id: 02182144582851_4_6
label yaofang:
桂枝 甘草 陈皮 法半夏 茯苓 前胡 桔梗 党参 浙贝母 细辛 白前 苦杏仁 粉葛 炙麻黄 贯众
0.523914 0.451261 0.455932 0.470853 0.339998 0.350721 0.402686 0.355374 0.307434 0.396443 0.360389
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 百部 炙甘草 广藿香

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
63. 
patient tongue id: 01190633162554_1_2_5
label yaofang:
甘草 薏苡仁 党参 五味子 山药 白茅根 细辛 茜草 天麻 鳖甲 款冬花 紫菀 百部 炙麻黄 蜈蚣 白花蛇舌 天山雪莲
0.957569 0.510639 0.562011 0.417392 0.310686 0.306843 0.310273 0.623201 0.516687 0.550635 0.388267 0.453223 0.472402
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.470588, error: 0.384615
64. 
patient tongue id: 03180120024623_7_1
label yaofang:
甘草 柴胡 川芎 香附 防风 赤芍 青蒿 荆芥穗 白芷 郁李仁 芥子
0.542449 0.317764 0.408 0.33848 0.401132 0.337955 0.377528
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
65. 
patient tongue id: 04130019502437_1_6
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.9799 0.51973 0.61274 0.426664 0.325124 0.324466 0.310723 0.701361 0.595209 0.629023 0.436683 0.530768 0.572031
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.846154, error: 0.153846
66. 
patient tongue id: 05032229113666_2_6
label yaofang:
甘草 茯苓 党参 黄芪 白术 酸枣仁 天麻 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.95527 0.314397 0.499532 0.580454 0.421796 0.306555 0.30716 0.30668 0.635097 0.538064 0.568755 0.408549 0.475653 0.501622
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.785714, recall: 0.785714, error: 0.214286
67. 
patient tongue id: 04112157111411_4_2
label yaofang:
甘草 陈皮 法半夏 茯苓 生地黄 牡丹皮 山药 山茱萸 菟丝子 桑螵蛸 益智
0.981226 0.525002 0.599657 0.422249 0.309949 0.31936 0.308378 0.697359 0.590013 0.634561 0.431601 0.519698 0.558242
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.363636, error: 0.692308
68. 
patient tongue id: 03062145390911_1_5
label yaofang:
甘草 陈皮 桃仁 蒲公英 黄芪 延胡索 海螵蛸 浙贝母 厚朴 砂仁 白芷 火麻仁 鸡内金 蛤壳 土鳖虫 冬凌草
0.713351 0.410495 0.436329 0.31054 0.433007 0.349093
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
69. 
patient tongue id: 03240556187035_1_4
label yaofang:
甘草 白芍 陈皮 防风 薏苡仁 党参 白术 山药 天麻 巴戟天 五灵脂 鳖甲 莪术 白扁豆 蜈蚣 天山雪莲 半枝莲
0.883246 0.461549 0.488233 0.492936 0.461428 0.354442 0.49212 0.32426
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.875000, recall: 0.411765, error: 0.125000
70. 
patient tongue id: 04271845042168_2_1
label yaofang:
甘草 柴胡 枳壳 半夏 薏苡仁 白术 浙贝母 厚朴 淡豆豉 僵蚕 夏枯草 麦芽 合欢皮 预知子 蛇舌草
0.833109 0.46731 0.440506 0.436011 0.391812 0.376441
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
71. 
patient tongue id: 04072013484283_1_4
label yaofang:
桂枝 枳壳 茯苓 薏苡仁 太子参 黄芪 枸杞子 白术 海螵蛸 杜仲 山药 厚朴 砂仁 猪苓 芡实 鸡内金 莲子 蜈蚣 红豆杉 五指毛桃 山慈菇
0.389919 0.338127 0.498351 0.487549 0.359767 0.327889
predicted yaofang:
甘草 茯苓 黄芪 白术 厚朴 北沙参

------Score: precision: 0.666667, recall: 0.190476, error: 0.333333
72. 
patient tongue id: 05312201115129_6_4
label yaofang:
甘草 川芎 法半夏 葛根 龙骨 牡蛎 白术 牛膝 荷叶 天麻 僵蚕 磁石 麦芽 地龙
0.713319 0.400304 0.364446 0.441828 0.374616
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
73. 
patient tongue id: 05252151193279_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.341551 0.55243 0.417268 0.670761 0.412397 0.536847 0.327269 0.330535 0.34279 0.359092 0.569891 0.583205 0.51412 0.593854 0.359141 0.736058 0.346473 0.540028 0.43332 0.498886
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
74. 
patient tongue id: 05222048314097_1_4_7
label yaofang:
茯苓 黄芪 白术 熟地黄 牡丹皮 山药 山茱萸 石菖蒲 泽泻 全蝎 磁石 鸡内金 北沙参 紫苏梗
0.642497 0.386932 0.350215 0.422566 0.511602
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
75. 
patient tongue id: 03311618353367_1_6_5
label yaofang:
半夏 黄芪 何首乌 白术 赤芍 浙贝母 杜仲 砂仁 菟丝子 桑寄生 橘络 土鳖虫 红豆杉 山慈菇
0.412355 0.335584 0.30538 0.483431 0.327063
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
76. 
patient tongue id: 03091957598829_4
label yaofang:
甘草 法半夏 前胡 太子参 黄芪 细辛 干姜 白芷 款冬花 紫菀 百部 北沙参 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.417912 0.69553 0.402355 0.882553 0.53299 0.66609 0.34019 0.350003 0.437943 0.44599 0.777089 0.788854 0.728353 0.812147 0.325746 0.895383 0.420751 0.677897 0.561393 0.626489
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.812500, error: 0.350000
77. 
patient tongue id: 04141810307623_1_4_3
label yaofang:
甘草 茯苓 半夏 党参 白术 海螵蛸 杜仲 黄柏 郁金 山药 干姜 厚朴 砂仁 鸡内金 紫苏叶 黑枣
0.401791 0.312168 0.336893 0.353025 0.359217
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.800000, recall: 0.250000, error: 0.200000
78. 
patient tongue id: 01202014305224_4_1
label yaofang:
甘草 茯苓 白术 海螵蛸 浙贝母 款冬花 诃子 枇杷叶 北沙参
0.837622 0.45188 0.449067 0.480177 0.409613 0.400772
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
79. 
patient tongue id: 01070838157796_1_4_7
label yaofang:
当归 党参 黄芪 熟附子 乌药 山药 干姜 淫羊藿 吴茱萸 仙茅 益智 鹿角霜 煨诃子
0.568173 0.37385 0.340558 0.452705 0.523157 0.31758
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
80. 
patient tongue id: 04062010470215_4
label yaofang:
甘草 白芍 川芎 独活 牛膝 细辛 干姜 仙鹤草 地榆 蜈蚣 姜黄 海桐皮 鹿衔草
0.573122 0.385335 0.369804 0.315311 0.412976
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
81. 
patient tongue id: 04142240095050_1
label yaofang:
柴胡 香附 龙骨 牡蛎 酸枣仁 合欢皮
0.607997 0.335641 0.376653 0.437008 0.3251 0.316682
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
82. 
patient tongue id: 03261704535207_2
label yaofang:
川芎 陈皮 枳壳 麦冬 酸枣仁 丹参 天冬 柏子仁 乌药 三七 火麻仁 珍珠母 首乌藤
0.502545 0.377027 0.382888 0.372891 0.328876
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
83. 
patient tongue id: 06062306583042_2_4
label yaofang:
甘草 法半夏 茯苓 前胡 细辛 天麻 鳖甲 款冬花 白前 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.899619 0.305182 0.465699 0.515736 0.423384 0.490195 0.372534 0.457072 0.313471 0.336565
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
84. 
patient tongue id: 02182153524198_5
label yaofang:
甘草 茯苓 连翘 白及 党参 黄连 细辛 地黄 白芷 升麻 淡竹叶 麦芽 川木通 独脚金
0.970195 0.307261 0.523598 0.578385 0.409019 0.316551 0.325695 0.310448 0.654058 0.564941 0.585419 0.431966 0.499499 0.511376
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.214286, recall: 0.214286, error: 0.785714
85. 
patient tongue id: 05102213347871_1
label yaofang:
法半夏 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.33211 0.609521 0.395034 0.783271 0.418849 0.610531 0.308921 0.305459 0.339387 0.643579 0.666223 0.589573 0.703702 0.370851 0.834468 0.349436 0.613321 0.472282 0.565776
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 1.000000, error: 0.368421
86. 
patient tongue id: 03022216261981_5_6
label yaofang:
甘草 白术 生地黄 延胡索 天麻 五灵脂 鳖甲 忍冬藤 桑枝 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.96091 0.301955 0.51602 0.553418 0.386117 0.596382 0.493879 0.517791 0.363674 0.425808 0.425368
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
87. 
patient tongue id: 06050823498044_1_3_5
label yaofang:
当归 党参 黄芪 牛膝 山药 泽泻 车前子 淫羊藿 仙茅 鹿角霜
0.55492 0.386204 0.40759
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.333333, recall: 0.100000, error: 0.666667
88. 
patient tongue id: 03111430205613_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 莪术 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花
0.976925 0.314558 0.538157 0.576582 0.39854 0.320315 0.3426 0.31937 0.659221 0.557729 0.586874 0.424006 0.493674 0.508217
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.714286, recall: 0.714286, error: 0.285714
89. 
patient tongue id: 02252106267683_6
label yaofang:
甘草 川芎 党参 枸杞子 酸枣仁 牛膝 天麻 麦芽 地龙 女贞子 辛夷 粉葛 首乌藤 沙苑子 墨旱莲
0.964868 0.322612 0.517429 0.577951 0.405544 0.318075 0.331064 0.308477 0.64414 0.551996 0.573177 0.424942 0.491312 0.510613
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.266667, error: 0.714286
90. 
patient tongue id: 01061612088942_6_5
label yaofang:
甘草 柴胡 白芍 法半夏 远志 白术 黄连 山药 车前子 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.925637 0.331822 0.465707 0.536964 0.408004 0.507214 0.388303 0.45266 0.327969 0.333284
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.500000, error: 0.200000
91. 
patient tongue id: 03081806311097_4
label yaofang:
桂枝 甘草 白芍 大枣 桃仁 玉竹 党参 郁金 北柴胡 淫羊藿 川牛膝 土茯苓 粉萆薢
0.339143 0.388369 0.512259
predicted yaofang:
甘草 茯苓 炙甘草

------Score: precision: 0.333333, recall: 0.076923, error: 0.666667
92. 
patient tongue id: 03302119258776_1_5
label yaofang:
甘草 白芍 木香 独活 桃仁 党参 鸡血藤 丹参 五味子 赤芍 山药 茵陈 补骨脂 虎杖
0.943222 0.504642 0.546366 0.448646 0.308611 0.591832 0.501316 0.553212 0.379439 0.435456 0.449216
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
93. 
patient tongue id: 03231257059886_5
label yaofang:
甘草 法半夏 茯苓 前胡 芦根 细辛 桑白皮 款冬花 白前 苦杏仁 板蓝根 紫苏子 炙麻黄 贯众
0.931083 0.313039 0.493532 0.54043 0.41347 0.550095 0.447768 0.507715 0.328408 0.384466 0.401227
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
94. 
patient tongue id: 01012101437253_1_4_2
label yaofang:
当归 党参 黄芪 熟附子 乌药 肉桂 山药 干姜 淫羊藿 仙茅 益智 鹿角霜 醋龟甲
0.452835 0.37517 0.31712 0.50287 0.465273 0.370041 0.378117
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 北沙参

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
95. 
patient tongue id: 05032310205188_2_5
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 牡丹皮 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.942041 0.32744 0.478288 0.567144 0.421151 0.600621 0.485886 0.541778 0.353686 0.42945 0.458393
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.785714, error: 0.000000
96. 
patient tongue id: 02120938162483_6_2
label yaofang:
甘草 薏苡仁 党参 白术 酸枣仁 栀子 佩兰 淡豆豉 天麻 鳖甲 豆蔻 苦杏仁 蜈蚣 天山雪莲 半枝莲
0.905103 0.322075 0.48089 0.520771 0.411534 0.518154 0.430579 0.470313 0.323097 0.376329 0.38698
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
97. 
patient tongue id: 04291457028674_4_1
label yaofang:
甘草 党参 杜仲 郁金 地黄 天麻 桑寄生 莪术 白花蛇舌草 续断 蜈蚣 半枝莲 醋鳖甲 炒鸡内金
0.975279 0.51483 0.607225 0.42479 0.346319 0.327946 0.323715 0.700597 0.584772 0.609275 0.434757 0.516967 0.557025
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
98. 
patient tongue id: 02240823021724_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌
0.395056 0.385786 0.311555 0.344767
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
99. 
patient tongue id: 03062147483742_6_1
label yaofang:
甘草 陈皮 枳壳 茯苓 半夏 连翘 党参 白术 厚朴 山楂 鸡内金 紫苏梗 红曲
0.5694 0.384724 0.34236 0.326323 0.501333 0.557992 0.316642 0.412066 0.316999 0.369946 0.331258
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
100. 
patient tongue id: 05242124534603_1_7
label yaofang:
甘草 柴胡 法半夏 茯苓 木香 党参 黄连 赤芍 郁金 砂仁 茵陈 海金沙 鸡内金 虎杖 王不留行 建曲
0.962177 0.519259 0.575726 0.433453 0.330869 0.325498 0.326819 0.638038 0.546588 0.57948 0.419628 0.480381 0.509664
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.187500, error: 0.769231
101. 
patient tongue id: 02271238456277_1_3
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 厚朴
0.442148 0.334865 0.392793 0.306341
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 1.000000, recall: 0.307692, error: 0.000000
102. 
patient tongue id: 03041130217807_1_4
label yaofang:
陈皮 前胡 桔梗 防风 白芷 款冬花 香薷 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.355345 0.779288 0.366318 0.925165 0.535281 0.762905 0.334476 0.407957 0.408805 0.441532 0.82844 0.849873 0.753481 0.846722 0.304117 0.944521 0.455159 0.752941 0.580386 0.685853
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
103. 
patient tongue id: 02191434505439_2_1_6
label yaofang:
甘草 茯苓 酸枣仁 浙贝母 钩藤 天麻 鳖甲 蒺藜 辛夷 浮小麦 蜈蚣 白花蛇舌 蜂房 岗梅根 四季青
0.936198 0.326927 0.509971 0.541891 0.4001 0.303712 0.315995 0.300787 0.57766 0.489362 0.514031 0.38049 0.434274 0.437278
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.466667, error: 0.500000
104. 
patient tongue id: 04222219198280_4_1
label yaofang:
法半夏 前胡 防风 太子参 黄芪 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.361344 0.779002 0.362294 0.934492 0.551348 0.775409 0.328361 0.40426 0.397663 0.447069 0.84746 0.866629 0.779202 0.873391 0.318824 0.94826 0.463556 0.758651 0.593308 0.731506
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
105. 
patient tongue id: 05131601339713_6_3
label yaofang:
甘草 当归 生地黄 红花 杜仲 山药 山茱萸 桑寄生 补骨脂 金樱子 蛇床子 锁阳 覆盆子 合欢花
0.946208 0.315272 0.500516 0.575348 0.425097 0.318167 0.312453 0.312675 0.619657 0.531104 0.553399 0.409652 0.470882 0.493019
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.214286, recall: 0.214286, error: 0.785714
106. 
patient tongue id: 05091951513926_2_4
label yaofang:
甘草 茯苓 葛根 麦冬 玉竹 太子参 豆蔻 北沙参 麸炒白术 炒六神曲 干石斛
0.366653 0.818574 0.342803 0.953637 0.544677 0.812209 0.331498 0.427845 0.420404 0.464775 0.869236 0.890397 0.800588 0.888703 0.301779 0.96624 0.478648 0.805809 0.628394 0.736605
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.272727, error: 0.850000
107. 
patient tongue id: 02142139552086_4_6
label yaofang:
甘草 陈皮 法半夏 茯苓 远志 党参 酸枣仁 黄连 竹茹 栀子 淡豆豉 扁豆花 麦芽 合欢花 木棉花
0.981958 0.532949 0.617199 0.424646 0.373381 0.361072 0.342235 0.728377 0.627976 0.648568 0.48341 0.562671 0.600986
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
108. 
patient tongue id: 01201257235995_7
label yaofang:
桂枝 甘草 川芎 桃仁 党参 鸡血藤 白术 生地黄 红花 赤芍 天麻 首乌藤 桑枝 威灵仙 络石藤
0.967765 0.31403 0.526277 0.574287 0.397592 0.33004 0.350746 0.317085 0.651902 0.561523 0.580283 0.441409 0.503324 0.511863
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.333333, error: 0.642857
109. 
patient tongue id: 04272226537886_4
label yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.35823 0.795986 0.337724 0.957138 0.537084 0.802593 0.418518 0.378918 0.457951 0.876856 0.895574 0.803739 0.903025 0.962237 0.475019 0.797258 0.592876 0.754538
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.928571, error: 0.277778
110. 
patient tongue id: 04201909145958_1_2
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.341772 0.76849 0.368577 0.922549 0.543974 0.761849 0.333713 0.382453 0.381039 0.429166 0.827518 0.849719 0.755468 0.852772 0.331977 0.943719 0.437749 0.754607 0.572396 0.71132
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.846154, error: 0.450000
111. 
patient tongue id: 04181948547886_4_6
label yaofang:
甘草 陈皮 法半夏 茯苓 羌活 独活 连翘 薏苡仁 远志 党参 苍术 厚朴 砂仁 莱菔子 麦芽
0.827382 0.336515 0.432966 0.479674 0.395823 0.400807 0.367421
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
112. 
patient tongue id: 05312318078421_6_4_2
label yaofang:
甘草 茯苓 远志 白术 酸枣仁 丹参 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.96375 0.307356 0.53437 0.560378 0.403343 0.319864 0.314058 0.620141 0.529024 0.55382 0.402917 0.46103 0.459499
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
113. 
patient tongue id: 02151846385728_9
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.369853 0.72665 0.380058 0.887748 0.491991 0.718524 0.328199 0.395124 0.391165 0.424335 0.775294 0.795592 0.713904 0.809154 0.324961 0.90271 0.448977 0.703142 0.583223 0.655636
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
114. 
patient tongue id: 01041633057269_1
label yaofang:
甘草 香附 茯苓 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草
0.730046 0.341325 0.391242 0.44403 0.370775 0.329823
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.363636, error: 0.333333
115. 
patient tongue id: 03111506389668_6_2
label yaofang:
甘草 柴胡 白芍 茯苓 太子参 浙贝母 郁金 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.957762 0.502346 0.552279 0.415308 0.601101 0.496216 0.548527 0.363533 0.43235 0.44849
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
116. 
patient tongue id: 04062006015367_1_4
label yaofang:
白芍 香附 枳壳 法半夏 党参 海螵蛸 车前子 北柴胡 麦芽 炙甘草 紫苏梗 威灵仙
0.304601 0.368445 0.469777 0.333098 0.311924 0.309948 0.365286 0.327088 0.549048 0.63783
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.416667, error: 0.500000
117. 
patient tongue id: 04221926339968_2_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.357844 0.752634 0.375801 0.907537 0.505319 0.743791 0.334909 0.39059 0.381482 0.428328 0.800425 0.819685 0.727857 0.829483 0.327904 0.928438 0.43625 0.739212 0.575592 0.671423
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
118. 
patient tongue id: 01182108236412_5
label yaofang:
黄芪 白术 丹参 海螵蛸 浙贝母 厚朴 砂仁 莪术 鸡内金 北沙参 合欢皮 预知子
0.607327 0.423297 0.396649 0.341614 0.382984 0.305091
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
119. 
patient tongue id: 04271911212480_1
label yaofang:
甘草 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 麸炒苍术 炒僵蚕
0.338653 0.559434 0.414629 0.670359 0.410246 0.565744 0.330577 0.345556 0.352929 0.373333 0.573345 0.588795 0.530998 0.60549 0.344432 0.753606 0.366802 0.557505 0.467802 0.523383
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.050000, recall: 0.071429, error: 0.950000
120. 
patient tongue id: 03012211288698_1_2
label yaofang:
甘草 白芍 川芎 茯苓 龙骨 党参 何首乌 生地黄 山药 女贞子 佛手 浮小麦 百合 合欢花
0.962524 0.514438 0.5664 0.423078 0.312044 0.300666 0.311464 0.64828 0.54751 0.581821 0.407535 0.473807 0.50785
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
121. 
patient tongue id: 01042326212585_5
label yaofang:
甘草 黄芩 桔梗 牛蒡子 浙贝母 天麻 蔓荆子 白花蛇舌草 苦杏仁 板蓝根 辛夷 蜈蚣 半枝莲 醋鳖甲
0.961634 0.504124 0.568665 0.411283 0.302548 0.643679 0.536226 0.570451 0.395367 0.471861 0.499253
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
122. 
patient tongue id: 04281837048971_5
label yaofang:
甘草 桔梗 荆芥 芦根 薏苡仁 鱼腥草 白茅根 桑白皮 莱菔子 白芷 瓜蒌皮 紫菀 白前 百部 苦杏仁 紫苏子 辛夷 蜜麻黄 炒苍耳子
0.458942 0.348289 0.449823 0.364974 0.331722 0.388609 0.495867
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.052632, error: 0.857143
123. 
patient tongue id: 03061822520635_1_4
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 栀子 淡豆豉 天麻 地骨皮 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.975868 0.530403 0.562109 0.390229 0.637881 0.552465 0.572308 0.40567 0.477498 0.462633
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.600000, error: 0.100000
124. 
patient tongue id: 03111520227143_5_6
label yaofang:
甘草 白芍 薏苡仁 党参 白术 熟附子 杜仲 牛膝 天麻 桑寄生 鳖甲 败酱草 蜈蚣 半枝莲 宽筋藤
0.959666 0.310715 0.523233 0.554492 0.404598 0.310011 0.302093 0.607852 0.514045 0.543675 0.388838 0.449633 0.446602
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.533333, error: 0.384615
125. 
patient tongue id: 04221854155670_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.354606 0.669429 0.396766 0.833998 0.475826 0.655505 0.326963 0.367262 0.3707 0.400441 0.716404 0.739314 0.646935 0.75355 0.328688 0.860275 0.412763 0.655478 0.539616 0.613734
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
126. 
patient tongue id: 03021407008448_1_3
label yaofang:
丹参 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 燀桃仁
0.574609 0.370326 0.421627 0.361973 0.300345
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
127. 
patient tongue id: 05242115541267_1_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 五味子 细辛 天麻 鳖甲 款冬花 苦杏仁 炙麻黄 紫苏梗 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.942159 0.498868 0.551392 0.417958 0.585489 0.496679 0.537483 0.371832 0.430426 0.446101
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.437500, error: 0.300000
128. 
patient tongue id: 03012330204884_6_2
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 丹参 青皮 郁金 山药 桑寄生 王不留行 女贞子 合欢花
0.921595 0.488521 0.508999 0.444445 0.519835 0.402179 0.487754 0.331262 0.344159
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.214286, error: 0.666667
129. 
patient tongue id: 03151858231984_4_6
label yaofang:
桂枝 柴胡 白芍 黄芩 党参 五味子 郁金 虎杖 白花蛇舌草 麦芽 姜半夏 炙甘草 土茯苓
0.350506 0.458583 0.34136 0.371646 0.332689 0.579867 0.698788
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
130. 
patient tongue id: 03291629032904_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 木香 党参 郁金 莪术 鸡内金 虎杖 王不留行 麦芽 建曲 紫苏梗
0.916506 0.46834 0.523778 0.413426 0.507761 0.352904 0.439227
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
131. 
patient tongue id: 02202243329382_6_2_1
label yaofang:
甘草 茯苓 党参 酸枣仁 柏子仁 山药 天麻 鳖甲 火麻仁 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.929614 0.490465 0.551985 0.424161 0.300588 0.582249 0.465668 0.514034 0.343095 0.402586 0.431013
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
132. 
patient tongue id: 03062132360335_2
label yaofang:
甘草 白芍 川芎 香附 枳壳 黄芩 党参 白术 丹参 生地黄 菟丝子 桑寄生
0.71814 0.40105 0.369754 0.444712 0.362192
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
133. 
patient tongue id: 05042027328961_6_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 蝉蜕 炙甘草
0.345454 0.374962 0.301259 0.352369 0.301889 0.304682 0.534732
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
134. 
patient tongue id: 01250705332646_2_7_6
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 知母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.861927 0.359486 0.427804 0.508024 0.392492 0.436616 0.386973
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.333333, error: 0.285714
135. 
patient tongue id: 05102157522625_1_2
label yaofang:
法半夏 前胡 太子参 细辛 干姜 砂仁 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 麸炒白术
0.347904 0.702708 0.406063 0.867346 0.519529 0.688137 0.33718 0.367321 0.367486 0.412467 0.767292 0.77587 0.697703 0.793016 0.341565 0.884885 0.417559 0.680237 0.536682 0.645163
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
136. 
patient tongue id: 03022137597482_6
label yaofang:
柴胡 陈皮 当归 龙骨 党参 黄芪 白术 车前子 砂仁 升麻 炙甘草
0.666137 0.397349 0.356725 0.439352 0.379372 0.301525
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
137. 
patient tongue id: 02182019245594_7_1
label yaofang:
甘草 党参 酸枣仁 杜仲 牛膝 乌药 山茱萸 天麻 桑寄生 金樱子 桑螵蛸 锁阳 益智 首乌藤
0.885756 0.30641 0.478939 0.511718 0.408059 0.511426 0.370582 0.429245 0.311825 0.318709
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
138. 
patient tongue id: 01192135351045_2_6
label yaofang:
甘草 茯苓 酸枣仁 丹参 赤芍 杜仲 黄柏 知母 天麻 僵蚕 桑寄生 淫羊藿 仙茅 浮小麦
0.993739 0.558673 0.650706 0.418948 0.372444 0.362274 0.328841 0.789747 0.672813 0.701016 0.500427 0.602538 0.643216
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
139. 
patient tongue id: 06190128269523_1_4
label yaofang:
甘草 茯苓 前胡 桔梗 薄荷 鱼腥草 桑叶 瓜蒌皮 紫菀 麦芽 苦杏仁 炙麻黄
0.979854 0.540554 0.313106 0.5844 0.423401 0.32369 0.31763 0.324339 0.686345 0.593262 0.615854 0.447445 0.520906 0.531949
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.142857, recall: 0.166667, error: 0.857143
140. 
patient tongue id: 05172100312708_2_6_7
label yaofang:
甘草 白芍 党参 白术 丹参 生地黄 熟附子 山茱萸 大黄 菟丝子 桑寄生 益母草 火麻仁 补骨脂
0.95362 0.304492 0.507992 0.553739 0.405053 0.593915 0.501633 0.529928 0.374009 0.441019 0.446106
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
141. 
patient tongue id: 04122158242782_6_4
label yaofang:
甘草 独活 党参 白术 延胡索 川楝子 杜仲 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.873394 0.485844 0.47824 0.400619 0.419421 0.310028 0.393659
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.857143, recall: 0.428571, error: 0.142857
142. 
patient tongue id: 01041817323239_4_1
label yaofang:
甘草 薏苡仁 黄芪 滑石 豆蔻 萹蓄 焦栀子 干鱼腥草 麸炒白术 川木通 车前草
0.375472 0.663788 0.395163 0.837779 0.461722 0.676494 0.329836 0.383654 0.382537 0.414852 0.720417 0.744445 0.666256 0.767488 0.336175 0.857663 0.432949 0.655515 0.561449 0.632376
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
143. 
patient tongue id: 04232023543639_4_2
label yaofang:
麻黄 桂枝 陈皮 茯苓 连翘 薏苡仁 白术 泽泻 车前子 莱菔子 防己 赤小豆 茯苓皮 猪苓 鸡内金 广藿香 土茯苓
0.541819 0.361459 0.372959 0.309038 0.562554 0.586351 0.319959 0.474938 0.327582 0.336057 0.382614 0.375654
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.250000, recall: 0.176471, error: 0.750000
144. 
patient tongue id: 03312025598943_1_4
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 郁金 砂仁 鳖甲 款冬花 扁豆花 莪术 紫菀 麦芽 苦杏仁 白花蛇舌 天山雪莲
0.993773 0.551394 0.628358 0.404436 0.325245 0.340167 0.767477 0.660698 0.697195 0.490527 0.591568 0.612634
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
145. 
patient tongue id: 01092344547222_2_4
label yaofang:
白芍 葛根 钩藤 桑叶 石斛 秦皮 决明子 蒺藜 化橘红
0.392594 0.350777 0.363364 0.329154 0.384948
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.111111, error: 0.800000
146. 
patient tongue id: 02281833026313_1
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.684083 0.393111 0.431368 0.383402 0.31659
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
147. 
patient tongue id: 03261651213449_4
label yaofang:
甘草 前胡 荆芥 防风 牛蒡子 鱼腥草 浙贝母 桑白皮 紫菀 枇杷叶 紫苏叶 东风桔
0.408356 0.345669 0.322732 0.3517 0.349121 0.409611
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
148. 
patient tongue id: 02211414567789_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.426048 0.380934 0.326667 0.344657 0.539001 0.301997
predicted yaofang:
法半夏 茯苓 前胡 防风 炙甘草 广藿香

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
149. 
patient tongue id: 06082013159792_1_7
label yaofang:
甘草 半夏 桃仁 蒲公英 党参 黄芪 白术 厚朴 砂仁 僵蚕 莪术 柿蒂 北沙参 赭石 蛇舌草
0.5232 0.391452 0.322637 0.452812 0.501681 0.345212 0.327362
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.857143, recall: 0.400000, error: 0.142857
150. 
patient tongue id: 03041418156287_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 黄连 生地黄 牡丹皮 黄柏 知母 山药 浮小麦 土鳖虫
0.925824 0.326664 0.495061 0.550374 0.396882 0.301773 0.581032 0.452353 0.49102 0.332384 0.389539 0.402526
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
151. 
patient tongue id: 01201315373811_1_2_7
label yaofang:
甘草 法半夏 桔梗 黄芪 浙贝母 天麻 鳖甲 款冬花 紫菀 苦杏仁 黄精 蜈蚣 天山雪莲 半枝莲
0.978904 0.528751 0.590244 0.41909 0.316097 0.320196 0.316127 0.676827 0.576225 0.609382 0.433745 0.507361 0.520439
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
152. 
patient tongue id: 02252105083929_6
label yaofang:
甘草 白术 酸枣仁 牡丹皮 山药 山茱萸 天麻 地骨皮 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.94509 0.314364 0.494095 0.557579 0.420298 0.306039 0.311332 0.301543 0.608859 0.507346 0.550988 0.381736 0.448944 0.477869
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.714286, recall: 0.714286, error: 0.285714
153. 
patient tongue id: 01041634080726_1_4
label yaofang:
甘草 浙贝母 牛膝 苍术 干姜 淡竹叶 生石膏 豆蔻 姜半夏 川木通 龙脷叶 苹果
0.456338 0.329049 0.324501 0.374096 0.406438 0.322247
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
154. 
patient tongue id: 05261926040678_4
label yaofang:
龙骨 牡蛎 芦根 薏苡仁 酸枣仁 车前子 厚朴 荷叶 赤小豆 茵陈 香薷 布渣叶 木棉花
0.944388 0.312741 0.508647 0.561059 0.417631 0.32717 0.32715 0.32004 0.624469 0.52057 0.549658 0.399418 0.459646 0.478069
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.071429, recall: 0.076923, error: 0.928571
155. 
patient tongue id: 05092123045090_1_2_6
label yaofang:
甘草 白芍 党参 生地黄 赤芍 山药 天麻 鳖甲 王不留行 女贞子 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.96312 0.309834 0.517689 0.562429 0.390746 0.306737 0.319208 0.630676 0.532393 0.550877 0.406065 0.473034 0.479231
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.666667, error: 0.230769
156. 
patient tongue id: 01012106412464_1_6_8
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.308443 0.44619 0.413378 0.498359 0.328158 0.446123 0.331501 0.407294 0.411125 0.410051 0.471229 0.358559 0.595829 0.304791 0.404754 0.325998 0.355422
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.117647, recall: 0.153846, error: 0.882353
157. 
patient tongue id: 06071942591234_1_5
label yaofang:
甘草 法半夏 茯苓 桔梗 牛蒡子 党参 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.950206 0.32971 0.496833 0.569355 0.407905 0.311226 0.59937 0.491177 0.536817 0.363697 0.433577 0.446876
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
158. 
patient tongue id: 01042354227001_4_6
label yaofang:
甘草 羌活 独活 桃仁 丹参 赤芍 郁金 苍术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.977307 0.530301 0.589426 0.412175 0.326491 0.324582 0.314102 0.686595 0.584454 0.616557 0.440464 0.518975 0.549416
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
159. 
patient tongue id: 04061833511919_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.324098 0.316406 0.451675 0.431806 0.489337 0.348578 0.431608 0.300927 0.309813 0.418339 0.413938 0.385868 0.440174 0.36709 0.57688 0.300014 0.424651 0.312453 0.359029
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
160. 
patient tongue id: 01172229586605_1_6
label yaofang:
甘草 茯苓 党参 酸枣仁 丹参 生地黄 天麻 鳖甲 补骨脂 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.96919 0.529408 0.581947 0.411577 0.333248 0.330503 0.312896 0.661025 0.55898 0.585845 0.426736 0.491562 0.524227
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.733333, error: 0.153846
161. 
patient tongue id: 03281928289799_2
label yaofang:
甘草 白芍 陈皮 黄芩 当归 麦冬 黄连 熟地黄 郁金 茵陈 鸡内金 虎杖 黄精
0.966637 0.521753 0.562509 0.390359 0.302365 0.636096 0.507264 0.539444 0.374832 0.438282 0.438266
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.076923, error: 0.909091
162. 
patient tongue id: 01192234341547_1_6
label yaofang:
甘草 川芎 当归 桃仁 党参 酸枣仁 生地黄 红花 赤芍 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.941858 0.310152 0.503957 0.543963 0.404427 0.303804 0.323339 0.301919 0.597675 0.501131 0.537918 0.385621 0.445437 0.459087
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.714286, recall: 0.666667, error: 0.285714
163. 
patient tongue id: 03161711331590_2_1
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.310825 0.583599 0.406779 0.736865 0.410596 0.583509 0.300019 0.318335 0.325522 0.352653 0.616129 0.638688 0.550014 0.657449 0.319868 0.819659 0.335945 0.597507 0.454974 0.540147
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
164. 
patient tongue id: 02131324588140_1_2
label yaofang:
柴胡 茯苓 黄芪 茵陈 白花蛇舌草
0.341128 0.310083 0.355635 0.395346
predicted yaofang:
甘草 白芍 党参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
165. 
patient tongue id: 02191214392604_4
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 浙贝母 细辛 桑白皮 款冬花 紫菀 苇茎 北沙参 苦杏仁
0.931893 0.323569 0.484448 0.55442 0.416904 0.587409 0.483255 0.525255 0.361583 0.423615 0.448104
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
166. 
patient tongue id: 06170910304570_1_7_4
label yaofang:
甘草 牡蛎 蒲公英 黄芪 白术 丹参 延胡索 浙贝母 郁金 桑寄生 王不留行 北沙参 续断 橘络
0.622109 0.429145 0.317975 0.308445 0.31675
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
167. 
patient tongue id: 03022128075146_6_2
label yaofang:
黄芩 茯苓 栀子 杜仲 牛膝 钩藤 天麻 石决明 桑寄生 首乌藤 玉米须
0.487825 0.314477 0.35412 0.358141 0.354438 0.310398
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
168. 
patient tongue id: 03231441188626_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.343169 0.618953 0.404272 0.779256 0.433685 0.614509 0.320499 0.372711 0.359463 0.388616 0.658986 0.676059 0.587733 0.68866 0.328172 0.828806 0.384575 0.616761 0.481759 0.567803
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
169. 
patient tongue id: 02272229304722_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.319905 0.361339 0.48068 0.318448 0.306242 0.325011 0.536943 0.666704
predicted yaofang:
甘草 柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
170. 
patient tongue id: 03021119302300_1_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.447623 0.357243 0.335241 0.392204 0.38996
predicted yaofang:
甘草 白芍 茯苓 党参 炙甘草

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
171. 
patient tongue id: 03311824371655_1_4
label yaofang:
茯苓 麦冬 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 炙甘草 制远志 干石斛 煅龙骨 炒酸枣仁
0.330206 0.801411 0.356448 0.935265 0.540142 0.776375 0.313073 0.35111 0.372983 0.412703 0.840309 0.857803 0.763612 0.856492 0.954125 0.423823 0.772425 0.596568 0.685511
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.157895, recall: 0.214286, error: 0.842105
172. 
patient tongue id: 02271823498177_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 薄荷 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.335315 0.707375 0.384794 0.865858 0.48515 0.69341 0.31173 0.35818 0.361577 0.395102 0.749226 0.760591 0.681728 0.779171 0.309341 0.8874 0.414799 0.671837 0.539616 0.623043
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
173. 
patient tongue id: 03312114024951_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 蒲公英 党参 砂仁 五灵脂 麦芽 佛手 紫苏梗 广藿香 鱼古
0.954039 0.500444 0.57182 0.428796 0.303828 0.303766 0.619803 0.515021 0.5496 0.383869 0.447067 0.474423
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
174. 
patient tongue id: 05222104225178_4_1
label yaofang:
陈皮 当归 黄芪 白术 杜仲 苍术 厚朴 生半夏 僵蚕 鸡内金 枇杷叶 红豆杉 山慈菇 稻芽
0.453297 0.335952 0.403813 0.610706 0.618342 0.301437 0.325977 0.516702 0.351608 0.36753 0.402694 0.419899
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
175. 
patient tongue id: 05290804591784_1_2
label yaofang:
甘草 陈皮 大枣 薏苡仁 党参 黄芪 山药 砂仁 茵陈 扁豆花 麦芽 北沙参 白扁豆
0.960125 0.326244 0.515968 0.561091 0.401881 0.301324 0.317249 0.303154 0.614802 0.530283 0.556148 0.406706 0.471363 0.481254
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.214286, recall: 0.230769, error: 0.785714
176. 
patient tongue id: 04182150498249_1_2
label yaofang:
甘草 法半夏 茯苓 桔梗 芦根 党参 黄连 浙贝母 砂仁 鳖甲 紫苏梗 广藿香 白花蛇舌 蜂房 四季青
0.94194 0.486219 0.552635 0.415003 0.574474 0.426929 0.490616 0.303564 0.362176 0.374782
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
177. 
patient tongue id: 05172127236353_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 牛蒡子 浙贝母 款冬花 枇杷叶 白花蛇舌草 苦杏仁 紫苏子 蜜麻黄 醋鳖甲
0.955037 0.503707 0.308167 0.581051 0.437117 0.338569 0.325296 0.33316 0.651983 0.552293 0.583785 0.424486 0.48779 0.522689
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.142857, recall: 0.133333, error: 0.857143
178. 
patient tongue id: 03211948021260_6_1
label yaofang:
甘草 川芎 香附 陈皮 枳壳 茯苓 葛根 龙骨 牡蛎 远志 党参 白术 酸枣仁 柏子仁 延胡索 海螵蛸 竹茹 车前子 姜半夏 紫苏梗 瓦楞子 猫爪草
0.335011 0.439806 0.302395 0.378992 0.310376 0.519088 0.63216
predicted yaofang:
柴胡 白芍 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.136364, error: 0.571429
179. 
patient tongue id: 04282013247881_4_1_6
label yaofang:
甘草 陈皮 法半夏 茯苓 木香 党参 白术 黄连 厚朴 佩兰 砂仁 扁豆花 柿蒂 豆蔻 麦芽 紫苏梗 稻芽
0.914599 0.323678 0.465214 0.524519 0.416697 0.484243 0.389996 0.471754 0.335283 0.337354
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.235294, error: 0.600000
180. 
patient tongue id: 05171900213570_1
label yaofang:
陈皮 茯苓 前胡 防风 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.33713 0.814387 0.342857 0.948523 0.530385 0.802742 0.321097 0.383009 0.384808 0.426176 0.85561 0.878017 0.785002 0.875959 0.968268 0.427882 0.797213 0.607516 0.71465
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 0.937500, error: 0.210526
181. 
patient tongue id: 01200707054893_6_2_1
label yaofang:
甘草 白芍 枳壳 当归 连翘 远志 党参 白术 莱菔子 天麻 巴戟天 鳖甲 蜈蚣 白花蛇舌 半枝莲 龙葵果
0.909965 0.494568 0.527923 0.449087 0.305715 0.317593 0.555138 0.409742 0.490598 0.300108 0.345783 0.379997
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
182. 
patient tongue id: 03100519356133_1_2_5
label yaofang:
甘草 薏苡仁 远志 党参 酸枣仁 地黄 天麻 滑石 白花蛇舌草 板蓝根 浮小麦 蜈蚣 半枝莲 醋鳖甲 大青叶
0.679879 0.414688 0.403642 0.375685 0.500218 0.33875
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
183. 
patient tongue id: 03101915299969_6_4
label yaofang:
甘草 柴胡 川芎 香附 防风 赤芍 荆芥穗 白芷 蔓荆子 郁李仁 芥子
0.678711 0.382771 0.442727 0.422802 0.333991
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
184. 
patient tongue id: 05032246351434_2_7_4
label yaofang:
甘草 黄芪 丹参 生地黄 山药 山茱萸 泽泻 车前子 天麻 鳖甲 皂角刺 鹿角霜 蜈蚣 天山雪莲 半枝莲
0.974131 0.32267 0.52642 0.601798 0.408959 0.350537 0.353686 0.323855 0.695702 0.606113 0.621141 0.47384 0.547867 0.571603
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.571429, recall: 0.533333, error: 0.428571
185. 
patient tongue id: 01052157043253_3_1
label yaofang:
甘草 白芍 茯苓 黄芪 白术 海螵蛸 浙贝母 附子 水蛭 厚朴 砂仁 猪苓 五指毛桃
0.719649 0.447731 0.426765 0.322611 0.409957 0.360331
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
186. 
patient tongue id: 05242245403295_1_2_7
label yaofang:
甘草 党参 白术 生地黄 红花 天麻 鳖甲 续断 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.939983 0.301745 0.488693 0.554093 0.421468 0.590219 0.483658 0.530065 0.362128 0.422909 0.440976
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
187. 
patient tongue id: 01032110326471_6_7_5
label yaofang:
甘草 黄芩 茯苓 桔梗 党参 白术 赤芍 浙贝母 杜仲 天麻 桑寄生 款冬花 地龙 苦杏仁 紫苏子
0.883109 0.471473 0.522401 0.406678 0.523783 0.390192 0.437747 0.328722 0.343319
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.555556, recall: 0.333333, error: 0.444444
188. 
patient tongue id: 03021849266294_1_5
label yaofang:
桃仁 黄芪 白术 海螵蛸 厚朴 砂仁 桑寄生 火麻仁 鸡内金 夏枯草 土鳖虫 合欢皮 路路通
0.436819 0.349296 0.349219 0.427018 0.318871
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
189. 
patient tongue id: 03132044584392_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.514766 0.359084 0.382134 0.40228 0.425077 0.380217 0.349847 0.386585 0.314106 0.304674 0.325329 0.330978
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻

------Score: precision: 0.666667, recall: 0.666667, error: 0.333333
190. 
patient tongue id: 03020759122561_1_7
label yaofang:
甘草 白芍 茯苓 党参 生地黄 山药 山茱萸 厚朴 肉苁蓉 火麻仁 制川乌 天山雪莲 牛大力
0.885227 0.32344 0.478661 0.534762 0.393315 0.526389 0.362877 0.422934 0.3052 0.313418
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.384615, error: 0.500000
191. 
patient tongue id: 05242233148828_6_4_2
label yaofang:
白芍 陈皮 木香 防风 白术 黄连 天麻 赤石脂 糯稻根 鳖甲 补骨脂 豆蔻 建曲 蜈蚣 天山雪莲 半枝莲
0.95121 0.313981 0.511741 0.55833 0.411538 0.304042 0.589032 0.499824 0.527866 0.378391 0.43474 0.442451
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
192. 
patient tongue id: 01130631066067_1_2_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 木香 太子参 白术 延胡索 川楝子 郁金 麦芽 姜黄 有瓜石斛
0.928601 0.300022 0.498645 0.50487 0.384419 0.538367 0.412687 0.472821 0.300237 0.348534 0.355795
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
193. 
patient tongue id: 03261704168767_5
label yaofang:
柴胡 香附 陈皮 半夏 玄参 黄连 枳实 川楝子 黄柏 莱菔子 火麻仁 扁豆花 鸡内金 虎杖
0.591241 0.390122 0.399593 0.407313 0.357813
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
194. 
patient tongue id: 04271840268152_4
label yaofang:
甘草 葶苈子 黄芪 枸杞子 赤芍 胆南星 浙贝母 附子 郁金 山茱萸 生半夏 全蝎 僵蚕 柿蒂 天竺黄 赭石 黑枣 土鳖虫 姜黄
0.610141 0.387138 0.354184 0.458082 0.560947 0.36237
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.105263, error: 0.666667
195. 
patient tongue id: 04201504029437_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.48905 0.36577 0.403808
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
196. 
patient tongue id: 05172141586339_6_2_4
label yaofang:
甘草 茯苓 龙骨 党参 枸杞子 酸枣仁 牡丹皮 山药 天麻 菟丝子 益母草 女贞子 浮小麦 墨旱莲
0.981212 0.508431 0.584735 0.425406 0.336552 0.318015 0.300771 0.727458 0.621637 0.662956 0.453811 0.550862 0.619877
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
197. 
patient tongue id: 04211334566729_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 苍耳子
0.354542 0.724712 0.390142 0.879941 0.491178 0.714329 0.330197 0.364975 0.361989 0.398165 0.767886 0.789779 0.706226 0.797635 0.327591 0.901447 0.431758 0.714837 0.565743 0.644952
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.750000, error: 0.400000
198. 
patient tongue id: 02251251184544_2_4
label yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.316583 0.553181 0.427639 0.663548 0.404744 0.541475 0.305458 0.322253 0.323342 0.351536 0.561512 0.564266 0.506271 0.57534 0.321987 0.725356 0.339743 0.539033 0.426133 0.492314
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
199. 
patient tongue id: 03290715081744_5
label yaofang:
甘草 黄芩 前胡 桔梗 薄荷 牛蒡子 桃仁 浙贝母 桑白皮 白前 枇杷叶 苦杏仁
0.72375 0.460633 0.412398 0.303786 0.35022
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
200. 
patient tongue id: 03240557245976_7_4_6
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 法半夏 大枣 茯苓 龙骨 牡蛎 远志 党参 丹参 干姜 浮小麦 首乌藤
0.95501 0.505352 0.552914 0.415874 0.301305 0.594176 0.512504 0.550635 0.389486 0.444542 0.451809
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
201. 
patient tongue id: 03231036155787_6_7
label yaofang:
甘草 白芍 川芎 香附 白术 丹参 牛膝 郁金 薤白 厚朴 砂仁 天麻 全蝎 瓜蒌皮 降香
0.951945 0.319563 0.501265 0.552414 0.409342 0.565567 0.480656 0.533539 0.347647 0.415007 0.427256
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
202. 
patient tongue id: 02141941567620_2
label yaofang:
法半夏 茯苓 前胡 党参 太子参 黄芪 枸杞子 白前 百部 豆蔻 北沙参 炙甘草 麸炒白术
0.367521 0.314357 0.473523 0.434358 0.527397 0.367596 0.455588 0.300857 0.305379 0.319392 0.458187 0.451835 0.423359 0.469769 0.32002 0.57444 0.315357 0.447999 0.341865 0.400315
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.615385, error: 0.600000
203. 
patient tongue id: 03221300257418_2_4
label yaofang:
甘草 茯苓 薏苡仁 党参 五味子 浙贝母 厚朴 淫羊藿 补骨脂 莪术 紫菀 仙茅 地龙 苦杏仁 鹿角霜 紫苏叶
0.965127 0.522111 0.57862 0.404734 0.320619 0.315808 0.309526 0.649253 0.537602 0.56297 0.405552 0.471818 0.489415
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.187500, error: 0.769231
204. 
patient tongue id: 01130644230738_6_4_1
label yaofang:
甘草 茯苓 木香 白术 黄连 山药 天麻 鳖甲 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.971247 0.521702 0.574477 0.395596 0.301883 0.309501 0.650152 0.551609 0.57323 0.415275 0.483514 0.49176
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
205. 
patient tongue id: 05232035293460_6
label yaofang:
柴胡 白芍 黄芩 茯苓 半夏 白术 丹参 赤芍 栀子 牡丹皮 郁金 淡豆豉 北沙参 炙甘草 百合 黑枣 预知子 素馨花
0.412716 0.333035 0.400178 0.588204 0.604763 0.487371 0.333003 0.306251 0.410319 0.39957
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.400000, recall: 0.222222, error: 0.600000
206. 
patient tongue id: 03180124022708_6_7
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 砂仁 鳖甲 白扁豆
0.414014 0.352746 0.323616 0.321253 0.315453 0.474065
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.666667, recall: 0.444444, error: 0.333333
207. 
patient tongue id: 02231804325623_4_1
label yaofang:
防风 党参 太子参 黄芪 枸杞子 山药 芡实 北沙参 麸炒白术
0.307045 0.378553 0.412398 0.315166 0.328607 0.321912 0.444978
predicted yaofang:
甘草 法半夏 茯苓 防风 黄芪 北沙参 炙甘草

------Score: precision: 0.428571, recall: 0.333333, error: 0.571429
208. 
patient tongue id: 04120820391824_1_2
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.424503 0.327451 0.462544 0.406762 0.433075 0.457192 0.424736 0.456911 0.378186 0.414537 0.430452 0.455164 0.322621 0.435793 0.425835 0.46892
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.250000, error: 0.812500
209. 
patient tongue id: 04142208536688_4_1_7
label yaofang:
桔梗 薏苡仁 黄芪 白术 海螵蛸 浙贝母 砂仁 鸡内金 紫苏梗 土鳖虫 红豆杉 山慈菇 蛇舌草
0.588483 0.391182 0.412581 0.401247 0.3403 0.327674
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
210. 
patient tongue id: 04260618151219_3_2
label yaofang:
甘草 茯苓 党参 生地黄 熟地黄 杜仲 山药 山茱萸 菟丝子 桑寄生 淫羊藿 女贞子 艾叶
0.894965 0.327771 0.464326 0.510491 0.394762 0.485417 0.360361 0.428368 0.30279
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
211. 
patient tongue id: 03291823106092_1_2
label yaofang:
甘草 白芍 川芎 荆芥 羌活 赤芍 牛膝 细辛 天麻 全蝎 白芷 白花蛇舌草 麦芽 醋鳖甲
0.744473 0.442404 0.419269 0.322491 0.327704
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
212. 
patient tongue id: 03282235551905_6_4
label yaofang:
柴胡 黄芩 葛根 羌活 党参 白术 泽泻 天麻 姜半夏 炙甘草 蒺藜 续断
0.316661 0.310678 0.422076 0.311488 0.312556 0.416403 0.636514
predicted yaofang:
甘草 柴胡 白芍 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
213. 
patient tongue id: 04182033523404_4_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 浮小麦 紫苏梗
0.355805 0.322234 0.416393 0.343117 0.31039 0.313783 0.40912 0.511397
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.454545, error: 0.375000
214. 
patient tongue id: 03020742579548_1_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 干姜 鸡内金
0.412799 0.321316 0.366793 0.337851 0.327148
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 1.000000, recall: 0.416667, error: 0.000000
215. 
patient tongue id: 06012008172050_1_6
label yaofang:
甘草 茯苓 桔梗 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.879104 0.353557 0.437083 0.508441 0.385675 0.467672 0.321456 0.404988
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.875000, recall: 0.500000, error: 0.125000
216. 
patient tongue id: 02182200263083_1
label yaofang:
甘草 川芎 茯苓 防风 党参 白术 五味子 荆芥穗 白芷 蔓荆子 皂角刺 辛夷 苍耳子 贯众
0.938929 0.319407 0.4869 0.535433 0.398104 0.541843 0.437523 0.4899 0.31948 0.377098 0.372988
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
217. 
patient tongue id: 04062012303238_6
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 延胡索 海螵蛸 郁金 大黄 豆蔻 姜半夏 炙甘草 紫苏梗
0.784151 0.313487 0.423642 0.449643 0.394247 0.360437 0.333797
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
218. 
patient tongue id: 03231039319133_2_6
label yaofang:
甘草 枸杞子 酸枣仁 生地黄 杜仲 山药 山茱萸 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲
0.974871 0.308278 0.524609 0.5903 0.418523 0.339594 0.343401 0.321656 0.675448 0.582309 0.610956 0.448895 0.521093 0.542604
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.642857, recall: 0.642857, error: 0.357143
219. 
patient tongue id: 01101810268548_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.36318 0.594116 0.42174 0.734605 0.449374 0.594486 0.343234 0.365746 0.360829 0.304152 0.389038 0.63306 0.64415 0.595161 0.667861 0.373368 0.763749 0.407662 0.579278 0.501314 0.568125
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
220. 
patient tongue id: 01190544545526_2_1
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 丹参 生地黄 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.943945 0.304672 0.482089 0.552576 0.409385 0.573346 0.453961 0.507779 0.327998 0.390919 0.404586
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
221. 
patient tongue id: 02191256242879_6_2
label yaofang:
甘草 柴胡 白芍 枳壳 木香 延胡索 郁金 天麻 鳖甲 鸡内金 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.948857 0.304318 0.512237 0.552921 0.403328 0.579192 0.461728 0.500875 0.337103 0.400339 0.424438
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
222. 
patient tongue id: 02171948475084_1_3
label yaofang:
甘草 柴胡 黄芩 半夏 党参 太子参 白芷 蔓荆子 北沙参 紫苏叶 黑枣
0.387891 0.335997 0.30349 0.351478 0.313565
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
223. 
patient tongue id: 03280636481037_4
label yaofang:
甘草 茯苓 蒲公英 山药 砂仁 黑枣
0.500702 0.37105 0.374499 0.406761 0.35021
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.333333, error: 0.600000
224. 
patient tongue id: 05191950495367_6_1
label yaofang:
甘草 柴胡 白芍 茯苓 远志 党参 丹参 胆南星 川楝子 山药 地黄 麦芽 合欢花
0.666595 0.329763 0.384282 0.436792 0.364961
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
225. 
patient tongue id: 01061611102009_5_6
label yaofang:
甘草 枳壳 茯苓 桔梗 党参 白术 丹参 黄连 浙贝母 郁金 山药 鳖甲 火麻仁 苦杏仁 白花蛇舌 天山雪莲
0.955244 0.516039 0.305012 0.569962 0.4204 0.331608 0.323125 0.32355 0.637316 0.521852 0.554016 0.393837 0.452064 0.477126
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.571429, recall: 0.500000, error: 0.428571
226. 
patient tongue id: 02202316267078_1_4_5
label yaofang:
甘草 黄芩 茯苓 薏苡仁 太子参 白术 莱菔子 鸡内金 枇杷叶 北沙参 木蝴蝶 稻芽
0.905899 0.496829 0.489955 0.41616 0.491917 0.41263 0.48408 0.311545 0.349338 0.356286
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.250000, error: 0.700000
227. 
patient tongue id: 03091828004400_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.377133 0.736979 0.357512 0.913214 0.497144 0.741478 0.30127 0.391565 0.392894 0.422631 0.805743 0.833901 0.737176 0.848818 0.301711 0.925133 0.449799 0.720945 0.598678 0.690109
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.733333, error: 0.450000
228. 
patient tongue id: 05191951153765_6_1
label yaofang:
甘草 柴胡 白芍 茯苓 远志 党参 丹参 胆南星 川楝子 山药 地黄 麦芽 合欢花
0.666595 0.329763 0.384282 0.436792 0.364961
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
229. 
patient tongue id: 01122226012738_6_7_1
label yaofang:
甘草 茯苓 木香 远志 党参 酸枣仁 丹参 生地黄 牡丹皮 山药 砂仁 鳖甲 鸡内金 麦芽
0.966283 0.519916 0.584781 0.412114 0.319345 0.3235 0.309076 0.64398 0.538278 0.563059 0.401417 0.477786 0.497086
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
230. 
patient tongue id: 05022032291976_2_1
label yaofang:
甘草 桔梗 芦根 太子参 浙贝母 鳖甲 北沙参 辛夷 苍耳子 白花蛇舌 天山雪莲 蜂房 岗梅根 四季青
0.969221 0.303818 0.518981 0.585187 0.405542 0.314942 0.647761 0.549965 0.576874 0.412756 0.489114 0.499734
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
231. 
patient tongue id: 05232124226417_1_3
label yaofang:
当归 茯苓 木香 远志 党参 黄芪 白术 龙眼肉 牛膝 山药 鸡内金 炙甘草 首乌藤 紫苏梗 合欢皮
0.89805 0.469284 0.515932 0.419524 0.540961 0.401997 0.463138 0.334759 0.352796
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
232. 
patient tongue id: 03311625244204_3
label yaofang:
牡蛎 黄芪 白术 熟地黄 杜仲 附子 山药 山茱萸 厚朴 当归尾 砂仁 磁石 火麻仁
0.468022 0.378403 0.32603 0.401754 0.399217
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
233. 
patient tongue id: 03312122456833_1_4
label yaofang:
甘草 茯苓 木香 远志 党参 白术 酸枣仁 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.978572 0.310321 0.531157 0.577731 0.408349 0.316258 0.666581 0.566105 0.607017 0.424454 0.497878 0.50999
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
234. 
patient tongue id: 02212105315037_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.361896 0.66288 0.388722 0.816769 0.471179 0.664852 0.338497 0.363929 0.38937 0.405441 0.708808 0.729468 0.660071 0.743006 0.330549 0.861377 0.422285 0.64642 0.552736 0.605531
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
235. 
patient tongue id: 04172224051765_2
label yaofang:
龙骨 牡蛎 芦根 枸杞子 酸枣仁 五味子 熟地黄 牛膝 山药 山茱萸 菟丝子 龟甲
0.505997 0.377361 0.3561 0.351342
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
236. 
patient tongue id: 04211333417870_1_2_4
label yaofang:
陈皮 法半夏 前胡 防风 太子参 黄芪 款冬花 紫菀 白前 百部 芡实 北沙参 炙甘草 炒紫苏子 麸炒白术
0.367968 0.784632 0.353833 0.941282 0.548773 0.78614 0.321932 0.406246 0.39556 0.443898 0.859251 0.874498 0.792546 0.882664 0.323006 0.952548 0.465691 0.7722 0.605555 0.736907
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
237. 
patient tongue id: 03282250569541_1
label yaofang:
甘草 黄芪 海螵蛸 肉桂 干姜 砂仁 附片 辛夷
0.329777 0.368075 0.458812 0.324035 0.329849 0.320827 0.355995 0.511395 0.584556
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.250000, error: 0.777778
238. 
patient tongue id: 03020852287112_4_6
label yaofang:
甘草 法半夏 茯苓 桔梗 白术 浙贝母 牡丹皮 地黄 白花蛇舌草 首乌藤 合欢花 醋鳖甲
0.99645 0.562397 0.64211 0.409036 0.370758 0.367023 0.313191 0.819839 0.695415 0.738807 0.510666 0.629467 0.678676
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.250000, error: 0.769231
239. 
patient tongue id: 06182034066055_1_4_6
label yaofang:
甘草 柴胡 茯苓 龙骨 牡蛎 党参 白术 丹参 砂仁 鸡内金 首乌藤 红豆杉 合欢皮
0.721374 0.408797 0.432483 0.322115 0.496134 0.318129 0.347836
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
240. 
patient tongue id: 04132031056516_2_5
label yaofang:
甘草 独活 党参 鸡血藤 白术 丹参 生地黄 延胡索 细辛 桑寄生 麦芽 忍冬藤 骨碎补 络石藤
0.903238 0.490716 0.502581 0.364878 0.549528 0.401369 0.444813 0.346095 0.353989
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.214286, error: 0.666667
241. 
patient tongue id: 04202018543058_5_7_6
label yaofang:
甘草 茯苓 太子参 黄芪 白术 赤芍 浙贝母 砂仁 北沙参 辛夷 合欢皮 蛇舌草 鲜龙葵果
0.67156 0.382235 0.402711 0.448769
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.230769, error: 0.250000
242. 
patient tongue id: 02231753141451_4
label yaofang:
防风 薄荷 钩藤 荆芥穗 白芷 北柴胡 香薷 炙甘草 辛夷 首乌藤 广藿香 炒苍耳子 炒蔓荆子
0.359131 0.751988 0.366701 0.908138 0.503952 0.743324 0.316465 0.390332 0.397369 0.419477 0.801579 0.824134 0.734919 0.82733 0.304745 0.927703 0.449735 0.725994 0.588802 0.674007
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.384615, error: 0.750000
243. 
patient tongue id: 06091835387355_5
label yaofang:
甘草 白芍 当归 独活 党参 槟榔 乌药 钩藤 车前子 天麻 全蝎 肉苁蓉 火麻仁 姜半夏 瓜蒌子 制枳实
0.761402 0.324245 0.395347 0.489488 0.331875 0.419286
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
244. 
patient tongue id: 04181146080517_1_4_7
label yaofang:
甘草 枳壳 法半夏 当归 茯苓 木香 党参 黄芪 丹参 厚朴 鸡内金 草豆蔻 麦芽
0.457122 0.325261 0.302509 0.397378 0.370711 0.310085 0.337518
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.714286, recall: 0.384615, error: 0.285714
245. 
patient tongue id: 03180146151142_4
label yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 泽泻 豆蔻 姜半夏 炙甘草 紫苏梗
0.494649 0.321076 0.336654 0.383974 0.366561
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
246. 
patient tongue id: 04202107116563_4_6_1
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 炙甘草 百合 紫苏叶 山慈菇
0.580976 0.30364 0.378401 0.440163 0.334902
predicted yaofang:
甘草 白芍 茯苓 党参 天麻

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
247. 
patient tongue id: 06012053318692_1_2
label yaofang:
甘草 白芍 枳壳 半夏 太子参 黄芪 白术 厚朴 肉苁蓉 莪术 麦芽 蜈蚣 合欢皮 预知子 蛇舌草
0.498923 0.351568 0.396673 0.570361 0.640993 0.325593 0.488466 0.349631 0.334609 0.316325 0.407124 0.404641
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 杜仲 厚朴 砂仁 僵蚕 莪术 北沙参 合欢皮

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
248. 
patient tongue id: 04291449031355_7_1
label yaofang:
甘草 柴胡 白芍 薏苡仁 桃仁 远志 天麻 白花蛇舌草 佛手 浮小麦 蜈蚣 合欢花 半枝莲 醋鳖甲
0.958666 0.500022 0.561313 0.450689 0.302243 0.621902 0.522299 0.58884 0.381796 0.44785 0.491086
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
249. 
patient tongue id: 04221912060492_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 蝉蜕 炙甘草 辛夷 广藿香 地肤子 炒紫苏子 蜜麻黄
0.336708 0.597013 0.416534 0.759195 0.43998 0.600141 0.310715 0.353101 0.345672 0.375934 0.644487 0.659164 0.567241 0.674917 0.332269 0.79424 0.370788 0.594188 0.459486 0.56079
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.875000, error: 0.300000
250. 
patient tongue id: 03141235168908_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.462261 0.337776 0.40837 0.303631
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
251. 
patient tongue id: 03311656518135_7_6
label yaofang:
白芍 当归 党参 枸杞子 丹参 熟地黄 砂仁 菟丝子 蛇床子 鹿角霜 酒萸肉
0.387643 0.333347 0.357023 0.376113 0.671061
predicted yaofang:
白芍 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
252. 
patient tongue id: 02181604218231_6_2_4
label yaofang:
甘草 法半夏 茯苓 桔梗 酸枣仁 浙贝母 杜仲 天麻 鳖甲 紫菀 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.974076 0.533538 0.588132 0.42215 0.325458 0.326147 0.321828 0.675321 0.583242 0.615198 0.443522 0.522037 0.549572
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
253. 
patient tongue id: 02261801151849_5_1
label yaofang:
甘草 黄芩 桔梗 乌梅 白茅根 细辛 白芷 蔓荆子 麦芽 皂角刺 辛夷 广藿香 苍耳子 蜂房
0.320449 0.590853 0.427657 0.739743 0.422303 0.522043 0.309465 0.326633 0.615603 0.596676 0.469743 0.557447 0.698308 0.302654 0.541911 0.398159
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.375000, recall: 0.428571, error: 0.625000
254. 
patient tongue id: 05172102276630_2
label yaofang:
甘草 薏苡仁 天麻 鳖甲 款冬花 莪术 紫菀 苦杏仁 紫苏子 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.899574 0.483385 0.508245 0.387936 0.487549 0.400437
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
255. 
patient tongue id: 06182217271481_4
label yaofang:
甘草 茯苓 前胡 桔梗 薄荷 芦根 鱼腥草 桑叶 瓜蒌皮 紫菀 苦杏仁 白花龙胆
0.914134 0.371999 0.447954 0.526565 0.391169 0.479911 0.371977 0.454892 0.321864 0.315029
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.166667, error: 0.800000
256. 
patient tongue id: 03111503259649_1_5
label yaofang:
桂枝 甘草 白芍 大枣 茯苓 木香 党参 白术 山药 砂仁 扁豆花 麦芽 白扁豆 木棉花
0.885914 0.306369 0.47077 0.5017 0.430396 0.492883 0.414634 0.487471 0.303265 0.351996 0.367886
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
257. 
patient tongue id: 04150416542948_6_4
label yaofang:
甘草 香附 法半夏 茯苓 党参 白术 酸枣仁 丹参 赤芍 青皮 郁金 砂仁 天花粉 瓜蒌皮 王不留行
0.954543 0.314291 0.510919 0.574806 0.408661 0.318573 0.323998 0.307357 0.631716 0.536604 0.557095 0.409967 0.472162 0.489953
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.333333, error: 0.642857
258. 
patient tongue id: 03021828450615_4
label yaofang:
茯苓 防风 薄荷 钩藤 荆芥穗 白芷 北柴胡 香薷 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.316973 0.892192 0.317488 0.983394 0.611679 0.871457 0.388754 0.386166 0.438072 0.9302 0.947197 0.869429 0.943734 0.988502 0.462875 0.865616 0.651115 0.807598
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.277778, recall: 0.357143, error: 0.722222
259. 
patient tongue id: 06010340354023_6_4
label yaofang:
甘草 茯苓 党参 赤芍 郁金 山药 天麻 鳖甲 虎杖 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.766882 0.336817 0.415542 0.452842 0.391793 0.343333 0.319855
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
260. 
patient tongue id: 01211213086112_5
label yaofang:
白芍 当归 麦冬 党参 白术 五味子 熟地黄 杜仲 肉苁蓉 巴戟天 补骨脂
0.43044 0.386367 0.323253 0.343579 0.316363 0.486769
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.272727, error: 0.500000
261. 
patient tongue id: 03231223492261_4
label yaofang:
陈皮 法半夏 前胡 太子参 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 麸炒白术 甘松
0.317693 0.533553 0.429754 0.660008 0.396409 0.51545 0.322052 0.31805 0.339861 0.557147 0.568039 0.464348 0.553818 0.723829 0.311152 0.518449 0.342345 0.444818
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.642857, error: 0.500000
262. 
patient tongue id: 05162103334972_6
label yaofang:
甘草 桃仁 党参 白术 酸枣仁 红花 延胡索 杜仲 牛膝 山茱萸 桑寄生 补骨脂 续断 牛大力
0.96384 0.30347 0.524735 0.559004 0.404951 0.303412 0.312311 0.30376 0.627663 0.542084 0.565794 0.416774 0.478345 0.478359
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.285714, error: 0.714286
263. 
patient tongue id: 04121854263775_5_1
label yaofang:
甘草 茯苓 半夏 薏苡仁 蒲公英 白术 赤芍 浙贝母 郁金 砂仁 莪术 北沙参 半枝莲 姜黄 预知子 鸡骨草
0.530286 0.316855 0.377433 0.398815 0.312303
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
264. 
patient tongue id: 02191235503344_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.369079 0.790246 0.353904 0.937897 0.526165 0.789537 0.320884 0.396909 0.39365 0.442036 0.848129 0.866381 0.782639 0.874484 0.304468 0.950641 0.469651 0.772771 0.620439 0.716524
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
265. 
patient tongue id: 04241838015858_4_6
label yaofang:
大枣 当归 木香 远志 党参 黄芪 白术 酸枣仁 柏子仁 覆盆子
0.34383 0.343806 0.451905 0.330231 0.30984 0.308464 0.461087 0.595242
predicted yaofang:
甘草 柴胡 白芍 党参 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.100000, error: 0.875000
266. 
patient tongue id: 04020815397570_1_2
label yaofang:
甘草 茯苓 桔梗 浙贝母 乌梅 郁金 山药 诃子 白花蛇舌草 紫苏梗 广藿香 蜈蚣 醋鳖甲
0.95924 0.309382 0.505351 0.559327 0.419076 0.3049 0.309982 0.611928 0.502102 0.541742 0.37855 0.439816 0.454717
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
267. 
patient tongue id: 03090805013513_7_1_6
label yaofang:
甘草 龙骨 党参 丹参 砂仁 天麻 白花蛇舌草 佛手 浮小麦 首乌藤 蜈蚣 醋香附 半枝莲 醋鳖甲
0.971297 0.511411 0.548439 0.457791 0.30933 0.657411 0.554922 0.633397 0.397729 0.482667 0.530913
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
268. 
patient tongue id: 06132001208316_1_7_4
label yaofang:
茯苓 薏苡仁 黄芪 枸杞子 白术 海螵蛸 浙贝母 杜仲 山茱萸 厚朴 生半夏 砂仁 桑寄生 莪术 柿蒂 炙甘草 蜈蚣 土鳖虫 守宫
0.661681 0.415417 0.381934 0.375811 0.462196
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.157895, error: 0.400000
269. 
patient tongue id: 04122151044517_6
label yaofang:
甘草 茯苓 连翘 党参 白术 酸枣仁 浙贝母 郁金 山药 天麻 扁豆花 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.866607 0.446299 0.508528 0.43875 0.301692 0.522538 0.394755
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 1.000000, recall: 0.466667, error: 0.000000
270. 
patient tongue id: 06062300403636_2_6
label yaofang:
甘草 茯苓 木香 龙骨 党参 太子参 酸枣仁 丹参 黄连 生地黄 山茱萸 火麻仁 补骨脂 浮小麦
0.866035 0.322543 0.462934 0.503303 0.422044 0.463236 0.341807 0.429313
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
271. 
patient tongue id: 04291616571593_6_4
label yaofang:
甘草 玉竹 太子参 鸡血藤 生地黄 砂仁 天麻 鳖甲 麦芽 北沙参 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.922837 0.492756 0.53652 0.390549 0.564485 0.427453 0.473578 0.310209 0.363725 0.371386
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.437500, error: 0.300000
272. 
patient tongue id: 01312301217045_6_2
label yaofang:
甘草 法半夏 桔梗 党参 酸枣仁 丹参 浙贝母 牡丹皮 薤白 水蛭 瓜蒌皮 浮小麦 合欢花 麸炒枳壳
0.979807 0.544252 0.571229 0.409848 0.305144 0.315318 0.30581 0.663576 0.564885 0.60297 0.423657 0.49685 0.505114
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
273. 
patient tongue id: 04111902215273_1
label yaofang:
白芍 川芎 当归 防风 太子参 黄芪 丹参 钩藤 天麻 白芷 石决明 炙甘草 首乌藤 广藿香 炒蔓荆子 棉萆薢
0.358178 0.808991 0.342409 0.950541 0.548661 0.804397 0.313846 0.416483 0.41519 0.456897 0.863992 0.889237 0.791995 0.887426 0.963485 0.469959 0.793987 0.610855 0.732213
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.263158, recall: 0.312500, error: 0.736842
274. 
patient tongue id: 03012251266435_1_4_2
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 延胡索 川楝子 天麻 鳖甲 豆蔻 浮小麦 威灵仙 蜈蚣 白花蛇舌 红豆杉
0.969218 0.519589 0.579058 0.358467 0.653763 0.406009 0.44828 0.319355 0.323752
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.400000, error: 0.333333
275. 
patient tongue id: 04291628432035_1_2_6
label yaofang:
甘草 枳壳 茯苓 党参 白术 浙贝母 槟榔 郁金 砂仁 鳖甲 火麻仁 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲 稻芽
0.916823 0.335141 0.494658 0.510842 0.394608 0.497184 0.417191 0.469471 0.310097 0.362164 0.359424
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.470588, error: 0.272727
276. 
patient tongue id: 06092003461762_1_4_7
label yaofang:
甘草 陈皮 当归 茯苓 半夏 独活 党参 黄芪 阿胶 丹参 杜仲 牛膝 苍术 天麻 僵蚕 桑寄生 紫苏叶 姜黄
0.521024 0.392741 0.338059 0.451584 0.490278 0.3503
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.222222, error: 0.333333
277. 
patient tongue id: 02242034107233_6_4
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.439287 0.386504 0.328684 0.332768
predicted yaofang:
甘草 茯苓 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
278. 
patient tongue id: 05022111397393_4_6
label yaofang:
甘草 白芍 川芎 香附 法半夏 茯苓 桔梗 白术 生地黄 浙贝母 菟丝子 续断
0.939973 0.326585 0.487772 0.543553 0.390996 0.591019 0.496945 0.528064 0.369699 0.433064 0.449807
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.333333, error: 0.636364
279. 
patient tongue id: 04112300263972_1
label yaofang:
甘草 白芍 川芎 独活 柏子仁 牛膝 细辛 干姜 补骨脂 蜈蚣 姜黄 鹿衔草
0.305253 0.434508 0.387052 0.343518 0.52569 0.724685
predicted yaofang:
柴胡 白芍 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
280. 
patient tongue id: 02182304131167_1_6
label yaofang:
甘草 白芍 党参 酸枣仁 柏子仁 山药 荆芥穗 鳖甲 王不留行 桑螵蛸 麦芽 益智 五倍子 首乌藤
0.92843 0.496821 0.561525 0.38473 0.324814 0.308646 0.603407 0.392865 0.432579 0.328092 0.351245
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
281. 
patient tongue id: 04272238542589_1_2
label yaofang:
陈皮 葛根 前胡 桔梗 防风 麦冬 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 干石斛
0.300761 0.752658 0.328363 0.904959 0.478838 0.732004 0.306605 0.368596 0.37684 0.788946 0.814886 0.711402 0.792041 0.947847 0.407323 0.718035 0.568178 0.602267
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.733333, error: 0.388889
282. 
patient tongue id: 06080120119386_1_4_6
label yaofang:
桂枝 甘草 柴胡 白芍 茯苓 桃仁 党参 青皮 浙贝母 牡丹皮 山药 菟丝子 益母草 王不留行 紫苏梗
0.976427 0.306196 0.518816 0.610082 0.425443 0.336549 0.340121 0.324582 0.69454 0.597276 0.628756 0.454479 0.535503 0.576292
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.333333, error: 0.642857
283. 
patient tongue id: 06190937484121_1_2_5
label yaofang:
甘草 茯苓 独活 党参 黄芪 生地黄 熟附子 牡丹皮 山药 山茱萸 泽泻 大黄 菟丝子 补骨脂 白花蛇舌 鹿衔草
0.981496 0.527623 0.597931 0.436932 0.329059 0.31806 0.325449 0.71227 0.610366 0.647263 0.456787 0.539331 0.578649
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.375000, error: 0.538462
284. 
patient tongue id: 03012047207357_6_2
label yaofang:
甘草 白芍 茯苓 桔梗 浙贝母 山茱萸 桑叶 荷叶 磁石 天花粉 白花蛇舌草 沙苑子 蜂房 醋鳖甲
0.973955 0.528768 0.585292 0.426845 0.331119 0.322407 0.317457 0.669776 0.570803 0.60431 0.435909 0.50142 0.526404
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.142857, error: 0.846154
285. 
patient tongue id: 04252307094175_1_6
label yaofang:
甘草 茯苓 桔梗 芦根 党参 浙贝母 山药 白茅根 鳖甲 诃子 麦芽 紫苏梗 木蝴蝶 白花蛇舌 天山雪莲
0.973358 0.523625 0.557597 0.437446 0.648545 0.555039 0.610371 0.403944 0.473835 0.50577
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.400000, error: 0.400000
286. 
patient tongue id: 01132150349279_1_6_2
label yaofang:
甘草 川芎 法半夏 桃仁 党参 枸杞子 白术 红花 赤芍 钩藤 天麻 决明子 地龙 首乌藤 沙苑子
0.979789 0.533183 0.60201 0.421335 0.340542 0.34437 0.327739 0.699282 0.601926 0.632999 0.459527 0.535357 0.567634
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
287. 
patient tongue id: 03111431335452_1_4
label yaofang:
甘草 党参 白术 郁金 山药 天麻 鳖甲 茵陈 扁豆花 莪术 豆蔻 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.833004 0.462185 0.43879 0.464824 0.402035 0.414671
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
288. 
patient tongue id: 02261000347820_6
label yaofang:
甘草 川芎 枳壳 茯苓 防风 白术 酸枣仁 生地黄 天麻 全蝎 槐花 火麻仁 浮小麦
0.824966 0.315783 0.43692 0.496747 0.412934 0.463128 0.313382 0.406882
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
289. 
patient tongue id: 03311630316639_1_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.368481 0.351051 0.448793 0.332946 0.329476 0.310961 0.446378 0.568181
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
290. 
patient tongue id: 03161305353494_2
label yaofang:
麻黄 陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 紫苏子 炙甘草
0.325786 0.603177 0.425066 0.748627 0.431597 0.595167 0.318647 0.352099 0.33843 0.368997 0.627533 0.650009 0.559368 0.659091 0.328402 0.80452 0.355276 0.606276 0.458085 0.547787
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
291. 
patient tongue id: 02141949377929_6
label yaofang:
黄连 肉桂 车前子 干姜 附片
0.336051 0.384518 0.362317 0.317309 0.385558 0.46644
predicted yaofang:
甘草 白芍 党参 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
292. 
patient tongue id: 01112026095793_1_2
label yaofang:
法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.423566 0.393233 0.306787 0.451799 0.385087 0.381797
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
293. 
patient tongue id: 05232034150661_7
label yaofang:
甘草 茯苓 薏苡仁 黄芪 白术 丹参 胆南星 浙贝母 杜仲 牛膝 僵蚕 莪术 桑枝 姜黄 蛇舌草
0.428695 0.349602 0.387164 0.565633 0.599491 0.454619 0.32268 0.410396 0.379483
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.444444, recall: 0.266667, error: 0.555556
294. 
patient tongue id: 03131955441685_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.454904 0.350715 0.323425 0.402309 0.37743 0.33125 0.330912
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
295. 
patient tongue id: 03291345193141_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 干姜 鳖甲 款冬花 白前 苦杏仁 炙麻黄 白花蛇舌
0.977397 0.529485 0.605194 0.407105 0.32745 0.331316 0.306726 0.689391 0.575573 0.596375 0.432202 0.505928 0.525666
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
296. 
patient tongue id: 05201514372587_6_7
label yaofang:
甘草 白芍 川芎 茯苓 远志 党参 黄芪 白术 酸枣仁 五味子 知母 山药 浮小麦 首乌藤 黄精
0.954994 0.317552 0.50159 0.552324 0.394842 0.59266 0.493616 0.526466 0.367987 0.432839 0.432835
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
297. 
patient tongue id: 04222131519793_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 蜜麻黄
0.35343 0.742867 0.375999 0.900247 0.506146 0.727743 0.329195 0.394129 0.379389 0.421814 0.792406 0.812949 0.712066 0.816582 0.316996 0.923625 0.430743 0.724474 0.554808 0.662343
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 1.000000, error: 0.350000
298. 
patient tongue id: 01122229280730_1_2
label yaofang:
甘草 葛根 黄芪 鸡血藤 天麻 菟丝子 益母草 白花蛇舌草 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲 酒黄精
0.96488 0.305494 0.508441 0.562957 0.395953 0.619564 0.519223 0.54897 0.384685 0.456892 0.469824
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
299. 
patient tongue id: 02241411508990_7_4
label yaofang:
当归 木香 党参 黄芪 鸡血藤 白术 丹参 柏子仁 砂仁 炙甘草 百合 紫苏叶
0.388917 0.319373 0.418146 0.355441 0.300889 0.365882 0.501616
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
300. 
patient tongue id: 05181046180565_1_2_4
label yaofang:
桂枝 甘草 白芍 党参 白术 酸枣仁 生地黄 红花 天麻 鳖甲 桑枝 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.985624 0.301276 0.539558 0.613401 0.406383 0.338212 0.344304 0.310721 0.715734 0.608761 0.635161 0.451168 0.54462 0.575646
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.857143, recall: 0.800000, error: 0.142857
301. 
patient tongue id: 04202038183361_9
label yaofang:
桂枝 甘草 牛蒡子 太子参 神曲 山楂 莪术 麦芽 甜杏仁 浮小麦
0.352567 0.315072 0.36372 0.525408
predicted yaofang:
白芍 党参 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
302. 
patient tongue id: 03231301104795_4_6
label yaofang:
甘草 茯苓 党参 黄芪 鸡血藤 生地黄 天麻 鳖甲 补骨脂 虎杖 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.960341 0.313208 0.521898 0.565028 0.416143 0.596199 0.514433 0.556562 0.379323 0.456016 0.47423
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
303. 
patient tongue id: 04132033420666_1_2_6
label yaofang:
甘草 茯苓 桔梗 半夏 橘红 白术 枇杷叶 北沙参 苦杏仁 炙麻黄 首乌藤 合欢皮
0.369812 0.350193 0.335214 0.556107
predicted yaofang:
茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
304. 
patient tongue id: 03221635111112_1_2_7
label yaofang:
茯苓 黄芪 白术 砂仁 天麻 菟丝子 桑寄生 鸡内金 首乌藤 蜈蚣 稻芽 罗布麻
0.477629 0.398459 0.316767 0.415796 0.329025 0.315517
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
305. 
patient tongue id: 03232306582218_3_2_7
label yaofang:
甘草 茯苓 独活 党参 黄芪 丹参 赤芍 山药 山茱萸 水蛭 桑寄生 补骨脂 鹿角霜 川加皮 牛大力
0.972204 0.527461 0.572181 0.435041 0.313306 0.304148 0.658192 0.549399 0.597605 0.404226 0.475756 0.507956
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
306. 
patient tongue id: 05130656261672_5_1_6
label yaofang:
甘草 法半夏 茯苓 龙骨 牡蛎 远志 党参 酸枣仁 丹参 黄连 郁金 山药 合欢花
0.971704 0.52606 0.589411 0.419821 0.315105 0.32433 0.304347 0.66328 0.575112 0.603532 0.434365 0.508292 0.527725
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.384615, error: 0.615385
307. 
patient tongue id: 04142219398324_1_7
label yaofang:
甘草 白芍 黄芪 白术 丹参 杜仲 牛膝 厚朴 砂仁 火麻仁 土鳖虫 宽筋藤 合欢皮
0.489551 0.347918 0.36946 0.373671 0.386718
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
308. 
patient tongue id: 01050637477034_1_6
label yaofang:
甘草 黄芩 白术 酸枣仁 生地黄 天麻 菟丝子 益母草 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.985768 0.541976 0.614743 0.406297 0.356539 0.353007 0.318045 0.739325 0.633767 0.655417 0.484222 0.570173 0.600342
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
309. 
patient tongue id: 03020756598060_1_6
label yaofang:
甘草 党参 酸枣仁 丹参 红花 浙贝母 天麻 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.964614 0.512265 0.301576 0.561069 0.44974 0.302532 0.322635 0.641486 0.547506 0.610125 0.406564 0.475924 0.518276
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
310. 
patient tongue id: 05172101267196_7_4_2
label yaofang:
甘草 白芍 独活 党参 白术 生地黄 红花 延胡索 细辛 桑寄生 锁阳 忍冬藤 续断 牛大力 千斤拔
0.896961 0.354989 0.409705 0.520693 0.394313 0.451158 0.407741
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
311. 
patient tongue id: 04190039340890_1_2
label yaofang:
当归 薏苡仁 太子参 黄芪 鸡血藤 白术 山楂 砂仁 鳖甲 补骨脂 鸡内金 女贞子 稻芽
0.360912 0.383751 0.429809 0.331386 0.363883 0.300899
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
312. 
patient tongue id: 02191211041298_6_4
label yaofang:
甘草 白芍 党参 白术 丹参 玄参 厚朴 天麻 火麻仁 决明子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.969565 0.529369 0.582319 0.421573 0.333826 0.328646 0.328642 0.66182 0.560054 0.588629 0.424748 0.491608 0.518681
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
313. 
patient tongue id: 02221318554290_1_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 车前子 干姜
0.505857 0.362469 0.369945 0.424816 0.329477 0.37791 0.348918 0.344168 0.323266 0.300954 0.352395
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 车前子 莱菔子 天麻

------Score: precision: 0.454545, recall: 0.416667, error: 0.545455
314. 
patient tongue id: 01250645156391_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 酸枣仁 赤芍 五灵脂 益母草 麦芽 合欢花 广金钱草 姜黄 炒鸡内金 石苇
0.966578 0.302135 0.517155 0.564923 0.400769 0.304286 0.626229 0.519896 0.554562 0.385855 0.45408 0.469169
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
315. 
patient tongue id: 04150319553994_6_2
label yaofang:
甘草 羌活 党参 白术 泽泻 砂仁 天麻 鳖甲 淫羊藿 女贞子 浮小麦 蜈蚣 天山雪莲 半枝莲 墨旱莲
0.946912 0.301743 0.507928 0.522745 0.395569 0.525794 0.419473 0.483473 0.354935 0.352932
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
316. 
patient tongue id: 05092050243059_2_7
label yaofang:
枳壳 太子参 白术 海螵蛸 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶 瓦楞子
0.721202 0.303766 0.37821 0.469865 0.347946 0.377176
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
317. 
patient tongue id: 05112018435829_6_7_2
label yaofang:
党参 浙贝母 当归尾 砂仁 菟丝子 莪术 王不留行 珍珠母 夏枯草 北沙参 续断 橘络 墨旱莲
0.597545 0.357236 0.400871 0.370013 0.426486
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
318. 
patient tongue id: 02211858489159_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.321634 0.310389 0.402036 0.323855 0.324954 0.340555 0.406349 0.545439
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
319. 
patient tongue id: 01202000433843_5_6
label yaofang:
甘草 桔梗 牡蛎 延胡索 浙贝母 山药 瓜蒌皮 北沙参 橘核 木蝴蝶 广金钱草 土茯苓 猫爪草
0.436438 0.428305 0.449863 0.437611 0.340289 0.383047 0.375865 0.367922 0.331027 0.353186 0.48489 0.377237
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
320. 
patient tongue id: 03311820527001_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 薄荷 白芷 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄
0.334179 0.62357 0.403523 0.768021 0.449508 0.611534 0.312807 0.342489 0.348792 0.385666 0.646994 0.670346 0.579743 0.665066 0.313748 0.825448 0.362229 0.620225 0.467022 0.544994
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
321. 
patient tongue id: 02240754470162_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.435869 0.335915 0.375336 0.393814 0.311352
predicted yaofang:
甘草 茯苓 党参 黄芪 牛膝

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
322. 
patient tongue id: 02181955128890_1_6_5
label yaofang:
白芍 陈皮 枳壳 当归 防风 连翘 党参 白术 黄连 乌梅 山药 干姜 仙鹤草 麦芽 皂角刺 炙甘草
0.949977 0.31834 0.480862 0.540472 0.395087 0.565639 0.450625 0.50261 0.324008 0.390927 0.399794
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
323. 
patient tongue id: 03081414219983_1_2
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.565446 0.359056 0.405158 0.445751 0.371576 0.412501 0.393719 0.402575 0.328428 0.351736 0.339775 0.388449 0.315023 0.312413
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 决明子 制何首乌

------Score: precision: 0.285714, recall: 0.307692, error: 0.714286
324. 
patient tongue id: 03020739223735_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.40974 0.51826 0.371064 0.446151 0.532959 0.514786 0.495514 0.439056 0.486164 0.466783 0.532309 0.350798 0.536555 0.524911 0.576886
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
325. 
patient tongue id: 03041057208346_1_4
label yaofang:
甘草 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 香薷 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.342098 0.772736 0.351758 0.924592 0.525436 0.765236 0.308242 0.383681 0.401663 0.433596 0.826681 0.846928 0.757538 0.850139 0.9475 0.442808 0.750967 0.586849 0.686369
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.421053, recall: 0.571429, error: 0.578947
326. 
patient tongue id: 06082040565305_2
label yaofang:
甘草 柴胡 龙骨 牡蛎 枸杞子 黄连 牡丹皮 杜仲 牛膝 知母 郁金 地骨皮 补骨脂 北沙参 续断 赭石 合欢皮
0.464436 0.398481 0.323207 0.458337 0.478149 0.323273 0.365536
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.117647, error: 0.714286
327. 
patient tongue id: 03032101574835_1_2
label yaofang:
当归 防风 黄芪 鸡血藤 白术 厚朴 火麻仁 鸡内金 女贞子 辛夷 紫苏叶 稻芽
0.300008 0.341101 0.509617 0.424825 0.625685 0.404851 0.51033 0.304195 0.333197 0.342044 0.34784 0.53651 0.552033 0.480919 0.553501 0.32023 0.673009 0.350128 0.515085 0.388396 0.457182
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.095238, recall: 0.166667, error: 0.904762
328. 
patient tongue id: 04111857316010_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 百部 炙甘草 广藿香 蜜麻黄
0.324162 0.314396 0.481712 0.424018 0.586067 0.372922 0.44806 0.485401 0.486323 0.43667 0.504743 0.350852 0.597924 0.308248 0.441841 0.304228 0.423052
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.647059, recall: 0.785714, error: 0.352941
329. 
patient tongue id: 01012058558372_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.407717 0.364755 0.355088 0.373805
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
330. 
patient tongue id: 05242000125657_5_2
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 茯苓 连翘 红花 牡丹皮 地黄 菟丝子 益母草 皂角刺 醋香附
0.958318 0.320584 0.503648 0.578657 0.41528 0.300808 0.309403 0.624472 0.531677 0.567385 0.400838 0.471219 0.491847
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
331. 
patient tongue id: 05251945535675_5_7_6
label yaofang:
甘草 半夏 薏苡仁 蒲公英 赤芍 牡丹皮 郁金 僵蚕 莪术 北沙参 蜈蚣 土鳖虫 合欢皮 姜黄 山慈菇 预知子
0.496166 0.37078 0.343507 0.421296 0.497205 0.309669
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.166667, recall: 0.062500, error: 0.833333
332. 
patient tongue id: 03242125186020_6_1
label yaofang:
麻黄 桂枝 白芍 法半夏 牛蒡子 太子参 五味子 细辛 干姜 款冬花 苦杏仁 炙甘草
0.333591 0.308169 0.410588 0.31614 0.328092 0.332052 0.40414 0.543029
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.166667, error: 0.750000
333. 
patient tongue id: 02181627186318_1_5
label yaofang:
甘草 防风 金银花 黄芪 红花 浙贝母 牡丹皮 水牛角 荆芥穗 麦芽 皂角刺 白鲜皮 地肤子
0.901516 0.322437 0.449828 0.528032 0.408864 0.514205 0.363347 0.442127 0.308359 0.320825
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.076923, error: 0.900000
334. 
patient tongue id: 03301212426910_6
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 大枣 当归 桃仁 熟地黄 胆南星 白茅根 石菖蒲 三七 鸡内金 红芪 红参 半边莲 金钗石斛
0.749483 0.444559 0.450348 0.392694 0.3598
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.055556, error: 0.800000
335. 
patient tongue id: 05182023256401_1_5_7
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 厚朴 砂仁 火麻仁 鸡内金 稻芽 两面针
0.387898 0.758004 0.365538 0.926749 0.535751 0.76341 0.313602 0.408802 0.407189 0.45353 0.831729 0.855795 0.766896 0.860891 0.319942 0.928861 0.490572 0.737418 0.61208 0.716373
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.050000, recall: 0.090909, error: 0.950000
336. 
patient tongue id: 03081201070705_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.644624 0.415324 0.318228 0.442196 0.304498 0.326089 0.311241 0.405931
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 天麻

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
337. 
patient tongue id: 05232030564949_1_4
label yaofang:
柴胡 白芍 香附 枳壳 蒲公英 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.621267 0.309233 0.341218 0.422223 0.357243
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
338. 
patient tongue id: 04271841031997_1_4_7
label yaofang:
甘草 柴胡 陈皮 枳壳 茯苓 党参 黄芪 白术 厚朴 莪术 柿蒂 蜈蚣 蛇舌草
0.522579 0.383068 0.344845 0.391563 0.440712
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 1.000000, recall: 0.384615, error: 0.000000
339. 
patient tongue id: 04282021144599_6_4
label yaofang:
甘草 川芎 法半夏 茯苓 独活 桃仁 白术 生地黄 红花 延胡索 黄柏 泽泻 天麻 桑寄生 地龙
0.966033 0.520443 0.571548 0.41905 0.3215 0.316845 0.312099 0.657122 0.552083 0.584569 0.417881 0.484253 0.508973
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
340. 
patient tongue id: 04181952445996_5_1_6
label yaofang:
甘草 白芍 川芎 羌活 独活 金银花 薏苡仁 党参 白术 牛膝 桑寄生 补骨脂 忍冬藤 威灵仙 白花蛇舌 天山雪莲
0.935885 0.314416 0.484471 0.557457 0.413917 0.581282 0.463854 0.513568 0.339924 0.406091 0.417894
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
341. 
patient tongue id: 02142150069882_6_2
label yaofang:
甘草 法半夏 桔梗 远志 党参 浙贝母 桑白皮 天麻 地骨皮 糯稻根 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.934268 0.309271 0.511483 0.311881 0.547197 0.420265 0.334638 0.344319 0.350332 0.602861 0.515283 0.5377 0.408197 0.461401 0.473975
predicted yaofang:
甘草 白芍 茯苓 薏苡仁 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.533333, recall: 0.500000, error: 0.466667
342. 
patient tongue id: 05260646327673_4_7
label yaofang:
甘草 陈皮 法半夏 茯苓 牛蒡子 桃仁 白术 红花 赤芍 浙贝母 细辛 紫苏梗 威灵仙 田七末
0.899788 0.30939 0.484108 0.537536 0.431325 0.311858 0.534167 0.443716 0.488135 0.338687 0.387112 0.402064
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
343. 
patient tongue id: 02170747116568_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.41261 0.354745 0.424445 0.384817 0.425041 0.421571 0.389991 0.416895 0.382511 0.378158 0.378287 0.417105 0.306527 0.39099 0.385902 0.419587
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
344. 
patient tongue id: 06132207194330_4_1_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.370889 0.307303 0.311943 0.307243 0.303827 0.361999 0.415673
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
345. 
patient tongue id: 02191433487714_1_2_5
label yaofang:
粉葛 建曲
0.985177 0.300487 0.542129 0.596942 0.403531 0.322761 0.336268 0.305046 0.700447 0.593748 0.629341 0.443263 0.528035 0.549703
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
346. 
patient tongue id: 05032254453295_2_7_6
label yaofang:
甘草 薏苡仁 党参 白术 赤芍 郁金 山药 天麻 白花蛇舌草 蜈蚣 合欢花 半枝莲 醋鳖甲 麸炒枳壳
0.977742 0.528728 0.609343 0.436401 0.335072 0.335761 0.323037 0.700131 0.599542 0.640908 0.449098 0.542281 0.582216
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
347. 
patient tongue id: 02170845383999_1_4_2
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.407254 0.401375 0.310136 0.368826
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
348. 
patient tongue id: 05222058310121_1_4_7
label yaofang:
陈皮 麦冬 鸡内金 莲子 布渣叶 莲房
0.641307 0.407582 0.410424 0.366805 0.398788 0.302985
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
349. 
patient tongue id: 04121324147070_1_4
label yaofang:
麻黄 陈皮 前胡 桔梗 半夏 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香
0.347457 0.599992 0.402073 0.744711 0.426188 0.604874 0.337041 0.336138 0.347728 0.368801 0.629914 0.650574 0.577302 0.666417 0.355697 0.81814 0.365367 0.601204 0.485596 0.553581
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
350. 
patient tongue id: 03240610501182_2
label yaofang:
甘草 金银花 红花 浙贝母 地黄 火麻仁 白花蛇舌草 麦芽 白鲜皮 地肤子 蜈蚣 蜂房 岗梅根 醋鳖甲
0.977834 0.528923 0.576123 0.408414 0.312188 0.318004 0.301277 0.675091 0.571451 0.604278 0.423717 0.504313 0.526696
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.142857, error: 0.846154
351. 
patient tongue id: 04121812579452_1_4
label yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.35443 0.689113 0.394213 0.857176 0.48044 0.690667 0.338996 0.400873 0.382092 0.421241 0.740608 0.76192 0.669343 0.771331 0.340805 0.890829 0.417358 0.689449 0.535887 0.637161
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
352. 
patient tongue id: 02240825529730_1_2_7
label yaofang:
当归 党参 黄芪 枸杞子 熟附子 乌药 肉桂 干姜 巴戟天 吴茱萸 炙甘草 黄精
0.354167 0.343061 0.325848 0.385573
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
353. 
patient tongue id: 03231050286863_2_6
label yaofang:
桂枝 甘草 茯苓 桃仁 生地黄 赤芍 牡丹皮 山药 山茱萸 泽泻 菟丝子 益母草 莪术
0.908146 0.390577 0.431674 0.515667 0.377646 0.460454 0.346441 0.439231
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
354. 
patient tongue id: 04061407417923_4
label yaofang:
法半夏 茯苓 前胡 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 芡实 豆蔻 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.318159 0.740583 0.366587 0.873549 0.493673 0.714204 0.317415 0.340487 0.369082 0.395927 0.755954 0.777867 0.691877 0.774917 0.92107 0.40221 0.709748 0.560897 0.614316
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.812500, error: 0.315789
355. 
patient tongue id: 05232040382904_1_4_7
label yaofang:
陈皮 太子参 黄芪 枸杞子 白术 龙眼肉 杜仲 牛膝 乌药 厚朴 补骨脂 川贝母 莪术 麦芽 桑椹 紫苏叶 骨碎补 龟甲 预知子 荔枝核
0.583323 0.382462 0.378899 0.425945 0.511413 0.320688
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.150000, error: 0.500000
356. 
patient tongue id: 02190525321680_1_7
label yaofang:
甘草 黄芪 酸枣仁 红花 赤芍 熟地黄 天麻 肉苁蓉 桑寄生 补骨脂 地龙 浮小麦 首乌藤 乌梢蛇
0.929366 0.505074 0.53 0.410237 0.562264 0.440669 0.492321 0.327997 0.374907 0.392385
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
357. 
patient tongue id: 04182036131258_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 姜半夏 炙甘草 龙脷叶
0.892646 0.484308 0.473499 0.431168 0.466875 0.33913 0.437484
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
358. 
patient tongue id: 04062056213676_1_4_7
label yaofang:
甘草 枳壳 茯苓 桔梗 金银花 薏苡仁 桃仁 黄芪 酸枣仁 肉苁蓉 六神曲 黄精
0.625566 0.418607 0.333571 0.421765 0.506718 0.318661 0.324179
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
359. 
patient tongue id: 03012210249115_1_2
label yaofang:
甘草 白芍 陈皮 防风 党参 白术 酸枣仁 生地黄 天麻 桑寄生 鳖甲 蜈蚣 天山雪莲 半枝莲
0.946458 0.493218 0.551189 0.44447 0.554547 0.481485 0.544335 0.360515 0.415773 0.428932
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.571429, error: 0.200000
360. 
patient tongue id: 03282212389163_2
label yaofang:
甘草 黄芩 茯苓 枸杞子 浙贝母 荷叶 磁石 白花蛇舌草 北沙参 沙苑子 蜂房 醋鳖甲 岗梅
0.93098 0.310313 0.481109 0.565539 0.439161 0.303894 0.30467 0.592801 0.49259 0.538558 0.370454 0.430886 0.457514
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.153846, error: 0.846154
361. 
patient tongue id: 01140824407238_5_6_2
label yaofang:
甘草 木香 蒲公英 黄芪 黄连 延胡索 赤芍 牛膝 苍术 山药 砂仁 天麻 白芷 五灵脂
0.979302 0.525423 0.614776 0.419086 0.357369 0.338113 0.318683 0.710744 0.572093 0.596155 0.418545 0.507345 0.547102
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
362. 
patient tongue id: 05131559334628_2_6_7
label yaofang:
甘草 白芍 牡蛎 麦冬 党参 丹参 天冬 延胡索 栀子 牡丹皮 牛膝 天麻 女贞子 浮小麦 龟甲
0.925854 0.312423 0.49313 0.543178 0.399969 0.553741 0.459595 0.496265 0.339388 0.396137 0.40727
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
363. 
patient tongue id: 05232107525084_4_1
label yaofang:
甘草 白芍 川芎 独活 牛膝 细辛 车前子 干姜 补骨脂 蜈蚣 姜黄 海桐皮 鹿衔草
0.321966 0.390706 0.480278 0.363441 0.302978 0.336502 0.302681 0.362589 0.56251 0.606764
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.153846, error: 0.800000
364. 
patient tongue id: 05131613052251_6_2
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 山药 菟丝子 益母草 白花蛇舌草 佛手 浮小麦 首乌藤 合欢花 醋鳖甲
0.856452 0.376467 0.442972 0.516466 0.395937 0.468708 0.337017 0.421097
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
365. 
patient tongue id: 04202143512085_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄 炒苍耳子
0.373408 0.768586 0.371787 0.926894 0.528877 0.761689 0.327806 0.374847 0.39068 0.425846 0.831908 0.854979 0.769206 0.847127 0.312106 0.934964 0.45573 0.746243 0.614534 0.707984
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
366. 
patient tongue id: 01312255123191_1_7
label yaofang:
甘草 羌活 独活 党参 白术 红花 地黄 天麻 白花蛇舌草 桑枝 威灵仙 蜈蚣 半枝莲 醋鳖甲
0.874288 0.45731 0.510968 0.429266 0.476533 0.334093 0.423943
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
367. 
patient tongue id: 04061832077339_4_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 黄芪 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.36792 0.650265 0.395808 0.80933 0.470632 0.652588 0.354786 0.400477 0.401326 0.317869 0.429636 0.698025 0.721651 0.634508 0.725042 0.344167 0.856749 0.417722 0.644889 0.51498 0.599586
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.875000, error: 0.333333
368. 
patient tongue id: 05232023248167_4
label yaofang:
甘草 柴胡 香附 枳壳 茯苓 半夏 薏苡仁 党参 白术 浙贝母 厚朴 砂仁 僵蚕 夏枯草 合欢皮 预知子
0.700501 0.425175 0.391263 0.380424 0.457048 0.311923
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
369. 
patient tongue id: 04061910452020_1_4
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 厚朴
0.829691 0.472376 0.438827 0.361345 0.357653 0.317654
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
370. 
patient tongue id: 03101745004628_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.374891 0.722361 0.372528 0.884711 0.509999 0.721752 0.350863 0.414842 0.4271 0.311709 0.447604 0.776252 0.80802 0.71695 0.805576 0.328605 0.915486 0.457522 0.707848 0.578257 0.672984
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 1.000000, error: 0.285714
371. 
patient tongue id: 05080855488553_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.603772 0.385257 0.379173 0.400373 0.485325
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
372. 
patient tongue id: 01180605332418_6_1_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 酸枣仁 黄连 川楝子 乌梅 山药 细辛 合欢花
0.757261 0.39946 0.419313 0.403074
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.285714, error: 0.000000
373. 
patient tongue id: 05242120007043_4_6
label yaofang:
甘草 法半夏 茯苓 牡蛎 远志 党参 酸枣仁 知母 淡豆豉 益智仁 桑螵蛸 天竺黄 首乌藤 紫苏梗 合欢花
0.912856 0.302845 0.482701 0.54204 0.38149 0.568033 0.406005 0.451671 0.344375 0.349881
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
374. 
patient tongue id: 04130647210328_1_7_6
label yaofang:
甘草 茯苓 党参 酸枣仁 丹参 生地黄 牡丹皮 黄柏 山茱萸 泽泻 菟丝子 益母草 淫羊藿 女贞子 浮小麦 墨旱莲
0.955412 0.326956 0.518025 0.558279 0.393896 0.306194 0.322363 0.622116 0.533343 0.552992 0.405288 0.471524 0.48724
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
375. 
patient tongue id: 03021852314167_1_2_7
label yaofang:
甘草 茯苓 浙贝母 厚朴 生半夏 砂仁 鸡内金 北沙参 首乌藤 合欢皮 蛇舌草
0.405045 0.361921 0.364515
predicted yaofang:
甘草 茯苓 黄芪

------Score: precision: 0.666667, recall: 0.181818, error: 0.333333
376. 
patient tongue id: 06072311074481_1_2
label yaofang:
甘草 法半夏 茯苓 前胡 桃仁 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.957661 0.514244 0.566096 0.42116 0.302981 0.301751 0.613105 0.524523 0.565419 0.3928 0.462415 0.481364
predicted yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.733333, error: 0.083333
377. 
patient tongue id: 03311648289040_4
label yaofang:
陈皮 桔梗 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 猫爪草 山慈菇
0.376303 0.326775 0.376338 0.339033
predicted yaofang:
甘草 白芍 党参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
378. 
patient tongue id: 06012035281709_2_5
label yaofang:
茯苓 薏苡仁 麦冬 鸡血藤 白术 生地黄 山药 紫草 鳖甲 扁豆花 蝉蜕 白鲜皮 土茯苓 龟甲 羚羊骨
0.474631 0.37452 0.340064 0.385099 0.388352
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
379. 
patient tongue id: 03131256225311_4
label yaofang:
陈皮 法半夏 防风 佩兰 荆芥穗 豆蔻 炙甘草 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术 炒六神曲 醋香附
0.341666 0.58899 0.396217 0.744239 0.437288 0.579354 0.30374 0.337761 0.358142 0.365998 0.623381 0.645138 0.567684 0.659316 0.317612 0.784449 0.37045 0.571061 0.469495 0.539697
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.428571, error: 0.700000
380. 
patient tongue id: 05191928023957_6_1
label yaofang:
甘草 法半夏 茯苓 红花 杜仲 山药 天麻 桑寄生 鳖甲 苦杏仁 瓜蒌子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.981586 0.53753 0.59913 0.413076 0.322724 0.325573 0.310006 0.697472 0.593538 0.62316 0.444465 0.523655 0.542451
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
381. 
patient tongue id: 03311642562715_1_4
label yaofang:
柴胡 大枣 茯苓 防风 连翘 太子参 昆布 海藻 乌梅 石斛 白花蛇舌草 猫爪草 山慈菇
0.306918 0.386357 0.32861 0.390223 0.522204
predicted yaofang:
甘草 白芍 党参 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
382. 
patient tongue id: 01062335521171_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.766444 0.422108 0.45779 0.440273 0.366156 0.349805
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
383. 
patient tongue id: 05022046307967_2_6
label yaofang:
甘草 茯苓 木香 党参 生地黄 山药 天麻 鳖甲 扁豆花 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.95816 0.307734 0.508404 0.546943 0.390304 0.592259 0.500696 0.527455 0.375985 0.440323 0.440895
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
384. 
patient tongue id: 02120940343215_6_2
label yaofang:
甘草 酸枣仁 生地黄 牡丹皮 杜仲 黄柏 山药 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.910083 0.338931 0.483614 0.536108 0.414181 0.313671 0.303137 0.551776 0.453287 0.497391 0.347427 0.398259 0.406468
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
385. 
patient tongue id: 02212007582065_1_2_5
label yaofang:
甘草 枳壳 当归 防风 党参 仙鹤草 茜草 天麻 槐花 鳖甲 火麻仁 蜈蚣 天山雪莲 半枝莲
0.978945 0.530033 0.5926 0.411158 0.328278 0.321035 0.312711 0.683107 0.568569 0.592599 0.421399 0.499001 0.519497
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
386. 
patient tongue id: 02171959301394_2
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.370672 0.73903 0.367771 0.904297 0.50383 0.737749 0.330131 0.406734 0.405699 0.440782 0.798776 0.820705 0.731731 0.829235 0.315569 0.922011 0.45728 0.721699 0.584355 0.67315
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
387. 
patient tongue id: 02212029417696_7_6
label yaofang:
甘草 枳壳 茯苓 桃仁 党参 酸枣仁 丹参 玄参 柏子仁 黄连 生地黄 栀子 牡丹皮 天花粉 火麻仁 郁李仁
0.961845 0.310531 0.520522 0.564816 0.415928 0.316759 0.327209 0.323361 0.626397 0.543508 0.570867 0.422467 0.483307 0.493676
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.312500, error: 0.642857
388. 
patient tongue id: 02020950137737_6_5
label yaofang:
甘草 柴胡 白芍 黄芩 当归 茯苓 党参 白术 酸枣仁 生地黄 栀子 牡丹皮 合欢花
0.950354 0.302505 0.488658 0.523473 0.378451 0.573692 0.466912 0.502045 0.344358 0.399423 0.410074
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
389. 
patient tongue id: 02252110182261_3
label yaofang:
甘草 茯苓 葛根 远志 党参 白术 酸枣仁 栀子 牡丹皮 山药 益智仁 芡实 桑螵蛸 浮小麦
0.989769 0.548712 0.623549 0.411865 0.359705 0.36011 0.326358 0.748235 0.64178 0.666477 0.487675 0.578063 0.599246
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
390. 
patient tongue id: 03272233577184_1_4_7
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 五味子 熟地黄 火麻仁 炙甘草 黑枣
0.513985 0.349189 0.363886 0.417457 0.434223 0.362378 0.331665 0.380755 0.31337 0.311922 0.339778
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 车前子 莱菔子 天麻

------Score: precision: 0.090909, recall: 0.100000, error: 0.909091
391. 
patient tongue id: 05261954034707_1_4
label yaofang:
荆芥 薄荷 浙贝母 僵蚕 百部 枇杷叶 苦杏仁 紫苏子 蝉蜕 紫苏叶 紫苑
0.465368 0.342254 0.358796 0.351389
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
392. 
patient tongue id: 01091945426733_1_4_7
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 黄连 山药 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.923212 0.326593 0.488093 0.539727 0.427609 0.55273 0.46804 0.512298 0.354662 0.411055 0.428233
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
393. 
patient tongue id: 05042036546633_1_6
label yaofang:
甘草 黄芪 阿胶 白术 海螵蛸 枳实 干姜 砂仁 菟丝子 制白附子
0.366847 0.453537 0.355334 0.321634 0.423089 0.306126 0.588244 0.643582 0.301046
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.222222, recall: 0.200000, error: 0.777778
394. 
patient tongue id: 01052206203844_1_3_7
label yaofang:
甘草 桔梗 黄芪 白术 熟地黄 浙贝母 山茱萸 桑螵蛸 夏枯草 北沙参 首乌藤 蜈蚣 合欢皮 墨旱莲
0.83739 0.470607 0.42246 0.405774 0.38176 0.353673
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
395. 
patient tongue id: 05261933056225_1_4_7
label yaofang:
陈皮 半夏 党参 黄芪 枸杞子 白术 杜仲 牛膝 郁金 山药 厚朴 僵蚕 菟丝子 鸡内金 紫苏梗 红豆杉
0.547674 0.363323 0.376418 0.456755 0.441011 0.307994
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
396. 
patient tongue id: 06190248442610_4_6
label yaofang:
甘草 白芍 法半夏 茯苓 龙骨 远志 酸枣仁 知母 山茱萸 地黄 砂仁 辛夷 浮小麦 紫苏梗 炒苍耳子 合欢花
0.86983 0.301381 0.472627 0.498045 0.39237 0.478642 0.336476 0.40644
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.187500, error: 0.625000
397. 
patient tongue id: 03242130590095_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.687057 0.372369 0.371885 0.444238 0.349532
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
398. 
patient tongue id: 03192302394682_2_7
label yaofang:
甘草 白芍 党参 白术 竹茹 杜仲 砂仁 天麻 桑寄生 麦芽 续断 紫苏梗 广藿香 牛大力
0.94096 0.503031 0.553201 0.427121 0.586362 0.489968 0.538336 0.365936 0.4231 0.436601
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
399. 
patient tongue id: 05032222108497_7_6_4
label yaofang:
甘草 法半夏 前胡 龙骨 桃仁 远志 党参 丹参 薤白 桑白皮 水蛭 瓜蒌皮 款冬花 莪术 苦杏仁
0.96929 0.334877 0.51019 0.600554 0.410771 0.332767 0.3461 0.315315 0.674504 0.57596 0.603139 0.441179 0.521522 0.557547
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.142857, recall: 0.133333, error: 0.857143
400. 
patient tongue id: 04052210079869_3_4
label yaofang:
麻黄 甘草 陈皮 黄芪 白术 胆南星 杜仲 郁金 神曲 厚朴 生半夏 僵蚕 桑寄生 莪术 紫苏叶 蜈蚣
0.959624 0.514029 0.581682 0.426525 0.327658 0.323982 0.313773 0.660273 0.553319 0.591296 0.416862 0.501101 0.53528
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.187500, error: 0.769231
401. 
patient tongue id: 04222053220677_1_4
label yaofang:
白芍 川芎 当归 独活 党参 黄芪 细辛 防己 桑寄生 木瓜 川牛膝 炙甘草 续断 首乌藤 威灵仙 盐菟丝子
0.335001 0.541161 0.401298 0.678167 0.396177 0.534269 0.318894 0.327853 0.557131 0.584494 0.515639 0.618459 0.348748 0.755803 0.330267 0.53932 0.445098 0.493592
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.055556, recall: 0.062500, error: 0.944444
402. 
patient tongue id: 04202316192773_5
label yaofang:
甘草 金银花 连翘 蒲公英 紫花地丁 党参 白术 天麻 白芷 白花蛇舌草 皂角刺 蜈蚣 半枝莲 醋鳖甲
0.976479 0.518335 0.609154 0.427131 0.335364 0.324627 0.314934 0.699259 0.568792 0.603164 0.409556 0.505408 0.549829
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
403. 
patient tongue id: 05162059381473_2_7
label yaofang:
甘草 白芍 法半夏 牡蛎 薏苡仁 桃仁 党参 枸杞子 赤芍 郁金 天麻 全蝎 蒺藜 女贞子 土鳖虫 制天南星
0.90313 0.332706 0.46417 0.533163 0.40329 0.532965 0.402146 0.45952 0.345092 0.344408
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
404. 
patient tongue id: 05312143408050_4
label yaofang:
甘草 羌活 独活 薏苡仁 党参 白术 杜仲 天麻 白花蛇舌草 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.790993 0.318703 0.430157 0.478135 0.390708 0.395857 0.335275
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
405. 
patient tongue id: 03291618097049_6_4
label yaofang:
甘草 香附 枳壳 法半夏 茯苓 党参 丹参 郁金 薤白 水蛭 瓜蒌皮 莪术 紫苏梗
0.928337 0.489528 0.536366 0.41613 0.552501 0.432141 0.479182 0.311438 0.364477 0.379422
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.230769, error: 0.700000
406. 
patient tongue id: 01062354544903_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.517698 0.385342 0.305778 0.400073 0.355208 0.30822 0.31445
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 天麻

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
407. 
patient tongue id: 01211155296740_2
label yaofang:
白芍 丹参 钩藤 桑叶 石斛 秦皮 决明子 蒺藜 化橘红
0.630879 0.396764 0.397098 0.376343
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
408. 
patient tongue id: 05111439032509_1_3_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.53416 0.380933 0.395394 0.35581 0.332641
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
409. 
patient tongue id: 03161713206874_2
label yaofang:
前胡 桔梗 麦冬 太子参 荷叶 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子
0.367461 0.670785 0.391975 0.841597 0.466645 0.677715 0.338174 0.373995 0.377477 0.410605 0.722581 0.745558 0.664609 0.761215 0.345294 0.871052 0.419496 0.669807 0.553989 0.625943
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.833333, error: 0.500000
410. 
patient tongue id: 03231132255868_5_7
label yaofang:
甘草 黄芩 防风 金银花 黄芪 白术 五味子 生地黄 浙贝母 牡丹皮 茜草 荆芥穗 紫苏梗 贯众
0.85627 0.358944 0.439026 0.479109 0.366105 0.410675 0.355655
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
411. 
patient tongue id: 01182159428007_6_2_1
label yaofang:
甘草 柴胡 川芎 木香 党参 丹参 赤芍 牛膝 郁金 山药 莪术 海金沙 鸡内金 王不留行
0.977689 0.532905 0.596971 0.430209 0.325655 0.320539 0.321671 0.6787 0.574058 0.612041 0.428798 0.50248 0.529426
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.214286, error: 0.769231
412. 
patient tongue id: 02141943569886_1
label yaofang:
甘草 肉桂 干姜 款冬花 附片
0.38939 0.318043 0.388522 0.329265
predicted yaofang:
甘草 白芍 党参 炙甘草

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
413. 
patient tongue id: 03292133154570_1
label yaofang:
甘草 枳壳 茯苓 牡蛎 党参 太子参 酸枣仁 丹参 生地黄 竹茹 浙贝母 郁金 扁豆花 麦芽
0.971678 0.30573 0.52083 0.580184 0.405862 0.307386 0.315414 0.649045 0.550946 0.578713 0.4143 0.486626 0.501399
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
414. 
patient tongue id: 05140956056868_6_4
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 赤芍 山药 天麻 鳖甲 补骨脂 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.983223 0.534074 0.613709 0.411982 0.330598 0.33489 0.306386 0.708303 0.602153 0.630254 0.4495 0.536736 0.56432
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.923077, recall: 0.800000, error: 0.076923
415. 
patient tongue id: 05161929352710_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄
0.343239 0.665052 0.401613 0.829985 0.467619 0.661247 0.315224 0.359259 0.351154 0.390861 0.71136 0.723689 0.645818 0.7469 0.323402 0.856778 0.40551 0.648686 0.521865 0.608819
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
416. 
patient tongue id: 05152046239739_1_2_6
label yaofang:
桂枝 当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 炙甘草 百合 紫苏叶
0.460512 0.354983 0.329534 0.375299 0.372744 0.376956
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
417. 
patient tongue id: 03090759186879_1_4_7
label yaofang:
甘草 川芎 党参 杜仲 牛膝 天麻 桑寄生 麦芽 地龙 女贞子 粉葛 首乌藤 墨旱莲
0.973 0.305506 0.532211 0.5917 0.422986 0.346461 0.343562 0.332609 0.683384 0.592234 0.617755 0.460436 0.531663 0.554306
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.214286, recall: 0.230769, error: 0.785714
418. 
patient tongue id: 03240607532132_1_2_4
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 党参 山药 车前子 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.909072 0.473071 0.503651 0.408411 0.472681 0.378188 0.444277 0.316831 0.310434
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.777778, recall: 0.466667, error: 0.222222
419. 
patient tongue id: 04061958385390_4
label yaofang:
甘草 柴胡 白芍 香附 黄芩 当归 茯苓 薄荷 白术 海螵蛸 白花蛇舌草 麦芽 广藿香
0.357793 0.458496 0.332171 0.40306 0.34148 0.564 0.680039
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
420. 
patient tongue id: 01121851476067_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.314481 0.455464 0.41178 0.526862 0.331346 0.457733 0.311698 0.42639 0.430843 0.428371 0.506582 0.377758 0.647965 0.300842 0.444358 0.38314 0.398722
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.705882, recall: 0.923077, error: 0.294118
421. 
patient tongue id: 05140638543298_6_1_5
label yaofang:
甘草 川芎 党参 酸枣仁 生地黄 天麻 鳖甲 白花蛇舌草 浮小麦 蜈蚣 天山雪莲 半枝莲
0.945996 0.3028 0.517501 0.556492 0.406017 0.308764 0.303404 0.592751 0.49583 0.524934 0.373041 0.435175 0.449377
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.666667, error: 0.384615
422. 
patient tongue id: 04282031455762_6
label yaofang:
甘草 香附 枳壳 黄芩 茯苓 桃仁 党参 白术 生地黄 红花 山药 菟丝子 桑寄生 补骨脂
0.941853 0.331991 0.491612 0.549455 0.40059 0.584543 0.483041 0.524055 0.353859 0.419619 0.434491
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
423. 
patient tongue id: 05162146419364_2_5
label yaofang:
白芍 茯苓 生地黄 牡丹皮 黄柏 知母 山药 山茱萸 白茅根 小蓟 泽泻 车前子 白花蛇舌 鹿衔草
0.837494 0.327856 0.428804 0.500865 0.396539 0.42114 0.3585
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
424. 
patient tongue id: 05262110593119_5_7
label yaofang:
甘草 白芍 川芎 法半夏 黄连 赤芍 胆南星 牛膝 细辛 天麻 全蝎 白芷
0.967609 0.529571 0.582326 0.430249 0.326115 0.324996 0.317951 0.663106 0.572303 0.613509 0.436549 0.516316 0.549296
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.166667, error: 0.846154
425. 
patient tongue id: 03221634094943_1_7_4
label yaofang:
半夏 橘红 薏苡仁 桃仁 黄芪 红花 赤芍 海螵蛸 郁金 厚朴 当归尾 砂仁 全蝎 鸡内金 地龙
0.846836 0.437916 0.421546 0.340473 0.535492 0.366812 0.411815
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.066667, error: 0.857143
426. 
patient tongue id: 03261611575991_6
label yaofang:
甘草 柴胡 白芍 川芎 香附 远志 枳实 泽泻 升麻 首乌藤 合欢皮
0.502547 0.355931 0.398745 0.319098 0.342696
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
427. 
patient tongue id: 03171415120649_4
label yaofang:
桂枝 甘草 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 白芷 百部 北沙参 辛夷 蜜麻黄 炒苍耳子 醋五味子
0.357995 0.70502 0.36803 0.871052 0.507424 0.698241 0.338 0.390512 0.414357 0.43788 0.762437 0.791626 0.700486 0.788091 0.310322 0.908301 0.43539 0.689705 0.562387 0.652307
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.625000, error: 0.500000
428. 
patient tongue id: 02161859548478_4
label yaofang:
陈皮 法半夏 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.348101 0.622207 0.40892 0.769657 0.450481 0.626019 0.339844 0.369082 0.376839 0.398902 0.658344 0.676853 0.597146 0.686396 0.330748 0.821478 0.395564 0.619085 0.499941 0.568704
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
429. 
patient tongue id: 02181628211123_1_6_7
label yaofang:
甘草 前胡 薏苡仁 党参 黄芪 白术 生地黄 延胡索 郁金 天麻 鳖甲 威灵仙 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.968062 0.307057 0.529372 0.594169 0.414516 0.325272 0.326611 0.309698 0.650584 0.550021 0.580496 0.417322 0.486848 0.520354
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.642857, recall: 0.562500, error: 0.357143
430. 
patient tongue id: 03090856447016_2
label yaofang:
甘草 茯苓 熟地黄 牡丹皮 杜仲 山药 山茱萸 泽泻 菟丝子 巴戟天 桑寄生 决明子
0.980962 0.53271 0.614428 0.417859 0.347254 0.341292 0.32279 0.720107 0.61923 0.642088 0.469616 0.558632 0.594082
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.250000, error: 0.769231
431. 
patient tongue id: 05251958320141_7_5_2
label yaofang:
薏苡仁 黄芪 白术 浙贝母 牛膝 小蓟 砂仁 莪术 山慈菇 蛇舌草
0.617953 0.414 0.388035 0.378527 0.414105
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
432. 
patient tongue id: 05221859059633_2_1
label yaofang:
甘草 芦根 薏苡仁 麦冬 黄芪 生地黄 枳实 乌梅 山茱萸 虎杖 决明子 地龙 北沙参 百合
0.699393 0.426507 0.432344 0.318194 0.462388 0.322016 0.335367
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
433. 
patient tongue id: 05092249462526_1_2
label yaofang:
枳壳 当归 黄芪 白术 海螵蛸 浙贝母 山药 砂仁 鸡内金 紫苏梗 红豆杉 合欢皮 稻芽
0.395234 0.386645 0.396661 0.3342 0.308224 0.302216
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
434. 
patient tongue id: 03111748035222_4_2_7
label yaofang:
甘草 白芍 川芎 法半夏 茯苓 牡蛎 白术 酸枣仁 牡丹皮 天麻 浮小麦 桑枝 威灵仙
0.907924 0.487842 0.518198 0.412326 0.518637 0.406819 0.455956 0.341341 0.340449
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
435. 
patient tongue id: 06072250294527_1_2
label yaofang:
甘草 白芍 陈皮 薏苡仁 党参 白术 山药 天麻 鳖甲 白扁豆 建曲 蜈蚣 天山雪莲 半枝莲
0.990183 0.540691 0.636495 0.412447 0.350737 0.355753 0.31945 0.763397 0.647805 0.67895 0.480456 0.580968 0.624145
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
436. 
patient tongue id: 02261926197982_1
label yaofang:
甘草 茯苓 生地黄 延胡索 牡丹皮 山药 山茱萸 泽泻 补骨脂 麦芽 续断 威灵仙
0.963979 0.309836 0.524981 0.570256 0.407312 0.305493 0.318457 0.304813 0.621305 0.530081 0.558412 0.400828 0.467601 0.484509
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.333333, error: 0.714286
437. 
patient tongue id: 04200623333925_6
label yaofang:
甘草 柴胡 白芍 香附 黄芩 茯苓 党参 白术 山药 砂仁 菟丝子 益母草 佛手 合欢花
0.912091 0.321569 0.484916 0.526636 0.382534 0.513722 0.397857 0.43436 0.334914 0.32317
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
438. 
patient tongue id: 04202153096518_4
label yaofang:
防风 党参 太子参 黄芪 枸杞子 山药 芡实 煅牡蛎 北沙参 炙甘草 浮小麦 麸炒白术 煅龙骨
0.352585 0.54727 0.419514 0.676574 0.426308 0.553814 0.339619 0.334216 0.33189 0.366647 0.585214 0.595551 0.531112 0.616783 0.371175 0.73738 0.369038 0.545848 0.434719 0.520776
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.307692, error: 0.800000
439. 
patient tongue id: 01180543308372_1_3_4
label yaofang:
桂枝 甘草 陈皮 茯苓 半夏 黄芪 白术 浙贝母 橘核 桑枝 黑枣 黑老虎
0.749175 0.438993 0.419114 0.318106 0.450753 0.336861 0.312413
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
440. 
patient tongue id: 05091927123896_2_4
label yaofang:
陈皮 法半夏 防风 佩兰 荆芥穗 砂仁 香薷 炙甘草 紫苏梗 广藿香 麸炒白术 麸炒苍术 炒六神曲 炒稻芽 醋香附 炒麦芽
0.357055 0.784673 0.360225 0.933687 0.534631 0.773269 0.334557 0.405941 0.407664 0.445126 0.83712 0.861562 0.764463 0.861295 0.308969 0.950318 0.457389 0.770464 0.594748 0.705539
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.312500, error: 0.750000
441. 
patient tongue id: 05222107388871_4_1
label yaofang:
陈皮 当归 黄芪 白术 杜仲 苍术 厚朴 生半夏 僵蚕 鸡内金 枇杷叶 红豆杉 山慈菇 稻芽
0.453297 0.335952 0.403813 0.610706 0.618342 0.301437 0.325977 0.516702 0.351608 0.36753 0.402694 0.419899
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
442. 
patient tongue id: 06051119462038_1_2
label yaofang:
当归 麦冬 玉竹 党参 黄芪 乌药 山药 淫羊藿 仙茅 益智 鹿角霜
0.474936 0.349344 0.352522 0.414767 0.363961 0.352002 0.321244 0.359358 0.311128 0.316837
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 车前子 天麻

------Score: precision: 0.200000, recall: 0.181818, error: 0.800000
443. 
patient tongue id: 06050915326782_1_3_7
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.50524 0.377353 0.347104 0.338728 0.384086
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
444. 
patient tongue id: 01182137036842_6_2
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 红花 山药 山茱萸 补骨脂 续断 浮小麦 桑枝 威灵仙
0.969534 0.31567 0.522048 0.587319 0.411012 0.329244 0.336013 0.31317 0.664061 0.579092 0.599884 0.445572 0.519054 0.544812
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.500000, error: 0.500000
445. 
patient tongue id: 05222101141649_5_4
label yaofang:
麦冬 黄芪 五味子 杜仲 厚朴 僵蚕 瓜蒌皮 莪术 诃子 鸡内金 枇杷叶 地龙 北沙参 蝉蜕
0.682673 0.405836 0.413249 0.370732 0.491102 0.314287
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
446. 
patient tongue id: 06132101578932_5
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 白花蛇舌草 白扁豆 鸡骨草
0.315326 0.410577 0.323836 0.342461 0.482221 0.561241
predicted yaofang:
柴胡 白芍 党参 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
447. 
patient tongue id: 04241922145369_2_3
label yaofang:
陈皮 芦根 黄芪 枸杞子 生地黄 赤芍 海螵蛸 枳实 厚朴 砂仁 芒硝 火麻仁 百合 人参叶 土牛膝
0.384809 0.341271 0.321168 0.349638 0.31233 0.442737
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
448. 
patient tongue id: 04282218309687_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 酸枣仁 丹参 黄连 郁金 山茱萸 补骨脂 佛手 浮小麦
0.972677 0.531831 0.305136 0.579614 0.420453 0.315697 0.31945 0.322038 0.654696 0.557234 0.590484 0.422545 0.488146 0.500531
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.285714, error: 0.714286
449. 
patient tongue id: 02181956257943_1_4_7
label yaofang:
甘草 法半夏 茯苓 桔梗 党参 丹参 浙贝母 砂仁 天麻 鳖甲 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.972829 0.524461 0.583103 0.430193 0.324271 0.315967 0.315892 0.6652 0.562316 0.60118 0.420921 0.492306 0.523205
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.562500, error: 0.307692
450. 
patient tongue id: 03231058246240_1_3
label yaofang:
防风 太子参 黄芪 肉桂 细辛 干姜 白芷 北沙参 辛夷 紫苏梗 广藿香 麸炒白术 麸炒苍术 超苍耳子
0.354307 0.713514 0.380636 0.877889 0.496281 0.706878 0.301783 0.379382 0.379538 0.408638 0.775105 0.789256 0.72322 0.808191 0.304128 0.889582 0.46984 0.68482 0.56892 0.670739
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.571429, error: 0.600000
451. 
patient tongue id: 05272343384152_4_7_5
label yaofang:
枳壳 黄芪 白术 海螵蛸 浙贝母 杜仲 白茅根 砂仁 补骨脂 鸡内金 紫苏梗 稻芽
0.523161 0.391965 0.359578 0.415124
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
452. 
patient tongue id: 05290748019004_1_4
label yaofang:
甘草 薏苡仁 党参 黄芪 枸杞子 白术 酸枣仁 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.982207 0.529453 0.599272 0.412638 0.315602 0.321548 0.693685 0.586664 0.620202 0.434744 0.519675 0.542683
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
453. 
patient tongue id: 05312342504121_6_2
label yaofang:
甘草 川芎 当归 茯苓 桃仁 红花 乌药 山药 山茱萸 地黄 桑寄生 吴茱萸 仙茅 佛手 合欢花
0.926477 0.460927 0.542814 0.405851 0.577364 0.432183 0.491117 0.300579 0.359843 0.383193
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.133333, error: 0.800000
454. 
patient tongue id: 06071852227647_4_3
label yaofang:
川芎 桔梗 半夏 羌活 麦冬 党参 白术 附子 豆蔻 北沙参 紫苏子 炙甘草 骨碎补 姜黄 石榴皮
0.488623 0.366856 0.377977 0.402988 0.448338
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
455. 
patient tongue id: 03091906502111_1_2
label yaofang:
甘草 川芎 党参 黄芪 枸杞子 酸枣仁 石菖蒲 天麻 地龙 蒺藜 女贞子 粉葛 首乌藤
0.961104 0.344663 0.505063 0.587865 0.414116 0.305838 0.323967 0.30315 0.643401 0.561197 0.59051 0.429297 0.504645 0.53097
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.307692, error: 0.714286
456. 
patient tongue id: 05130637599152_1_2_4
label yaofang:
甘草 柴胡 陈皮 薏苡仁 黄芪 山茱萸 天麻 鳖甲 莪术 地龙 蜈蚣 白花蛇舌 红豆杉 龙葵果 广升麻
0.857244 0.461188 0.506469 0.425114 0.463775 0.320359 0.406694
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
457. 
patient tongue id: 03021232004242_1_3_7
label yaofang:
甘草 白芍 桔梗 金银花 连翘 薄荷 桃仁 蒲公英 麦冬 玄参 生地黄 红花 浙贝母 牡丹皮 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 败酱草 制何首乌
0.381487 0.301136 0.359027 0.392127 0.305416
predicted yaofang:
甘草 茯苓 党参 黄芪 牛膝

------Score: precision: 0.400000, recall: 0.083333, error: 0.600000
458. 
patient tongue id: 04132049296799_7_5
label yaofang:
桂枝 甘草 川芎 当归 金银花 蒲公英 紫花地丁 黄芪 生地黄 红花 赤芍 吴茱萸 白鲜皮 地肤子
0.889419 0.315027 0.459471 0.52274 0.392511 0.521459 0.325752 0.40691
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.125000, recall: 0.071429, error: 0.875000
459. 
patient tongue id: 05022220273856_2_5
label yaofang:
甘草 山茱萸 天麻 菟丝子 益母草 鳖甲 桑螵蛸 益智 续断 蜈蚣 天山雪莲 半枝莲 广金钱草 红豆杉
0.907795 0.346521 0.457401 0.537393 0.419467 0.51279 0.411818 0.48503 0.354985 0.361901
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.428571, error: 0.400000
460. 
patient tongue id: 01190621199806_2_1_6
label yaofang:
甘草 白芍 茯苓 远志 党参 枸杞子 牡丹皮 黄柏 山药 山茱萸 泽泻 菟丝子 金樱子 蛇床子 沙苑子 合欢花
0.987882 0.532354 0.627252 0.399278 0.337313 0.333567 0.307881 0.737653 0.60677 0.626193 0.442529 0.539374 0.572796
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.250000, error: 0.692308
461. 
patient tongue id: 03142051504437_4
label yaofang:
白芍 香附 法半夏 党参 延胡索 海螵蛸 砂仁 天花粉 北柴胡 麦芽 炙甘草 紫苏梗
0.404088 0.31991 0.325461 0.420192 0.556082
predicted yaofang:
白芍 党参 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
462. 
patient tongue id: 03012336527370_6_2
label yaofang:
甘草 薏苡仁 桑白皮 天麻 鳖甲 款冬花 莪术 紫菀 枇杷叶 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.957259 0.509017 0.538142 0.396186 0.60027 0.451444 0.500574 0.32931 0.384043 0.383997
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.428571, error: 0.400000
463. 
patient tongue id: 03301959026757_4
label yaofang:
甘草 茯苓 半夏 牛蒡子 薏苡仁 鱼腥草 黄芪 白术 赤芍 浙贝母 杜仲 泽泻 僵蚕 白芷 蝉蜕 辛夷 紫苏叶 蜈蚣 猫爪草 冬凌草
0.620351 0.407385 0.371682 0.405335 0.485404 0.314794
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.200000, error: 0.333333
464. 
patient tongue id: 02211850374883_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 干姜 豆蔻 姜半夏 炙甘草 紫苏梗
0.355272 0.358513 0.446637 0.314862 0.336175 0.321305 0.33397 0.303401 0.472936 0.580669
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.700000, recall: 0.636364, error: 0.300000
465. 
patient tongue id: 04062019186697_4_1_6
label yaofang:
柴胡 大枣 茯苓 防风 连翘 太子参 昆布 海藻 乌梅 石斛 白花蛇舌草 猫爪草 山慈菇
0.767872 0.368996 0.383607 0.475265 0.378924 0.372546 0.32223
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
466. 
patient tongue id: 01140807411080_6_2_5
label yaofang:
甘草 白芍 薏苡仁 党参 白术 熟附子 山药 天麻 赤石脂 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.965506 0.304025 0.528284 0.567743 0.426923 0.316159 0.327442 0.318091 0.641439 0.555958 0.598354 0.422084 0.498096 0.520891
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.714286, recall: 0.666667, error: 0.285714
467. 
patient tongue id: 06041124157518_1
label yaofang:
白芍 川芎 当归 党参 太子参 黄芪 枸杞子 熟地黄 郁金 北柴胡 炙甘草 续断 盐菟丝子 酒女贞子 墨旱莲 干益母草
0.341511 0.384419 0.379966 0.378886 0.432782
predicted yaofang:
甘草 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
468. 
patient tongue id: 03211947277137_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗
0.383503 0.476331 0.361068 0.314327 0.316947 0.389826 0.310606 0.581284 0.615996
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.777778, recall: 0.636364, error: 0.222222
469. 
patient tongue id: 06182025467826_1_4_6
label yaofang:
桃仁 蒲公英 龙齿 黄芪 白术 砂仁 菟丝子 桑寄生 鸡内金 莲子 麦芽 首乌藤 土鳖虫 合欢皮
0.554296 0.398018 0.301585 0.462873 0.507292 0.329888 0.361832
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
470. 
patient tongue id: 02261101461368_1_6
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 山药 天麻 鳖甲 白花蛇舌草 浮小麦 蜈蚣 天山雪莲 合欢花 半枝莲
0.926999 0.300388 0.497888 0.537351 0.432561 0.308337 0.57745 0.484445 0.529409 0.37374 0.419895 0.433371
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
471. 
patient tongue id: 02142126299882_1_2
label yaofang:
法半夏 前胡 防风 太子参 黄芪 白芷 款冬花 紫菀 百部 北沙参 炙甘草 辛夷 广藿香 炒苍耳子 麸炒白术
0.36765 0.670191 0.392663 0.834109 0.467601 0.670209 0.33417 0.379384 0.381352 0.413955 0.718029 0.738092 0.66723 0.758968 0.338831 0.85989 0.432461 0.657393 0.560127 0.621352
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
472. 
patient tongue id: 02122101348965_6_5_1
label yaofang:
柴胡 白芍 黄芩 法半夏 大枣 茯苓 龙骨 牡蛎 党参 竹茹 郁金 石菖蒲 大黄 炙甘草 浮小麦 合欢花
0.865988 0.353785 0.420365 0.505062 0.408764 0.445082 0.318525 0.421586
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.187500, error: 0.625000
473. 
patient tongue id: 04131805467596_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 远志 党参 酸枣仁 丹参 胆南星 浙贝母 石菖蒲 白花蛇舌草 蜈蚣 醋鳖甲
0.973343 0.508835 0.574052 0.421532 0.66273 0.558663 0.60703 0.406047 0.489286 0.52606
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
474. 
patient tongue id: 02110736270713_1_3_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌
0.316762 0.35549 0.410847 0.318143 0.302764 0.553922 0.317743
predicted yaofang:
甘草 法半夏 茯苓 防风 紫菀 炙甘草 广藿香

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
475. 
patient tongue id: 06080204163206_5_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 远志 枸杞子 白术 酸枣仁 泽泻 天麻 麦芽 女贞子 首乌藤 沙苑子
0.977886 0.319195 0.536714 0.601285 0.409103 0.345802 0.361804 0.32733 0.690198 0.592627 0.617241 0.456223 0.536065 0.55856
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.428571, recall: 0.400000, error: 0.571429
476. 
patient tongue id: 04181934531716_1_2_6
label yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 知母 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.941254 0.514131 0.540194 0.407985 0.579918 0.466719 0.508427 0.34456 0.401123 0.410507
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.600000, error: 0.100000
477. 
patient tongue id: 02120939242868_1_6_5
label yaofang:
甘草 茯苓 金银花 党参 红花 牡丹皮 荆芥穗 天麻 鳖甲 麦芽 白鲜皮 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.96229 0.518709 0.576562 0.422512 0.325291 0.322005 0.321993 0.642923 0.541996 0.57402 0.415799 0.478509 0.490541
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
478. 
patient tongue id: 03261604189277_4
label yaofang:
甘草 桔梗 薄荷 芦根 桑叶 苦杏仁 百合 木蝴蝶 野马追
0.399393 0.311215 0.357211 0.328942
predicted yaofang:
甘草 茯苓 党参 炙甘草

------Score: precision: 0.250000, recall: 0.111111, error: 0.750000
479. 
patient tongue id: 03020715016086_5_7_1
label yaofang:
甘草 白芍 茯苓 白术 酸枣仁 牡丹皮 牛膝 车前子 益母草 鳖甲 淡竹叶 决明子 土鳖虫 谷精子
0.960212 0.508941 0.578013 0.450551 0.334086 0.317784 0.662215 0.547407 0.587417 0.40349 0.486588 0.532226
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
480. 
patient tongue id: 05092136143168_5_6
label yaofang:
甘草 白芍 茯苓 薏苡仁 党参 丹参 苍术 山药 泽泻 厚朴 砂仁 茵陈 扁豆花 虎杖 麦芽
0.961013 0.321462 0.506296 0.571302 0.402735 0.305272 0.62725 0.531583 0.558865 0.39827 0.466342 0.474647
predicted yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
481. 
patient tongue id: 01140543127190_1_2_6
label yaofang:
甘草 白芍 陈皮 茯苓 防风 党参 白术 赤芍 山药 天麻 五灵脂 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989567 0.539496 0.630592 0.418099 0.355858 0.356984 0.321768 0.762049 0.652531 0.683067 0.48903 0.588193 0.628066
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.687500, error: 0.153846
482. 
patient tongue id: 02161946166870_6
label yaofang:
柴胡 白芍 香附 枳壳 黄芩 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 浮小麦 紫苏梗
0.332273 0.332758 0.302008 0.333745 0.441871
predicted yaofang:
白芍 党参 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
483. 
patient tongue id: 01041852414357_2
label yaofang:
柴胡 白芍 黄芩 当归 阿胶 枳实 石膏 杏仁 细辛 干姜 大黄 生地 川朴 法夏
0.900615 0.462176 0.508053 0.422169 0.473689 0.371336 0.439955 0.310189 0.317991
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
484. 
patient tongue id: 04072006444776_1_4_7
label yaofang:
玄参 生地黄 海螵蛸 浙贝母 牡丹皮 郁金 仙鹤草 砂仁 鸡内金 枇杷叶 北沙参 蛤壳 首乌藤 鲜龙葵果
0.412029 0.323136 0.327039 0.40598 0.408425
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
485. 
patient tongue id: 01180602171656_1_2
label yaofang:
甘草 桔梗 麦冬 太子参 丹参 浙贝母 鳖甲 诃子 北沙参 鹿角霜 百合 白花蛇舌 天山雪莲 蜂房
0.95266 0.318692 0.505673 0.541395 0.3879 0.569472 0.48439 0.511627 0.365112 0.42235 0.415062
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
486. 
patient tongue id: 01192152376587_2_5
label yaofang:
甘草 黄芩 桔梗 防风 芦根 麦冬 丹参 玄参 生地黄 浙贝母 白茅根 车前子 鳖甲 鹿角霜 白花蛇舌 四季青
0.983445 0.301308 0.528652 0.620201 0.420676 0.377608 0.369909 0.330775 0.734697 0.631455 0.65873 0.488854 0.572294 0.616364
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.250000, error: 0.714286
487. 
patient tongue id: 06082011087953_1
label yaofang:
桂枝 白芍 川芎 当归 茯苓 防风 芦根 麦冬 党参 白术 五味子 延胡索 北沙参 炙甘草 女贞子
0.870367 0.441007 0.498718 0.461837 0.429241 0.300651 0.433475
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
488. 
patient tongue id: 05032251013285_5_7
label yaofang:
甘草 白芍 当归 茯苓 远志 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.976242 0.309766 0.526158 0.602525 0.412544 0.336173 0.347405 0.317668 0.686616 0.583652 0.608537 0.441588 0.524891 0.553049
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.857143, recall: 0.800000, error: 0.142857
489. 
patient tongue id: 06132011077602_4_7
label yaofang:
甘草 枳壳 半夏 橘红 薏苡仁 黄芪 胆南星 浙贝母 杜仲 厚朴 僵蚕 莪术 紫苏子 蝉蜕 辛夷 紫苏叶 蜈蚣 守宫
0.491391 0.397166 0.321613 0.452188 0.408719 0.320334
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.111111, error: 0.666667
490. 
patient tongue id: 02281249517102_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.454272 0.397972 0.342591 0.317126
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
491. 
patient tongue id: 06082028269834_2_5
label yaofang:
甘草 白芍 枳壳 薏苡仁 白术 海螵蛸 郁金 白茅根 泽泻 车前子 厚朴 射干 北沙参 土鳖虫 合欢皮 姜黄 预知子 蛇舌草
0.706777 0.43023 0.383239 0.347827 0.486837 0.331263
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.333333, recall: 0.111111, error: 0.666667
492. 
patient tongue id: 04121811008302_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.341895 0.766754 0.369905 0.928417 0.525244 0.768895 0.307652 0.388262 0.360677 0.41896 0.832257 0.848369 0.761688 0.865697 0.322905 0.944717 0.433023 0.75858 0.574554 0.717016
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
493. 
patient tongue id: 03111159067124_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.399618 0.323841 0.478925 0.400632 0.441386 0.475221 0.446093 0.484581 0.403778 0.442584 0.462523 0.49319 0.321465 0.475981 0.46697 0.519254
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
494. 
patient tongue id: 03022131402691_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.348 0.464509 0.353918 0.353732 0.302607 0.609647 0.684832
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
495. 
patient tongue id: 03261714162055_1
label yaofang:
当归 薏苡仁 党参 太子参 黄芪 山药 芡实 莲子 百合
0.895942 0.480525 0.498857 0.426738 0.528429 0.360879 0.44687 0.328903
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.125000, recall: 0.111111, error: 0.875000
496. 
patient tongue id: 04131836360588_1
label yaofang:
陈皮 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 广藿香
0.334156 0.651634 0.40394 0.811042 0.45882 0.638828 0.308709 0.355622 0.344514 0.390255 0.693761 0.710066 0.617642 0.723825 0.308244 0.846575 0.389589 0.632145 0.494259 0.594207
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
497. 
patient tongue id: 02161926544417_1_6
label yaofang:
茯苓 党参 黄芪 白术 山药 砂仁 补骨脂
0.519573 0.393437 0.348632 0.420743 0.440164 0.312177 0.304727
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.571429, error: 0.428571
498. 
patient tongue id: 06130757280187_1_2_4
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.484559 0.34629 0.448773 0.423061 0.41244 0.446129 0.426028 0.429568 0.355747 0.381228 0.388201 0.420447 0.370396 0.38995 0.377678 0.406351
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.250000, recall: 0.333333, error: 0.750000
499. 
patient tongue id: 04122056190651_1
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 天麻 鳖甲 扁豆花 佛手 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.979562 0.310492 0.510836 0.605819 0.422053 0.316148 0.31708 0.302762 0.700858 0.587539 0.632956 0.433656 0.521713 0.564151
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.714286, recall: 0.714286, error: 0.285714
------Average Score: average precision: 0.451038, average recall: 0.359729, error: 0.548962