5248/8539 [=================>............] - ETA: 37s - loss: 0.18052017-10-19 18:48:14.919101: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:247] PoolAllocator: After 31798 get requests, put_count=31797 evicted_count=1000 eviction_rate=0.0314495 and unsatisfied allocation rate=0.0346248
2017-10-19 18:48:14.919162: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
8512/8539 [============================>.] - ETA: 0s - loss: 0.1518Epoch 00000: val_loss improved from inf to 0.08988, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 99s - loss: 0.1517 - val_loss: 0.0899
Epoch 2/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0964Epoch 00001: val_loss improved from 0.08988 to 0.08222, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 96s - loss: 0.0964 - val_loss: 0.0822
Epoch 3/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0901Epoch 00002: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0901 - val_loss: 0.0831
Epoch 4/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0875Epoch 00003: val_loss improved from 0.08222 to 0.08019, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 96s - loss: 0.0875 - val_loss: 0.0802
Epoch 5/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0856Epoch 00004: val_loss improved from 0.08019 to 0.07688, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0856 - val_loss: 0.0769
Epoch 6/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0842Epoch 00005: val_loss improved from 0.07688 to 0.07595, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 96s - loss: 0.0842 - val_loss: 0.0760
Epoch 7/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0832Epoch 00006: val_loss improved from 0.07595 to 0.07577, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 96s - loss: 0.0832 - val_loss: 0.0758
Epoch 8/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0819Epoch 00007: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0819 - val_loss: 0.0769
Epoch 9/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0818Epoch 00008: val_loss improved from 0.07577 to 0.07465, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 96s - loss: 0.0818 - val_loss: 0.0746
Epoch 10/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0808Epoch 00009: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0808 - val_loss: 0.0755
Epoch 11/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0803Epoch 00010: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0802 - val_loss: 0.0764
Epoch 12/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0797Epoch 00011: val_loss improved from 0.07465 to 0.07462, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 96s - loss: 0.0797 - val_loss: 0.0746
Epoch 13/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0791Epoch 00012: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0791 - val_loss: 0.0750
Epoch 14/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0787Epoch 00013: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0787 - val_loss: 0.0749
Epoch 15/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0782Epoch 00014: val_loss improved from 0.07462 to 0.07408, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 98s - loss: 0.0781 - val_loss: 0.0741
Epoch 16/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0778Epoch 00015: val_loss did not improve
8539/8539 [==============================] - 100s - loss: 0.0777 - val_loss: 0.0741
Epoch 17/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0775Epoch 00016: val_loss improved from 0.07408 to 0.07343, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 98s - loss: 0.0775 - val_loss: 0.0734
Epoch 18/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0769Epoch 00017: val_loss did not improve
8539/8539 [==============================] - 99s - loss: 0.0770 - val_loss: 0.0738
Epoch 19/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0766Epoch 00018: val_loss did not improve
8539/8539 [==============================] - 100s - loss: 0.0766 - val_loss: 0.0739
Epoch 20/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0764Epoch 00019: val_loss improved from 0.07343 to 0.07318, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 98s - loss: 0.0764 - val_loss: 0.0732
Epoch 21/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0758Epoch 00020: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0758 - val_loss: 0.0735
Epoch 22/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0756Epoch 00021: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0756 - val_loss: 0.0738
Epoch 23/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0753Epoch 00022: val_loss improved from 0.07318 to 0.07308, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0753 - val_loss: 0.0731
Epoch 24/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0749Epoch 00023: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0749 - val_loss: 0.0738
Epoch 25/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0748Epoch 00024: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0748 - val_loss: 0.0734
Epoch 26/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0744Epoch 00025: val_loss did not improve
8539/8539 [==============================] - 98s - loss: 0.0744 - val_loss: 0.0737
Epoch 27/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0744Epoch 00026: val_loss did not improve
8539/8539 [==============================] - 99s - loss: 0.0744 - val_loss: 0.0733
Epoch 28/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0739Epoch 00027: val_loss improved from 0.07308 to 0.07278, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0739 - val_loss: 0.0728
Epoch 29/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0737Epoch 00028: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0736 - val_loss: 0.0737
Epoch 30/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0734Epoch 00029: val_loss improved from 0.07278 to 0.07257, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 96s - loss: 0.0735 - val_loss: 0.0726
Epoch 31/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0730Epoch 00030: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0730 - val_loss: 0.0728
Epoch 32/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0727Epoch 00031: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0727 - val_loss: 0.0731
Epoch 33/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0727Epoch 00032: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0727 - val_loss: 0.0732
Epoch 34/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0722Epoch 00033: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0722 - val_loss: 0.0729
Epoch 35/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0719Epoch 00034: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0719 - val_loss: 0.0729
Epoch 36/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0718Epoch 00035: val_loss improved from 0.07257 to 0.07254, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0718 - val_loss: 0.0725
Epoch 37/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0714Epoch 00036: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0714 - val_loss: 0.0732
Epoch 38/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0714Epoch 00037: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0714 - val_loss: 0.0736
Epoch 39/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0709Epoch 00038: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0709 - val_loss: 0.0731
Epoch 40/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0709Epoch 00039: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0709 - val_loss: 0.0732
Epoch 41/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0707Epoch 00040: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0707 - val_loss: 0.0730
Epoch 42/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0702Epoch 00041: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0702 - val_loss: 0.0731
Epoch 43/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0700Epoch 00042: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0700 - val_loss: 0.0732
Epoch 44/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0699Epoch 00043: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0699 - val_loss: 0.0741
Epoch 45/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0696Epoch 00044: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0696 - val_loss: 0.0735
Epoch 46/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0692Epoch 00045: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0692 - val_loss: 0.0735
Epoch 47/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0691Epoch 00046: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0691 - val_loss: 0.0733
Epoch 48/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0689Epoch 00047: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0689 - val_loss: 0.0737
Epoch 49/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0685Epoch 00048: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0685 - val_loss: 0.0732
Epoch 50/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0684Epoch 00049: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0684 - val_loss: 0.0739
Epoch 51/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0683Epoch 00050: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0683 - val_loss: 0.0741
Epoch 52/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0681Epoch 00051: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0682 - val_loss: 0.0745
Epoch 53/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0677Epoch 00052: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0678 - val_loss: 0.0744
Epoch 54/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0675Epoch 00053: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0675 - val_loss: 0.0742
Epoch 55/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0673Epoch 00054: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0673 - val_loss: 0.0743
Epoch 56/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0671Epoch 00055: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0671 - val_loss: 0.0741
Epoch 57/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0668Epoch 00056: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0668 - val_loss: 0.0740
Epoch 58/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0666Epoch 00057: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0666 - val_loss: 0.0746
Epoch 59/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0664Epoch 00058: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0664 - val_loss: 0.0747
Epoch 60/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0663Epoch 00059: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0662 - val_loss: 0.0752
Epoch 61/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00060: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0660 - val_loss: 0.0756
Epoch 62/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0657Epoch 00061: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0657 - val_loss: 0.0749
Epoch 63/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0656Epoch 00062: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0656 - val_loss: 0.0761
Epoch 64/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0653Epoch 00063: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0653 - val_loss: 0.0745
Epoch 65/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0650Epoch 00064: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0650 - val_loss: 0.0756
Epoch 66/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0648Epoch 00065: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0648 - val_loss: 0.0747
Epoch 67/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0646Epoch 00066: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0646 - val_loss: 0.0752
Epoch 68/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0643Epoch 00067: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0643 - val_loss: 0.0754
Epoch 69/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0641Epoch 00068: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0641 - val_loss: 0.0754
Epoch 70/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0640Epoch 00069: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0640 - val_loss: 0.0761
Epoch 71/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0637Epoch 00070: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0637 - val_loss: 0.0752
Epoch 72/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0636Epoch 00071: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0636 - val_loss: 0.0763
Epoch 73/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0637Epoch 00072: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0637 - val_loss: 0.0763
Epoch 74/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0634Epoch 00073: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0634 - val_loss: 0.0762
Epoch 75/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0631Epoch 00074: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0631 - val_loss: 0.0751
Epoch 76/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0630Epoch 00075: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0630 - val_loss: 0.0756
Epoch 77/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0627Epoch 00076: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0627 - val_loss: 0.0759
Epoch 78/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0625Epoch 00077: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0625 - val_loss: 0.0767
Epoch 79/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0624Epoch 00078: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0624 - val_loss: 0.0760
Epoch 80/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0621Epoch 00079: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0621 - val_loss: 0.0762
history: [(0.15169058404823615, None, 0.089875894970509601, None), (0.096401216653557928, None, 0.08221980593689196, None), (0.09012767630220786, None, 0.083053885689585202, None), (0.087531871825809127, None, 0.080190644541502876, None), (0.085645201492852638, None, 0.076877807686617089, None), (0.084200333555655787, None, 0.075953790556380157, None), (0.083165337408485224, None, 0.075769854443413873, None), (0.08193533107182896, None, 0.076876859743516518, None), (0.081755871680242453, None, 0.074649194821769932, None), (0.080829034341185754, None, 0.075494804661789219, None), (0.0802337679619783, None, 0.076411798159718075, None), (0.079720187627301722, None, 0.074617720758303613, None), (0.079088862471885402, None, 0.075034810837371888, None), (0.07868151595402216, None, 0.074853985382742058, None), (0.078145771272875753, None, 0.074075270239468458, None), (0.077740318173616124, None, 0.074093326516858821, None), (0.077511954028693805, None, 0.073425805776110492, None), (0.076970901448004336, None, 0.073766517224329295, None), (0.076625744340039756, None, 0.073906472614614957, None), (0.076360601632094433, None, 0.073177166365005153, None), (0.075780145231503934, None, 0.073527918739633241, None), (0.075601895972484304, None, 0.073847813647745286, None), (0.075331070856183041, None, 0.073075948671980223, None), (0.074914299113917421, None, 0.073821368562432876, None), (0.074842836552082848, None, 0.073371714888474882, None), (0.074404131624176237, None, 0.073727911372324484, None), (0.074412944257985322, None, 0.073314535011956977, None), (0.073877969727274381, None, 0.072779459612710137, None), (0.07363518602061514, None, 0.073668714135121077, None), (0.073460142519828908, None, 0.072568330845553364, None), (0.072965205458256466, None, 0.072792251850222492, None), (0.072739483710299438, None, 0.073071782241810809, None), (0.072659155221932781, None, 0.073166601168803677, None), (0.072201272234318895, None, 0.072924536062684245, None), (0.071905523090106227, None, 0.07288290723994538, None), (0.071825871615991174, None, 0.072543038908160218, None), (0.071373115402639492, None, 0.07323852503474379, None), (0.071376808115080154, None, 0.07363618462731987, None), (0.070932703481190712, None, 0.073139378903331331, None), (0.070946952599226301, None, 0.073236952225367233, None), (0.070730984228418725, None, 0.073020253753487446, None), (0.070221710276975047, None, 0.073071573188890029, None), (0.070030966989363591, None, 0.07324351856123397, None), (0.069873457201918496, None, 0.074088130651157852, None), (0.069646222424187443, None, 0.07352990804465262, None), (0.069233779566972617, None, 0.073514294820827442, None), (0.069064004687671571, None, 0.073300639733726719, None), (0.068872690802855158, None, 0.073727863775941482, None), (0.06854055149868761, None, 0.073182116334254921, None), (0.06835370318422497, None, 0.073871376149820325, None), (0.068254558535080931, None, 0.074091670113605457, None), (0.068153313757566614, None, 0.074483716144011572, None), (0.067770650744480049, None, 0.074410369380926475, None), (0.067487368825441332, None, 0.074170960393144095, None), (0.067272599773868236, None, 0.074250585839643585, None), (0.067149185569982422, None, 0.07406793133570598, None), (0.066791233661715327, None, 0.073993767082909528, None), (0.06663109734000025, None, 0.07463435708603143, None), (0.066400906997481413, None, 0.074674838546649872, None), (0.066238036945711773, None, 0.075159270630214672, None), (0.065983467288284761, None, 0.075598967817676804, None), (0.06570474423545769, None, 0.074856481327242028, None), (0.0655766481884624, None, 0.076113968760102665, None), (0.065273798531873928, None, 0.074528885029611136, None), (0.065015418253230858, None, 0.075626623554107472, None), (0.064779270869191233, None, 0.074681772417201225, None), (0.064576511248721075, None, 0.075204487030322731, None), (0.064304984057203696, None, 0.075402917797530528, None), (0.064085901136043164, None, 0.075417304022626558, None), (0.063971499320752648, None, 0.076096116923368901, None), (0.063659747284844151, None, 0.075162310412515212, None), (0.063609244795115857, None, 0.076318458759741026, None), (0.063705038001392406, None, 0.07632763683795929, None), (0.063444690700541442, None, 0.076150351555356183, None), (0.063131674824888726, None, 0.075109277971279934, None), (0.063005599655609715, None, 0.075558066040604985, None), (0.062733675394129149, None, 0.075912559916684913, None), (0.062489374059433819, None, 0.076667177971902783, None), (0.06240455065036437, None, 0.075956655509305956, None), (0.062102311682241805, None, 0.076192631717129936, None)]
0. 
patient tongue id: 04182205587528_5_1_7
label yaofang:
枳壳 薏苡仁 黄芪 白术 浙贝母 厚朴 地榆 槐花 北沙参 红豆杉 合欢皮 预知子 蛇舌草 稻芽
0.503016 0.384837 0.302622 0.368586 0.566512 0.631765 0.317813 0.379021 0.377293 0.309196 0.378471
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
1. 
patient tongue id: 05021508202689_1_4_7
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 天麻 桑寄生 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.661523 0.429639 0.43491 0.349237 0.341493
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
2. 
patient tongue id: 03312130132536_6_1_4
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 党参 酸枣仁 浙贝母 天麻 鳖甲 白前 麦芽 蒺藜 蜈蚣 天山雪莲 半枝莲
0.869751 0.442694 0.503548 0.536891 0.325464
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.800000, recall: 0.235294, error: 0.200000
3. 
patient tongue id: 02122107148190_4_7_1
label yaofang:
麻黄 甘草 黄芩 法半夏 前胡 桃仁 远志 五味子 细辛 干姜 鳖甲 白前 地龙 白花蛇舌
0.96339 0.303956 0.510682 0.557548 0.404519 0.305055 0.523841 0.465116 0.435986 0.359314 0.357086 0.36301
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
4. 
patient tongue id: 06182030018322_2_1_3
label yaofang:
丹参 天冬 钩藤 天麻 北沙参 女贞子 赭石 首乌藤 玉米须 合欢皮 墨旱莲 罗布麻
0.328919 0.386365 0.488358 0.448289 0.373491
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
5. 
patient tongue id: 05162048197214_2
label yaofang:
甘草 太子参 生地黄 浙贝母 黄柏 细辛 砂仁 白芷 鳖甲 北沙参 辛夷 白花蛇舌 天山雪莲 蜂房 四季青
0.995497 0.565261 0.614674 0.366148 0.356287 0.696018 0.641934 0.56597 0.508963 0.506467 0.521789
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
6. 
patient tongue id: 05032209361836_6
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.602501 0.400683 0.388514 0.41094 0.355384 0.303797
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
7. 
patient tongue id: 02182252409847_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 黄连 延胡索 川楝子 郁金 砂仁 五灵脂 柿蒂 麦芽 佛手 合欢花
0.951826 0.339294 0.488752 0.551904 0.416383 0.411309 0.322389 0.340221
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.133333, error: 0.750000
8. 
patient tongue id: 04181948547886_4_6
label yaofang:
甘草 陈皮 法半夏 茯苓 羌活 独活 连翘 薏苡仁 远志 党参 苍术 厚朴 砂仁 莱菔子 麦芽
0.933284 0.507597 0.532659 0.387979 0.489036 0.422832 0.383591 0.324927 0.316162 0.316015
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
9. 
patient tongue id: 01062353212507_1_6
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.400532 0.32654 0.436226 0.433025 0.384827 0.445495 0.394379 0.404472 0.364467 0.363977 0.399041 0.427435 0.374812 0.354329 0.371167 0.377562
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.250000, recall: 0.307692, error: 0.750000
10. 
patient tongue id: 05172118379077_6_7
label yaofang:
甘草 川芎 茯苓 枸杞子 白术 生地黄 牡丹皮 杜仲 山药 山茱萸 天麻 桑寄生 麦芽 地龙
0.979616 0.529641 0.568262 0.380372 0.308571 0.595953 0.534254 0.475498 0.421094 0.419803 0.437386
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
11. 
patient tongue id: 02182258536887_2_6
label yaofang:
甘草 柴胡 白芍 川芎 枳壳 当归 何首乌 生地黄 黄柏 砂仁 菟丝子 五灵脂 桑寄生 益母草 艾叶
0.982622 0.541221 0.586394 0.382532 0.306193 0.560276 0.508105 0.451137 0.389072 0.385934 0.381797
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.066667, error: 0.909091
12. 
patient tongue id: 02191628432476_6_1
label yaofang:
甘草 白芍 茯苓 薏苡仁 党参 生地黄 浙贝母 栀子 牡丹皮 山药 细辛 鳖甲 白花蛇舌 天山雪莲 骨碎补
0.602759 0.51478 0.484838 0.496331 0.404468 0.3221 0.315946 0.4857 0.472587 0.366829
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 细辛 款冬花 紫菀 炙甘草

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
13. 
patient tongue id: 05191953551582_2_5
label yaofang:
甘草 黄芩 芦根 牛蒡子 浙贝母 栀子 乌梅 黄柏 天花粉 白花蛇舌草 北沙参 蜂房 醋鳖甲 岗梅
0.961202 0.320951 0.513433 0.552889 0.381064 0.464131 0.40072 0.368311 0.301841
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌

------Score: precision: 0.111111, recall: 0.071429, error: 0.888889
14. 
patient tongue id: 04062010470215_4
label yaofang:
甘草 白芍 川芎 独活 牛膝 细辛 干姜 仙鹤草 地榆 蜈蚣 姜黄 海桐皮 鹿衔草
0.500764 0.355026 0.399479 0.397551 0.535364
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
15. 
patient tongue id: 03062145390911_1_5
label yaofang:
甘草 陈皮 桃仁 蒲公英 黄芪 延胡索 海螵蛸 浙贝母 厚朴 砂仁 白芷 火麻仁 鸡内金 蛤壳 土鳖虫 冬凌草
0.464636 0.392293 0.376206 0.341731 0.354453
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
16. 
patient tongue id: 02120943315241_5_6_7
label yaofang:
甘草 枳壳 独活 薏苡仁 党参 黄柏 郁金 山药 桑寄生 鳖甲 茵陈 虎杖 土鳖虫 牛大力 千斤拔
0.978338 0.524569 0.583955 0.395121 0.324966 0.607562 0.538436 0.491701 0.418254 0.42057 0.426423
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
17. 
patient tongue id: 05172109374413_2_6
label yaofang:
甘草 茯苓 太子参 白术 酸枣仁 红花 山药 山茱萸 天麻 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.987538 0.54022 0.606804 0.412476 0.349129 0.632681 0.561624 0.519627 0.432328 0.439726 0.460263
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
18. 
patient tongue id: 03221823085790_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷
0.954775 0.40934 0.996386 0.608657 0.846726 0.41656 0.330794 0.488248 0.980942 0.987347 0.967007 0.986421 0.993553 0.693919 0.671791 0.48707 0.882871
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.705882, recall: 0.800000, error: 0.294118
19. 
patient tongue id: 04122250094042_1_2
label yaofang:
甘草 川芎 党参 太子参 酸枣仁 生地黄 天麻 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.812924 0.481534 0.410575 0.451054
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
20. 
patient tongue id: 04132023570495_6_1_4
label yaofang:
甘草 茯苓 牡蛎 黄芪 白术 赤芍 浙贝母 厚朴 北沙参 合欢皮
0.530398 0.439154 0.381043 0.514921 0.527683 0.341788 0.316177 0.397208
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
21. 
patient tongue id: 05022133435030_6_7_1
label yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 熟地黄 知母 山药 地骨皮 秦艽 淫羊藿 女贞子 浮小麦
0.997631 0.558694 0.633782 0.384014 0.37927 0.762866 0.697399 0.641682 0.551319 0.56896 0.607061
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
22. 
patient tongue id: 04132019213277_1_7_6
label yaofang:
甘草 柴胡 白芍 黄芪 何首乌 丹参 枳实 郁金 小蓟 砂仁 珍珠母 浮小麦 首乌藤 百合
0.846101 0.441113 0.44225 0.446614
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
23. 
patient tongue id: 02190535322797_2_6_7
label yaofang:
甘草 远志 党参 酸枣仁 杜仲 地黄 天麻 桑寄生 白花蛇舌草 浮小麦 蜈蚣 合欢花 半枝莲 醋鳖甲
0.994008 0.548795 0.619192 0.39268 0.376154 0.713361 0.657964 0.613139 0.528657 0.547138 0.597304
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
24. 
patient tongue id: 05260620332210_6_7_2
label yaofang:
甘草 茯苓 党参 白术 山药 车前子 天麻 扁豆花 白花蛇舌草 建曲 蜈蚣 半枝莲 醋鳖甲 宽筋藤
0.982906 0.51468 0.598648 0.403575 0.35934 0.636906 0.55768 0.526972 0.440699 0.455919 0.506485
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
25. 
patient tongue id: 03232318493978_2_6
label yaofang:
甘草 茯苓 太子参 酸枣仁 栀子 乌梅 地黄 白花蛇舌草 首乌藤 蜂房 岗梅根 醋鳖甲
0.858294 0.307501 0.479185 0.496003 0.432454 0.302336
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
26. 
patient tongue id: 03161834396783_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.301191 0.85939 0.423032 0.968519 0.539269 0.734989 0.445587 0.396519 0.468699 0.912648 0.932509 0.890727 0.934599 0.302461 0.956831 0.596465 0.322859 0.600989 0.503838 0.786209
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
27. 
patient tongue id: 04252007349542_6_1
label yaofang:
甘草 柏子仁 干姜 砂仁 附片
0.375239 0.361104 0.304074 0.349181 0.565241
predicted yaofang:
白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
28. 
patient tongue id: 04130230528083_5
label yaofang:
甘草 桔梗 金银花 连翘 蒲公英 紫花地丁 党参 丹参 地黄 白芷 麦芽 皂角刺 白鲜皮
0.825424 0.440498 0.459348 0.319756 0.552478
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
29. 
patient tongue id: 05021437354414_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.474856 0.379081 0.402762 0.543768 0.441666 0.331752 0.322798
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
30. 
patient tongue id: 05022101393382_6_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 黄连 胆南星 牛膝 山药 细辛 瓜蒌皮 王不留行 麸炒枳壳
0.901421 0.323161 0.491991 0.514684 0.392312 0.406948 0.323811 0.319222
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
31. 
patient tongue id: 05140630081675_7_6
label yaofang:
甘草 柴胡 白芍 川芎 枳壳 当归 桃仁 党参 生地黄 红花 川楝子 菟丝子 五灵脂 益母草
0.980054 0.520436 0.598632 0.403317 0.358034 0.6102 0.540539 0.506281 0.423897 0.440901 0.488727
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
32. 
patient tongue id: 05032232123576_1_2
label yaofang:
甘草 薏苡仁 党参 酸枣仁 山药 灯心草 天麻 鳖甲 扁豆花 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.993253 0.531531 0.637401 0.404399 0.395675 0.720813 0.6435 0.619887 0.516258 0.53339 0.628965
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
33. 
patient tongue id: 03171028358481_1_4
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.321344 0.359102 0.377847
predicted yaofang:
甘草 茯苓 黄芪

------Score: precision: 0.666667, recall: 0.166667, error: 0.333333
34. 
patient tongue id: 03180154085892_6
label yaofang:
柴胡 大枣 茯苓 防风 连翘 太子参 昆布 海藻 乌梅 石斛 白花蛇舌草 猫爪草 山慈菇
0.315264 0.392465 0.381267 0.331619
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
35. 
patient tongue id: 04151235327602_2
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.861688 0.439219 0.964726 0.546415 0.711719 0.432619 0.385346 0.461479 0.910717 0.923738 0.878805 0.924381 0.945204 0.579524 0.574423 0.483994 0.777224
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.705882, recall: 0.750000, error: 0.294118
36. 
patient tongue id: 02120818547246_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 荆芥 鱼腥草 白术 浙贝母 白前 苦杏仁 紫苏子 贯众
0.971899 0.50418 0.557505 0.379096 0.327526 0.598808 0.530563 0.481027 0.422848 0.411986 0.426403
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
37. 
patient tongue id: 05241938423799_6_1
label yaofang:
甘草 陈皮 法半夏 茯苓 党参 黄连 砂仁 天麻 鳖甲 麦芽 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.82277 0.372552 0.426164 0.451105 0.379281
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
38. 
patient tongue id: 05032237235067_1_4
label yaofang:
甘草 法半夏 茯苓 桔梗 党参 白术 浙贝母 山药 鳖甲 诃子 蜈蚣 白花蛇舌 天山雪莲 蜂房 四季青
0.900787 0.317618 0.472242 0.523769 0.386435 0.431845 0.305154
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.333333, error: 0.285714
39. 
patient tongue id: 04300917010231_2_4
label yaofang:
甘草 茯苓 党参 白术 熟附子 杜仲 乌药 山茱萸 泽泻 车前子 天麻 补骨脂 桑螵蛸 地龙 益智 泽兰
0.677712 0.459177 0.381627
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 1.000000, recall: 0.187500, error: 0.000000
40. 
patient tongue id: 04211804461324_5
label yaofang:
黄芩 连翘 薄荷 薏苡仁 玄参 浙贝母 石菖蒲 茵陈 射干 豆蔻 马勃 广藿香 木蝴蝶
0.688677 0.305002 0.442909 0.3882 0.380168
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
41. 
patient tongue id: 02131307249812_1_4_7
label yaofang:
白芍 金银花 桃仁 蒲公英 生地黄 苍术 百部 苦参 白鲜皮 辛夷 关黄柏 地肤子 苍耳子
0.341207 0.323282 0.408393
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
42. 
patient tongue id: 06071857550090_5
label yaofang:
薏苡仁 黄芪 厚朴 佩兰 肉苁蓉 菟丝子 茵陈 金樱子 决明子 覆盆子
0.681996 0.418736 0.407708 0.620679 0.629018 0.605103 0.626284 0.65052 0.676153 0.741686 0.470147 0.701575 0.700331 0.738013
predicted yaofang:
桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.142857, recall: 0.200000, error: 0.857143
43. 
patient tongue id: 01192151343234_1_5_6
label yaofang:
甘草 薏苡仁 党参 白术 杜仲 天麻 巴戟天 鳖甲 莪术 豆蔻 败酱草 蜈蚣 天山雪莲 半枝莲 红豆杉
0.977603 0.516209 0.58502 0.417446 0.323506 0.59791 0.544188 0.515285 0.429227 0.445739 0.485504
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
44. 
patient tongue id: 01052202049911_6_4_7
label yaofang:
黄芪 白术 海螵蛸 浙贝母 砂仁 桑寄生 北沙参 桑枝 土鳖虫 红豆杉 合欢皮 山慈菇 预知子 蛇舌草
0.646222 0.396056 0.395992 0.537073 0.659332 0.36881 0.363981 0.332568
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
45. 
patient tongue id: 04271848465838_1_7
label yaofang:
桂枝 甘草 半夏 桃仁 蒲公英 黄芪 白术 浙贝母 厚朴 莪术 柿蒂 北沙参 赭石 蛇舌草
0.477377 0.33775 0.371991 0.564817 0.641686 0.301052 0.367006 0.335438
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
46. 
patient tongue id: 04291609484219_4_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 丹参 川楝子 郁金 山药 猪苓 鳖甲 虎杖 麦芽 鹿衔草
0.972543 0.493853 0.579094 0.396686 0.311704 0.558032 0.445979 0.433854 0.327018 0.342921 0.374483
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
47. 
patient tongue id: 04102052327469_2
label yaofang:
甘草 枳壳 桔梗 芦根 牛蒡子 麦冬 桑叶 菊花 白前 北沙参 苦杏仁 木蝴蝶 野马追 东风桔
0.844952 0.342282 0.432487 0.493354 0.427835 0.313212
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
48. 
patient tongue id: 02182300481802_6_3
label yaofang:
甘草 法半夏 当归 茯苓 远志 党参 酸枣仁 红花 熟地黄 山药 石菖蒲 巴戟天 金樱子 锁阳 蜈蚣 合欢花
0.92921 0.329306 0.486391 0.520655 0.377837 0.427015 0.331601 0.322629
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
49. 
patient tongue id: 03101917247123_4
label yaofang:
甘草 川芎 当归 桔梗 龙骨 桃仁 柏子仁 生地黄 红花 赤芍 肉桂 北柴胡
0.425636 0.374542 0.400923 0.414616 0.346049
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
50. 
patient tongue id: 05272343384152_4_7_5
label yaofang:
枳壳 黄芪 白术 海螵蛸 浙贝母 杜仲 白茅根 砂仁 补骨脂 鸡内金 紫苏梗 稻芽
0.478706 0.393974 0.385561 0.385316
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
51. 
patient tongue id: 01140005071438_2_6
label yaofang:
甘草 茯苓 党参 何首乌 丹参 山茱萸 天麻 鳖甲 决明子 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.970877 0.300503 0.477733 0.57812 0.401583 0.36891 0.328225 0.320757 0.323346 0.649 0.560213 0.55432 0.475257 0.472506 0.543066
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.642857, error: 0.400000
52. 
patient tongue id: 05222036078681_5
label yaofang:
金银花 蒲公英 丹参 黄连 乌梅 郁金 灯心草 厚朴 王不留行 枇杷叶 木蝴蝶 土茯苓 青天葵
0.727468 0.422832 0.392636 0.383382 0.533313
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
53. 
patient tongue id: 05162026499288_6_4
label yaofang:
桂枝 甘草 柴胡 白芍 枳壳 薏苡仁 黄芪 丹参 五味子 虎杖 白花蛇舌草 制何首乌 田基黄
0.32171 0.461902 0.319666 0.32549 0.374063 0.354924 0.321555 0.337919 0.525825 0.639892
predicted yaofang:
柴胡 白芍 香附 当归 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.153846, error: 0.800000
54. 
patient tongue id: 04130900128686_6_4
label yaofang:
甘草 茯苓 白术 酸枣仁 丹参 生地黄 赤芍 山茱萸 天麻 桑寄生 补骨脂 麦芽 天山雪莲
0.977597 0.537057 0.576977 0.414239 0.322236 0.569467 0.53129 0.483752 0.423683 0.414381 0.411953
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
55. 
patient tongue id: 03312046296299_2_6
label yaofang:
甘草 白芍 薏苡仁 熟附子 赤芍 郁金 山药 天麻 鳖甲 扁豆花 败酱草 续断 浮小麦 半枝莲 牛大力
0.932489 0.504959 0.536052 0.417702 0.301252 0.302696 0.480729 0.412591 0.406754 0.317566 0.311288 0.319188
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
56. 
patient tongue id: 05242239414775_6_4_2
label yaofang:
甘草 柴胡 白芍 茯苓 木香 党参 黄芪 白术 黄连 乌梅 山药 车前子 干姜 补骨脂 白扁豆 建曲 广升麻
0.920566 0.308261 0.493975 0.52064 0.418728 0.37003 0.314762
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.294118, error: 0.285714
57. 
patient tongue id: 04130631448736_4_6
label yaofang:
甘草 川芎 党参 白术 生地黄 牡丹皮 杜仲 牛膝 山茱萸 钩藤 天麻 桑寄生 蒺藜 沙苑子 牛大力
0.969077 0.525241 0.559805 0.39423 0.553813 0.492758 0.455776 0.390886 0.392394 0.41203
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
58. 
patient tongue id: 06050804150416_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.357056 0.34897 0.366995 0.422809 0.303146
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
59. 
patient tongue id: 05131449394558_7_6
label yaofang:
桂枝 甘草 川芎 当归 茯苓 金银花 桃仁 红花 赤芍 益母草 吴茱萸 建曲 土鳖虫
0.981113 0.536653 0.574062 0.383611 0.31209 0.579189 0.52533 0.463136 0.410541 0.399696 0.401817
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
60. 
patient tongue id: 03221959554521_5_6
label yaofang:
甘草 柴胡 白芍 香附 法半夏 茯苓 党参 白术 生地黄 栀子 牡丹皮 黄柏 淡竹叶 麦芽 浮小麦 百合
0.961482 0.399312 0.5262 0.31198 0.464221 0.459007 0.385974 0.309668
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
61. 
patient tongue id: 01180622047955_1
label yaofang:
甘草 茯苓 龙骨 薏苡仁 远志 党参 白术 酸枣仁 牛膝 山药 桑寄生 补骨脂 白扁豆 首乌藤 合欢花
0.994195 0.551572 0.607295 0.393398 0.374717 0.303177 0.717018 0.662706 0.615104 0.532169 0.536424 0.571322
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
62. 
patient tongue id: 02120806384943_1_4
label yaofang:
甘草 白芍 木香 党参 鸡血藤 山药 车前子 天麻 赤石脂 鳖甲 补骨脂 建曲 蜈蚣 天山雪莲 半枝莲
0.831917 0.339918 0.454865 0.476989 0.377381 0.324018
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
63. 
patient tongue id: 01032105449163_6_4
label yaofang:
甘草 川芎 羌活 独活 鸡血藤 白术 赤芍 天麻 白花蛇舌草 麦芽 蜈蚣 半枝莲 醋鳖甲 骨碎补
0.933684 0.460382 0.533744 0.351735 0.521781 0.304962
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
64. 
patient tongue id: 02120815050441_6
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 当归 茯苓 桃仁 党参 白术 红花 山药 砂仁 豆蔻
0.98818 0.513181 0.603405 0.385707 0.606784 0.486631 0.470595 0.340707 0.35878 0.389095
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
65. 
patient tongue id: 02151843111610_4
label yaofang:
甘草 白芍 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 炒僵蚕
0.317142 0.814203 0.432287 0.944159 0.520518 0.685336 0.424463 0.38068 0.438521 0.874933 0.898193 0.851992 0.902737 0.317769 0.930866 0.55223 0.310032 0.572578 0.50919 0.743107
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.050000, recall: 0.071429, error: 0.950000
66. 
patient tongue id: 03062124405515_1_4_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 砂仁 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲
0.990378 0.546232 0.601949 0.390834 0.354126 0.304125 0.661201 0.631596 0.561426 0.506375 0.506061 0.526439
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
67. 
patient tongue id: 02211433334613_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.437864 0.374434 0.397289 0.358157 0.406937
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
68. 
patient tongue id: 02210155059517_1_2
label yaofang:
桂枝 当归 黄芪 鸡血藤 阿胶 白术 砂仁 补骨脂 鸡内金 黄精 稻芽 红芪 红参
0.457545 0.403847 0.318405 0.303744 0.568259 0.55941 0.333341 0.320639 0.444124
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
69. 
patient tongue id: 01041855275700_2_5
label yaofang:
柴胡 黄芩 当归 玄参 石膏 杏仁 薏仁 川朴
0.924269 0.312676 0.47664 0.536744 0.405241 0.417719 0.310291 0.330485
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
70. 
patient tongue id: 04301136059351_2_6
label yaofang:
甘草 柴胡 白芍 木香 党参 太子参 黄连 延胡索 砂仁 五灵脂 麦芽 北沙参 鱼古 瓦楞子
0.961164 0.309676 0.514113 0.576024 0.436055 0.309278 0.510966 0.426219 0.419785 0.315139 0.321652 0.329121
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
71. 
patient tongue id: 04112215261003_6_2
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 佛手 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.925137 0.461229 0.547846 0.375728 0.3069 0.546694 0.323787
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 蜈蚣

------Score: precision: 1.000000, recall: 0.500000, error: 0.000000
72. 
patient tongue id: 03291334143938_4_6
label yaofang:
桂枝 甘草 白芍 茯苓 桃仁 生地黄 牡丹皮 郁金 山药 山茱萸 泽泻 莪术 决明子 浮小麦 建曲
0.974887 0.518682 0.600971 0.459478 0.356008 0.307134 0.584305 0.532288 0.532729 0.398284 0.413924 0.470643
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
73. 
patient tongue id: 04141958349993_1_4
label yaofang:
甘草 黄芩 桔梗 芦根 麦冬 浙贝母 天麻 天花粉 鳖甲 诃子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.983363 0.539836 0.581482 0.415804 0.369308 0.302208 0.321812 0.641209 0.606144 0.567907 0.499892 0.500673 0.521895
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
74. 
patient tongue id: 04181951103840_2_1
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 车前子 砂仁 菟丝子 巴戟天 桑寄生 鹿角霜 续断 艾叶
0.318626 0.477471 0.382966 0.386476 0.310591 0.3037 0.51397 0.641264
predicted yaofang:
柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
75. 
patient tongue id: 04062017233514_1
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.862283 0.354265 0.458352 0.520165 0.423711 0.317672
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
76. 
patient tongue id: 02281214483318_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.382754 0.375165 0.329579 0.385416 0.438165 0.357804 0.302158 0.344353
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
77. 
patient tongue id: 05031857245713_4
label yaofang:
桂枝 枳壳 茯苓 麦冬 酸枣仁 五味子 天冬 石斛 佛手 合欢皮 石榴皮
0.430006 0.318833 0.375071 0.366829 0.382614 0.390535
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
78. 
patient tongue id: 06190805299131_1_6
label yaofang:
甘草 茯苓 龙骨 远志 酸枣仁 龙眼肉 地黄 天麻 补骨脂 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲
0.902295 0.437447 0.524453 0.390899 0.451537
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
79. 
patient tongue id: 02181604218231_6_2_4
label yaofang:
甘草 法半夏 茯苓 桔梗 酸枣仁 浙贝母 杜仲 天麻 鳖甲 紫菀 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.95967 0.504593 0.542485 0.400651 0.302672 0.5423 0.471895 0.441291 0.368922 0.37007 0.387741
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
80. 
patient tongue id: 05260647373965_1_2_7
label yaofang:
甘草 党参 白术 酸枣仁 丹参 生地黄 天麻 鳖甲 首乌藤 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.961286 0.330241 0.487227 0.582994 0.412686 0.318196 0.535457 0.442608 0.441912 0.326326 0.354397 0.39641
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
81. 
patient tongue id: 03302309265143_2_5
label yaofang:
甘草 麦冬 丹参 黄连 牡丹皮 僵蚕 麦芽 粉葛 百合 紫苏叶 黑枣 木蝴蝶 合欢皮 预知子
0.880065 0.343191 0.505617 0.419294
predicted yaofang:
甘草 法半夏 茯苓 党参

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
82. 
patient tongue id: 03231215527335_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄 炒六神曲
0.638044 0.41395 0.757397 0.410891 0.533444 0.657694 0.685601 0.670374 0.716452 0.343883 0.774878 0.392541 0.433583 0.392295 0.53964
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.733333, recall: 0.785714, error: 0.266667
83. 
patient tongue id: 03240612596856_1_2_6
label yaofang:
甘草 白芍 川芎 陈皮 防风 枸杞子 白术 黄连 牛膝 地黄 干姜 天麻 酒女贞子 墨旱莲
0.991478 0.543724 0.603473 0.381854 0.346381 0.650451 0.598375 0.532661 0.467138 0.473833 0.500232
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
84. 
patient tongue id: 03111435096075_6
label yaofang:
甘草 柴胡 白芍 香附 生地黄 延胡索 赤芍 杜仲 天花粉 瓜蒌皮 皂角刺 续断 川木瓜 宽筋藤 田七末
0.983666 0.535445 0.580667 0.396388 0.333353 0.604613 0.536396 0.491009 0.422222 0.419342 0.432899
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.066667, error: 0.909091
85. 
patient tongue id: 03111714098381_6_5
label yaofang:
甘草 独活 酸枣仁 生地黄 延胡索 杜仲 山药 山茱萸 桑寄生 麦芽 威灵仙 川木瓜 土茯苓 牛大力 千斤拔
0.471111 0.379083 0.392714 0.326413 0.35544
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
86. 
patient tongue id: 03061506095891_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 延胡索 赤芍 海螵蛸 牛膝
0.417975 0.302654 0.390204 0.388818 0.326985 0.394179 0.526146
predicted yaofang:
白芍 当归 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
87. 
patient tongue id: 03311648289040_4
label yaofang:
陈皮 桔梗 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 猫爪草 山慈菇
0.398726 0.317301 0.322319 0.419667 0.360323
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
88. 
patient tongue id: 04122057576971_4_1_6
label yaofang:
甘草 当归 薏苡仁 党参 黄芪 鸡血藤 丹参 砂仁 天麻 鳖甲 补骨脂 莪术 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.98975 0.523884 0.622353 0.42617 0.357406 0.665629 0.598986 0.582247 0.460391 0.489005 0.575042
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.411765, error: 0.363636
89. 
patient tongue id: 04211744048137_4
label yaofang:
白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.830369 0.416521 0.945497 0.518238 0.691846 0.404952 0.381388 0.460023 0.882826 0.902409 0.864403 0.90556 0.308474 0.936881 0.568727 0.574654 0.496064 0.772332
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.800000, error: 0.333333
90. 
patient tongue id: 02181558053229_5
label yaofang:
甘草 川芎 黄芩 桔梗 金银花 浙贝母 细辛 白芷 蔓荆子 辛夷 广藿香 苍耳子
0.963818 0.504675 0.538966 0.35755 0.53282 0.424378 0.395408 0.313203 0.314683 0.334508
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.083333, error: 0.900000
91. 
patient tongue id: 03022202171620_1
label yaofang:
柴胡 陈皮 枳壳 当归 木香 党参 黄芪 枸杞子 白术 青皮 川楝子 槟榔 牛膝 乌药 车前子 高良姜 小茴香 炙甘草 黄精
0.642129 0.369868 0.383142 0.447368 0.368087
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.105263, error: 0.600000
92. 
patient tongue id: 03012204468651_1_6_2
label yaofang:
甘草 茯苓 党参 白术 杜仲 山药 天麻 槐花 桑寄生 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.978211 0.542614 0.559576 0.373631 0.530672 0.472314 0.415678 0.368511 0.354816 0.335682
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
93. 
patient tongue id: 04282038419013_1_6_5
label yaofang:
甘草 柴胡 白芍 黄芪 白术 丹参 延胡索 海螵蛸 枳实 砂仁 北沙参 广金钱草
0.528563 0.376769 0.422601 0.466399 0.343972 0.301493
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
94. 
patient tongue id: 05230811378034_1_2
label yaofang:
甘草 法半夏 桔梗 橘红 防风 金银花 太子参 藿香 白前 鸡内金 蜜百部 干鱼腥草
0.35093 0.552282 0.433902 0.400911 0.53412 0.50897 0.498088 0.47874 0.488747 0.530118 0.572468 0.400125 0.51857 0.523046 0.541965
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.066667, recall: 0.083333, error: 0.933333
95. 
patient tongue id: 02201840047067_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.302922 0.785085 0.417556 0.920998 0.504969 0.666226 0.383139 0.331603 0.392674 0.848665 0.866612 0.828846 0.873749 0.881068 0.511294 0.558694 0.504607 0.704688
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
96. 
patient tongue id: 01111907510030_5
label yaofang:
陈皮 茯苓 前胡 桔梗 半夏 神曲 款冬花 紫菀 白前 百部 炙甘草 广藿香
0.866714 0.391342 0.973881 0.562233 0.767124 0.430531 0.384106 0.498783 0.930777 0.950246 0.909892 0.9465 0.968883 0.623485 0.31242 0.642977 0.518781 0.804824
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.750000, error: 0.500000
97. 
patient tongue id: 04201858525959_4
label yaofang:
陈皮 茯苓 前胡 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄
0.857166 0.431299 0.969146 0.551246 0.716207 0.437345 0.397259 0.461981 0.917844 0.934034 0.886007 0.933014 0.956564 0.588718 0.314981 0.577111 0.48764 0.780897
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.750000, error: 0.500000
98. 
patient tongue id: 02260649080182_1_6
label yaofang:
甘草 远志 党参 黄芪 白术 酸枣仁 生地黄 天麻 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.999793 0.576958 0.71559 0.359372 0.391189 0.863367 0.790292 0.745067 0.610426 0.655143 0.737337
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
99. 
patient tongue id: 04131818541667_2_1
label yaofang:
甘草 陈皮 茯苓 薏苡仁 党参 白术 五味子 天麻 鳖甲 补骨脂 莪术 蜈蚣 白花蛇舌 天山雪莲
0.917928 0.320281 0.501898 0.540268 0.445893 0.335128 0.308449 0.326273 0.503922 0.444524 0.457267 0.353282 0.353694 0.384516
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.642857, recall: 0.642857, error: 0.357143
100. 
patient tongue id: 02181624531776_1
label yaofang:
甘草 柴胡 白芍 川芎 黄芪 天麻 蔓荆子 鳖甲 皂角刺 辛夷 蜈蚣 苍耳子 白花蛇舌 天山雪莲 半枝莲
0.986691 0.538338 0.579235 0.390339 0.353444 0.641754 0.57829 0.535105 0.46608 0.4593 0.473663
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
101. 
patient tongue id: 05162054544492_4_6
label yaofang:
甘草 柴胡 白芍 香附 黄芩 当归 茯苓 薄荷 白术 黄连 麦芽 广藿香
0.451698 0.35465 0.342854 0.334158 0.399288 0.656028
predicted yaofang:
白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
102. 
patient tongue id: 05161207246043_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.433137 0.312994 0.439459 0.428462 0.476114 0.432248 0.351406 0.406709 0.341695 0.348114 0.365622 0.304067 0.322341 0.330457 0.303011
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.733333, recall: 0.916667, error: 0.266667
103. 
patient tongue id: 05262359590639_6_7
label yaofang:
甘草 川芎 茯苓 党参 红花 赤芍 桑寄生 鳖甲 续断 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.869671 0.33429 0.459716 0.512737 0.409126 0.381598
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
104. 
patient tongue id: 03301959026757_4
label yaofang:
甘草 茯苓 半夏 牛蒡子 薏苡仁 鱼腥草 黄芪 白术 赤芍 浙贝母 杜仲 泽泻 僵蚕 白芷 蝉蜕 辛夷 紫苏叶 蜈蚣 猫爪草 冬凌草
0.630639 0.453812 0.432916 0.360281 0.47929
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.200000, error: 0.200000
105. 
patient tongue id: 01061557292574_1_4
label yaofang:
桂枝 甘草 白芍 黄芪 白术 赤芍 山药 山茱萸 车前子 菟丝子 益母草 猪苓 桑螵蛸 益智 泽兰 广升麻
0.973616 0.519648 0.578563 0.418716 0.340919 0.595308 0.531875 0.507335 0.420185 0.422715 0.456371
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
106. 
patient tongue id: 05042105441117_4
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.441326 0.312803 0.33105 0.315549 0.45673 0.687202
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.100000, error: 0.833333
107. 
patient tongue id: 06041129403541_2_4
label yaofang:
白芍 太子参 黄芪 枸杞子 柏子仁 郁金 石决明 北柴胡 煅牡蛎 北沙参 山萸肉 炙甘草 制远志 酒女贞子 煅龙骨 炒酸枣仁
0.325462 0.567773 0.461022 0.653152 0.428181 0.485088 0.323194 0.363219 0.350352 0.359396 0.584958 0.597741 0.569175 0.60408 0.353964 0.66688 0.401672 0.308332 0.423435 0.365978 0.483387
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.142857, recall: 0.187500, error: 0.857143
108. 
patient tongue id: 05102023116065_9
label yaofang:
法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 麸炒白术
0.327442 0.750427 0.437344 0.891885 0.488815 0.61456 0.391853 0.342458 0.39676 0.814953 0.826209 0.778376 0.84014 0.340376 0.860893 0.504104 0.305746 0.510796 0.456298 0.673092
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
109. 
patient tongue id: 06191325531391_1_2
label yaofang:
甘草 茯苓 太子参 鸡血藤 白术 生地黄 浙贝母 山药 鳖甲 补骨脂 北沙参 白花蛇舌 蜂房 岗梅根 四季青
0.945215 0.505277 0.515797 0.381012 0.479312 0.404593 0.372926 0.313299
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌

------Score: precision: 0.625000, recall: 0.333333, error: 0.375000
110. 
patient tongue id: 03012313302163_5_6_1
label yaofang:
柴胡 白芍 陈皮 防风 党参 白术 黄连 生地黄 牡丹皮 乌梅 山药 仙鹤草 茜草 麦芽 炙甘草
0.546843 0.30971 0.371546 0.441786 0.323596
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
111. 
patient tongue id: 06111055447015_1_2_4
label yaofang:
甘草 桃仁 党参 鸡血藤 白术 酸枣仁 红花 延胡索 胆南星 杜仲 补骨脂 麦芽 续断 牛大力
0.971607 0.306352 0.525334 0.579011 0.390554 0.311647 0.549799 0.499889 0.436977 0.375964 0.384628 0.383671
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
112. 
patient tongue id: 04291515533195_1_6_7
label yaofang:
甘草 白芍 防风 独活 党参 红花 延胡索 细辛 大黄 肉苁蓉 桑寄生 补骨脂 制川乌 天山雪莲 牛大力
0.936879 0.324684 0.50036 0.551436 0.401576 0.479476 0.39522 0.388148 0.308814 0.323914
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
113. 
patient tongue id: 04202010497529_1
label yaofang:
茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁 火麻仁 柿蒂 鸡内金 枇杷叶 北沙参 辛夷 紫苏梗
0.391707 0.344797 0.332326 0.425615 0.424277 0.300596 0.354092 0.335309
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
114. 
patient tongue id: 06072000236399_6_5
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 丹参 黄连 郁金 山药 天麻 粉葛 沙苑子 合欢花
0.976984 0.53431 0.572871 0.375889 0.318645 0.583945 0.534732 0.464083 0.424574 0.422269 0.433311
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
115. 
patient tongue id: 04182028119036_2_7
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.32259 0.434318 0.327793 0.336653 0.323973 0.355128 0.307553 0.598387
predicted yaofang:
甘草 白芍 茯苓 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.166667, error: 0.750000
116. 
patient tongue id: 01042328310873_1_7
label yaofang:
桂枝 甘草 茯苓 桃仁 党参 白术 丹参 牡丹皮 郁金 山药 地黄 菟丝子 益母草 莪术
0.995713 0.5501 0.629171 0.376148 0.379035 0.736656 0.659833 0.608659 0.523306 0.543466 0.604942
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
117. 
patient tongue id: 01211225397343_2
label yaofang:
阿胶 生地黄 红花 白芷 冬瓜子 辛夷 苍耳子 猫爪草 风栗壳
0.463254 0.399666 0.366044 0.400493 0.331385 0.410373
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
118. 
patient tongue id: 04061833511919_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.326757 0.717904 0.452775 0.856626 0.479117 0.618242 0.303368 0.404542 0.371881 0.415683 0.761024 0.783206 0.748623 0.801321 0.34129 0.83532 0.504381 0.315843 0.526874 0.484871 0.654137
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
119. 
patient tongue id: 04222314019689_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.308819 0.679687 0.452944 0.838142 0.469777 0.603242 0.368598 0.316633 0.375931 0.73934 0.750773 0.704052 0.765597 0.320782 0.804159 0.474077 0.510158 0.423964 0.590267
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
120. 
patient tongue id: 05262108284657_6_1
label yaofang:
甘草 白芍 陈皮 茯苓 防风 党参 白术 黄连 乌梅 山药 细辛 车前子 干姜 粉葛 建曲
0.995425 0.539829 0.619977 0.370953 0.375983 0.749324 0.680359 0.623185 0.548637 0.569925 0.626732
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
121. 
patient tongue id: 03291614178929_2_5_6
label yaofang:
甘草 桔梗 羌活 紫花地丁 黄芪 浙贝母 白芷 鳖甲 款冬花 皂角刺 蜈蚣 白花蛇舌 龙葵果 广升麻 蒿苯
0.898548 0.315991 0.47821 0.517222 0.405905 0.388665 0.300573 0.31167
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
122. 
patient tongue id: 02241846021589_4_1
label yaofang:
防风 钩藤 荆芥穗 白芷 香薷 豆蔻 炙甘草 紫苏梗 广藿香 麸炒白术
0.490458 0.405984 0.517872 0.329145 0.436615 0.432581 0.466425 0.503218 0.482682 0.635475 0.301693 0.302205
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.250000, recall: 0.300000, error: 0.750000
123. 
patient tongue id: 03020812598367_5
label yaofang:
甘草 防风 金银花 桃仁 蒲公英 黄芪 黄连 生地黄 红花 荆芥穗 火麻仁 麦芽 白鲜皮 建曲 重楼
0.983917 0.509232 0.589838 0.400872 0.30832 0.589216 0.499936 0.493507 0.379975 0.38768 0.449206
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.066667, error: 0.909091
124. 
patient tongue id: 06031127327540_2_5
label yaofang:
甘草 黄芩 桔梗 金银花 牛蒡子 麦冬 太子参 玄参 浙贝母 鳖甲 白花蛇舌 蜂房 岗梅根 四季青
0.974509 0.532119 0.562603 0.38962 0.339277 0.594159 0.54198 0.483637 0.434151 0.431419 0.438241
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
125. 
patient tongue id: 04121849553094_2_5
label yaofang:
甘草 黄芪 白术 红花 赤芍 浙贝母 牡丹皮 杜仲 郁金 桑叶 莪术 麦芽 北沙参 蝉蜕 桑椹 木蝴蝶 预知子
0.495134 0.421202 0.509818 0.513655 0.400549
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.800000, recall: 0.235294, error: 0.200000
126. 
patient tongue id: 01192220409169_5_6
label yaofang:
甘草 川芎 茯苓 葛根 羌活 薏苡仁 远志 白术 杜仲 石膏 桑寄生 胡黄连 广藿香 骨碎补
0.914822 0.473472 0.525253 0.43811 0.386287 0.331942
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
127. 
patient tongue id: 06012008172050_1_6
label yaofang:
甘草 茯苓 桔梗 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.988844 0.544155 0.610042 0.387559 0.352738 0.656437 0.606405 0.546734 0.486525 0.497669 0.544084
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.785714, error: 0.000000
128. 
patient tongue id: 05312318078421_6_4_2
label yaofang:
甘草 茯苓 远志 白术 酸枣仁 丹参 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.991636 0.539597 0.623575 0.394367 0.401855 0.301947 0.713648 0.649372 0.604154 0.52457 0.555991 0.607367
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
129. 
patient tongue id: 05102211420047_1_2
label yaofang:
陈皮 法半夏 茯苓 前胡 麦冬 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.868487 0.426436 0.967011 0.540418 0.702101 0.41355 0.370923 0.423859 0.913929 0.929384 0.890649 0.934308 0.31595 0.955203 0.558265 0.561612 0.507387 0.787438
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.812500, error: 0.277778
130. 
patient tongue id: 05022019405311_2_6
label yaofang:
甘草 白芍 川芎 茯苓 木香 龙骨 远志 党参 酸枣仁 丹参 生地黄 天麻 浮小麦 首乌藤
0.97609 0.531228 0.578286 0.403286 0.539248 0.470029 0.433162 0.354965 0.353275 0.352279
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
131. 
patient tongue id: 01070846255460_1_2
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 泽泻 干姜
0.430031 0.389017 0.402785 0.325019 0.318196
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 1.000000, recall: 0.416667, error: 0.000000
132. 
patient tongue id: 02202246296718_1_6_2
label yaofang:
甘草 白芍 枸杞子 酸枣仁 生地黄 山茱萸 菊花 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 木贼
0.885416 0.344496 0.473412 0.505062 0.399611 0.369756 0.316563
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
133. 
patient tongue id: 01121850319496_2
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.339977 0.615941 0.440999 0.742147 0.451305 0.551445 0.309007 0.384432 0.360626 0.385505 0.672076 0.690226 0.649686 0.698259 0.337046 0.759739 0.447438 0.318978 0.475208 0.408322 0.547419
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
134. 
patient tongue id: 05232103420527_6_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 枳实 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.338865 0.316487 0.494457 0.379437 0.347705 0.411371 0.550781
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
135. 
patient tongue id: 04111959201922_1_4_7
label yaofang:
党参 黄芪 枸杞子 海螵蛸 杜仲 牛膝 乌药 生半夏 砂仁 僵蚕 菟丝子 鳖甲 莪术 紫苏梗 红豆杉 荔枝核
0.565561 0.445701 0.338715
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.333333, recall: 0.062500, error: 0.666667
136. 
patient tongue id: 02241440241654_1
label yaofang:
陈皮 桔梗 太子参 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.32546 0.378801 0.324988 0.452105 0.305044 0.322943
predicted yaofang:
甘草 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
137. 
patient tongue id: 02191245186561_1_6_4
label yaofang:
甘草 薏苡仁 桃仁 党参 酸枣仁 红花 延胡索 天麻 五灵脂 瓜蒌皮 白花蛇舌草 蜈蚣 合欢花 醋鳖甲 姜黄 川贝母粉
0.995847 0.542623 0.611308 0.397647 0.367308 0.300739 0.741152 0.68188 0.646321 0.540779 0.549984 0.604949
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
138. 
patient tongue id: 02231415272573_2
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.316603 0.773009 0.427814 0.906845 0.502464 0.638599 0.420178 0.38965 0.43 0.831499 0.85185 0.795834 0.856192 0.896679 0.526268 0.311246 0.527803 0.45711 0.694801
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 1.000000, error: 0.368421
139. 
patient tongue id: 05092106114917_2_1_7
label yaofang:
甘草 柴胡 白芍 葛根 党参 鸡血藤 山茱萸 天麻 白花蛇舌草 玉米须 蜈蚣 合欢花 半枝莲 醋鳖甲
0.95493 0.507331 0.539025 0.419856 0.490557 0.406867 0.412305 0.308225 0.306235 0.307206
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
140. 
patient tongue id: 03231846164081_2_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 威灵仙 蜜麻黄
0.309812 0.830631 0.420979 0.956576 0.536643 0.705192 0.445015 0.41114 0.461206 0.892517 0.918493 0.866175 0.912637 0.94778 0.570392 0.328122 0.576572 0.489505 0.752881
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
141. 
patient tongue id: 03152034413621_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.547727 0.403199 0.391506 0.32263
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
142. 
patient tongue id: 02260706016587_1_6
label yaofang:
甘草 川芎 茯苓 羌活 薏苡仁 牛膝 郁金 细辛 全蝎 白芷 蔓荆子 鳖甲 莪术 天山雪莲 半枝莲
0.862154 0.46436 0.503477 0.308651 0.56634 0.35949
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
143. 
patient tongue id: 03271541493500_6
label yaofang:
麻黄 桂枝 柴胡 白芍 黄芩 法半夏 当归 葛根 桃仁 熟地黄 栀子 白茅根 水蛭 三七 旋覆花 炙甘草 赭石 红参
0.982762 0.535007 0.596285 0.395205 0.362596 0.312327 0.641465 0.585633 0.530225 0.468314 0.473736 0.486338
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
144. 
patient tongue id: 05270757427920_2_4
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.40329 0.327155 0.359774 0.433596 0.418957 0.370123 0.340361 0.316752
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 车前子

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
145. 
patient tongue id: 04222124581202_2
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.805001 0.421488 0.943569 0.514714 0.69259 0.422175 0.384383 0.442662 0.871466 0.898958 0.846494 0.900317 0.936914 0.561681 0.303918 0.580146 0.481826 0.740721
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.785714, error: 0.388889
146. 
patient tongue id: 02231832119362_2
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.308172 0.789894 0.453947 0.912854 0.507129 0.632452 0.427015 0.407357 0.431827 0.841174 0.858116 0.815594 0.862694 0.320332 0.907529 0.523712 0.320704 0.518427 0.468368 0.709892
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
147. 
patient tongue id: 02150735084801_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.578172 0.414506 0.424293 0.362175 0.307924 0.310245
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
148. 
patient tongue id: 04181959442598_4_6
label yaofang:
甘草 前胡 防风 金银花 黄芪 白术 荆芥穗 天麻 鳖甲 茵陈 款冬花 蜈蚣 白花蛇舌 天山雪莲 半枝莲 大青叶
0.848537 0.337107 0.443484 0.506515 0.41914
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
149. 
patient tongue id: 04061332287399_4_7
label yaofang:
甘草 柴胡 黄芩 法半夏 茯苓 前胡 桔梗 桃仁 远志 浙贝母 细辛 款冬花 紫菀 白前 地龙
0.820785 0.445805 0.480202 0.319978 0.461576 0.301598
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
150. 
patient tongue id: 02110733330242_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.471953 0.357947 0.428825 0.455985 0.381142 0.428289 0.381544 0.390002 0.310646 0.35276 0.375874 0.392332 0.39368 0.328939 0.342478 0.327893
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
151. 
patient tongue id: 04151229139078_1
label yaofang:
茯苓 防风 党参 太子参 黄芪 枸杞子 山药 芡实 豆蔻 北沙参 炒白扁豆 麸炒白术 炒稻芽 炒麦芽
0.31164 0.638699 0.427259 0.779272 0.461414 0.581797 0.355725 0.341366 0.386989 0.690833 0.738908 0.683261 0.719682 0.801974 0.447629 0.319043 0.499444 0.376486 0.562832
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.105263, recall: 0.142857, error: 0.894737
152. 
patient tongue id: 02211857272771_1_7
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.679192 0.372798 0.385381 0.456932 0.369147
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
153. 
patient tongue id: 03231059309963_5_6
label yaofang:
甘草 法半夏 茯苓 薏苡仁 白术 栀子 佩兰 天麻 滑石 鳖甲 白花蛇舌草 麦芽 苦杏仁 蜈蚣 天山雪莲 半枝莲
0.984372 0.504178 0.569457 0.517929 0.31792 0.550677 0.517696 0.611574 0.39583 0.407193 0.518359
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
154. 
patient tongue id: 06011957532756_2_7_6
label yaofang:
甘草 白芍 党参 酸枣仁 生地黄 红花 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜 宽筋藤
0.968723 0.311644 0.513829 0.567323 0.417462 0.358245 0.31493 0.3149 0.611924 0.566878 0.541045 0.460706 0.4724 0.51673
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.714286, recall: 0.714286, error: 0.285714
155. 
patient tongue id: 05290806100049_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 延胡索 浙贝母 郁金 天麻 瓜蒌皮 鳖甲 鸡内金 麦芽 皂角刺 蜈蚣 白花蛇舌 天山雪莲
0.978537 0.300229 0.53211 0.561751 0.391805 0.320758 0.573428 0.514853 0.47021 0.402365 0.395734 0.385047
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.470588, error: 0.333333
156. 
patient tongue id: 04211415191438_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.305957 0.881349 0.362189 0.977284 0.559354 0.788593 0.464088 0.420612 0.525602 0.942519 0.958311 0.917193 0.957244 0.97581 0.639826 0.319537 0.657439 0.52017 0.820969
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
157. 
patient tongue id: 02211827570903_4_1
label yaofang:
大枣 党参 太子参 黄芪 枸杞子 山药 白芷 芡实 煅牡蛎 北沙参 辛夷 浮小麦 麸炒白术 煅龙骨
0.864719 0.416627 0.966302 0.551482 0.712514 0.424067 0.382815 0.457258 0.918452 0.930724 0.889304 0.934707 0.950616 0.574321 0.577818 0.513813 0.792115
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.117647, recall: 0.142857, error: 0.882353
158. 
patient tongue id: 02131323185418_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.357894 0.496219 0.440485 0.329651 0.493086 0.447044 0.441186 0.372149 0.441766 0.493714 0.474232 0.379056 0.418861 0.415534 0.454842
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
159. 
patient tongue id: 03022149411791_1_6
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 王不留行 豆蔻 姜半夏 炙甘草 紫苏梗
0.320979 0.483142 0.369097 0.35425 0.512594 0.593083
predicted yaofang:
柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
160. 
patient tongue id: 03081839403859_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.321757 0.325621 0.310666 0.36207
predicted yaofang:
甘草 茯苓 党参 钩藤

------Score: precision: 0.250000, recall: 0.066667, error: 0.750000
161. 
patient tongue id: 03101737585550_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.309833 0.636713 0.454493 0.756395 0.432599 0.537829 0.305264 0.336868 0.338099 0.337792 0.654143 0.689207 0.669342 0.707728 0.36277 0.791725 0.408202 0.446667 0.417181 0.561569
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
162. 
patient tongue id: 05160624158637_5_4
label yaofang:
甘草 陈皮 茯苓 半夏 薏苡仁 浙贝母 杜仲 砂仁 僵蚕 芡实 金樱子 枇杷叶 蛤壳 鲜龙葵果
0.540074 0.374614 0.336974 0.312278 0.6336 0.700638 0.439627 0.401371 0.340371 0.441897
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
163. 
patient tongue id: 06082001004237_1_7
label yaofang:
白芍 桃仁 麦冬 黄芪 丹参 红花 延胡索 牛膝 三七 珍珠母 北沙参 浮小麦 威灵仙 宽筋藤 黑老虎 制草乌
0.319117 0.387791 0.43257 0.408195 0.358899 0.400092 0.337793 0.382033 0.436899 0.353261 0.392264 0.30348 0.557837 0.317725 0.356593
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香

------Score: precision: 0.133333, recall: 0.125000, error: 0.866667
164. 
patient tongue id: 04282305449084_2_6
label yaofang:
甘草 薏苡仁 党参 酸枣仁 生地黄 栀子 天麻 鳖甲 莪术 北沙参 浮小麦 百合 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.983537 0.528073 0.605598 0.410602 0.34915 0.632778 0.562406 0.526845 0.435244 0.448055 0.482611
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
165. 
patient tongue id: 03061501301352_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.413714 0.459224 0.309317 0.390368 0.346372 0.49128
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
166. 
patient tongue id: 05022116084396_1_6_2
label yaofang:
甘草 白芍 党参 鸡血藤 酸枣仁 丹参 生地黄 杜仲 天麻 鳖甲 麦芽 蜈蚣 天山雪莲 半枝莲
0.9872 0.550607 0.589408 0.361743 0.341346 0.633689 0.590281 0.508672 0.47562 0.468339 0.4791
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
167. 
patient tongue id: 04020809330346_6_7_4
label yaofang:
甘草 川芎 桃仁 枸杞子 白术 酸枣仁 赤芍 牛膝 泽泻 天麻 磁石 地龙 佛手 粉葛 浮小麦 合欢花
0.51151 0.321474 0.389542 0.419316 0.350546
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
168. 
patient tongue id: 03020800179926_3_5_7
label yaofang:
甘草 白芍 薏苡仁 太子参 郁金 山药 山茱萸 大腹皮 砂仁 鳖甲 补骨脂 莪术 白花蛇舌草 白扁豆 天山雪莲 泽兰
0.99564 0.55038 0.643486 0.415058 0.413858 0.302347 0.758218 0.704826 0.670512 0.562907 0.593665 0.686494
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
169. 
patient tongue id: 04071422593039_1_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.86181 0.426833 0.96899 0.552099 0.72536 0.428571 0.38592 0.456337 0.920181 0.933925 0.893169 0.93508 0.306386 0.954693 0.581155 0.313066 0.58615 0.511496 0.787221
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
170. 
patient tongue id: 04131821180308_2_1_6
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 丹参 地黄 天麻 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.791352 0.452554 0.44374 0.459728
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.285714, error: 0.000000
171. 
patient tongue id: 05042033007056_6_1
label yaofang:
陈皮 桔梗 牛蒡子 海螵蛸 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.311204 0.308083 0.462757 0.372366 0.372347 0.432718 0.573497
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
172. 
patient tongue id: 01132136527130_5_6
label yaofang:
甘草 茯苓 生地黄 牡丹皮 杜仲 乌药 山药 山茱萸 泽泻 桑寄生 王不留行 桑螵蛸 益智 鹿角霜
0.923597 0.482962 0.513436 0.366228 0.438222 0.310082 0.313095
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
173. 
patient tongue id: 06012108596980_6
label yaofang:
麻黄 甘草 黄芩 茯苓 黄芪 白术 杜仲 厚朴 僵蚕 辛夷 蜈蚣 猫爪草
0.55213 0.354947 0.384986 0.321841 0.668459 0.748352 0.324474 0.335453 0.525856 0.447319 0.395899 0.455779 0.311999 0.309548
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮 蛇舌草

------Score: precision: 0.428571, recall: 0.500000, error: 0.571429
174. 
patient tongue id: 03221951480008_2
label yaofang:
甘草 白芍 桔梗 玉竹 太子参 酸枣仁 生地黄 浙贝母 鳖甲 北沙参 白花蛇舌 天山雪莲 合欢花 四季青
0.99097 0.551324 0.597179 0.375229 0.337928 0.648847 0.611992 0.533308 0.487776 0.487724 0.498079
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
175. 
patient tongue id: 01172253298583_2_5
label yaofang:
甘草 党参 生地黄 牛膝 郁金 细辛 天麻 鳖甲 莪术 北沙参 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.986866 0.547052 0.584873 0.380989 0.341728 0.631784 0.585277 0.511418 0.465482 0.463437 0.466111
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
176. 
patient tongue id: 06132014119207_4
label yaofang:
麻黄 桂枝 甘草 牡蛎 葶苈子 太子参 黄芪 泽泻 厚朴 僵蚕 苦杏仁 黑枣 蜈蚣
0.505091 0.375987 0.339219 0.599267 0.657167 0.405125 0.383718 0.323053 0.395473
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
177. 
patient tongue id: 01041644254644_1
label yaofang:
木香 柏子仁 青皮 海螵蛸 川楝子 槟榔 乌药 车前子 高良姜 小茴香 附片
0.705902 0.407058 0.473465 0.31237 0.537324
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
178. 
patient tongue id: 02202241213647_4_7
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 牛蒡子 桃仁 远志 浙贝母 细辛 干姜 款冬花 射干 蝉蜕 威灵仙
0.963125 0.522682 0.548859 0.383561 0.310764 0.532927 0.491337 0.438043 0.385981 0.378063 0.377131
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
179. 
patient tongue id: 02122216213472_5
label yaofang:
甘草 法半夏 当归 茯苓 前胡 黄连 黄柏 牛膝 石膏 细辛 砂仁 白芷 款冬花 麦芽 苦杏仁 广升麻
0.982522 0.535597 0.598907 0.411542 0.356677 0.613999 0.55847 0.509718 0.436968 0.443253 0.457621
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
180. 
patient tongue id: 04300911268862_1_4
label yaofang:
甘草 法半夏 前胡 桃仁 远志 五味子 细辛 天麻 鳖甲 白前 苦杏仁 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.911965 0.307946 0.506045 0.508837 0.349698 0.421626 0.347501 0.307835
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
181. 
patient tongue id: 02171930431054_2_1
label yaofang:
麦冬 玉竹 黄芪 酸枣仁 天冬 柏子仁 杜仲 厚朴 砂仁 巴戟天 川贝母 鸡内金 珍珠母 麦芽 北沙参 首乌藤 百合 红豆杉 合欢皮 墨旱莲
0.461589 0.325627 0.362433 0.414914 0.536054 0.360287 0.355693 0.366761
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝

------Score: precision: 0.125000, recall: 0.050000, error: 0.875000
182. 
patient tongue id: 05022023535253_6_4
label yaofang:
甘草 柴胡 白芍 茯苓 党参 延胡索 川楝子 天麻 五灵脂 鳖甲 麦芽 蜈蚣 天山雪莲 半枝莲 红豆杉
0.972839 0.526024 0.574582 0.388793 0.325142 0.558902 0.489896 0.44644 0.381227 0.379371 0.391469
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
183. 
patient tongue id: 06080138238120_4_6
label yaofang:
甘草 川芎 法半夏 茯苓 龙骨 远志 党参 鸡血藤 酸枣仁 龙眼肉 丹参 知母 浮小麦 合欢花
0.827209 0.377303 0.528309 0.315866 0.477974
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
184. 
patient tongue id: 06031040437174_2
label yaofang:
桂枝 甘草 白芍 茯苓 牡蛎 白术 天冬 生地黄 山药 山茱萸 泽泻 车前子 桑螵蛸 龟甲
0.961885 0.521706 0.557177 0.416579 0.304941 0.51458 0.434524 0.427521 0.327737 0.329003 0.33738
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
185. 
patient tongue id: 06072243261904_1_4
label yaofang:
甘草 木香 远志 党参 酸枣仁 生地黄 杜仲 天麻 鳖甲 补骨脂 首乌藤 蜈蚣 天山雪莲 半枝莲
0.960385 0.506127 0.550858 0.38854 0.52974 0.444534 0.419688 0.349265 0.337316 0.354837
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
186. 
patient tongue id: 02281841159432_4
label yaofang:
甘草 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 香薷 紫菀 百部 辛夷 紫苏梗 广藿香 苍耳子
0.309606 0.781888 0.431806 0.919597 0.498038 0.644032 0.392434 0.348035 0.394514 0.844031 0.857985 0.806838 0.866012 0.327161 0.899164 0.510036 0.526804 0.47558 0.699026
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.368421, recall: 0.466667, error: 0.631579
187. 
patient tongue id: 05232040382904_1_4_7
label yaofang:
陈皮 太子参 黄芪 枸杞子 白术 龙眼肉 杜仲 牛膝 乌药 厚朴 补骨脂 川贝母 莪术 麦芽 桑椹 紫苏叶 骨碎补 龟甲 预知子 荔枝核
0.462221 0.409931 0.343161 0.381521 0.384412
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.100000, error: 0.600000
188. 
patient tongue id: 03231232177847_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.630325 0.454512 0.748254 0.463627 0.517676 0.36824 0.323166 0.350653 0.667892 0.676409 0.624393 0.653396 0.692779 0.413665 0.448841 0.33667 0.498345
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.647059, recall: 0.846154, error: 0.352941
189. 
patient tongue id: 06171333445688_1_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.327978 0.418195 0.305715 0.368976 0.364197 0.519138
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
190. 
patient tongue id: 02211431393837_1_4_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.403537 0.341572 0.44415 0.414073 0.454593 0.427357 0.373524 0.41681 0.360478 0.377259 0.385918 0.411942 0.316546 0.388814 0.388151 0.394409
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.312500, recall: 0.416667, error: 0.687500
191. 
patient tongue id: 02212230165457_1_2_4
label yaofang:
茯苓 桔梗 橘红 芦根 浙贝母 莱菔子 鳖甲 扁豆花 紫苏子 浮小麦 白花蛇舌 蜂房 四季青 红豆杉
0.826273 0.327048 0.457193 0.486879 0.415386 0.368403
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
192. 
patient tongue id: 04260746466167_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.377665 0.441041 0.458674 0.431133 0.363417 0.384899 0.306328 0.400251 0.408279 0.373711 0.370168 0.493015 0.336199
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 炙甘草 广藿香

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
193. 
patient tongue id: 03271928139865_1_4
label yaofang:
法半夏 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.312853 0.76479 0.445792 0.91323 0.501756 0.647822 0.400534 0.350473 0.412835 0.838256 0.851293 0.794905 0.856009 0.331303 0.878699 0.525637 0.527666 0.463537 0.685898
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.923077, error: 0.368421
194. 
patient tongue id: 03171053199903_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.41983 0.3131 0.530501 0.472466 0.422275 0.510272 0.488329 0.481826 0.412204 0.472009 0.495546 0.536266 0.408272 0.475884 0.489848 0.482687
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
195. 
patient tongue id: 04112042173492_6_5
label yaofang:
甘草 柴胡 白芍 木香 薏苡仁 白及 党参 白术 黄连 山药 益智仁 桑螵蛸 佛手 麸炒枳壳
0.975598 0.528883 0.570181 0.380851 0.305324 0.552194 0.489525 0.439299 0.382785 0.379459 0.381984
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
196. 
patient tongue id: 05090831322810_1_3
label yaofang:
柴胡 茯苓 黄芪 茵陈 白花蛇舌草
0.391782 0.359321 0.314045 0.494359 0.364558
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.400000, error: 0.600000
197. 
patient tongue id: 03211935355960_4
label yaofang:
柴胡 黄芩 党参 白术 侧柏叶 泽泻 天麻 姜半夏 炙甘草 续断
0.363317 0.570421 0.410685 0.306043 0.303642 0.302908 0.350067 0.398279 0.748579 0.828155
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.400000, error: 0.600000
198. 
patient tongue id: 01201317515436_1_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 牛蒡子 浙贝母 茜草 天麻 鳖甲 诃子 蜈蚣 白花蛇舌 岗梅根 四季青
0.903172 0.494347 0.489715 0.3829 0.440704 0.304205 0.318551
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.333333, error: 0.285714
199. 
patient tongue id: 06010233594224_4_7
label yaofang:
甘草 柴胡 白芍 茯苓 浙贝母 牡丹皮 郁金 茵陈 虎杖 决明子 蜂房 红曲
0.91893 0.476323 0.530691 0.395804 0.446808 0.316279
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
200. 
patient tongue id: 06091835387355_5
label yaofang:
甘草 白芍 当归 独活 党参 槟榔 乌药 钩藤 车前子 天麻 全蝎 肉苁蓉 火麻仁 姜半夏 瓜蒌子 制枳实
0.82384 0.390512 0.510467 0.308721 0.37695
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
201. 
patient tongue id: 03081819132815_1_4_7
label yaofang:
党参 黄芪 白术 海螵蛸 浙贝母 杜仲 厚朴 山楂 淫羊藿 火麻仁 鸡内金 桑螵蛸 北沙参 蜈蚣 鲜龙葵果
0.472885 0.388751 0.31238 0.337399 0.597848 0.618007 0.408044 0.372571 0.347632 0.441069
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.600000, recall: 0.400000, error: 0.400000
202. 
patient tongue id: 06072313215898_1_7_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桃仁 远志 细辛 款冬花 苦杏仁 炙麻黄 紫苏梗
0.987404 0.512685 0.60103 0.387217 0.348343 0.637409 0.549071 0.527268 0.429793 0.427316 0.495247
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.166667, error: 0.818182
203. 
patient tongue id: 03151852280477_1_4
label yaofang:
甘草 牛蒡子 浙贝母 射干 豆蔻 马勃 姜半夏 广藿香 龙脷叶
0.455973 0.344342 0.336638 0.475278 0.658996
predicted yaofang:
白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.111111, error: 0.800000
204. 
patient tongue id: 06041120382959_2_4
label yaofang:
茯苓 牡蛎 防风 麦冬 玉竹 党参 太子参 黄芪 枸杞子 白术 山药 芡实 北沙参 干石斛 煅龙骨
0.337237 0.577974 0.453571 0.66177 0.429626 0.501399 0.331152 0.366337 0.365632 0.363757 0.588292 0.616293 0.596244 0.625287 0.369837 0.710545 0.418353 0.323541 0.444121 0.411035 0.522897
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.190476, recall: 0.266667, error: 0.809524
205. 
patient tongue id: 01042304321914_4
label yaofang:
甘草 浙贝母 牛膝 苍术 干姜 草果 仙鹤草 淡竹叶 生石膏 豆蔻 姜半夏 川木通 龙脷叶
0.445934 0.450969 0.325137 0.428761 0.392326 0.311382 0.45666
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
206. 
patient tongue id: 01312300226144_7_6_2
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 天麻 鳖甲 麦芽 首乌藤 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.990401 0.536208 0.611525 0.417453 0.375668 0.313482 0.689395 0.621682 0.587754 0.493963 0.504752 0.547185
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
207. 
patient tongue id: 05140357551033_6
label yaofang:
甘草 龙骨 桃仁 党参 酸枣仁 丹参 红花 郁金 厚朴 天麻 全蝎 鳖甲 火麻仁 王不留行 瓜蒌子 浮小麦
0.980203 0.509363 0.601562 0.431325 0.379038 0.303053 0.652334 0.552534 0.552171 0.414667 0.442638 0.525322
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
208. 
patient tongue id: 06080218074044_6_1_4
label yaofang:
甘草 法半夏 前胡 桃仁 远志 党参 天麻 鳖甲 白前 苦杏仁 紫苏子 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991835 0.538022 0.612538 0.407059 0.384853 0.69009 0.621586 0.586447 0.495323 0.513415 0.567695
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
209. 
patient tongue id: 02170808596620_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.781392 0.474777 0.408347 0.322615
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
210. 
patient tongue id: 03290703239550_6_1
label yaofang:
甘草 白芍 茯苓 木香 白术 生地黄 牡丹皮 山药 白茅根 泽泻 菟丝子 益母草 芡实 益智 蜈蚣 广金钱草
0.983308 0.307889 0.537228 0.590433 0.402333 0.313461 0.564012 0.514662 0.471408 0.390443 0.393629 0.403019
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
211. 
patient tongue id: 02191026066517_2_7
label yaofang:
甘草 白芍 荆芥 防风 红花 地黄 天麻 火麻仁 白花蛇舌草 麦芽 白鲜皮 制何首乌 半枝莲 醋鳖甲
0.998832 0.576045 0.677653 0.390848 0.418801 0.801483 0.747731 0.705007 0.601233 0.629448 0.693897
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
212. 
patient tongue id: 04142239147562_6_4_1
label yaofang:
甘草 白芍 法半夏 茯苓 党参 酸枣仁 黄连 生地黄 山药 石菖蒲 鳖甲 首乌藤 白花蛇舌 天山雪莲 合欢花
0.897584 0.322663 0.472333 0.518423 0.36841 0.441886
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
213. 
patient tongue id: 01050644521371_1_2
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 菟丝子 益母草 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.947147 0.497856 0.556425 0.410365 0.486154 0.394477 0.395681 0.329771
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 1.000000, recall: 0.500000, error: 0.000000
214. 
patient tongue id: 02190542079680_6_4
label yaofang:
甘草 白芍 黄芩 茯苓 桔梗 金银花 浙贝母 天麻 鳖甲 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜
0.653556 0.417512 0.351874 0.444315 0.366952
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
215. 
patient tongue id: 02281928283958_1
label yaofang:
茯苓 党参 白术 乌药 肉桂 白芷 益智仁 诃子 浮小麦 百合
0.339269 0.517132 0.346532 0.334484 0.332462 0.33084 0.325721 0.629013 0.714043
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.200000, error: 0.777778
216. 
patient tongue id: 04272305356455_6_4
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮
0.643436 0.377912 0.360663 0.414339 0.394481
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
217. 
patient tongue id: 03242133426313_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.303368 0.446861 0.30012 0.39804 0.387355 0.40447 0.556369
predicted yaofang:
柴胡 白芍 当归 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.363636, error: 0.428571
218. 
patient tongue id: 05172057505966_2_6
label yaofang:
甘草 柴胡 白芍 茯苓 白术 黄连 延胡索 川楝子 山药 泽泻 车前子 五灵脂 桑寄生 桑螵蛸
0.991454 0.538855 0.618094 0.390788 0.357473 0.687197 0.6238 0.569982 0.495622 0.505266 0.543731
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
219. 
patient tongue id: 03181805202709_2_6
label yaofang:
甘草 茯苓 太子参 白术 五味子 浙贝母 郁金 山药 山茱萸 天麻 鳖甲 淫羊藿 补骨脂 蜈蚣 白花蛇舌 天山雪莲 川加皮
0.484772 0.366676 0.355213 0.45625 0.430521 0.306428 0.366846 0.300633 0.342415 0.319657
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 红花 牛膝 天麻

------Score: precision: 0.400000, recall: 0.235294, error: 0.600000
220. 
patient tongue id: 03170916165006_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.434481 0.35264 0.323872 0.407474 0.379331 0.346284 0.300578
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
221. 
patient tongue id: 05161913566401_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄
0.305441 0.642038 0.453819 0.763805 0.454887 0.542957 0.381794 0.362128 0.383491 0.671973 0.698537 0.654597 0.69521 0.318854 0.787071 0.435694 0.30493 0.452835 0.374147 0.546373
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
222. 
patient tongue id: 01041812199397_2
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 炒紫苏子 蜜麻黄 北海参 醋五味子
0.332247 0.523391 0.447062 0.537452 0.373597 0.380036 0.327307 0.310843 0.478514 0.581942 0.374432 0.389009 0.641187 0.376576
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香

------Score: precision: 0.642857, recall: 0.562500, error: 0.357143
223. 
patient tongue id: 02161834335559_1
label yaofang:
陈皮 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.78097 0.443532 0.905416 0.50095 0.608894 0.391098 0.36551 0.396167 0.83033 0.843734 0.793837 0.842884 0.3002 0.888913 0.496025 0.493091 0.444519 0.693313
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.928571, error: 0.277778
224. 
patient tongue id: 02211403126167_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.557301 0.369376 0.441845 0.444246 0.376843 0.303136
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
225. 
patient tongue id: 05242002307658_1_7
label yaofang:
桂枝 甘草 川芎 茯苓 鸡血藤 白术 红花 赤芍 牡丹皮 天麻 全蝎 僵蚕
0.989432 0.547815 0.608286 0.409698 0.363316 0.300222 0.643722 0.590168 0.546411 0.469409 0.476912 0.498615
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
226. 
patient tongue id: 05162143340353_1_2
label yaofang:
甘草 白芍 川芎 茯苓 党参 枸杞子 白术 酸枣仁 生地黄 赤芍 细辛 天麻 白芷 菟丝子 益母草 建曲
0.971358 0.523639 0.573889 0.395188 0.316403 0.565456 0.491655 0.446535 0.378778 0.381246 0.389117
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
227. 
patient tongue id: 05261922343216_3
label yaofang:
白芍 桔梗 五味子 僵蚕 百部 苦杏仁 紫苏子 炙甘草 紫苏叶 紫苑
0.585188 0.404292 0.414653 0.414426 0.483314
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
228. 
patient tongue id: 03151853179476_6_1
label yaofang:
桂枝 柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.353212 0.515504 0.349212 0.304307 0.326439 0.334928 0.339681 0.354065 0.626779 0.710526
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.700000, recall: 0.636364, error: 0.300000
229. 
patient tongue id: 05221923039529_1
label yaofang:
陈皮 法半夏 大枣 茯苓 桔梗 牛蒡子 白术 大腹皮 厚朴 白芷 炙甘草 紫苏叶 广藿香 徐长卿
0.345231 0.510203 0.345067 0.306206 0.357284 0.348332 0.326071 0.344198 0.586037 0.679426
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
230. 
patient tongue id: 04112045506199_2
label yaofang:
甘草 桔梗 鸡血藤 酸枣仁 丹参 生地黄 浙贝母 山茱萸 天花粉 鳖甲 补骨脂 麦芽 白花蛇舌 蜂房 四季青
0.953398 0.308328 0.514726 0.550188 0.398686 0.480342 0.407654 0.378471 0.3114 0.309755 0.311271
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
231. 
patient tongue id: 03100450513393_5_7
label yaofang:
甘草 白芍 茯苓 独活 党参 鸡血藤 生地黄 杜仲 细辛 桑寄生 三棱 莪术 制川乌 续断 牛大力
0.859074 0.479722 0.491801 0.448495 0.381691 0.302459 0.350768
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
232. 
patient tongue id: 01200647149022_1_4
label yaofang:
甘草 薏苡仁 党参 白术 酸枣仁 砂仁 天麻 豆蔻 白花蛇舌草 白扁豆 建曲 蜈蚣 半枝莲 醋鳖甲
0.993997 0.526125 0.63491 0.434446 0.410591 0.320437 0.737348 0.656381 0.647904 0.508046 0.539564 0.620711
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
233. 
patient tongue id: 01182133515805_6_4
label yaofang:
甘草 香附 党参 丹参 生地黄 郁金 薤白 天麻 瓜蒌皮 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲
0.887888 0.329535 0.472214 0.503816 0.415565 0.321293
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
234. 
patient tongue id: 01250700390934_1_2_6
label yaofang:
甘草 党参 酸枣仁 丹参 生地黄 知母 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.896217 0.312069 0.49043 0.517743 0.400386 0.429316 0.321255 0.321678
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
235. 
patient tongue id: 05251947342804_7_5
label yaofang:
甘草 桃仁 玄参 赤芍 牡丹皮 厚朴 僵蚕 北沙参 板蓝根 蜈蚣 猫爪草 姜黄
0.603775 0.3877 0.413672 0.505834 0.643809 0.35424 0.355175 0.303362
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
236. 
patient tongue id: 02242335338929_1_5_7
label yaofang:
牡蛎 生地黄 牡丹皮 杜仲 牛膝 山茱萸 砂仁 莪术 北沙参 白鲜皮 蜈蚣 红豆杉 土茯苓 山慈菇 蛇舌草 鸭脚艾
0.504136 0.379148 0.427491 0.471392 0.435361
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
237. 
patient tongue id: 03282206494925_6_7
label yaofang:
甘草 白芍 川芎 茯苓 党参 白术 酸枣仁 生地黄 天麻 淡竹叶 麦芽 首乌藤 川木通
0.89349 0.468013 0.529863 0.398974 0.429277
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 1.000000, recall: 0.384615, error: 0.000000
238. 
patient tongue id: 03152050489573_1_4_7
label yaofang:
川芎 法半夏 防风 鸡血藤 乳香 胆南星 藿香 白芷 辛夷 苍耳子 芥子 醋没药
0.847959 0.368034 0.966558 0.507907 0.744121 0.423764 0.344156 0.418208 0.914746 0.934221 0.900112 0.948304 0.957055 0.587488 0.62286 0.544161 0.801706
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.235294, recall: 0.333333, error: 0.764706
239. 
patient tongue id: 02171852021553_4
label yaofang:
法半夏 前胡 防风 钩藤 荆芥穗 白芷 香薷 百部 炙甘草 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.303587 0.901094 0.417175 0.981362 0.554272 0.748308 0.432213 0.389181 0.455201 0.94427 0.954009 0.921919 0.96016 0.314598 0.973083 0.600023 0.598879 0.542164 0.832621
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.368421, recall: 0.538462, error: 0.631579
240. 
patient tongue id: 02171933452205_1_7_4
label yaofang:
桃仁 黄芪 鸡血藤 白术 浙贝母 杜仲 山药 砂仁 淫羊藿 莪术 玉米须 土鳖虫 合欢皮 山慈菇 预知子
0.462616 0.406719 0.402282 0.438757 0.415838 0.306515
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
241. 
patient tongue id: 01182205204822_2
label yaofang:
甘草 桔梗 麦冬 太子参 酸枣仁 生地黄 浙贝母 知母 鳖甲 北沙参 浮小麦 白花蛇舌 蜂房 岗梅根 四季青
0.984681 0.503768 0.601175 0.373707 0.392022 0.307322 0.704557 0.566581 0.531211 0.426738 0.454306 0.492705
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
242. 
patient tongue id: 04252302502287_3_4
label yaofang:
甘草 党参 酸枣仁 玄参 生地黄 牛膝 山药 山茱萸 白茅根 天麻 蔓荆子 鳖甲 皂角刺 益智 蜈蚣 白花蛇舌 天山雪莲
0.863709 0.327203 0.320325 0.499505 0.499168 0.400636 0.410903 0.345999 0.336752
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.555556, recall: 0.294118, error: 0.444444
243. 
patient tongue id: 03222003039851_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.32429 0.435111 0.382036 0.375088 0.332625 0.53473
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
244. 
patient tongue id: 03012245290835_6_5
label yaofang:
甘草 柴胡 白芍 葛根 木香 延胡索 川楝子 山药 砂仁 赤石脂 桑寄生 芡实 桑螵蛸 豆蔻 麸炒枳壳
0.974043 0.531433 0.532495 0.361522 0.511622 0.462484 0.402976 0.360587 0.333521 0.303236
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.066667, error: 0.900000
245. 
patient tongue id: 05092110537960_6
label yaofang:
甘草 柴胡 枳壳 桔梗 黄芪 白术 枳实 槟榔 厚朴 肉苁蓉 火麻仁 紫菀
0.545516 0.391311 0.356359 0.399288 0.355899 0.310043
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
246. 
patient tongue id: 03231026433328_4_6
label yaofang:
甘草 白芍 木香 薏苡仁 党参 白术 槟榔 砂仁 莱菔子 鳖甲 莪术 白扁豆 蜈蚣 白花蛇舌 红豆杉
0.838513 0.316577 0.511362 0.439522 0.339475
predicted yaofang:
甘草 法半夏 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
247. 
patient tongue id: 03041133174115_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.306174 0.79615 0.459675 0.928487 0.519745 0.659433 0.423967 0.387099 0.434975 0.850483 0.872817 0.824643 0.871601 0.326047 0.911042 0.527858 0.313188 0.544869 0.4753 0.70813
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
248. 
patient tongue id: 05232027564264_5
label yaofang:
陈皮 桔梗 鸡血藤 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 威灵仙 山慈菇
0.485078 0.420736 0.331494 0.434399 0.391633 0.396784
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
249. 
patient tongue id: 05272349588036_1_2_5
label yaofang:
茯苓 黄芪 白术 延胡索 海螵蛸 浙贝母 山药 砂仁 三七 补骨脂 枇杷叶 北沙参 紫苏梗
0.493166 0.370593 0.348143 0.347487 0.616228 0.690824 0.360539 0.446881 0.419928 0.360247 0.421945 0.310567
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.500000, recall: 0.461538, error: 0.500000
250. 
patient tongue id: 03011854019165_2_1
label yaofang:
陈皮 前胡 防风 太子参 黄芪 白前 百部 北沙参 蝉蜕 炙甘草 地肤子 蜜麻黄 麸炒白术 炒僵蚕
0.545264 0.420532 0.346555 0.485802 0.518591 0.303246 0.363725
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
251. 
patient tongue id: 06111044584201_7_2
label yaofang:
甘草 芦根 桃仁 远志 酸枣仁 生地黄 浙贝母 天麻 鳖甲 紫菀 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫
0.899755 0.482237 0.532775 0.392105 0.444073 0.302169
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
252. 
patient tongue id: 05242236185036_2_6
label yaofang:
甘草 川芎 茯苓 党参 白术 生地黄 牛膝 天麻 磁石 蔓荆子 桑寄生 麦芽 女贞子 沙苑子 墨旱莲
0.971898 0.30627 0.516993 0.581418 0.420342 0.530648 0.448555 0.424392 0.332899 0.337266 0.339069
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
253. 
patient tongue id: 05032238237956_2_7
label yaofang:
甘草 茯苓 党参 郁金 山药 天麻 鳖甲 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 有瓜石斛
0.811361 0.432568 0.487105 0.306608 0.330217 0.351748 0.319424
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 党参 款冬花

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
254. 
patient tongue id: 01041826151406_2
label yaofang:
法半夏 葛根 前胡 太子参 黄芪 细辛 干姜 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 蜜麻黄 麸炒白术 干石斛
0.336961 0.736664 0.402036 0.875613 0.471569 0.634323 0.389948 0.354208 0.406767 0.794787 0.820364 0.772796 0.841387 0.300514 0.874162 0.50043 0.30851 0.53559 0.469085 0.654941
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.625000, error: 0.500000
255. 
patient tongue id: 04131713180758_1_3
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.405114 0.386813 0.458031 0.328839 0.327142 0.357763 0.307435 0.354487 0.398563
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 黄芪 款冬花 北沙参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
256. 
patient tongue id: 03231303089391_6_7
label yaofang:
甘草 川芎 茯苓 远志 党参 酸枣仁 知母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.981093 0.525809 0.583905 0.389353 0.343174 0.622282 0.54206 0.498501 0.425513 0.434063 0.475469
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
257. 
patient tongue id: 04102037410659_4_6
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 白花蛇舌草 白扁豆 山慈菇
0.325527 0.522265 0.311308 0.376033 0.366219 0.313463 0.531401 0.669371
predicted yaofang:
柴胡 白芍 香附 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.181818, error: 0.750000
258. 
patient tongue id: 03231632217563_4
label yaofang:
茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香
0.316063 0.832638 0.437681 0.94873 0.52429 0.688743 0.424171 0.37914 0.452232 0.883316 0.900001 0.857141 0.905024 0.333368 0.930554 0.568459 0.320071 0.567969 0.505964 0.748959
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.923077, error: 0.400000
259. 
patient tongue id: 01070832228124_1_4_7
label yaofang:
人参 当归 黄芪 乌药 山药 肉苁蓉 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.431867 0.414758 0.381772 0.389775
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
260. 
patient tongue id: 01192238329015_4_1
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 酸枣仁 山药 天麻 鳖甲 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.993896 0.560583 0.603693 0.365711 0.378357 0.70738 0.660883 0.593363 0.535378 0.536915 0.574785
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
261. 
patient tongue id: 06070747395893_1_3_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌
0.428147 0.483506 0.441056 0.458502 0.466725 0.416359 0.441606 0.350374 0.41351 0.412593 0.438241 0.360027 0.396184 0.406308 0.38137
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.733333, recall: 1.000000, error: 0.266667
262. 
patient tongue id: 06140823214547_1_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 车前子 干姜
0.391178 0.301108 0.530401 0.457318 0.444153 0.505428 0.477058 0.477322 0.431362 0.47286 0.49127 0.543731 0.377732 0.48894 0.498129 0.508829
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.312500, recall: 0.416667, error: 0.687500
263. 
patient tongue id: 06190755366257_1_7
label yaofang:
甘草 独活 党参 鸡血藤 白术 地黄 天麻 桑寄生 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 牛大力 千斤拔 络石藤
0.989695 0.529177 0.607302 0.396097 0.391157 0.304287 0.7002 0.62978 0.580078 0.51114 0.53116 0.574805
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
264. 
patient tongue id: 03111445478244_7_6_1
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 酸枣仁 浙贝母 郁金 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫 红豆杉
0.85373 0.319333 0.478074 0.496657 0.367946 0.397396
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 1.000000, recall: 0.352941, error: 0.000000
265. 
patient tongue id: 02181606257339_6_4_7
label yaofang:
柴胡 白芍 茯苓 党参 酸枣仁 五味子 牡丹皮 山药 地黄 菟丝子 益母草 麦芽 首乌藤 酒黄精
0.998055 0.56184 0.637522 0.376873 0.388296 0.779843 0.722514 0.675651 0.577986 0.602857 0.666568
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
266. 
patient tongue id: 03230722168819_6_5_2
label yaofang:
甘草 白芍 川芎 法半夏 茯苓 麦冬 白术 酸枣仁 生地黄 牡丹皮 苍术 天麻 僵蚕 磁石 蒺藜 浮小麦
0.977977 0.522009 0.564435 0.407313 0.30385 0.5603 0.499286 0.467045 0.387999 0.377089 0.38668
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
267. 
patient tongue id: 03290715081744_5
label yaofang:
甘草 黄芩 前胡 桔梗 薄荷 牛蒡子 桃仁 浙贝母 桑白皮 白前 枇杷叶 苦杏仁
0.314821 0.618789 0.452 0.761399 0.465254 0.557376 0.402059 0.366397 0.394668 0.681999 0.7118 0.65753 0.705809 0.758609 0.453012 0.300455 0.485216 0.393308 0.555455
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.157895, recall: 0.250000, error: 0.842105
268. 
patient tongue id: 02211955460387_6_4
label yaofang:
甘草 法半夏 牛蒡子 远志 党参 浙贝母 郁金 天麻 鳖甲 夏枯草 蜈蚣 白花蛇舌 四季青 猫爪草
0.985727 0.539192 0.597694 0.406025 0.339717 0.600996 0.540353 0.497506 0.415272 0.41991 0.434212
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
269. 
patient tongue id: 02122222429102_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 薏苡仁 白术 熟附子 延胡索 天麻 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.990434 0.543963 0.599726 0.381657 0.344164 0.660238 0.612374 0.545663 0.48548 0.489481 0.509632
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
270. 
patient tongue id: 06012133591797_6_4_7
label yaofang:
桂枝 甘草 茯苓 羌活 鸡血藤 白术 红花 赤芍 牡丹皮 天麻 僵蚕 粉葛 蜈蚣
0.96811 0.523436 0.558156 0.394068 0.50576 0.429204 0.40487 0.324372 0.317727 0.3051
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.384615, error: 0.500000
271. 
patient tongue id: 05131633519116_7_1
label yaofang:
桂枝 甘草 独活 远志 党参 鸡血藤 白术 熟附子 红花 细辛 大黄 肉苁蓉 桑寄生 补骨脂 天山雪莲 牛大力
0.527637 0.412179 0.344141 0.358366
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.187500, error: 0.250000
272. 
patient tongue id: 05140846301133_5_2_8
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 薄荷 牛蒡子 浙贝母 鳖甲 诃子 紫苏梗 白花蛇舌 蜂房 岗梅根 四季青
0.607595 0.438951 0.42631 0.348234 0.425976
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
273. 
patient tongue id: 05130655189271_2_6
label yaofang:
甘草 枳壳 白术 玄参 生地黄 牛膝 厚朴 天麻 肉苁蓉 鳖甲 火麻仁 蜈蚣 天山雪莲 半枝莲
0.947084 0.508674 0.541124 0.423986 0.31298 0.534202 0.436133 0.433695 0.32998 0.329377 0.331782
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
274. 
patient tongue id: 05311935319321_5
label yaofang:
甘草 桔梗 金银花 连翘 薄荷 芦根 牛蒡子 桑白皮 淡豆豉 淡竹叶 射干 板蓝根 龙脷叶
0.428044 0.365481 0.309827 0.496904 0.558177 0.313276
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
275. 
patient tongue id: 03101919528667_1
label yaofang:
陈皮 当归 党参 黄芪 白术 海螵蛸 白芷 升麻 北柴胡 炙甘草
0.337119 0.309737 0.391854 0.371973 0.326693
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.300000, error: 0.400000
276. 
patient tongue id: 05241946143005_4_6
label yaofang:
桂枝 甘草 白芍 茯苓 党参 白术 生地黄 熟附子 山药 山茱萸 车前子 大腹皮 干姜 猪苓
0.993357 0.542817 0.619687 0.402234 0.372983 0.691344 0.630489 0.583664 0.492735 0.509082 0.557727
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
277. 
patient tongue id: 02111400216355_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌
0.745161 0.444599 0.451538 0.369821 0.558396
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
278. 
patient tongue id: 01192127111734_5
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 防风 金银花 浙贝母 桑白皮 荆芥穗 款冬花 苦杏仁 紫苏子 炙麻黄 贯众
0.978769 0.518889 0.573119 0.411854 0.336325 0.599168 0.533554 0.511807 0.415049 0.428157 0.472689
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
279. 
patient tongue id: 02171823234001_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.325571 0.780978 0.448902 0.921369 0.510543 0.653399 0.300048 0.43555 0.398633 0.443278 0.840922 0.862128 0.814675 0.867735 0.330426 0.899498 0.536659 0.326533 0.550378 0.495554 0.711322
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.571429, recall: 0.857143, error: 0.428571
280. 
patient tongue id: 01032340551599_5_6
label yaofang:
甘草 法半夏 茯苓 党参 白术 杜仲 郁金 石菖蒲 天麻 桑寄生 麦芽 地龙 辛夷 合欢花
0.99541 0.541714 0.627581 0.393875 0.390332 0.740888 0.67014 0.632559 0.52674 0.54837 0.595966
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
281. 
patient tongue id: 01061929540850_9
label yaofang:
柴胡 前胡 半夏 防风 薄荷 荆芥穗 香薷 紫菀 白扁豆 辛夷 紫苏梗 广藿香 苍耳子
0.553966 0.434946 0.647459 0.386211 0.473572 0.525566 0.590877 0.577319 0.605218 0.363559 0.73256 0.356962 0.372227 0.322147 0.430014
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.333333, recall: 0.384615, error: 0.666667
282. 
patient tongue id: 02201812563960_7_4
label yaofang:
甘草 白芍 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 炒僵蚕
0.322954 0.814855 0.402983 0.943761 0.516334 0.708862 0.431529 0.375856 0.445023 0.884179 0.899628 0.854679 0.909456 0.926685 0.55303 0.305998 0.581725 0.51797 0.748001
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.052632, recall: 0.071429, error: 0.947368
283. 
patient tongue id: 02211840585641_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.326375 0.306478 0.468307 0.459993 0.469688 0.380011 0.396852 0.309717 0.322962 0.426018 0.427241 0.441229 0.444864 0.374114 0.528606 0.324001 0.338308 0.351822
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
284. 
patient tongue id: 03171219124535_1_2
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 黄芪 五味子 熟地黄 火麻仁 炙甘草 黑枣
0.446107 0.400977 0.399569 0.325295
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.500000, recall: 0.181818, error: 0.500000
285. 
patient tongue id: 05261921069247_2
label yaofang:
柴胡 香附 半夏 龙骨 牡蛎 麦冬 太子参 五味子 肉苁蓉 首乌藤 黄精 合欢皮
0.648717 0.394044 0.448344 0.412619
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
286. 
patient tongue id: 05182037284021_1_4
label yaofang:
柴胡 黄芩 党参 白术 泽泻 天麻 白芷 姜半夏 炙甘草 续断
0.314341 0.466201 0.318375 0.328798 0.372178 0.371595 0.34144 0.337649 0.54665 0.669005
predicted yaofang:
柴胡 白芍 香附 当归 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.500000, error: 0.500000
287. 
patient tongue id: 03040843554012_1
label yaofang:
甘草 薏苡仁 党参 白术 山药 砂仁 天麻 鳖甲 莪术 白扁豆 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花
0.923391 0.322243 0.507399 0.53101 0.398331 0.422903 0.356316 0.334189
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.400000, error: 0.250000
288. 
patient tongue id: 05162140495729_1_2_6
label yaofang:
甘草 川芎 芦根 党参 浙贝母 天麻 白芷 蔓荆子 鳖甲 辛夷 广藿香 苍耳子 白花蛇舌 蜂房 四季青 红曲
0.944421 0.481652 0.541201 0.428501 0.491669 0.357778 0.389505
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
289. 
patient tongue id: 03141555139924_1_3_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.357143 0.335189 0.368757 0.316713
predicted yaofang:
茯苓 党参 黄芪 钩藤

------Score: precision: 0.750000, recall: 0.230769, error: 0.250000
290. 
patient tongue id: 05131555385714_1_2_5
label yaofang:
甘草 柴胡 当归 薏苡仁 党参 黄芪 红花 赤芍 熟地黄 天麻 败酱草 皂角刺 女贞子 广升麻 墨旱莲
0.876628 0.480854 0.482184 0.381061 0.385601
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
291. 
patient tongue id: 03311802088239_1_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 钩藤 细辛 白芷 辛夷 紫苏梗 广藿香 炒苍耳子 炒蔓荆子
0.306643 0.871538 0.435149 0.969127 0.541461 0.723516 0.443899 0.405532 0.473937 0.914173 0.931952 0.894382 0.93638 0.322035 0.95886 0.59626 0.312423 0.596302 0.531979 0.798915
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
292. 
patient tongue id: 03142040163331_6
label yaofang:
白芍 香附 法半夏 党参 延胡索 海螵蛸 北柴胡 麦芽 炙甘草 紫苏梗 猫爪草
0.518725 0.368252 0.339117 0.425215 0.397964
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
293. 
patient tongue id: 03081417065857_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.396833 0.326374 0.301158 0.439501 0.3337 0.319858
predicted yaofang:
甘草 茯苓 桃仁 党参 丹参 车前子

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
294. 
patient tongue id: 02142142413946_6_2
label yaofang:
甘草 柴胡 白芍 槟榔 杜仲 天麻 肉苁蓉 火麻仁 补骨脂 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.9958 0.557658 0.627994 0.384752 0.38948 0.753065 0.689006 0.644948 0.556415 0.576028 0.64058
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
295. 
patient tongue id: 05232034418153_6
label yaofang:
桂枝 柴胡 白芍 黄芩 党参 郁金 姜半夏 炙甘草 土茯苓
0.328644 0.464641 0.406053 0.38293 0.385513 0.543061
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.666667, recall: 0.444444, error: 0.333333
296. 
patient tongue id: 03111502323218_6_7_2
label yaofang:
甘草 薏苡仁 党参 郁金 山药 天麻 鳖甲 莪术 北沙参 白扁豆 辛夷 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.985835 0.533885 0.5975 0.415316 0.343374 0.619607 0.542914 0.530034 0.433352 0.434351 0.469108
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
297. 
patient tongue id: 03232317404929_4_6
label yaofang:
桂枝 甘草 防风 金银花 黄芪 白术 生地黄 红花 赤芍 石膏 水牛角 荆芥穗 火麻仁 麦芽 苦参 白鲜皮
0.973908 0.32335 0.520501 0.564824 0.393494 0.512443 0.42545 0.408925 0.310514 0.310895 0.318295
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
298. 
patient tongue id: 05162149375094_6_2_7
label yaofang:
甘草 茯苓 龙骨 党参 黄芪 酸枣仁 生地黄 牡丹皮 黄柏 山药 山茱萸 泽泻 仙鹤草 茜草 墨旱莲
0.949812 0.315305 0.516422 0.562879 0.398662 0.469019 0.400097 0.375085 0.300279
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
299. 
patient tongue id: 01312313178519_1_2_7
label yaofang:
甘草 茯苓 薏苡仁 桃仁 太子参 五味子 山药 山茱萸 天麻 鳖甲 补骨脂 莪术 黄精 蜈蚣 白花蛇舌 红豆杉
0.946765 0.511911 0.541576 0.404707 0.311319 0.505559 0.438483 0.423618 0.343635 0.334942 0.331183
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
300. 
patient tongue id: 04192228036581_2_4
label yaofang:
甘草 桔梗 远志 浙贝母 天麻 鳖甲 款冬花 紫菀 诃子 苦杏仁 蜈蚣 天山雪莲 半枝莲
0.937705 0.303058 0.512471 0.542874 0.396103 0.47871 0.419323 0.38075 0.328655 0.3206 0.314152
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
301. 
patient tongue id: 04101908493569_2_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.3217 0.575649 0.447693 0.69417 0.425611 0.504388 0.309691 0.335137 0.314544 0.329509 0.617828 0.626429 0.607987 0.659157 0.371509 0.686401 0.414608 0.303094 0.429466 0.393173 0.529637
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
302. 
patient tongue id: 05031809059292_2
label yaofang:
茯苓 枸杞子 五味子 栀子 牡丹皮 黄柏 知母 山药 地黄 泽泻 地骨皮 菟丝子 山萸肉 女贞子 桑椹
0.689534 0.30567 0.40906 0.431151 0.464823
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
303. 
patient tongue id: 03061810071086_1_6_5
label yaofang:
甘草 白芍 陈皮 桔梗 防风 白术 浙贝母 鳖甲 豆蔻 粉葛 紫苏梗 广藿香 白花蛇舌 天山雪莲 蜂房
0.963211 0.303802 0.520211 0.560888 0.387576 0.306006 0.545694 0.49306 0.438412 0.394199 0.388489 0.392859
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
304. 
patient tongue id: 05172117343802_4_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 蒲公英 白及 党参 黄连 胆南星 麦芽 浮小麦 鱼古 麸炒枳壳 煅瓦楞子
0.932779 0.489558 0.484958 0.508237 0.30115 0.365482
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
305. 
patient tongue id: 02212005360808_2_7_6
label yaofang:
甘草 茯苓 龙骨 党参 黄芪 生地黄 牡丹皮 黄柏 山药 地骨皮 糯稻根 淫羊藿 仙茅 龟甲
0.976024 0.519658 0.57659 0.424482 0.364884 0.311167 0.616693 0.5355 0.526713 0.42765 0.43068 0.452889
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
306. 
patient tongue id: 02231812462867_2
label yaofang:
法半夏 茯苓 前胡 桔梗 黄芪 干姜 款冬花 白前 百部 北沙参 广藿香 蜜麻黄
0.318191 0.856481 0.418932 0.962562 0.538852 0.712333 0.428238 0.392618 0.463124 0.914331 0.923293 0.878829 0.931371 0.950785 0.575078 0.301274 0.57456 0.50556 0.771959
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.833333, error: 0.473684
307. 
patient tongue id: 03231055593855_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.32475 0.608211 0.456728 0.730389 0.436442 0.536695 0.308399 0.375174 0.359125 0.371585 0.640576 0.672617 0.642277 0.679146 0.356287 0.757824 0.434415 0.32047 0.454823 0.410416 0.54389
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 1.000000, error: 0.285714
308. 
patient tongue id: 03020741466184_1_4
label yaofang:
甘草 茯苓 龙骨 党参 酸枣仁 生地黄 山药 砂仁 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.971197 0.510062 0.5773 0.428574 0.310277 0.549706 0.441275 0.454889 0.317929 0.333171 0.387934
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
309. 
patient tongue id: 01211253269110_1
label yaofang:
桂枝 柴胡 黄芩 桔梗 牡蛎 干姜 天花粉 苦杏仁 炙甘草 蜜枇杷叶 人参叶
0.307127 0.304564 0.412207 0.340737 0.3488
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
310. 
patient tongue id: 05182112481424_7
label yaofang:
甘草 柴胡 白芍 香附 当归 茯苓 薄荷 桃仁 白术 鳖甲 麦芽 广藿香 土茯苓
0.410596 0.390429 0.389251 0.314845 0.4591 0.572143
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
311. 
patient tongue id: 05131446234642_4_1_7
label yaofang:
甘草 柴胡 白芍 白及 党参 黄连 延胡索 川楝子 山药 天麻 建曲 蜈蚣 半枝莲 醋鳖甲
0.695383 0.442879 0.449866 0.30693 0.366648 0.321688
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
312. 
patient tongue id: 04061333245927_1_6
label yaofang:
甘草 黄芩 茯苓 羌活 牛蒡子 浙贝母 荆芥穗 天麻 鳖甲 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.959466 0.503581 0.548694 0.387451 0.531661 0.452397 0.429654 0.342602 0.340684 0.361141
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.571429, error: 0.200000
313. 
patient tongue id: 01042316416871_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.318992 0.49333 0.31036 0.34027 0.339524 0.315187 0.332527 0.563166 0.700501
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.666667, recall: 0.545455, error: 0.333333
314. 
patient tongue id: 04272312275186_1_4
label yaofang:
桂枝 甘草 牛蒡子 浙贝母 白芷 射干 紫菀 豆蔻 马勃 姜半夏 广藿香 龙脷叶
0.479829 0.427144 0.331136 0.426883 0.391968 0.393795
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
315. 
patient tongue id: 02150019020918_1_6_2
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 当归 茯苓 党参 白术 酸枣仁 生地黄 牡丹皮 巴戟天 佛手 合欢花
0.914339 0.321663 0.489951 0.516941 0.401761 0.424817 0.352288 0.358296
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.333333, error: 0.375000
316. 
patient tongue id: 04282327129540_5
label yaofang:
甘草 法半夏 茯苓 荆芥 金银花 党参 丹参 黄连 胆南星 黄柏 茵陈 麦芽 白鲜皮 地肤子 广金钱草
0.808028 0.456473 0.489269 0.465092 0.307728
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
317. 
patient tongue id: 05140831507723_6_7_1
label yaofang:
甘草 川芎 党参 鸡血藤 杜仲 牛膝 山药 山茱萸 钩藤 泽泻 天麻 桑寄生 豆蔻 蒺藜 首乌藤
0.98537 0.540188 0.599673 0.397242 0.325299 0.616327 0.548408 0.499019 0.42516 0.434773 0.454548
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
318. 
patient tongue id: 04272238542589_1_2
label yaofang:
陈皮 葛根 前胡 桔梗 防风 麦冬 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 干石斛
0.706803 0.416974 0.852412 0.469681 0.630433 0.404799 0.428273 0.468623 0.758988 0.829429 0.748097 0.810751 0.917551 0.508265 0.311944 0.546144 0.377059 0.623338
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.555556, recall: 0.666667, error: 0.444444
319. 
patient tongue id: 04112057074681_1_6_4
label yaofang:
甘草 茯苓 牡蛎 太子参 黄芪 白术 丹参 五味子 海螵蛸 砂仁 地龙 首乌藤 合欢皮 墨旱莲 山慈菇
0.491242 0.3612 0.315782 0.579751 0.653992 0.384549 0.355838 0.360744
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.625000, recall: 0.333333, error: 0.375000
320. 
patient tongue id: 05310801530018_1_5
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.474091 0.368682 0.379192 0.451015 0.389205 0.38706 0.322026 0.358104 0.33769 0.307549 0.330802
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 车前子 莱菔子 天麻

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
321. 
patient tongue id: 05232054545245_6_7
label yaofang:
柴胡 大枣 茯苓 防风 连翘 牛蒡子 太子参 昆布 海藻 乌梅 石斛 白花蛇舌草 猫爪草 山慈菇
0.486193 0.433607 0.329898 0.423475 0.384976 0.387864
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
322. 
patient tongue id: 04020822519215_4_7
label yaofang:
甘草 法半夏 茯苓 牡蛎 党参 白术 丹参 薤白 水蛭 天麻 瓜蒌皮 三棱 莪术 首乌藤
0.961491 0.307758 0.511592 0.574054 0.430254 0.518355 0.424631 0.41423 0.313377 0.316324 0.314703
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
323. 
patient tongue id: 03020753173007_6_1
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 杜仲 山药 天麻 鳖甲 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.966678 0.500702 0.554976 0.380129 0.522783 0.433178 0.412867 0.332821 0.320931 0.351995
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.714286, error: 0.000000
324. 
patient tongue id: 02221233493656_1_3_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.401979 0.310703 0.472234 0.465044 0.391859 0.465974 0.427591 0.431421 0.352365 0.399559 0.448009 0.450675 0.384828 0.382386 0.390558 0.406703
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.250000, recall: 0.307692, error: 0.750000
325. 
patient tongue id: 04071907232122_1_4
label yaofang:
生姜 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 广藿香
0.394594 0.43472 0.44036 0.52523 0.340848 0.373944 0.461385 0.438163 0.411613 0.486784 0.32967 0.456074 0.313294 0.312011
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.642857, recall: 0.642857, error: 0.357143
326. 
patient tongue id: 04061353303932_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄 炒苍耳子
0.307307 0.779936 0.463416 0.913797 0.514764 0.645539 0.426326 0.38158 0.427745 0.833002 0.847448 0.801191 0.849537 0.344706 0.895553 0.518198 0.323234 0.522292 0.448056 0.68963
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
327. 
patient tongue id: 02212229056485_1_2_6
label yaofang:
甘草 桃仁 生地黄 红花 车前子 天麻 没药 鳖甲 淡竹叶 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木通
0.959333 0.315774 0.507448 0.568959 0.417926 0.330265 0.562731 0.475689 0.458717 0.365432 0.370024 0.368551
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
328. 
patient tongue id: 02211144438626_4_1_7
label yaofang:
甘草 川芎 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.336595 0.533277 0.421031 0.441006 0.510821 0.474307 0.479328 0.459033 0.469985 0.487348 0.543129 0.363383 0.478703 0.489912 0.515814
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
329. 
patient tongue id: 01211311185112_4
label yaofang:
陈皮 枳壳 大枣 茯苓 桃仁 太子参 白术 青皮 厚朴 佩兰 僵蚕 姜半夏 炙甘草 蜈蚣
0.358375 0.339058 0.373243 0.320649
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
330. 
patient tongue id: 03301322253689_1_4
label yaofang:
茯苓 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 豆蔻 北沙参 炙甘草 广藿香 制远志 炒六神曲 煅龙骨 炒酸枣仁
0.847172 0.454977 0.95292 0.517667 0.669771 0.414246 0.384012 0.43054 0.889609 0.901522 0.863456 0.907438 0.332578 0.941477 0.546917 0.532953 0.49013 0.770535
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.222222, recall: 0.266667, error: 0.777778
331. 
patient tongue id: 06072124090365_4_1
label yaofang:
甘草 枳壳 连翘 党参 白术 酸枣仁 山药 莱菔子 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991699 0.518045 0.609683 0.41463 0.364389 0.703781 0.630533 0.624949 0.498594 0.518784 0.618415
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
332. 
patient tongue id: 04281835261486_5
label yaofang:
法半夏 薏苡仁 通草 石菖蒲 厚朴 佩兰 滑石 淡竹叶 豆蔻 苦杏仁 广藿香 牛大力 五指毛桃
0.92512 0.34367 0.476646 0.515063 0.408928 0.368866 0.320014
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
333. 
patient tongue id: 04121812579452_1_4
label yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.314919 0.822559 0.433912 0.944183 0.526066 0.670497 0.425935 0.389655 0.431915 0.877618 0.8977 0.85139 0.899885 0.343397 0.929592 0.54394 0.321554 0.529738 0.480781 0.739679
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
334. 
patient tongue id: 03020840403574_1_6_5
label yaofang:
甘草 白芍 薏苡仁 远志 白术 枳实 厚朴 天麻 火麻仁 莪术 败酱草 苦杏仁 蜈蚣 半枝莲 醋鳖甲 淡附片
0.977998 0.507296 0.588774 0.408181 0.346305 0.592053 0.513989 0.485562 0.4061 0.405457 0.455652
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
335. 
patient tongue id: 06190141062958_1_2
label yaofang:
甘草 葛根 党参 鸡血藤 枸杞子 熟地黄 杜仲 山茱萸 天麻 桑寄生 续断 威灵仙 宽筋藤 鹿衔草
0.906132 0.500334 0.510235 0.393626 0.426783 0.34482 0.328497
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
336. 
patient tongue id: 05312149578032_4_1
label yaofang:
甘草 枳壳 茯苓 连翘 薏苡仁 党参 白术 苍术 灯心草 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.9803 0.502294 0.602791 0.410979 0.331574 0.588633 0.492876 0.48624 0.36496 0.389761 0.449598
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.625000, error: 0.090909
337. 
patient tongue id: 06181831490006_1
label yaofang:
甘草 白芍 茯苓 蒲公英 党参 黄芪 白术 熟附子 山药 干姜 砂仁 鳖甲 蜈蚣 天山雪莲 半枝莲
0.954878 0.509905 0.535379 0.390459 0.491049 0.425784 0.394063 0.330411 0.321168 0.314338
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
338. 
patient tongue id: 01041828217597_1_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.317667 0.81661 0.42357 0.945295 0.533873 0.684572 0.435916 0.400461 0.463694 0.879139 0.904984 0.856427 0.902979 0.30505 0.933773 0.572997 0.336418 0.585879 0.507687 0.747438
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
339. 
patient tongue id: 04071922199692_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.453058 0.446455 0.354919 0.348446 0.312612 0.353708
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
340. 
patient tongue id: 03091857572666_4_1
label yaofang:
甘草 法半夏 茯苓 白术 酸枣仁 淡豆豉 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.9991 0.568235 0.683037 0.385198 0.42663 0.833062 0.76338 0.724973 0.608565 0.648116 0.743768
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
341. 
patient tongue id: 04071905032294_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.306253 0.737714 0.434266 0.880067 0.493223 0.604058 0.405004 0.37405 0.404846 0.791691 0.816348 0.761435 0.818164 0.320166 0.865283 0.485127 0.312397 0.501389 0.434732 0.650138
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.923077, error: 0.400000
342. 
patient tongue id: 01140758242523_4_1
label yaofang:
甘草 白芍 川芎 党参 黄芪 白术 酸枣仁 天麻 鳖甲 沙苑子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 蒿苯
0.997488 0.533716 0.649475 0.428327 0.410634 0.784446 0.718837 0.705723 0.575355 0.615889 0.707141
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
343. 
patient tongue id: 04101944078380_1_4
label yaofang:
白芍 法半夏 前胡 桔梗 太子参 黄芪 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.32697 0.685588 0.462593 0.805787 0.464907 0.563178 0.324388 0.378574 0.369343 0.380015 0.71468 0.738618 0.710447 0.750778 0.372749 0.815068 0.447675 0.308849 0.467473 0.447151 0.612343
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.866667, error: 0.380952
344. 
patient tongue id: 01061626112081_1_2_7
label yaofang:
甘草 薏苡仁 玉竹 太子参 鸡血藤 山药 砂仁 天麻 鳖甲 补骨脂 莪术 黄精 蜈蚣 白花蛇舌 天山雪莲
0.899905 0.487448 0.521525 0.438402 0.446625 0.34877 0.365244
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
345. 
patient tongue id: 05171906218364_4
label yaofang:
茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.321878 0.705042 0.42553 0.851818 0.488645 0.610144 0.403886 0.379194 0.420321 0.766365 0.799883 0.748837 0.798786 0.312848 0.85261 0.506049 0.328103 0.533063 0.450388 0.651794
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 1.000000, error: 0.350000
346. 
patient tongue id: 04300954416695_6_4_2
label yaofang:
甘草 白芍 茯苓 牛蒡子 酸枣仁 生地黄 知母 山茱萸 青蒿 天麻 全蝎 地骨皮 秦艽 麦芽 浮小麦
0.904813 0.316222 0.480948 0.526764 0.375242 0.384189
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
347. 
patient tongue id: 05312155104602_1_2_6
label yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 砂仁 莱菔子 天麻 白花蛇舌草 浮小麦 紫苏梗 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.994477 0.53746 0.634159 0.356405 0.335776 0.667832 0.581675 0.51747 0.428961 0.45723 0.512488
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
348. 
patient tongue id: 03081832260536_3_4
label yaofang:
甘草 茯苓 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 炒僵蚕
0.528855 0.421991 0.564705 0.366434 0.438534 0.483015 0.515106 0.525533 0.52187 0.328408 0.644058 0.327912 0.325567 0.373677
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.142857, recall: 0.142857, error: 0.857143
349. 
patient tongue id: 04142238018815_1_6_5
label yaofang:
甘草 薏苡仁 黄芪 白术 玄参 熟附子 厚朴 天麻 鳖甲 火麻仁 败酱草 地龙 首乌藤 蜈蚣 天山雪莲 半枝莲
0.862537 0.3007 0.30922 0.49606 0.46125 0.309125 0.313515
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻

------Score: precision: 0.428571, recall: 0.187500, error: 0.571429
350. 
patient tongue id: 02251243307279_2
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 炒紫苏子 蜜麻黄
0.329485 0.734856 0.437301 0.87964 0.494438 0.62661 0.415334 0.378309 0.430648 0.802551 0.823691 0.770919 0.826657 0.316189 0.860075 0.526357 0.325205 0.534649 0.471831 0.668115
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
351. 
patient tongue id: 02142330545320_6
label yaofang:
甘草 川芎 茯苓 防风 党参 白术 酸枣仁 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.996937 0.549091 0.634294 0.34374 0.356024 0.740485 0.678264 0.622112 0.529403 0.552454 0.605569
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.733333, error: 0.000000
352. 
patient tongue id: 04142210398547_3_4
label yaofang:
白芍 川芎 陈皮 当归 茯苓 党参 白术 熟地黄 炙甘草 黑枣 狗脊
0.484522 0.371512 0.40538 0.532407 0.452995 0.320643
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.272727, error: 0.500000
353. 
patient tongue id: 05201449302679_5_6
label yaofang:
甘草 柴胡 白芍 酸枣仁 栀子 牡丹皮 车前子 天麻 磁石 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.983501 0.531552 0.575246 0.374774 0.326135 0.611867 0.56491 0.491292 0.444879 0.44662 0.45117
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
354. 
patient tongue id: 05251930261857_2
label yaofang:
甘草 蒲公英 浙贝母 郁金 生半夏 僵蚕 莪术 柿蒂 北沙参 赭石 蜈蚣 红豆杉 预知子 冬凌草
0.306406 0.328247 0.405495 0.321923 0.360359
predicted yaofang:
甘草 法半夏 茯苓 黄芪 炙甘草

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
355. 
patient tongue id: 05160615177777_6_7_1
label yaofang:
黄芪 白术 丹参 砂仁 桑寄生 北沙参 炙甘草 女贞子 桑椹 首乌藤 合欢皮 墨旱莲 山慈菇 蛇舌草
0.514001 0.40992 0.354426 0.434428 0.528911 0.303969
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
356. 
patient tongue id: 06022206037285_1_4_7
label yaofang:
陈皮 当归 茯苓 半夏 党参 黄芪 阿胶 枸杞子 白术 海螵蛸 杜仲 厚朴 桑寄生 鸡内金 紫苏梗 骨碎补 预知子
0.417309 0.391372 0.308544 0.539138 0.547655 0.313783 0.303068 0.387824
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.625000, recall: 0.294118, error: 0.375000
357. 
patient tongue id: 02151923362184_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.302901 0.812881 0.41615 0.933349 0.469199 0.697439 0.377845 0.343842 0.408683 0.846828 0.877424 0.843351 0.903948 0.31651 0.932466 0.52975 0.571504 0.520973 0.73962
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
358. 
patient tongue id: 04131426475400_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.536114 0.390479 0.427363 0.460611 0.504037 0.304177
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
359. 
patient tongue id: 05181249289956_6_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 厚朴 天麻 滑石 莪术 王不留行 白花蛇舌草 苦杏仁 蜈蚣 半枝莲 醋鳖甲
0.942114 0.474974 0.533859 0.462945 0.469299 0.375679 0.445666 0.331496
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.875000, recall: 0.466667, error: 0.125000
360. 
patient tongue id: 04131918142645_1_2
label yaofang:
甘草 半夏 薏苡仁 黄芪 黄连 厚朴 砂仁 僵蚕 枇杷叶 蝉蜕 紫苏叶 木蝴蝶 合欢皮
0.517073 0.38055 0.317847 0.386867 0.575697 0.6366 0.341497 0.320395 0.449248 0.403487 0.359927 0.389003
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
361. 
patient tongue id: 03012321301472_6_2
label yaofang:
甘草 柴胡 白芍 红花 延胡索 川楝子 郁金 天麻 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲 红豆杉 田七末
0.976636 0.532318 0.577593 0.383733 0.319046 0.571325 0.520059 0.454158 0.406156 0.403668 0.404185
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
362. 
patient tongue id: 06031643240599_1_4
label yaofang:
法半夏 前胡 桔梗 防风 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.875875 0.438888 0.968455 0.54924 0.711893 0.438947 0.398365 0.460419 0.916214 0.931491 0.889064 0.932711 0.958912 0.582142 0.573371 0.497096 0.792509
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.823529, recall: 0.933333, error: 0.176471
363. 
patient tongue id: 02211844288534_1
label yaofang:
甘草 香附 茯苓 牛蒡子 党参 阿胶 白术 柏子仁 海螵蛸 肉桂 干姜 制川乌 附片 续断 紫苏梗 瓦楞子
0.991928 0.515515 0.635972 0.385548 0.410622 0.742021 0.553328 0.54216 0.389649 0.435959 0.506962
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
364. 
patient tongue id: 06092011494812_1_4_7
label yaofang:
甘草 牡蛎 太子参 枸杞子 丹参 生地黄 赤芍 牛膝 郁金 山茱萸 女贞子 紫苏梗
0.657332 0.412121 0.429687 0.402124 0.577187 0.307387
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 砂仁

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
365. 
patient tongue id: 04121911408692_1_7_4
label yaofang:
枳壳 木香 黄芪 赤芍 牡丹皮 泽泻 大腹皮 厚朴 茯苓皮 猪苓 柿蒂 吴茱萸 赭石 玉米须 土鳖虫 荔枝核 鸭脚艾
0.560843 0.422216 0.361407 0.450542 0.393247 0.326982
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.166667, recall: 0.058824, error: 0.833333
366. 
patient tongue id: 02131308025090_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.431759 0.341675 0.412855 0.439797 0.332932 0.425649 0.366169 0.381982 0.317632 0.343113 0.394601 0.365782 0.374929 0.311178 0.310356 0.310355
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
367. 
patient tongue id: 05232036129587_1
label yaofang:
柴胡 半夏 连翘 牛蒡子 党参 黄芪 枸杞子 白术 杜仲 砂仁 补骨脂 莪术 北沙参
0.458991 0.375932 0.49612 0.53996 0.362377
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
368. 
patient tongue id: 03221300257418_2_4
label yaofang:
甘草 茯苓 薏苡仁 党参 五味子 浙贝母 厚朴 淫羊藿 补骨脂 莪术 紫菀 仙茅 地龙 苦杏仁 鹿角霜 紫苏叶
0.975482 0.524924 0.567202 0.38345 0.305361 0.56718 0.491826 0.440924 0.377473 0.375879 0.38121
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
369. 
patient tongue id: 03221638298071_1_2_3
label yaofang:
当归 半夏 橘红 连翘 黄芪 鸡血藤 白术 补骨脂 鸡内金 枇杷叶 红芪 红参
0.90891 0.46718 0.476436 0.550366 0.309122 0.398856
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
370. 
patient tongue id: 04122159577912_2_5
label yaofang:
甘草 黄芪 黄连 赤芍 栀子 杜仲 苍术 山药 山茱萸 天麻 天花粉 桑寄生 牛大力
0.867756 0.307013 0.4693 0.51068 0.419795 0.411221 0.330941
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
371. 
patient tongue id: 02202324079714_5_2
label yaofang:
甘草 黄芩 鱼腥草 海螵蛸 僵蚕 川贝母 紫菀 鸡内金 枇杷叶 地龙 北沙参 苦杏仁 炙麻黄 紫苏梗
0.411853 0.41621 0.457429 0.403257 0.365319
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
372. 
patient tongue id: 02231915359185_1
label yaofang:
白芍 川芎 茯苓 防风 丹参 钩藤 天麻 白芷 石决明 炙甘草 首乌藤 威灵仙 炒蔓荆子 棉萆薢
0.316299 0.757496 0.451919 0.889498 0.499885 0.616904 0.302324 0.402421 0.36308 0.406858 0.809237 0.819115 0.778953 0.828999 0.334702 0.85966 0.501668 0.302935 0.50875 0.473641 0.681204
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.190476, recall: 0.285714, error: 0.809524
373. 
patient tongue id: 02281251245109_1_3
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.382412 0.38887 0.446047 0.305691 0.335277 0.35681 0.493234
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 紫菀 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
374. 
patient tongue id: 01122213131920_1_5
label yaofang:
甘草 白芍 龙骨 防风 金银花 黄芪 白术 五味子 红花 荆芥穗 麦芽 白鲜皮 蒺藜 浮小麦 地肤子
0.974531 0.53511 0.568934 0.379754 0.306375 0.578191 0.505168 0.450173 0.392888 0.395588 0.39447
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
375. 
patient tongue id: 03011105569254_1
label yaofang:
甘草 白芍 川芎 独活 牛膝 细辛 干姜 补骨脂 蜈蚣 姜黄 海桐皮 鹿衔草
0.417382 0.338346 0.430037 0.391942 0.435652
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
376. 
patient tongue id: 03091907518402_4_1
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 丹参 生地黄 天麻 鳖甲 莪术 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989556 0.533257 0.618483 0.435047 0.385374 0.30288 0.678692 0.625102 0.603505 0.497374 0.521247 0.596205
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.687500, error: 0.083333
377. 
patient tongue id: 04132029475968_6
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 浙贝母 郁金 山药 天麻 鳖甲 莪术 虎杖 蜈蚣 白花蛇舌 天山雪莲 广金钱草
0.961189 0.310151 0.513806 0.586293 0.438958 0.332264 0.56266 0.486343 0.46961 0.376257 0.386666 0.405732
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
378. 
patient tongue id: 01182144042412_6_5
label yaofang:
甘草 白芍 桔梗 党参 浙贝母 郁金 山药 山茱萸 泽泻 菟丝子 益母草 鳖甲 夏枯草 浮小麦 合欢花
0.976314 0.525766 0.563727 0.375321 0.328367 0.618565 0.562623 0.496889 0.442047 0.440882 0.446992
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
379. 
patient tongue id: 01052146502452_2_6
label yaofang:
甘草 柴胡 白芍 茯苓 龙骨 酸枣仁 牡丹皮 山药 山茱萸 地黄 菟丝子 益母草 浮小麦 首乌藤
0.997905 0.541781 0.658463 0.38077 0.418683 0.789805 0.727682 0.698069 0.579351 0.619694 0.704688
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
380. 
patient tongue id: 04222122526706_4
label yaofang:
麻黄 柴胡 前胡 桔梗 半夏 防风 薄荷 青蒿 荆芥穗 款冬花 紫菀 白前 百部 紫苏子 炙甘草 紫苏梗
0.788836 0.422441 0.932015 0.530551 0.673394 0.397029 0.397132 0.444551 0.861255 0.894978 0.842029 0.875482 0.940438 0.540722 0.318548 0.557597 0.456508 0.71601
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.562500, error: 0.500000
381. 
patient tongue id: 03062147483742_6_1
label yaofang:
甘草 陈皮 枳壳 茯苓 半夏 连翘 党参 白术 厚朴 山楂 鸡内金 紫苏梗 红曲
0.518858 0.401553 0.344529 0.556094 0.601065 0.373908 0.35287 0.314324 0.408194
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.666667, recall: 0.461538, error: 0.333333
382. 
patient tongue id: 03232306582218_3_2_7
label yaofang:
甘草 茯苓 独活 党参 黄芪 丹参 赤芍 山药 山茱萸 水蛭 桑寄生 补骨脂 鹿角霜 川加皮 牛大力
0.945046 0.522437 0.538868 0.390053 0.513921 0.448997 0.403225 0.351418 0.337792 0.322675
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
383. 
patient tongue id: 04241931050225_1
label yaofang:
白芍 木香 桃仁 麦冬 玉竹 太子参 丹参 玄参 赤芍 枳实 地黄 车前子 厚朴 莱菔子 火麻仁 北沙参 苦杏仁
0.931997 0.481793 0.557115 0.439913 0.499237 0.402542 0.411593 0.30248 0.337777
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
384. 
patient tongue id: 01042347533030_1_6
label yaofang:
甘草 党参 白术 赤芍 山药 地黄 天麻 菟丝子 益母草 补骨脂 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.962344 0.511362 0.550796 0.438018 0.306701 0.526178 0.436412 0.454838 0.328211 0.329534 0.356715
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
385. 
patient tongue id: 04252004191718_4_7
label yaofang:
柴胡 黄芩 羌活 党参 白术 泽泻 天麻 白芷 姜半夏 炙甘草 续断
0.334124 0.312426 0.445331 0.304639 0.398746 0.417289 0.319291 0.360489 0.507918
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.555556, recall: 0.454545, error: 0.444444
386. 
patient tongue id: 04141833295593_1_4_7
label yaofang:
荆芥 党参 黄芪 枸杞子 白术 丹参 浙贝母 牛膝 山药 僵蚕 莪术 紫苏子 紫苏叶 预知子
0.42164 0.418752 0.301401 0.406602 0.403532 0.343578
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
387. 
patient tongue id: 02182307154975_6_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 黄连 山药 干姜 砂仁 佛手 合欢花
0.979569 0.528544 0.593485 0.402686 0.341561 0.588757 0.515831 0.481631 0.395719 0.40633 0.43628
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
388. 
patient tongue id: 06091834178904_1
label yaofang:
桂枝 白芍 茯苓 木香 防风 茯神 黄芪 白术 郁金 通草 白芷 瓜蒌皮 西洋参 炙甘草
0.795793 0.35056 0.403869 0.489724 0.409807
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
389. 
patient tongue id: 06031129285832_2
label yaofang:
甘草 黄芩 桔梗 金银花 党参 生地黄 浙贝母 杜仲 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.806235 0.354941 0.412207 0.515855 0.434737
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
390. 
patient tongue id: 03021242120180_1_4_7
label yaofang:
甘草 川芎 茯苓 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.438613 0.346003 0.37295 0.434976 0.370604 0.37888 0.320588 0.338427 0.309776 0.318275 0.30549 0.307251
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 车前子 莱菔子 天麻

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
391. 
patient tongue id: 03081758252928_1_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.445215 0.372641 0.414843 0.355513 0.409906
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
392. 
patient tongue id: 05131621556198_1_2_7
label yaofang:
甘草 白芍 橘红 太子参 黄芪 浙贝母 山茱萸 天麻 鳖甲 地龙 北沙参 蜈蚣 白花蛇舌 蜂房 岗梅根 四季青
0.811954 0.330279 0.433825 0.484563 0.37933 0.313323
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
393. 
patient tongue id: 01032103396994_1_6
label yaofang:
甘草 茯苓 党参 枸杞子 酸枣仁 天麻 鳖甲 蒺藜 浮小麦 沙苑子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川加皮
0.962637 0.301712 0.520151 0.559274 0.408795 0.313852 0.523719 0.444195 0.425539 0.342451 0.337972 0.341131
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
394. 
patient tongue id: 01040552439394_6_2
label yaofang:
甘草 白芍 川芎 党参 黄芪 枸杞子 酸枣仁 生地黄 杜仲 牛膝 知母 天麻 桑寄生 首乌藤 土鳖虫
0.996365 0.53668 0.640785 0.371667 0.344915 0.729977 0.627513 0.587346 0.490285 0.518839 0.526376
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
395. 
patient tongue id: 04182147536236_2
label yaofang:
甘草 黄芩 桔梗 芦根 太子参 生地黄 浙贝母 乌梅 天花粉 鳖甲 北沙参 白花蛇舌 蜂房 四季青
0.982738 0.538556 0.594284 0.405083 0.330944 0.5838 0.535049 0.487729 0.415789 0.419121 0.427836
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
396. 
patient tongue id: 02142343086820_4_1
label yaofang:
甘草 白芍 薏苡仁 白术 赤芍 附子 天麻 僵蚕 鳖甲 木瓜 败酱草 蜈蚣 半枝莲 宽筋藤
0.881565 0.414715 0.523537 0.343476 0.591901 0.376362
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
397. 
patient tongue id: 04182037524552_1_4
label yaofang:
甘草 川芎 陈皮 枳壳 茯苓 龙骨 牡蛎 牛蒡子 远志 柏子仁 竹茹 紫菀 姜半夏
0.417084 0.384369 0.371987 0.300132 0.3977 0.532339
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
398. 
patient tongue id: 06080205247722_1_7_4
label yaofang:
甘草 川芎 法半夏 前胡 桃仁 远志 黄芪 赤芍 细辛 桑白皮 款冬花 地龙 苦杏仁 炙麻黄
0.989163 0.533976 0.613436 0.412517 0.403235 0.303686 0.312944 0.682171 0.622891 0.580032 0.504951 0.526607 0.570943
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.076923, recall: 0.071429, error: 0.923077
399. 
patient tongue id: 03291313308548_6_1
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗
0.423095 0.309661 0.467886 0.411189 0.385568 0.350326 0.468127
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
400. 
patient tongue id: 06071920220519_6_1
label yaofang:
桂枝 柴胡 白芍 当归 半夏 龙骨 牡蛎 酸枣仁 乌梅 知母 山药 砂仁 麦芽 北沙参 合欢皮 预知子
0.698541 0.427685 0.329294 0.361801 0.508557
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
401. 
patient tongue id: 02221313095060_1_7
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 郁金 三棱 鸡内金 白花蛇舌草 浮小麦 首乌藤 制远志
0.409343 0.343855 0.456494 0.313034 0.303665 0.443122
predicted yaofang:
甘草 法半夏 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
402. 
patient tongue id: 03021300301145_2
label yaofang:
陈皮 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.810694 0.429886 0.940875 0.52082 0.685068 0.405213 0.350982 0.425528 0.87359 0.890918 0.843337 0.898443 0.918204 0.5522 0.571881 0.486879 0.736985
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.588235, recall: 0.769231, error: 0.411765
403. 
patient tongue id: 02170951465389_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.423961 0.42174 0.354333 0.386072 0.300727 0.302279
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
404. 
patient tongue id: 02182224440174_1_2_6
label yaofang:
甘草 白及 地黄 天麻 没药 胡黄连 淡竹叶 白花蛇舌草 麦芽 广藿香 蜈蚣 半枝莲 醋鳖甲 川木通
0.72473 0.397184 0.389645 0.453576 0.360612
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
405. 
patient tongue id: 01132314555324_4_7
label yaofang:
白芍 延胡索 牛膝 全蝎 苏木 炙甘草 紫苏梗 蜈蚣 两面针
0.332149 0.311389 0.372995 0.322053 0.310278 0.50638
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.222222, error: 0.666667
406. 
patient tongue id: 06111047385908_2_4
label yaofang:
甘草 川芎 桃仁 党参 杜仲 黄柏 肉桂 山药 菟丝子 益智仁 益母草 桑螵蛸 麦芽 醋香附 合欢花
0.989733 0.544248 0.58489 0.371744 0.347977 0.652817 0.599565 0.532287 0.479993 0.477151 0.485411
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
407. 
patient tongue id: 05130653138212_2_1
label yaofang:
甘草 荆芥 防风 金银花 黄芪 白术 红花 天麻 火麻仁 白花蛇舌草 麦芽 白鲜皮 地肤子 蜈蚣 半枝莲 醋鳖甲
0.973863 0.522687 0.58891 0.424466 0.328564 0.581411 0.510887 0.480389 0.393832 0.401623 0.421346
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
408. 
patient tongue id: 03012315474186_4
label yaofang:
甘草 香附 茯苓 龙骨 麦冬 太子参 酸枣仁 丹参 五味子 薤白 砂仁 瓜蒌皮 浮小麦 首乌藤 降香 合欢花
0.979215 0.536163 0.597617 0.409032 0.327248 0.582508 0.514625 0.471438 0.393465 0.402152 0.414837
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
409. 
patient tongue id: 06072128582792_4_1
label yaofang:
甘草 茯苓 连翘 白术 地黄 砂仁 莱菔子 天麻 淡竹叶 白花蛇舌草 麦芽 蜈蚣 半枝莲 醋鳖甲
0.972834 0.503454 0.588482 0.414077 0.323559 0.570003 0.467346 0.468597 0.357067 0.357068 0.423795
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
410. 
patient tongue id: 01180603274291_1_2_7
label yaofang:
甘草 茯苓 党参 白术 生地黄 浙贝母 郁金 山茱萸 天麻 鳖甲 夏枯草 麦芽 蜈蚣 白花蛇舌 红豆杉
0.982117 0.542428 0.569355 0.379953 0.321486 0.597855 0.555941 0.487408 0.443024 0.432834 0.412221
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
411. 
patient tongue id: 02181627186318_1_5
label yaofang:
甘草 防风 金银花 黄芪 红花 浙贝母 牡丹皮 水牛角 荆芥穗 麦芽 皂角刺 白鲜皮 地肤子
0.893276 0.372333 0.442127 0.519984 0.390432 0.332506
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
412. 
patient tongue id: 05260633148369_1_7_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 砂仁 天麻 鳖甲 麦芽 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.984494 0.523176 0.595079 0.409898 0.375012 0.31287 0.672906 0.599847 0.555152 0.48021 0.496641 0.532695
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
413. 
patient tongue id: 05271844333055_1
label yaofang:
甘草 柴胡 陈皮 太子参 黄芪 鸡血藤 白术 乌药 山药 升麻 火麻仁 虎杖 紫苏梗
0.473252 0.375549 0.388915 0.439896 0.500921
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
414. 
patient tongue id: 03311657470159_1_6
label yaofang:
甘草 白芍 川芎 独活 牛蒡子 牛膝 细辛 干姜 蜈蚣 姜黄 海桐皮 鹿衔草
0.307303 0.41202 0.304565 0.314371 0.352848
predicted yaofang:
甘草 党参 黄芪 丹参 车前子

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
415. 
patient tongue id: 02190512460989_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 木香 党参 白术 郁金 砂仁 海金沙 鸡内金 虎杖 麦芽 紫苏梗
0.791439 0.45691 0.487541 0.355111 0.406077
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
416. 
patient tongue id: 02142125062181_5_7_1
label yaofang:
甘草 陈皮 茯苓 薏苡仁 白及 党参 山药 茜草 天麻 鳖甲 紫菀 苦杏仁 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.983845 0.535455 0.57885 0.374267 0.33044 0.613313 0.561428 0.499171 0.443742 0.441228 0.449696
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
417. 
patient tongue id: 05032309180340_6_1
label yaofang:
甘草 茯苓 麦冬 酸枣仁 柏子仁 生地黄 知母 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991354 0.543227 0.612525 0.367877 0.359798 0.684379 0.621415 0.547789 0.495171 0.508116 0.545983
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
418. 
patient tongue id: 01201949464024_3_5_7
label yaofang:
甘草 白芍 薏苡仁 熟附子 郁金 大腹皮 干姜 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 川木瓜 土鳖虫
0.959499 0.389044 0.54252 0.30594 0.484107 0.423975 0.376125 0.303174
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
419. 
patient tongue id: 04061954104522_1_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.382132 0.351108 0.40506 0.334855 0.37338 0.567934
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
420. 
patient tongue id: 05181042310199_6_2_1
label yaofang:
甘草 荆芥 防风 金银花 红花 地黄 水牛角 天麻 紫草 火麻仁 白花蛇舌草 麦芽 白鲜皮 蜈蚣 半枝莲 醋鳖甲
0.998712 0.544646 0.663711 0.390807 0.419122 0.820107 0.747295 0.731487 0.602834 0.638723 0.743482
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
421. 
patient tongue id: 06132016220438_2_1
label yaofang:
甘草 党参 太子参 阿胶 枸杞子 黄连 浙贝母 杜仲 莪术 北沙参 赭石 紫苏叶 浮石
0.304563 0.523734 0.446472 0.61699 0.389931 0.474499 0.549079 0.549146 0.543453 0.584578 0.357307 0.631835 0.371139 0.398066 0.3256 0.440433
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.062500, recall: 0.076923, error: 0.937500
422. 
patient tongue id: 03021330328397_1_4
label yaofang:
麻黄 桂枝 白芍 前胡 半夏 太子参 黄芪 五味子 细辛 干姜 紫菀 北沙参 紫苏子 炙甘草
0.335657 0.714759 0.451424 0.860972 0.499416 0.617108 0.304768 0.418984 0.37924 0.437636 0.776255 0.79646 0.742671 0.79754 0.327708 0.839429 0.520072 0.32677 0.530602 0.467291 0.644468 0.301225
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄 炒苍耳子

------Score: precision: 0.318182, recall: 0.500000, error: 0.681818
423. 
patient tongue id: 02202247302805_5_6
label yaofang:
甘草 黄芩 法半夏 茯苓 薏苡仁 桃仁 远志 细辛 桑白皮 干姜 款冬花 苇茎 苦杏仁 紫苏子 辛夷 炙麻黄
0.990418 0.539267 0.610378 0.409762 0.369319 0.656811 0.60755 0.567893 0.482382 0.496029 0.533558
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
424. 
patient tongue id: 05092218467250_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 款冬花 白前 苦杏仁 炙麻黄
0.988918 0.538493 0.604711 0.399019 0.370374 0.655324 0.593035 0.550111 0.476628 0.479715 0.517511
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.166667, error: 0.818182
425. 
patient tongue id: 01141832049702_1_5_6
label yaofang:
甘草 茯苓 党参 白术 生地黄 牡丹皮 杜仲 山药 山茱萸 白茅根 茜草 女贞子 续断 广金钱草
0.984728 0.525535 0.590957 0.403096 0.356385 0.659941 0.593379 0.557197 0.470716 0.482152 0.533888
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
426. 
patient tongue id: 03231443000575_1_4
label yaofang:
陈皮 茯苓 前胡 防风 太子参 黄芪 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄 麸炒白术
0.320702 0.656451 0.472446 0.783497 0.46293 0.532544 0.358148 0.336721 0.710701 0.69242 0.622774 0.667026 0.637206 0.412243 0.436982 0.483556
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.500000, recall: 0.615385, error: 0.500000
427. 
patient tongue id: 04131911060805_2
label yaofang:
甘草 蒲公英 枸杞子 黄连 红花 赤芍 海螵蛸 牡丹皮 山茱萸 桑叶 天麻 麦芽 北沙参 续断 紫苏叶 蛇舌草
0.495239 0.416761 0.384279 0.366758 0.396509
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
428. 
patient tongue id: 04282024049490_1_4
label yaofang:
甘草 前胡 薏苡仁 五味子 桑叶 细辛 天麻 莪术 紫菀 百部 白花蛇舌草 蜈蚣 蜜麻黄 醋鳖甲
0.993016 0.557186 0.613614 0.374406 0.344153 0.656118 0.605363 0.533666 0.47918 0.478716 0.493693
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
429. 
patient tongue id: 05181057498679_5
label yaofang:
甘草 法半夏 前胡 桔梗 金银花 连翘 浙贝母 细辛 款冬花 苦杏仁 辛夷 炙麻黄 苍耳子 四季青
0.943924 0.495914 0.528271 0.458993 0.436677 0.379028 0.425117 0.308292
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.125000, recall: 0.071429, error: 0.875000
430. 
patient tongue id: 03192241522104_4_6
label yaofang:
甘草 独活 桃仁 党参 鸡血藤 白术 红花 延胡索 赤芍 牛膝 桑寄生 决明子 续断 威灵仙 牛大力
0.995796 0.559036 0.631598 0.429343 0.381529 0.703781 0.660479 0.632433 0.52276 0.532378 0.590017
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
431. 
patient tongue id: 05102007465151_2_1
label yaofang:
法半夏 葛根 前胡 桔梗 麦冬 玉竹 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 人参叶
0.513999 0.44225 0.597522 0.377753 0.439513 0.526215 0.528699 0.51509 0.578218 0.373224 0.628632 0.332011 0.356705 0.408225
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.642857, recall: 0.642857, error: 0.357143
432. 
patient tongue id: 02122055325978_1
label yaofang:
甘草 茯苓 党参 白术 黄连 牛膝 山药 茜草 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.576147 0.42443 0.394145
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 1.000000, recall: 0.214286, error: 0.000000
433. 
patient tongue id: 04062030120916_4
label yaofang:
甘草 陈皮 法半夏 前胡 防风 细辛 干姜 木瓜 款冬花 紫菀 白前 百部 紫苏梗 蜜麻黄
0.315122 0.776153 0.458407 0.905505 0.513029 0.629824 0.424335 0.382771 0.425384 0.824619 0.840442 0.7966 0.847215 0.331883 0.883157 0.518416 0.314324 0.516936 0.481667 0.700062
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
434. 
patient tongue id: 05232111404798_1_4_6
label yaofang:
甘草 陈皮 当归 茯苓 半夏 木香 远志 党参 白术 杜仲 山药 僵蚕 桑寄生 瓜蒌皮 芡实 苦杏仁
0.710081 0.440941 0.42962 0.438355 0.5411
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.250000, error: 0.200000
435. 
patient tongue id: 04122133579679_6_4
label yaofang:
甘草 香附 茯苓 薏苡仁 党参 郁金 天麻 鳖甲 扁豆花 莪术 浮小麦 蜈蚣 白花蛇舌 天山雪莲
0.997611 0.554107 0.659356 0.420294 0.412539 0.778775 0.718948 0.695755 0.576042 0.608832 0.708786
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
436. 
patient tongue id: 03211945576371_6
label yaofang:
白芍 香附 法半夏 党参 延胡索 海螵蛸 枳实 北柴胡 麦芽 炙甘草 紫苏梗
0.306275 0.436897 0.308445 0.303889 0.370038 0.397925 0.36394 0.512806 0.612933
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.555556, recall: 0.454545, error: 0.444444
437. 
patient tongue id: 04150713556260_4_7
label yaofang:
甘草 白芍 薏苡仁 远志 白术 红花 牛膝 细辛 天麻 制川乌 忍冬藤 续断 威灵仙 川木瓜 骨碎补
0.981805 0.521516 0.578836 0.382241 0.309724 0.629142 0.558834 0.496713 0.433541 0.434889 0.452702
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
438. 
patient tongue id: 03302000466483_3_4
label yaofang:
桂枝 白芍 麦冬 党参 枸杞子 丹参 五味子 山茱萸 三七 珍珠母 蒺藜 广藿香
0.556276 0.335225 0.359801 0.417591 0.401165
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
439. 
patient tongue id: 03081201070705_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.595961 0.401936 0.45529 0.320144 0.317334 0.339584
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 天麻

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
440. 
patient tongue id: 03282202528898_4
label yaofang:
桂枝 甘草 白芍 川芎 羌活 独活 细辛 干姜 蜈蚣 姜黄 海桐皮 鹿衔草
0.351159 0.406649 0.304217 0.466231
predicted yaofang:
白芍 党参 白术 炙甘草

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
441. 
patient tongue id: 05232110526965_1_4_7
label yaofang:
陈皮 茯苓 半夏 党参 黄芪 枸杞子 白术 海螵蛸 杜仲 牛膝 山药 厚朴 僵蚕 菟丝子 鸡内金 紫苏梗 骨碎补 红豆杉
0.759401 0.437742 0.463156 0.49305
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.166667, error: 0.250000
442. 
patient tongue id: 01062347510090_1_3_8
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.350083 0.338072 0.364763
predicted yaofang:
茯苓 黄芪 炙甘草

------Score: precision: 0.666667, recall: 0.153846, error: 0.333333
443. 
patient tongue id: 01201948462277_1_7_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 丹参 郁金 天麻 桑寄生 鳖甲 续断 浮小麦 蜈蚣 天山雪莲 合欢花 半枝莲 红豆杉
0.990971 0.54085 0.600042 0.399824 0.373994 0.309599 0.68883 0.631651 0.588153 0.509207 0.518346 0.547163
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.352941, error: 0.500000
444. 
patient tongue id: 04121947295996_5
label yaofang:
甘草 枸杞子 杜仲 黄柏 山药 泽泻 车前子 砂仁 菟丝子 桑寄生 金樱子 虎杖 紫苏梗 广藿香 沙苑子
0.999105 0.542629 0.66023 0.387932 0.427059 0.843951 0.759993 0.74006 0.597167 0.641309 0.727211
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.066667, error: 0.909091
445. 
patient tongue id: 06031050525671_3_4_6
label yaofang:
甘草 枳壳 法半夏 茯苓 薏苡仁 党参 砂仁 鳖甲 莪术 枇杷叶 麦芽 紫苏梗 广藿香 白花蛇舌 天山雪莲
0.980138 0.527133 0.588001 0.415448 0.312616 0.568428 0.511715 0.47954 0.394607 0.395638 0.410151
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
446. 
patient tongue id: 03281926256817_6
label yaofang:
柴胡 白芍 黄芩 法半夏 大枣 当归 茯苓 葛根 桃仁 党参 五味子 熟地黄 牡丹皮 细辛 干姜 炙甘草
0.814792 0.345351 0.43202 0.512359 0.457267
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
447. 
patient tongue id: 04111541121879_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.411846 0.356084 0.367165 0.440308 0.361159 0.384938 0.32529 0.346276 0.326528 0.319753 0.342773
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 车前子 莱菔子 天麻

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
448. 
patient tongue id: 01061910374305_4
label yaofang:
法半夏 葛根 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 人参叶
0.334647 0.69402 0.446047 0.815763 0.464987 0.573818 0.316337 0.376031 0.345644 0.38056 0.728095 0.738856 0.719843 0.77317 0.362802 0.791203 0.468596 0.304572 0.488449 0.490841 0.633141
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.571429, recall: 0.800000, error: 0.428571
449. 
patient tongue id: 01031828329629_1
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.748479 0.45467 0.887373 0.487758 0.623247 0.387188 0.354356 0.394687 0.793287 0.822087 0.778915 0.835419 0.301468 0.865709 0.501085 0.540967 0.451874 0.665295
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
450. 
patient tongue id: 03111738251908_5_2
label yaofang:
甘草 党参 黄连 生地黄 赤芍 栀子 牛膝 石膏 肉桂 山药 山茱萸 细辛 砂仁 白芷 粉葛
0.87321 0.48368 0.492545 0.410226 0.33024
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
451. 
patient tongue id: 03151914205977_1
label yaofang:
白芍 香附 法半夏 党参 丹参 延胡索 乳香 海螵蛸 砂仁 北柴胡 麦芽 炙甘草 紫苏梗
0.340615 0.427183 0.4095 0.397475 0.348368 0.482534
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
452. 
patient tongue id: 03091829490414_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.328517 0.745223 0.432575 0.88362 0.495132 0.639906 0.42048 0.388619 0.432643 0.811412 0.831837 0.769131 0.830256 0.300463 0.880129 0.520692 0.327753 0.538103 0.439932 0.65535 0.301632
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄 炒苍耳子

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
453. 
patient tongue id: 05222120136358_5_6
label yaofang:
甘草 白芍 牡蛎 麦冬 黄芪 白术 五味子 厚朴 全蝎 女贞子 首乌藤 合欢皮 墨旱莲
0.576749 0.373862 0.339882 0.315244 0.634472 0.722257 0.303694 0.46529 0.43092 0.364676 0.438688
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
454. 
patient tongue id: 03141621180999_1_3_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.380165 0.504532 0.439186 0.374455 0.49014 0.462153 0.444066 0.440206 0.434808 0.474259 0.509761 0.382955 0.446455 0.443405 0.465202
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
455. 
patient tongue id: 04112039564553_6_5_7
label yaofang:
甘草 枳壳 法半夏 茯苓 龙骨 党参 白术 丹参 黄连 竹茹 牛膝 石菖蒲 砂仁 白芷 合欢花
0.939398 0.48606 0.567242 0.360742 0.331604 0.555227 0.32536 0.320187
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
456. 
patient tongue id: 03221310464845_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 白术 槟榔 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.974111 0.530236 0.56784 0.387256 0.542566 0.479355 0.428586 0.370713 0.367996 0.366124
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.615385, error: 0.200000
457. 
patient tongue id: 03282204574308_2_4
label yaofang:
甘草 黄芩 法半夏 茯苓 桃仁 远志 党参 浙贝母 山药 厚朴 紫菀 地龙 苦杏仁 紫苏子 鹿角霜 蜜麻黄
0.889108 0.312746 0.49026 0.520671 0.385014 0.427221 0.330367 0.311198
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.187500, error: 0.625000
458. 
patient tongue id: 06012047482035_2_5
label yaofang:
甘草 枳壳 牡蛎 薏苡仁 太子参 赤芍 郁金 厚朴 僵蚕 莪术 蛤壳 蜈蚣 山慈菇 蛇舌草
0.457497 0.375377 0.361886 0.555651 0.632783 0.337461 0.375543 0.371046 0.31229 0.374021
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
459. 
patient tongue id: 03301918329611_4
label yaofang:
法半夏 前胡 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.344976 0.597764 0.460048 0.716192 0.435942 0.525741 0.328619 0.372062 0.347633 0.356153 0.631945 0.65535 0.622406 0.667171 0.378069 0.722139 0.426447 0.321624 0.454758 0.401463 0.52205
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
460. 
patient tongue id: 03311630316639_1_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.388154 0.436349 0.306491 0.387443 0.383799 0.308636 0.496501
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
461. 
patient tongue id: 05232015307386_4_7
label yaofang:
半夏 薏苡仁 赤芍 杜仲 牛膝 郁金 僵蚕 莪术 北沙参 赭石 蜈蚣 骨碎补 土鳖虫 冬凌草 鸭脚艾
0.399688 0.484242 0.304907 0.428093
predicted yaofang:
茯苓 黄芪 白术 北沙参

------Score: precision: 0.250000, recall: 0.066667, error: 0.750000
462. 
patient tongue id: 01062031413347_1_5
label yaofang:
甘草 黄芩 桔梗 芦根 麦冬 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 蜂房 岗梅根 四季青
0.960781 0.316156 0.514276 0.552019 0.369903 0.518162 0.434405 0.402707 0.320819 0.328687 0.325287
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
463. 
patient tongue id: 06130800337287_1_4_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.364035 0.438162 0.422866 0.417735 0.438472 0.3664 0.396796 0.335997 0.353078 0.391515 0.401115 0.313998 0.33475 0.358472 0.37417
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.333333, recall: 0.416667, error: 0.666667
464. 
patient tongue id: 04131920486583_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.33106 0.729069 0.431173 0.880172 0.487081 0.650284 0.411395 0.393394 0.437113 0.795528 0.835719 0.787464 0.833175 0.332053 0.878155 0.533687 0.342779 0.561976 0.486071 0.679686
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
465. 
patient tongue id: 06022255192274_1_4_6
label yaofang:
甘草 陈皮 半夏 荆芥 枸杞子 浙贝母 僵蚕 白前 百部 苦杏仁 紫苏子 蝉蜕 炙麻黄 紫苏叶 紫苑 芥子
0.439069 0.371903 0.333136 0.549493 0.520661 0.349658 0.382366
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.142857, recall: 0.062500, error: 0.857143
466. 
patient tongue id: 03311646558715_9
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.335404 0.402115 0.395413 0.393222 0.301511 0.452198
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
467. 
patient tongue id: 03101911360727_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.397563 0.414163 0.30391 0.428413 0.385952 0.338613 0.459825
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
468. 
patient tongue id: 03041418156287_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 黄连 生地黄 牡丹皮 黄柏 知母 山药 浮小麦 土鳖虫
0.902772 0.326687 0.487336 0.531796 0.425054 0.410791 0.31835 0.332338
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
469. 
patient tongue id: 03101734585745_4_1
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.303 0.487004 0.455066 0.534313 0.374904 0.439275 0.322596 0.454655 0.480526 0.479096 0.498501 0.379248 0.608713 0.348918 0.367011 0.307717 0.380414
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.705882, recall: 0.857143, error: 0.294118
470. 
patient tongue id: 03021207575038_1_2_7
label yaofang:
甘草 法半夏 橘红 防风 金银花 太子参 藿香 白前 鸡内金 辛夷 蜜百部 干鱼腥草
0.355496 0.362376 0.378823 0.459661 0.36491 0.357179
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
471. 
patient tongue id: 05140644029785_6_2
label yaofang:
甘草 龙骨 太子参 白术 酸枣仁 山茱萸 桑叶 天麻 糯稻根 鳖甲 白花蛇舌草 蜈蚣 天山雪莲 半枝莲
0.956851 0.503981 0.558235 0.401623 0.309443 0.548708 0.483108 0.45125 0.383873 0.394682 0.422329
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
472. 
patient tongue id: 05091925331925_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.315999 0.82126 0.434265 0.940471 0.517006 0.674509 0.433974 0.409128 0.452566 0.869484 0.893606 0.853131 0.897978 0.334093 0.93037 0.549936 0.324654 0.564108 0.516484 0.752451
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
473. 
patient tongue id: 05042040199607_4_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 姜半夏 百合 紫苏叶 独脚金
0.346317 0.521759 0.318759 0.352589 0.348499 0.304534 0.348705 0.556142 0.69388
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.166667, error: 0.777778
474. 
patient tongue id: 02182317302905_1_2
label yaofang:
甘草 柴胡 白芍 枳壳 薏苡仁 远志 党参 栀子 郁金 山药 砂仁 莱菔子 天麻 鳖甲 蜈蚣 半枝莲
0.980368 0.536205 0.55674 0.363611 0.312571 0.591804 0.532194 0.469646 0.42547 0.411112 0.408342
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
475. 
patient tongue id: 03061828217784_2_1_6
label yaofang:
甘草 黄芩 桔梗 生地黄 浙贝母 白芷 天花粉 鳖甲 麦芽 苦杏仁 广藿香 苍耳子 白花蛇舌 蜂房 四季青
0.954764 0.51792 0.55383 0.413207 0.459605 0.383644 0.380761
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.133333, error: 0.714286
476. 
patient tongue id: 03012014039796_2
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.303474 0.651406 0.444624 0.805246 0.47654 0.599133 0.417079 0.385548 0.44032 0.718005 0.756916 0.685592 0.73881 0.814266 0.504445 0.310121 0.527935 0.414059 0.586941
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
477. 
patient tongue id: 03141624023390_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.443532 0.353141 0.325127 0.424333 0.464205 0.317224 0.335821 0.310421
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
478. 
patient tongue id: 01172252199814_6_4
label yaofang:
甘草 茯苓 龙骨 麦冬 党参 太子参 酸枣仁 丹参 五味子 生地黄 山药 山茱萸 补骨脂 鹿角霜
0.992473 0.551583 0.604608 0.369008 0.348598 0.671832 0.618304 0.544583 0.492196 0.494759 0.513837
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
479. 
patient tongue id: 05022047456811_1_2
label yaofang:
甘草 枳壳 茯苓 木香 党参 白术 酸枣仁 柏子仁 黄连 厚朴 桑寄生 火麻仁 浮小麦 合欢花 牛大力
0.900292 0.492315 0.516121 0.431027 0.371376 0.322672
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
480. 
patient tongue id: 03090823503274_1_4
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 黄芪 白术 乌药 石菖蒲 泽泻 砂仁 菟丝子 益智仁 芡实 棉萆薢
0.895624 0.301257 0.478822 0.517754 0.441102 0.433021 0.348717 0.391748
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
481. 
patient tongue id: 05152048066585_1_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.46995 0.300757 0.381962 0.41909 0.432899
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
482. 
patient tongue id: 05102208194674_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄
0.309301 0.570013 0.443901 0.712481 0.3976 0.520596 0.301715 0.612351 0.630143 0.608839 0.674973 0.372648 0.721518 0.396973 0.426572 0.34298 0.481239
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.823529, recall: 1.000000, error: 0.176471
483. 
patient tongue id: 01101808493959_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.330659 0.679297 0.457827 0.818767 0.485095 0.582895 0.311517 0.408106 0.375196 0.407246 0.735851 0.75303 0.700268 0.745176 0.332906 0.793548 0.486979 0.324597 0.495154 0.432128 0.606816
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
484. 
patient tongue id: 04141903599650_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.817884 0.42477 0.953311 0.533779 0.71214 0.421819 0.376016 0.467233 0.890749 0.912758 0.863757 0.908501 0.30435 0.941543 0.583791 0.317879 0.586073 0.485303 0.750376
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
485. 
patient tongue id: 05032129043639_4
label yaofang:
桂枝 柴胡 白芍 黄芩 羌活 党参 郁金 姜半夏 炙甘草 土鳖虫 土茯苓
0.393743 0.393779 0.326509 0.408433 0.545742
predicted yaofang:
白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.800000, recall: 0.363636, error: 0.200000
486. 
patient tongue id: 05022046307967_2_6
label yaofang:
甘草 茯苓 木香 党参 生地黄 山药 天麻 鳖甲 扁豆花 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.914428 0.31899 0.495225 0.521711 0.380086 0.421075 0.333233 0.318717
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.428571, error: 0.250000
487. 
patient tongue id: 01180614395208_1_6
label yaofang:
甘草 法半夏 茯苓 党参 白术 黄连 赤芍 川楝子 郁金 砂仁 麦芽 佛手 合欢花 鱼古 瓦楞子
0.951993 0.503637 0.507043 0.407554 0.46396 0.332742 0.37797
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
488. 
patient tongue id: 04020807275265_6
label yaofang:
甘草 柴胡 白芍 川芎 党参 栀子 牡丹皮 牛膝 山药 天麻 菟丝子 蔓荆子 益母草 女贞子 浮小麦 墨旱莲
0.936639 0.503468 0.520513 0.397903 0.499427 0.419091 0.391282 0.326776 0.307677 0.30626
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.187500, error: 0.700000
489. 
patient tongue id: 05251933137327_6_7
label yaofang:
甘草 枳壳 牡蛎 薏苡仁 太子参 赤芍 牡丹皮 郁金 厚朴 僵蚕 莪术 蛤壳 蜈蚣 山慈菇
0.382783 0.388934 0.579304 0.546669 0.456918
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
490. 
patient tongue id: 06062249232509_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 连翘 薄荷 芦根 牛蒡子 浙贝母 淡竹叶 皂角刺 粉葛 紫苏梗 大青叶
0.933348 0.338246 0.485263 0.543834 0.379103 0.396676 0.301848 0.303085
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.125000, error: 0.750000
491. 
patient tongue id: 01040702212149_2_6
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 丹参 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.98609 0.538523 0.598285 0.378413 0.342761 0.637095 0.57521 0.502525 0.454333 0.45024 0.449837
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.785714, error: 0.000000
492. 
patient tongue id: 02241428006805_4_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草
0.344674 0.524774 0.382671 0.334626 0.318359 0.303101 0.373017 0.646812 0.738695
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.333333, error: 0.555556
493. 
patient tongue id: 02151852074477_1_4
label yaofang:
陈皮 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.877715 0.426742 0.973882 0.553694 0.7449 0.449558 0.393136 0.472752 0.923542 0.942163 0.904074 0.944571 0.964235 0.60584 0.308438 0.613515 0.527256 0.804415
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
494. 
patient tongue id: 01132124333258_6_1
label yaofang:
甘草 川芎 党参 红花 赤芍 地黄 天麻 菟丝子 益母草 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲 乌梢蛇
0.970385 0.516817 0.570612 0.396695 0.329961 0.603768 0.539827 0.499924 0.424117 0.431904 0.469362
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
495. 
patient tongue id: 06181704221521_2_1
label yaofang:
甘草 半夏 黄芪 枸杞子 黄连 牡丹皮 杜仲 僵蚕 莪术 柿蒂 枇杷叶 北沙参 赭石 紫苏叶 合欢皮 蛇舌草
0.706109 0.423221 0.409349 0.391082 0.562103
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
496. 
patient tongue id: 05232036098741_4_1
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 豆蔻 蝉蜕 姜半夏 炙甘草 紫苏梗 黄皮果核
0.428948 0.307045 0.351014 0.385653 0.320805 0.464872 0.616282
predicted yaofang:
白芍 当归 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
497. 
patient tongue id: 06140819237844_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.468562 0.305426 0.552268 0.459129 0.372568 0.528711 0.520224 0.489992 0.458482 0.486842 0.505091 0.559728 0.48613 0.505287 0.513829 0.494805
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
498. 
patient tongue id: 03141622395435_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.352733 0.452244 0.435216 0.363355 0.450483 0.405269 0.430348 0.312674 0.393594 0.469353 0.407796 0.31661 0.368071 0.363779 0.374941
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
499. 
patient tongue id: 05092208485915_4_1
label yaofang:
法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.317121 0.777 0.440101 0.922371 0.517347 0.669251 0.43266 0.400807 0.452525 0.847508 0.875132 0.818434 0.865591 0.303854 0.918092 0.540927 0.326745 0.553855 0.452791 0.695022
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
------Average Score: average precision: 0.455035, average recall: 0.350167, error: 0.544965