5216/8539 [=================>............] - ETA: 38s - loss: 0.18332017-10-19 16:35:54.162919: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:247] PoolAllocator: After 31604 get requests, put_count=31599 evicted_count=1000 eviction_rate=0.0316466 and unsatisfied allocation rate=0.0349639
2017-10-19 16:35:54.162942: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
8512/8539 [============================>.] - ETA: 0s - loss: 0.1534Epoch 00000: val_loss improved from inf to 0.08292, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 100s - loss: 0.1533 - val_loss: 0.0829
Epoch 2/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0962Epoch 00001: val_loss improved from 0.08292 to 0.08021, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 98s - loss: 0.0962 - val_loss: 0.0802
Epoch 3/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0904Epoch 00002: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0904 - val_loss: 0.0852
Epoch 4/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0870Epoch 00003: val_loss improved from 0.08021 to 0.07804, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0871 - val_loss: 0.0780
Epoch 5/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0852Epoch 00004: val_loss improved from 0.07804 to 0.07685, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0852 - val_loss: 0.0769
Epoch 6/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0838Epoch 00005: val_loss improved from 0.07685 to 0.07650, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0838 - val_loss: 0.0765
Epoch 7/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0828Epoch 00006: val_loss improved from 0.07650 to 0.07647, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0828 - val_loss: 0.0765
Epoch 8/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0819Epoch 00007: val_loss improved from 0.07647 to 0.07623, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0819 - val_loss: 0.0762
Epoch 9/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0815Epoch 00008: val_loss improved from 0.07623 to 0.07593, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0815 - val_loss: 0.0759
Epoch 10/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0806Epoch 00009: val_loss improved from 0.07593 to 0.07477, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0806 - val_loss: 0.0748
Epoch 11/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0800Epoch 00010: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0800 - val_loss: 0.0749
Epoch 12/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0797Epoch 00011: val_loss improved from 0.07477 to 0.07460, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0797 - val_loss: 0.0746
Epoch 13/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0789Epoch 00012: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0789 - val_loss: 0.0746
Epoch 14/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0786Epoch 00013: val_loss improved from 0.07460 to 0.07407, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0786 - val_loss: 0.0741
Epoch 15/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0782Epoch 00014: val_loss improved from 0.07407 to 0.07369, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0782 - val_loss: 0.0737
Epoch 16/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0777Epoch 00015: val_loss improved from 0.07369 to 0.07350, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0777 - val_loss: 0.0735
Epoch 17/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0772Epoch 00016: val_loss improved from 0.07350 to 0.07303, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0771 - val_loss: 0.0730
Epoch 18/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0770Epoch 00017: val_loss improved from 0.07303 to 0.07276, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0770 - val_loss: 0.0728
Epoch 19/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0765Epoch 00018: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0764 - val_loss: 0.0735
Epoch 20/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0762Epoch 00019: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0761 - val_loss: 0.0733
Epoch 21/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0759Epoch 00020: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0760 - val_loss: 0.0733
Epoch 22/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0758Epoch 00021: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0757 - val_loss: 0.0737
Epoch 23/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0754Epoch 00022: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0754 - val_loss: 0.0739
Epoch 24/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0750Epoch 00023: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0750 - val_loss: 0.0731
Epoch 25/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0746Epoch 00024: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0746 - val_loss: 0.0731
Epoch 26/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0744Epoch 00025: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0744 - val_loss: 0.0730
Epoch 27/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0741Epoch 00026: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0741 - val_loss: 0.0729
Epoch 28/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0740Epoch 00027: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0740 - val_loss: 0.0739
Epoch 29/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0737Epoch 00028: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0736 - val_loss: 0.0729
Epoch 30/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0735Epoch 00029: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0735 - val_loss: 0.0735
Epoch 31/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0732Epoch 00030: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0732 - val_loss: 0.0739
Epoch 32/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0730Epoch 00031: val_loss improved from 0.07276 to 0.07242, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0730 - val_loss: 0.0724
Epoch 33/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0727Epoch 00032: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0727 - val_loss: 0.0733
Epoch 34/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0724Epoch 00033: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0724 - val_loss: 0.0731
Epoch 35/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0721Epoch 00034: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0721 - val_loss: 0.0728
Epoch 36/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0717Epoch 00035: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0717 - val_loss: 0.0742
Epoch 37/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0717Epoch 00036: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0717 - val_loss: 0.0738
Epoch 38/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0716Epoch 00037: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0716 - val_loss: 0.0732
Epoch 39/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0712Epoch 00038: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0712 - val_loss: 0.0731
Epoch 40/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0711Epoch 00039: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0711 - val_loss: 0.0733
Epoch 41/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0707Epoch 00040: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0707 - val_loss: 0.0734
Epoch 42/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0703Epoch 00041: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0704 - val_loss: 0.0731
Epoch 43/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0702Epoch 00042: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0702 - val_loss: 0.0734
Epoch 44/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0699Epoch 00043: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0699 - val_loss: 0.0734
Epoch 45/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0698Epoch 00044: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0698 - val_loss: 0.0733
Epoch 46/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0695Epoch 00045: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0695 - val_loss: 0.0734
Epoch 47/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0694Epoch 00046: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0694 - val_loss: 0.0735
Epoch 48/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0691Epoch 00047: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0691 - val_loss: 0.0741
Epoch 49/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0690Epoch 00048: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0690 - val_loss: 0.0739
Epoch 50/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0685Epoch 00049: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0685 - val_loss: 0.0741
Epoch 51/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0683Epoch 00050: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0683 - val_loss: 0.0746
Epoch 52/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0682Epoch 00051: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0682 - val_loss: 0.0737
Epoch 53/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0680Epoch 00052: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0680 - val_loss: 0.0744
Epoch 54/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0676Epoch 00053: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0676 - val_loss: 0.0749
Epoch 55/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0676Epoch 00054: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0676 - val_loss: 0.0748
Epoch 56/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0672Epoch 00055: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0672 - val_loss: 0.0746
Epoch 57/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0671Epoch 00056: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0671 - val_loss: 0.0744
Epoch 58/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0666Epoch 00057: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0666 - val_loss: 0.0745
Epoch 59/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0667Epoch 00058: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0667 - val_loss: 0.0750
Epoch 60/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0664Epoch 00059: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0665 - val_loss: 0.0745
Epoch 61/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0662Epoch 00060: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0662 - val_loss: 0.0746
Epoch 62/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0659Epoch 00061: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0659 - val_loss: 0.0743
Epoch 63/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0657Epoch 00062: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0657 - val_loss: 0.0753
Epoch 64/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0653Epoch 00063: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0653 - val_loss: 0.0752
Epoch 65/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0650Epoch 00064: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0650 - val_loss: 0.0750
Epoch 66/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0649Epoch 00065: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0649 - val_loss: 0.0750
Epoch 67/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0645Epoch 00066: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0645 - val_loss: 0.0747
Epoch 68/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0643Epoch 00067: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0643 - val_loss: 0.0751
Epoch 69/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0640Epoch 00068: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0640 - val_loss: 0.0749
Epoch 70/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0639Epoch 00069: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0639 - val_loss: 0.0749
Epoch 71/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0636Epoch 00070: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0636 - val_loss: 0.0755
Epoch 72/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0635Epoch 00071: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0635 - val_loss: 0.0755
Epoch 73/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0632Epoch 00072: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0632 - val_loss: 0.0761
Epoch 74/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0629Epoch 00073: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0629 - val_loss: 0.0761
Epoch 75/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0626Epoch 00074: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0626 - val_loss: 0.0764
Epoch 76/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0625Epoch 00075: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0625 - val_loss: 0.0760
Epoch 77/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0622Epoch 00076: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0623 - val_loss: 0.0767
Epoch 78/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0621Epoch 00077: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0621 - val_loss: 0.0768
Epoch 79/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0620Epoch 00078: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0620 - val_loss: 0.0767
Epoch 80/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0615Epoch 00079: val_loss did not improve
8539/8539 [==============================] - 97s - loss: 0.0615 - val_loss: 0.0766
history: [(0.15328956707668104, None, 0.082921584938472001, None), (0.096190081223704135, None, 0.080213498610716596, None), (0.090380329602509329, None, 0.085157695680092543, None), (0.087050432289794255, None, 0.07804119434112157, None), (0.085208386641738701, None, 0.07685360934708145, None), (0.083777550732255998, None, 0.076504375826526472, None), (0.082837231973774447, None, 0.076474170927163007, None), (0.081915780926339873, None, 0.076225617457003819, None), (0.081506971942134562, None, 0.075925982342316553, None), (0.080629049044175283, None, 0.074770011198826328, None), (0.079950838268068439, None, 0.07485686993096774, None), (0.079664474110411235, None, 0.074600813289483384, None), (0.078939110876553684, None, 0.074647467869978681, None), (0.078621056001091996, None, 0.074066259731084869, None), (0.078203657605578514, None, 0.073685318013250609, None), (0.077715545924999269, None, 0.073503653208414718, None), (0.07712595170011062, None, 0.073025002475186576, None), (0.076981674747600232, None, 0.072763565040770029, None), (0.076400365292614139, None, 0.073516991166841419, None), (0.076141519188210813, None, 0.073274105186864127, None), (0.075951710298861594, None, 0.073295754800131036, None), (0.075747704983895353, None, 0.073693058320454183, None), (0.075388041746457218, None, 0.073904721155053088, None), (0.075004345159233834, None, 0.073066611757208577, None), (0.074620975316485247, None, 0.073070864646862715, None), (0.074427415003526939, None, 0.072984116199689031, None), (0.074143441655077691, None, 0.072893080939521723, None), (0.07399819086831827, None, 0.073852039846308504, None), (0.073646366725357182, None, 0.072925331500860363, None), (0.07347560606156095, None, 0.073459288794479091, None), (0.073211229471192033, None, 0.073867913403790508, None), (0.072982856234449847, None, 0.072419998191651846, None), (0.072677482441739549, None, 0.073250450821586585, None), (0.072447870298827446, None, 0.073070152120275816, None), (0.072087241290240786, None, 0.072772921223343515, None), (0.071706494235967297, None, 0.074188593051809096, None), (0.071655885841370684, None, 0.073825592523092745, None), (0.071596623062982756, None, 0.073240163125397953, None), (0.071219465158166892, None, 0.073102121033292985, None), (0.071106918492073165, None, 0.073349021538928319, None), (0.070670982094863097, None, 0.073427035394824036, None), (0.0703697276643825, None, 0.073123384417195028, None), (0.070220678992371374, None, 0.073400343348691749, None), (0.069927504375823027, None, 0.073411648472150162, None), (0.069757079686182055, None, 0.073334420993651228, None), (0.069538718181731962, None, 0.07340975356844319, None), (0.069401358671434904, None, 0.073538711656144257, None), (0.06906593491156747, None, 0.074094663036393602, None), (0.069024857306825227, None, 0.073918694869065896, None), (0.06853369020849609, None, 0.074077927749672215, None), (0.068313983119941316, None, 0.074647659510919895, None), (0.068193097320620968, None, 0.073669476113913265, None), (0.067974904350764517, None, 0.074379001344953261, None), (0.067618982696480159, None, 0.074890333490493968, None), (0.067642558689334664, None, 0.07481300192219871, None), (0.067158910713628298, None, 0.074594435947281976, None), (0.067075024727901653, None, 0.074373533382957241, None), (0.066555006953728735, None, 0.074530371188462438, None), (0.066717628691930486, None, 0.075020217306011328, None), (0.066461649938976339, None, 0.074505725677633458, None), (0.066222690528781991, None, 0.074589537668140818, None), (0.065856934269092476, None, 0.074323739760961294, None), (0.065699855745840391, None, 0.075285841666516806, None), (0.065332146343365108, None, 0.075199942449073645, None), (0.065003671649887518, None, 0.074992067866272979, None), (0.064861676961424364, None, 0.075039214485294214, None), (0.064493837139759758, None, 0.074720337086326472, None), (0.064304779225569694, None, 0.075094261967437168, None), (0.064036864943087746, None, 0.074894317722582551, None), (0.06389654073604642, None, 0.0748997898601787, None), (0.063599190416778889, None, 0.07553197454401861, None), (0.063499926186645184, None, 0.075542624125550517, None), (0.063164132134056375, None, 0.076051148411991829, None), (0.062893142030018251, None, 0.076116141136530993, None), (0.062626846932160071, None, 0.076351730569160031, None), (0.062532595460330284, None, 0.076013572568640164, None), (0.062259899346970023, None, 0.076679652290684838, None), (0.062090571121206771, None, 0.076780491805338594, None), (0.061980505324817262, None, 0.076739188488368151, None), (0.061505231934763503, None, 0.076647403039338383, None)]
0. 
patient tongue id: 03211936112753_4
label yaofang:
黄芩 茯苓 栀子 杜仲 牛膝 钩藤 天麻 石决明 桑寄生 益母草 首乌藤
0.376578 0.352465 0.385649 0.314522 0.3154 0.433062
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
1. 
patient tongue id: 06092004526441_1_4_6
label yaofang:
甘草 川芎 当归 防风 独活 党参 白术 海螵蛸 杜仲 牛膝 厚朴 巴戟天 桑寄生 秦艽 紫苏叶 蜈蚣 骨碎补
0.605467 0.40161 0.406871 0.485837 0.571588 0.339487 0.30164 0.367413 0.344539 0.328647 0.307377
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 浙贝母 杜仲 厚朴 砂仁 北沙参 蜈蚣

------Score: precision: 0.545455, recall: 0.352941, error: 0.454545
2. 
patient tongue id: 04252016476939_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 海螵蛸 车前子 白花蛇舌草 紫苏梗 瓦楞子 猫爪草 山慈菇
0.318898 0.321464 0.438716 0.340154 0.363935 0.349153 0.33647 0.344146 0.565651 0.613875 0.301318
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
3. 
patient tongue id: 03151854573311_3_6
label yaofang:
党参 白术 柏子仁 附子 车前子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.336123 0.394069 0.363653 0.325693
predicted yaofang:
甘草 党参 黄芪 炙甘草

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
4. 
patient tongue id: 02122104594538_4_6
label yaofang:
甘草 薏苡仁 蒲公英 党参 厚朴 天麻 五灵脂 鳖甲 三棱 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 鱼古
0.996177 0.566841 0.63967 0.378686 0.356708 0.320779 0.304454 0.689697 0.603434 0.625186 0.517568 0.482044 0.496692
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
5. 
patient tongue id: 05270138084657_1_2_4
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 党参 浙贝母 细辛 砂仁 天麻 鳖甲 补骨脂 莪术 蜈蚣 白花蛇舌 天山雪莲
0.941821 0.498042 0.554938 0.420287 0.330671 0.307792 0.302869 0.525597 0.46532 0.500082 0.401443 0.382502 0.394888
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.562500, error: 0.307692
6. 
patient tongue id: 06190148379154_7_6
label yaofang:
甘草 川芎 茯苓 龙骨 桃仁 远志 党参 酸枣仁 丹参 红花 赤芍 知母 地黄 淡竹叶 浮小麦 百合 合欢花
0.982034 0.309595 0.5444 0.594585 0.372539 0.336542 0.321675 0.301594 0.597977 0.538686 0.528481 0.463089 0.426905 0.428607
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.235294, error: 0.714286
7. 
patient tongue id: 05090815286121_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.427112 0.620894 0.42538 0.451562 0.590963 0.469313 0.493346 0.488939 0.532483 0.505726 0.595458 0.435698 0.595312 0.544134 0.582034
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
8. 
patient tongue id: 04141835473752_1_4_3
label yaofang:
陈皮 枳壳 当归 木香 黄芪 枸杞子 白术 杜仲 厚朴 砂仁 菟丝子 鸡内金 北沙参 紫苏叶 预知子 稻芽
0.467708 0.399961 0.471908 0.423594 0.414103
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
9. 
patient tongue id: 05182041306526_1_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 金樱子 桑螵蛸 炙甘草 百合 紫苏叶 覆盆子
0.4109 0.335518 0.374926 0.33074 0.509541 0.629856 0.336176
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
10. 
patient tongue id: 06130757280187_1_2_4
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.554384 0.346161 0.520128 0.462396 0.428988 0.520844 0.415131 0.429433 0.42432 0.42558 0.396928 0.48334 0.48602 0.472309 0.432753 0.434363
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.250000, recall: 0.333333, error: 0.750000
11. 
patient tongue id: 02150746046672_1_3_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.414241 0.540192 0.368249 0.52613 0.534167 0.300557 0.386985 0.344097 0.305103 0.424856 0.401893 0.344255 0.334234
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
12. 
patient tongue id: 04300900263194_5
label yaofang:
甘草 荆芥 金银花 蒲公英 紫花地丁 白术 丹参 浙贝母 地黄 紫草 麦芽 皂角刺 白鲜皮 地肤子
0.964576 0.482805 0.599217 0.429392 0.363442 0.588472 0.466685 0.548108 0.391593 0.398148 0.465855
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
13. 
patient tongue id: 01201410528158_1_4
label yaofang:
甘草 白芍 枳壳 薏苡仁 党参 白术 熟附子 天麻 鳖甲 莪术 败酱草 佛手 蜈蚣 天山雪莲 半枝莲 红豆杉
0.891418 0.456501 0.530306 0.389175 0.445743 0.341259
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.312500, error: 0.166667
14. 
patient tongue id: 03081838101446_4
label yaofang:
麻黄 陈皮 前胡 半夏 防风 细辛 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.429061 0.797868 0.400545 0.889143 0.471904 0.581271 0.424233 0.398366 0.393082 0.302407 0.404222 0.814612 0.865005 0.739444 0.849183 0.446596 0.906171 0.440951 0.31725 0.467111 0.579561 0.716484
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.545455, recall: 0.800000, error: 0.454545
15. 
patient tongue id: 04112055520868_1_2_7
label yaofang:
桂枝 白芍 牡蛎 薏苡仁 黄芪 白术 熟地黄 浙贝母 山茱萸 砂仁 糯稻根 北沙参 炙甘草 麻黄根 黑枣 鲜龙葵果
0.554565 0.394301 0.354399 0.550977 0.581095 0.399519 0.341744 0.409964 0.302302
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.444444, recall: 0.250000, error: 0.555556
16. 
patient tongue id: 02182202209567_2_1
label yaofang:
甘草 白芍 茯苓 龙骨 远志 玉竹 党参 赤芍 紫河车 天麻 僵蚕 益智仁 北沙参 沙苑子
0.947183 0.492295 0.548966 0.412989 0.307658 0.342687 0.518362 0.435134 0.474752 0.353784 0.340745 0.347082
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
17. 
patient tongue id: 05022129253218_1_6
label yaofang:
甘草 法半夏 茯苓 龙骨 牡蛎 远志 党参 太子参 酸枣仁 丹参 黄连 生地黄 浮小麦 合欢花
0.974477 0.524081 0.594735 0.383223 0.37373 0.317718 0.326558 0.598071 0.504668 0.512295 0.436063 0.418245 0.431217
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
18. 
patient tongue id: 03232025522366_6_4
label yaofang:
甘草 法半夏 茯苓 桔梗 柏子仁 浙贝母 鳖甲 首乌藤 白花蛇舌 天山雪莲
0.87448 0.479324 0.503479 0.416423 0.405799 0.341545
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
19. 
patient tongue id: 06190943139925_2_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 石菖蒲 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.972043 0.514684 0.584335 0.384359 0.333418 0.323864 0.576612 0.475051 0.500421 0.388133 0.377567 0.401421
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
20. 
patient tongue id: 04291510105716_1_6
label yaofang:
甘草 薏苡仁 党参 黄芪 熟附子 泽泻 天麻 赤石脂 鳖甲 补骨脂 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.949617 0.497023 0.578687 0.386086 0.352493 0.304357 0.578743 0.445043 0.472975 0.367483 0.366372 0.390408
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
21. 
patient tongue id: 03291941162140_1_2
label yaofang:
甘草 桃仁 党参 太子参 枸杞子 浙贝母 乌药 莪术 北沙参 赭石 蜈蚣 荔枝核 鸭脚艾
0.456277 0.400591 0.383302 0.381207 0.37892 0.323883
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
22. 
patient tongue id: 05192002495832_6_7_2
label yaofang:
甘草 川芎 茯苓 薏苡仁 党参 赤芍 杜仲 牛膝 山药 天麻 僵蚕 桑寄生 川木瓜 宽筋藤
0.909989 0.476281 0.535261 0.401704 0.336121 0.430409 0.327367 0.384269
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
23. 
patient tongue id: 04282239073444_1_2_7
label yaofang:
甘草 柴胡 当归 黄芪 白术 赤芍 海螵蛸 砂仁 柿蒂 鸡内金 北沙参 土鳖虫 预知子 稻芽
0.67392 0.392814 0.394507 0.488229 0.465624 0.300932
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
24. 
patient tongue id: 04282213242322_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 桔梗 芦根 浙贝母 白茅根 细辛 诃子 板蓝根 紫苏子 木蝴蝶
0.957336 0.501002 0.578992 0.4031 0.315297 0.317945 0.522888 0.418468 0.4609 0.338656 0.333741 0.352045
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
25. 
patient tongue id: 02221317287831_1_4_7
label yaofang:
甘草 法半夏 桔梗 橘红 防风 金银花 太子参 藿香 白前 鸡内金 蜜百部 干鱼腥草
0.531574 0.329309 0.531407 0.458976 0.438966 0.511776 0.390782 0.419348 0.374611 0.423589 0.387585 0.457058 0.46095 0.434964 0.408135 0.397826
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.062500, recall: 0.083333, error: 0.937500
26. 
patient tongue id: 06072249163764_1_4
label yaofang:
甘草 桔梗 独活 芦根 薏苡仁 白术 浙贝母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991294 0.529141 0.654847 0.387736 0.435949 0.301191 0.717383 0.608832 0.653971 0.533099 0.541481 0.642303
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
27. 
patient tongue id: 03231441188626_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.37175 0.711405 0.436241 0.799544 0.418335 0.496802 0.386453 0.366989 0.337117 0.352155 0.700845 0.759671 0.594885 0.72546 0.408792 0.810053 0.374106 0.397426 0.454387 0.612877
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
28. 
patient tongue id: 04171837100610_6
label yaofang:
川芎 陈皮 法半夏 茯苓 木香 茯神 党参 白术 五味子 杜仲 郁金 砂仁 炙甘草 合欢皮 牛大力 五指毛桃
0.983676 0.542524 0.597243 0.388211 0.350862 0.311059 0.616332 0.545123 0.554909 0.466289 0.444116 0.467799
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
29. 
patient tongue id: 05232044202054_1_4_7
label yaofang:
甘草 茯苓 半夏 党参 黄芪 枸杞子 白术 杜仲 牛膝 厚朴 菟丝子 芡实 鸡内金 莲子 紫苏子 百合 紫苏叶 骨碎补 红豆杉 土茯苓 预知子 素馨花
0.5744 0.418498 0.366566 0.425881 0.424033 0.338901
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.833333, recall: 0.227273, error: 0.166667
30. 
patient tongue id: 02212026241597_4_6
label yaofang:
甘草 前胡 酸枣仁 生地黄 牡丹皮 杜仲 天麻 鳖甲 苦杏仁 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.979297 0.535459 0.584128 0.40083 0.325271 0.305395 0.586707 0.495995 0.520027 0.40937 0.391233 0.400069
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
31. 
patient tongue id: 04072028513350_4_5_1
label yaofang:
黄芪 白术 丹参 厚朴 砂仁 菟丝子 桑寄生 莪术 王不留行 橘核 首乌藤 合欢皮
0.513731 0.355794 0.310263 0.373012 0.617781 0.470978 0.393946 0.323649 0.396839
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
32. 
patient tongue id: 04130619356062_4
label yaofang:
甘草 川芎 当归 茯苓 桔梗 黄芪 郁金 山药 山茱萸 石菖蒲 天麻 桑螵蛸 地龙 辛夷 首乌藤
0.965708 0.35225 0.526772 0.541382 0.391213 0.330672 0.499515 0.474487 0.481076 0.403487 0.35146 0.334471
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
33. 
patient tongue id: 02251112247374_4
label yaofang:
白芍 川芎 茯苓 木香 防风 丹参 钩藤 天麻 白芷 石决明 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.398635 0.679322 0.426097 0.776058 0.436095 0.505706 0.406767 0.393782 0.390715 0.307374 0.391856 0.690599 0.759662 0.604186 0.724976 0.441018 0.818663 0.398604 0.332427 0.42746 0.489513 0.609214
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.227273, recall: 0.312500, error: 0.772727
34. 
patient tongue id: 05161912268370_4
label yaofang:
麻黄 陈皮 前胡 桔梗 半夏 防风 细辛 白芷 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.378485 0.911026 0.358224 0.96855 0.496356 0.666157 0.397724 0.396967 0.380143 0.401046 0.923741 0.961907 0.852663 0.941214 0.429241 0.981091 0.427571 0.476082 0.633775 0.821383
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
35. 
patient tongue id: 02281228362087_1_7
label yaofang:
黄芩 金银花 牛蒡子 蒲公英 麦冬 细辛 荷叶 蔓荆子 百部 白鲜皮 苍耳子 炒六神曲
0.515675 0.324278 0.447844 0.4575 0.391216 0.437701 0.326111 0.362144 0.349041 0.373412 0.349949 0.392282 0.327969 0.318527
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 决明子 制何首乌

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
36. 
patient tongue id: 01132305570528_1
label yaofang:
柴胡 黄芩 大枣 龙骨 牡蛎 党参 栀子 淡豆豉 姜半夏 炙甘草
0.380874 0.338188 0.322151 0.361098 0.32594 0.378747 0.481414
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.285714, recall: 0.200000, error: 0.714286
37. 
patient tongue id: 01051854006500_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.367577 0.80099 0.38227 0.876796 0.427241 0.566778 0.392342 0.370953 0.361227 0.391257 0.799752 0.862317 0.733286 0.839772 0.436793 0.905546 0.417262 0.448793 0.570715 0.712451
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
38. 
patient tongue id: 04291449031355_7_1
label yaofang:
甘草 柴胡 白芍 薏苡仁 桃仁 远志 天麻 白花蛇舌草 佛手 浮小麦 蜈蚣 合欢花 半枝莲 醋鳖甲
0.990566 0.540647 0.631493 0.389181 0.403835 0.691012 0.580873 0.61468 0.502557 0.480454 0.549053
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
39. 
patient tongue id: 03231854140386_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.398145 0.787843 0.404555 0.874885 0.448314 0.568693 0.412909 0.392013 0.383775 0.394653 0.796575 0.858617 0.710233 0.826646 0.44398 0.907141 0.415921 0.305586 0.457487 0.564482 0.703677
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
40. 
patient tongue id: 04131756056735_1_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.984515 0.531677 0.586156 0.372938 0.308779 0.596048 0.515151 0.509294 0.435436 0.395478 0.405098
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
41. 
patient tongue id: 03090802565431_6
label yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.962787 0.308449 0.512679 0.57408 0.424182 0.35163 0.323861 0.57849 0.475289 0.529265 0.39824 0.398877 0.444771
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
42. 
patient tongue id: 02272226177792_4_1
label yaofang:
白芍 当归 木香 党参 白术 肉桂 补骨脂 肉豆蔻 诃子 炙甘草
0.478474 0.343192 0.309795 0.402707 0.407816 0.366611
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.666667, recall: 0.400000, error: 0.333333
43. 
patient tongue id: 03141606320774_1_2_7
label yaofang:
桔梗 防风 金银花 薏苡仁 党参 乳香 胆南星 藿香 白芷 辛夷 干鱼腥草 苍耳子
0.917613 0.461165 0.561234 0.365015 0.325024 0.304239 0.525626 0.345717 0.399798
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.111111, recall: 0.083333, error: 0.888889
44. 
patient tongue id: 03280627487411_4
label yaofang:
陈皮 前胡 桔梗 荆芥 防风 牛蒡子 薏苡仁 浙贝母 桑白皮 紫菀 苦杏仁 紫苏叶
0.604887 0.402978 0.420107 0.477889 0.519489 0.305214 0.327813 0.301877 0.300832
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 浙贝母 厚朴 砂仁 北沙参

------Score: precision: 0.111111, recall: 0.083333, error: 0.888889
45. 
patient tongue id: 06190936485518_6_1
label yaofang:
甘草 党参 黄芪 酸枣仁 生地黄 山药 菟丝子 桑寄生 益母草 鳖甲 麦芽 续断 天山雪莲 半枝莲 红豆杉
0.985112 0.520941 0.628659 0.425177 0.392437 0.31874 0.67022 0.565603 0.63271 0.499334 0.491348 0.571213
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
46. 
patient tongue id: 03271537585114_2_5
label yaofang:
桂枝 柴胡 白芍 黄芩 当归 牡蛎 桃仁 党参 黄芪 枸杞子 白术 黄连 生地黄 胆南星 黄柏 干姜 水蛭 天花粉 糯稻根 姜半夏 炙甘草 浮小麦 半枝莲 淡附片 半边莲 蒸陈皮
0.933277 0.491659 0.528 0.458481 0.334511 0.456584 0.395308 0.467386 0.318025 0.300757 0.322263
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.115385, error: 0.727273
47. 
patient tongue id: 05092124506730_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒六神曲
0.456296 0.543186 0.451315 0.550664 0.361118 0.341459 0.467653 0.460686 0.326976 0.383773 0.312615 0.490762
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
48. 
patient tongue id: 02201802258727_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.422675 0.927481 0.365571 0.973985 0.53223 0.658546 0.444942 0.415682 0.405492 0.395373 0.936221 0.968151 0.869951 0.952971 0.470481 0.983924 0.438136 0.476314 0.669085 0.853505
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
49. 
patient tongue id: 03301352465122_4
label yaofang:
法半夏 前胡 防风 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.384931 0.749432 0.415371 0.839997 0.4432 0.520079 0.423671 0.392988 0.388803 0.370155 0.756796 0.829 0.687023 0.798957 0.468511 0.885588 0.386445 0.311001 0.418728 0.541969 0.698671
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
50. 
patient tongue id: 02142152203344_6_1_2
label yaofang:
甘草 党参 白术 山药 天麻 鳖甲 扁豆花 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 木棉花
0.940553 0.501044 0.556507 0.414266 0.360223 0.356675 0.325117 0.55252 0.4867 0.514057 0.430004 0.407367 0.417872
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
51. 
patient tongue id: 06132207194330_4_1_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.452236 0.318164 0.319704 0.389084 0.303732 0.43438 0.35787
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
52. 
patient tongue id: 03021201155190_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.433656 0.310927 0.359681 0.417547 0.405793 0.354394
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
53. 
patient tongue id: 03021953406490_4_1
label yaofang:
白芍 川芎 大枣 当归 党参 太子参 枸杞子 熟地黄 山萸肉 炙甘草 续断 制何首乌 炙黄芪 盐菟丝子 酒女贞子 盐巴戟天
0.652117 0.359753 0.416903 0.392512 0.346876 0.31335 0.344817
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 炙甘草

------Score: precision: 0.428571, recall: 0.187500, error: 0.571429
54. 
patient tongue id: 04222116002959_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.383089 0.629585 0.427966 0.7245 0.407826 0.490396 0.403818 0.354283 0.340687 0.306139 0.37413 0.633877 0.693072 0.578813 0.673765 0.45509 0.783183 0.391004 0.320094 0.398637 0.463171 0.571605
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.681818, recall: 1.000000, error: 0.318182
55. 
patient tongue id: 04200637018914_2_6
label yaofang:
甘草 白芍 茯苓 龙骨 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.988994 0.320116 0.543973 0.597373 0.390027 0.302175 0.322567 0.582844 0.53513 0.544992 0.462503 0.415011 0.41749
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
56. 
patient tongue id: 04062010158057_1_4_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.978543 0.532908 0.591875 0.410427 0.362879 0.322787 0.310312 0.607968 0.533977 0.550062 0.466274 0.437684 0.455671
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.166667, error: 0.846154
57. 
patient tongue id: 06111022092460_1_6
label yaofang:
甘草 白芍 党参 白术 山药 白茅根 茜草 天麻 赤石脂 鳖甲 补骨脂 蜈蚣 天山雪莲 半枝莲 广金钱草
0.991817 0.323721 0.558535 0.594333 0.36418 0.302424 0.313993 0.606118 0.551542 0.538684 0.474269 0.416851 0.404434
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.533333, error: 0.384615
58. 
patient tongue id: 05222124222250_7_2_1
label yaofang:
牡蛎 蒲公英 黄芪 白术 浙贝母 砂仁 莪术 王不留行 麦芽 橘络 墨旱莲
0.516453 0.36456 0.332184 0.560957 0.609543 0.338723 0.30698 0.387078 0.369078 0.392867 0.335856
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 浙贝母 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.363636, recall: 0.363636, error: 0.636364
59. 
patient tongue id: 03111203178808_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.548794 0.37224 0.429009 0.348743 0.338
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
60. 
patient tongue id: 05021440330750_1_4_7
label yaofang:
人参 当归 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.408166 0.517059 0.384795 0.587703 0.499013 0.380397 0.348905 0.398646 0.398119 0.352305 0.352839
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 泽泻 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.090909, recall: 0.083333, error: 0.909091
61. 
patient tongue id: 04191714594400_3_1
label yaofang:
牡蛎 黄芪 白术 熟地黄 杜仲 附子 山药 山茱萸 厚朴 当归尾 砂仁 三七 桑枝
0.567802 0.38878 0.385565 0.596992 0.489896 0.396948 0.307727 0.374117
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
62. 
patient tongue id: 05182102403420_4
label yaofang:
陈皮 桔梗 牛蒡子 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 天山雪莲
0.533151 0.310973 0.338866 0.414749 0.320813 0.415998
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
63. 
patient tongue id: 02231821438489_4
label yaofang:
麻黄 甘草 法半夏 前胡 桔梗 防风 荆芥穗 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子
0.364407 0.738865 0.384573 0.803134 0.388469 0.530953 0.382299 0.332464 0.342961 0.349821 0.701411 0.792011 0.664542 0.77093 0.426105 0.864885 0.380689 0.416312 0.51834 0.670468
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.583333, error: 0.650000
64. 
patient tongue id: 03240608491750_2_7_4
label yaofang:
甘草 白芍 川芎 茯苓 党参 枸杞子 白术 牛膝 山药 泽泻 天麻 磁石 桑寄生 麦芽 蒺藜 首乌藤
0.978846 0.523695 0.58481 0.387947 0.319102 0.323128 0.573706 0.508892 0.520174 0.432856 0.405781 0.415685
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
65. 
patient tongue id: 01042344242554_1_7
label yaofang:
甘草 独活 党参 白术 生地黄 杜仲 天麻 鳖甲 续断 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.961258 0.517055 0.573798 0.408929 0.323762 0.301167 0.554888 0.462509 0.503172 0.385355 0.375119 0.410713
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.615385, error: 0.333333
66. 
patient tongue id: 02272220562979_1
label yaofang:
陈皮 当归 党参 黄芪 白术 海螵蛸 白芷 升麻 北柴胡 炙甘草
0.439936 0.40796 0.315242 0.373411 0.344919 0.302868 0.524195
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.300000, error: 0.571429
67. 
patient tongue id: 03151901022924_1
label yaofang:
桂枝 白芍 当归 茯苓 龙骨 牡蛎 党参 黄芪 白术 海螵蛸 砂仁 炙甘草
0.364579 0.319677 0.417464 0.306441 0.308215 0.389181 0.351808 0.325316 0.307275 0.438011 0.555107
predicted yaofang:
甘草 柴胡 白芍 香附 茯苓 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.545455, recall: 0.500000, error: 0.454545
68. 
patient tongue id: 02212127132845_4
label yaofang:
防风 薄荷 钩藤 荆芥穗 白芷 北柴胡 炙甘草 首乌藤 紫苏梗 广藿香 威灵仙 炒蔓荆子
0.433064 0.823507 0.38547 0.912331 0.483803 0.571451 0.441939 0.39693 0.399161 0.371835 0.844458 0.888508 0.761581 0.877524 0.478577 0.940265 0.408004 0.311183 0.447784 0.589889 0.74328
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.238095, recall: 0.416667, error: 0.761905
69. 
patient tongue id: 01040647112282_6_2_1
label yaofang:
甘草 白芍 川芎 麦冬 党参 白术 玄参 柏子仁 生地黄 牛膝 厚朴 天麻 全蝎 火麻仁
0.994835 0.305779 0.560851 0.631657 0.40646 0.358075 0.305218 0.677501 0.59882 0.621073 0.520697 0.480108 0.517231
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
70. 
patient tongue id: 06041126505886_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.342188 0.34001 0.513366 0.434054 0.552586 0.355812 0.355597 0.344777 0.468246 0.520086 0.393492 0.494006 0.425354 0.618201 0.374552
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.600000, recall: 0.562500, error: 0.400000
71. 
patient tongue id: 02241442382479_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.380825 0.311653 0.379565 0.360347 0.310156
predicted yaofang:
甘草 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
72. 
patient tongue id: 03101921026061_6_2_7
label yaofang:
黄芪 白术 黄柏 郁金 泽泻 天麻 全蝎 桑寄生 芡实 金樱子 玉米须 合欢皮
0.541579 0.38511 0.426834 0.681762 0.688601 0.355801 0.514541 0.416665 0.346867 0.54068 0.3947
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
73. 
patient tongue id: 02141849046928_4
label yaofang:
陈皮 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.386797 0.722657 0.406645 0.798784 0.39901 0.491935 0.408784 0.361359 0.37521 0.360031 0.699358 0.798183 0.625774 0.75072 0.446419 0.884884 0.338726 0.413208 0.480053 0.654956
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
74. 
patient tongue id: 02191256242879_6_2
label yaofang:
甘草 柴胡 白芍 枳壳 木香 延胡索 郁金 天麻 鳖甲 鸡内金 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.93221 0.497802 0.529461 0.392828 0.331952 0.495828 0.372448 0.405998
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
75. 
patient tongue id: 04202014554214_7_5_1
label yaofang:
甘草 陈皮 茯苓 黄芪 枸杞子 白术 生地黄 海螵蛸 胆南星 车前子 厚朴 生半夏 砂仁 天麻 蜈蚣 鲜龙葵果
0.363002 0.380417 0.410767 0.348402
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.750000, recall: 0.187500, error: 0.250000
76. 
patient tongue id: 02261921450466_1_5
label yaofang:
甘草 黄芩 橘红 牛蒡子 桃仁 远志 细辛 桑白皮 鳖甲 款冬花 川贝母 紫菀 苦杏仁 白花蛇舌
0.989427 0.300905 0.551813 0.593491 0.392872 0.326771 0.319392 0.305208 0.602296 0.536179 0.553054 0.451719 0.411657 0.41075
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.214286, recall: 0.214286, error: 0.785714
77. 
patient tongue id: 06022237143554_1_4_6
label yaofang:
陈皮 半夏 牡蛎 远志 黄芪 枸杞子 白术 杜仲 郁金 菟丝子 北沙参 炙甘草 首乌藤 紫苏梗 骨碎补 红豆杉 合欢皮 预知子
0.627111 0.404045 0.348315 0.554885 0.595911 0.310461 0.39142 0.341922 0.436906
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.444444, recall: 0.222222, error: 0.555556
78. 
patient tongue id: 06111030183679_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 生地黄 浙贝母 山楂 莱菔子 麦芽 建曲
0.980222 0.538718 0.607758 0.377776 0.371922 0.311255 0.618938 0.532745 0.532831 0.468133 0.433475 0.437697
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
79. 
patient tongue id: 04271549503123_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.451728 0.346662 0.300621 0.35317 0.480971 0.309719 0.313967
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 北沙参

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
80. 
patient tongue id: 04142236233858_6_4_7
label yaofang:
甘草 枳壳 法半夏 茯苓 龙骨 党参 酸枣仁 丹参 黄连 山茱萸 薤白 天麻 全蝎 瓜蒌皮 麦芽
0.989511 0.547299 0.6089 0.382698 0.317248 0.308322 0.608773 0.534558 0.547694 0.461188 0.425222 0.442117
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
81. 
patient tongue id: 01070838157796_1_4_7
label yaofang:
当归 党参 黄芪 熟附子 乌药 山药 干姜 淫羊藿 吴茱萸 仙茅 益智 鹿角霜 煨诃子
0.508253 0.388223 0.368264 0.445145 0.441437 0.314135
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
82. 
patient tongue id: 05182214120526_1_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.385501 0.680311 0.414328 0.80216 0.416753 0.486602 0.40319 0.332937 0.327086 0.348251 0.714493 0.780574 0.635677 0.764211 0.487234 0.845967 0.38446 0.313124 0.377022 0.454441 0.625726
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
83. 
patient tongue id: 04142240130644_6
label yaofang:
甘草 柴胡 茯苓 桃仁 黄芪 白术 酸枣仁 生地黄 桑螵蛸 益智 浮小麦 广升麻
0.986199 0.306654 0.53941 0.596727 0.394148 0.344109 0.304694 0.300879 0.621565 0.551518 0.563779 0.474991 0.443763 0.446541
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.333333, error: 0.714286
84. 
patient tongue id: 02021017140721_1_4
label yaofang:
甘草 茯苓 黄芪 白术 胆南星 杜仲 白茅根 石菖蒲 大黄 厚朴 生半夏 火麻仁 鸡内金 稻芽
0.680257 0.428833 0.335687 0.372283 0.386478 0.319435
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
85. 
patient tongue id: 01192136512410_7_1_6
label yaofang:
甘草 法半夏 前胡 浙贝母 郁金 天麻 款冬花 紫菀 诃子 白花蛇舌草 丝瓜络 蜈蚣 半枝莲 醋鳖甲
0.839929 0.44651 0.46905 0.380686 0.545837 0.302821 0.412589
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 浙贝母 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
86. 
patient tongue id: 05191952205989_6_2_1
label yaofang:
甘草 川芎 茯苓 羌活 桃仁 党参 浙贝母 山药 天麻 全蝎 粉葛 首乌藤 紫苏梗 猫爪草
0.994825 0.368061 0.581978 0.616317 0.362444 0.322329 0.329356 0.619495 0.586764 0.57087 0.507886 0.448409 0.436369
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
87. 
patient tongue id: 04171840023037_7
label yaofang:
柴胡 川芎 茯苓 桔梗 薏苡仁 桃仁 党参 黄芪 白术 红花 乳香 熟地黄 黄柏 白茅根 干姜 地骨皮 天花粉 没药 败酱草 皂角刺 山萸肉 炙甘草 醋香附 大血藤
0.929974 0.300472 0.492165 0.547189 0.408748 0.316614 0.477315 0.381273 0.445284 0.301876 0.302113 0.323595
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.125000, error: 0.750000
88. 
patient tongue id: 05191926128325_6_1
label yaofang:
甘草 茯苓 龙骨 牡蛎 远志 党参 酸枣仁 生地黄 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.984166 0.538122 0.598708 0.399176 0.345783 0.301325 0.586987 0.508046 0.528003 0.433004 0.406906 0.413177
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
89. 
patient tongue id: 01200648408446_1_7_5
label yaofang:
甘草 柴胡 蒲公英 黄芪 生地黄 天麻 白芷 天花粉 鳖甲 百部 王不留行 麦芽 皂角刺 蜈蚣 白花蛇舌 天山雪莲 半枝莲 广升麻
0.631729 0.3729 0.314022 0.457403 0.338205 0.315718 0.389283
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 天麻

------Score: precision: 0.428571, recall: 0.166667, error: 0.571429
90. 
patient tongue id: 03091958120659_5
label yaofang:
甘草 黄芩 前胡 桔梗 芦根 牛蒡子 浙贝母 天麻 鳖甲 款冬花 苦杏仁 板蓝根 蜈蚣 天山雪莲 半枝莲
0.892124 0.459388 0.5259 0.443573 0.336241 0.440354 0.339542 0.429006
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.333333, error: 0.375000
91. 
patient tongue id: 04201415481479_1_2
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.451958 0.584539 0.430945 0.455306 0.557095 0.418509 0.449412 0.422609 0.480443 0.458061 0.542138 0.406857 0.536313 0.479424 0.519617
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
92. 
patient tongue id: 01100248200851_1_2
label yaofang:
白芍 牛膝 全蝎 苏木 炙甘草 紫苏梗 蜈蚣 醋延胡索
0.57658 0.357604 0.392712 0.397047
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
93. 
patient tongue id: 03240614548861_6_2
label yaofang:
茯苓 龙骨 党参 丹参 生地黄 山茱萸 天麻 鳖甲 火麻仁 炙甘草 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.990965 0.315244 0.558349 0.618121 0.378757 0.357749 0.310614 0.307229 0.641143 0.587824 0.582339 0.510863 0.471263 0.478159
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.571429, recall: 0.571429, error: 0.428571
94. 
patient tongue id: 04261934159961_4
label yaofang:
桂枝 茯苓 酸枣仁 神曲 泽泻 山楂 莱菔子 磁石 赤小豆 茯苓皮 猪苓 鸡内金 珍珠母 广藿香
0.816514 0.433589 0.498824 0.415346 0.349158
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
95. 
patient tongue id: 02252059002883_1_4
label yaofang:
甘草 枸杞子 丹参 栀子 牡丹皮 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 木贼 有瓜石斛
0.889852 0.453147 0.494014 0.45963 0.313545 0.358519 0.379845
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
96. 
patient tongue id: 03012052108424_5_6
label yaofang:
甘草 法半夏 大枣 茯苓 桔梗 薏苡仁 葶苈子 浙贝母 款冬花 苇茎 苦杏仁
0.9812 0.532038 0.567281 0.439424 0.316199 0.537888 0.493603 0.528924 0.413529 0.366369 0.369917
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.272727, error: 0.727273
97. 
patient tongue id: 03221335488711_2_4
label yaofang:
法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.403826 0.757836 0.424295 0.824587 0.455912 0.496744 0.435987 0.398625 0.382271 0.344214 0.72904 0.784443 0.673022 0.768606 0.446847 0.852932 0.372964 0.303871 0.405323 0.527704 0.676734
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
98. 
patient tongue id: 03301359441832_1_4
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 麦冬 款冬花 紫菀 白前 百部 北沙参 广藿香 蜜麻黄
0.32342 0.496399 0.406079 0.532418 0.321974 0.345544 0.329777 0.422183 0.498491 0.391089 0.486598 0.49191 0.671756 0.349643
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.714286, recall: 0.769231, error: 0.285714
99. 
patient tongue id: 02182259505353_1_2_6
label yaofang:
甘草 柴胡 白芍 香附 茯苓 党参 酸枣仁 丹参 郁金 山药 砂仁 菟丝子 益母草 麦芽 白扁豆
0.992261 0.54575 0.62558 0.399876 0.382663 0.328773 0.330574 0.675951 0.595335 0.629369 0.524171 0.501438 0.530842
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
100. 
patient tongue id: 04221848579766_2
label yaofang:
法半夏 葛根 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 威灵仙 人参叶
0.37157 0.736734 0.402252 0.837736 0.412687 0.481342 0.388068 0.324029 0.325368 0.309448 0.737259 0.797479 0.646402 0.796584 0.462368 0.872633 0.325496 0.370545 0.491917 0.650482
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
101. 
patient tongue id: 06011956469720_5_7
label yaofang:
甘草 薏苡仁 鸡血藤 枸杞子 赤芍 杜仲 郁金 苍术 天麻 菟丝子 金樱子 桑螵蛸 决明子 沙苑子 覆盆子
0.983669 0.525927 0.619651 0.3973 0.396123 0.317623 0.316836 0.646088 0.554096 0.574973 0.478668 0.466532 0.515219
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.133333, error: 0.846154
102. 
patient tongue id: 04172229427925_1
label yaofang:
柴胡 白芍 香附 陈皮 延胡索 川楝子 干姜 炙甘草 预知子
0.580485 0.323987 0.377715 0.451166 0.302339 0.381321
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.166667, recall: 0.111111, error: 0.833333
103. 
patient tongue id: 06031046424397_1_4
label yaofang:
甘草 柴胡 黄芩 金银花 连翘 蒲公英 浙贝母 牡丹皮 郁金 天花粉 瓜蒌皮 王不留行 皂角刺 路路通
0.963995 0.380138 0.530739 0.53012 0.366872 0.332747 0.485097 0.439027 0.434301 0.376866 0.323398
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
104. 
patient tongue id: 03152021467591_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.510886 0.30768 0.482292 0.407651 0.522924 0.462521 0.358566 0.318973 0.356863 0.309525 0.362364 0.318519
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻 莱菔子 天麻 决明子 夏枯草

------Score: precision: 0.250000, recall: 0.250000, error: 0.750000
105. 
patient tongue id: 05162041043829_7_1
label yaofang:
柴胡 白芍 香附 枳壳 桃仁 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗 土茯苓
0.38567 0.427227 0.393114 0.330193 0.317836 0.489966 0.549032
predicted yaofang:
甘草 白芍 党参 白术 柏子仁 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
106. 
patient tongue id: 02191623352769_6_4
label yaofang:
甘草 薏苡仁 远志 党参 赤芍 郁金 山药 天麻 鳖甲 莪术 虎杖 蜈蚣 天山雪莲 红豆杉
0.978534 0.530224 0.578819 0.393747 0.320788 0.32698 0.313536 0.574081 0.512107 0.517902 0.433059 0.39852 0.390792
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
107. 
patient tongue id: 02202228066799_1_6
label yaofang:
甘草 茯苓 远志 党参 白术 五味子 杜仲 山茱萸 车前子 菟丝子 巴戟天 金樱子 蛇床子 覆盆子
0.95824 0.491945 0.568246 0.385182 0.312108 0.507995 0.366932 0.41505
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
108. 
patient tongue id: 02020821107179_5
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 鱼腥草 浙贝母 桑白皮 款冬花 紫菀 苇茎 苦杏仁 紫苏子 蜜麻黄
0.962769 0.50854 0.596092 0.413539 0.384128 0.322887 0.60732 0.507145 0.536735 0.441755 0.432364 0.47836
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
109. 
patient tongue id: 02272214146195_6_4
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.40302 0.304261 0.33921 0.411333 0.38978 0.328814
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
110. 
patient tongue id: 05130652110081_2_6
label yaofang:
甘草 白芍 龙骨 党参 黄芪 白术 酸枣仁 山茱萸 地黄 天麻 糯稻根 蜈蚣 半枝莲 醋鳖甲
0.956843 0.51733 0.552372 0.417334 0.304562 0.321335 0.303457 0.495538 0.443202 0.474004 0.367784 0.339593 0.337489
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
111. 
patient tongue id: 02182227538034_2_1
label yaofang:
甘草 白芍 酸枣仁 丹参 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 木贼 谷精子
0.969907 0.482701 0.576948 0.401091 0.52117 0.395729 0.472062 0.300136 0.332552
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 半枝莲

------Score: precision: 0.666667, recall: 0.428571, error: 0.333333
112. 
patient tongue id: 02202244307088_5
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 鱼腥草 白术 桑白皮 款冬花 苦杏仁 紫苏梗
0.947788 0.502486 0.558911 0.40961 0.32523 0.328079 0.301286 0.536047 0.433188 0.465986 0.355476 0.345626 0.355069
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.272727, error: 0.769231
113. 
patient tongue id: 05221904306881_4
label yaofang:
陈皮 半夏 薏苡仁 厚朴 蝉蜕 白鲜皮 土茯苓 木棉花
0.577087 0.365211 0.300847 0.343997 0.633522 0.643487 0.303652 0.438741 0.353488 0.43403 0.315285
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.181818, recall: 0.250000, error: 0.818182
114. 
patient tongue id: 03081821577831_1_7_4
label yaofang:
甘草 枳壳 太子参 黄芪 白术 海螵蛸 郁金 厚朴 山楂 砂仁 鸡内金 北沙参 紫苏梗
0.478421 0.352044 0.308172 0.400713 0.510949 0.374639 0.302522
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
115. 
patient tongue id: 02272203463482_6
label yaofang:
甘草 川芎 陈皮 枳壳 茯苓 龙骨 牡蛎 远志 柏子仁 竹茹 肉桂 姜半夏 附片
0.390282 0.397325 0.302152 0.382449 0.333583 0.36726 0.529905
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
116. 
patient tongue id: 02182217015039_2_6
label yaofang:
甘草 白芍 麦冬 太子参 浙贝母 山药 白茅根 鳖甲 北沙参 辛夷 苍耳子 白花蛇舌 天山雪莲 蜂房 四季青
0.981507 0.314315 0.542549 0.60004 0.39419 0.375586 0.327662 0.338162 0.616338 0.547954 0.547349 0.475316 0.445409 0.454103
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.428571, recall: 0.400000, error: 0.571429
117. 
patient tongue id: 02171855235107_4
label yaofang:
甘草 防风 黄芪 细辛 荆芥穗 白芷 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术
0.38593 0.852094 0.404262 0.922402 0.503779 0.581532 0.414048 0.406385 0.38366 0.385032 0.855825 0.905098 0.768117 0.882582 0.443323 0.932817 0.414886 0.433591 0.579729 0.757512
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.454545, error: 0.750000
118. 
patient tongue id: 06170923445741_5_1_6
label yaofang:
甘草 桔梗 牛蒡子 海螵蛸 浙贝母 郁金 厚朴 砂仁 北沙参 木蝴蝶 猫爪草 稻芽
0.488555 0.353635 0.348329 0.594694 0.466407 0.346915 0.390571
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
119. 
patient tongue id: 06181855225779_1_2
label yaofang:
甘草 川芎 龙骨 党参 牛膝 山药 天麻 鳖甲 麦芽 女贞子 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.986195 0.302616 0.539107 0.599889 0.398389 0.332161 0.323651 0.591906 0.526068 0.543064 0.45747 0.42122 0.429554
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.500000, error: 0.384615
120. 
patient tongue id: 06031125422178_5_1_7
label yaofang:
甘草 柴胡 白芍 连翘 薏苡仁 党参 白术 黄连 延胡索 浙贝母 乌梅 郁金 山药 仙鹤草 麦芽 白花蛇舌
0.908059 0.345187 0.480416 0.509947 0.388593 0.356867 0.384874 0.352032
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 蜈蚣

------Score: precision: 0.625000, recall: 0.312500, error: 0.375000
121. 
patient tongue id: 02241826013553_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.391038 0.849611 0.398727 0.914009 0.4773 0.560793 0.444895 0.405824 0.395357 0.378692 0.840356 0.904221 0.760527 0.871838 0.467747 0.943964 0.398079 0.4316 0.593583 0.779399
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
122. 
patient tongue id: 02120817007164_1_7
label yaofang:
甘草 法半夏 茯苓 远志 党参 白术 杜仲 石菖蒲 天麻 菟丝子 补骨脂 桑螵蛸 益智 辛夷
0.984394 0.526361 0.59196 0.416535 0.318126 0.315951 0.588008 0.515736 0.550444 0.436865 0.402711 0.419453
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
123. 
patient tongue id: 03151812056427_1_3_7
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 薤白 厚朴
0.445715 0.660758 0.428643 0.488254 0.630361 0.501535 0.521903 0.530306 0.557888 0.526197 0.658713 0.459822 0.650493 0.595514 0.632065
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.333333, recall: 0.384615, error: 0.666667
124. 
patient tongue id: 04282232113156_5_6_1
label yaofang:
甘草 法半夏 茯苓 龙骨 党参 酸枣仁 地黄 天麻 白花蛇舌草 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.987929 0.327012 0.549093 0.600277 0.399875 0.342914 0.335524 0.310795 0.607132 0.552973 0.565236 0.484448 0.442341 0.446422
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.571429, recall: 0.571429, error: 0.428571
125. 
patient tongue id: 02202220357633_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 栀子 桑白皮 莱菔子 茵陈 款冬花 麦芽 苦杏仁 紫苏子
0.922138 0.471675 0.544649 0.436544 0.30248 0.319761 0.491702 0.35737 0.452408 0.302526
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
126. 
patient tongue id: 02260214108926_1_6
label yaofang:
甘草 茯苓 党参 栀子 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 木贼 有瓜石斛
0.861413 0.31215 0.489731 0.49669 0.413064 0.312728 0.435365 0.327576 0.371098
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.666667, recall: 0.428571, error: 0.333333
127. 
patient tongue id: 02142151149145_6
label yaofang:
甘草 柴胡 白芍 木香 酸枣仁 山药 砂仁 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.957312 0.507631 0.595032 0.440365 0.420863 0.332711 0.612154 0.515712 0.579723 0.462533 0.466735 0.552842
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.461538, error: 0.500000
128. 
patient tongue id: 01201946387318_2_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 酸枣仁 生地黄 砂仁 菟丝子 麦芽 女贞子 紫苏梗
0.818162 0.32705 0.399596 0.463304 0.386657
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.357143, error: 0.000000
129. 
patient tongue id: 05090816486962_1_4_7
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 阿胶 五味子 熟地黄 火麻仁 炙甘草 牡荆子 黑枣
0.538063 0.300854 0.590643 0.451536 0.548228 0.576348 0.41429 0.458849 0.415732 0.454405 0.401888 0.565994 0.421466 0.546447 0.497684 0.488029
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.062500, recall: 0.083333, error: 0.937500
130. 
patient tongue id: 02142001548586_4
label yaofang:
甘草 黄连 肉桂 干姜 附片
0.614967 0.381709 0.398117 0.44056 0.37458 0.304802 0.313592
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 炙甘草

------Score: precision: 0.142857, recall: 0.200000, error: 0.857143
131. 
patient tongue id: 02272233112543_3
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 砂仁 菟丝子 巴戟天 桑寄生 鹿角霜 续断 制何首乌 艾叶
0.583376 0.353494 0.371294 0.389177 0.337805 0.349117
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
132. 
patient tongue id: 03312043271548_1_6_4
label yaofang:
甘草 茯苓 羌活 独活 薏苡仁 白术 延胡索 郁金 山药 厚朴 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲
0.848749 0.383643 0.49734 0.44514 0.35656 0.360889
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
133. 
patient tongue id: 04182208380615_1_3_7
label yaofang:
甘草 当归 茯苓 党参 黄芪 白术 浙贝母 杜仲 厚朴 砂仁 款冬花 鸡内金 地龙 紫苏子 蜈蚣 鲜龙葵果
0.556416 0.39741 0.364736 0.563891 0.517914 0.375883 0.413667
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.857143, recall: 0.375000, error: 0.142857
134. 
patient tongue id: 03151835363889_6_1
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.427408 0.313895 0.319044 0.384475 0.301194 0.385833 0.382568
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
135. 
patient tongue id: 02182148324994_2_6
label yaofang:
甘草 党参 生地黄 郁金 山药 山茱萸 泽泻 车前子 海金沙 鸡内金 王不留行 川木瓜 广金钱草 土茯苓 石苇
0.990456 0.306213 0.557207 0.608447 0.376713 0.33541 0.308857 0.310734 0.62418 0.551829 0.553144 0.465917 0.428713 0.427936
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.214286, recall: 0.200000, error: 0.785714
136. 
patient tongue id: 02020947100958_6_1
label yaofang:
甘草 柴胡 法半夏 茯苓 木香 蒲公英 白及 党参 白术 黄连 延胡索 五灵脂 旋覆花 鱼古 煅瓦楞子
0.802188 0.330318 0.484419 0.485817 0.421255 0.322639 0.399851 0.355664
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 浙贝母 天麻 蜈蚣

------Score: precision: 0.625000, recall: 0.333333, error: 0.375000
137. 
patient tongue id: 03111516539803_7_6
label yaofang:
甘草 柴胡 白芍 川芎 羌活 桃仁 红花 赤芍 栀子 牡丹皮 牛膝 细辛 天麻 全蝎 白芷
0.936633 0.494173 0.528724 0.46934 0.388663 0.409984
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
138. 
patient tongue id: 06010208339212_6_4_7
label yaofang:
甘草 法半夏 茯苓 党参 白术 砂仁 天麻 鳖甲 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.990002 0.542101 0.631892 0.391979 0.403761 0.314575 0.686435 0.58824 0.611793 0.511722 0.495875 0.541406
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
139. 
patient tongue id: 04232016402822_4
label yaofang:
麻黄 桂枝 荆芥 防风 独活 延胡索 乳香 没药 炙甘草 豨莶草 海风藤 海桐皮 鹿衔草 走马胎
0.471957 0.370786 0.346243 0.536457 0.46483 0.331877 0.345008
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
140. 
patient tongue id: 01061842504754_2_4
label yaofang:
甘草 茯苓 葛根 麦冬 玄参 牡丹皮 北沙参 百合 人参叶 干石斛
0.388239 0.824085 0.396762 0.895278 0.476714 0.571403 0.435274 0.386763 0.385304 0.388388 0.822644 0.883074 0.760388 0.858109 0.456665 0.919398 0.427649 0.447713 0.590675 0.762232
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.200000, error: 0.900000
141. 
patient tongue id: 05312141258570_1_2_7
label yaofang:
甘草 桃仁 党参 酸枣仁 生地黄 天麻 鳖甲 女贞子 紫苏叶 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众 龟甲
0.995152 0.537318 0.676142 0.401474 0.457188 0.766222 0.651305 0.707027 0.580617 0.577422 0.684562
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
142. 
patient tongue id: 02271231581169_1_7
label yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 薏苡仁 白术 大腹皮 厚朴 藿香 白芷 六神曲
0.749569 0.421897 0.393828
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.666667, recall: 0.166667, error: 0.333333
143. 
patient tongue id: 01111919051363_1
label yaofang:
白芍 川芎 大枣 当归 党参 太子参 黄芪 枸杞子 熟地黄 郁金 干姜 北柴胡 炙甘草 续断 盐菟丝子 酒女贞子
0.397344 0.820056 0.400633 0.897006 0.454421 0.534417 0.407776 0.367702 0.363739 0.370552 0.809965 0.878237 0.705285 0.853804 0.442781 0.920639 0.390108 0.423057 0.557634 0.705364
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.187500, error: 0.850000
144. 
patient tongue id: 05232039238010_1
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 车前子 砂仁 升麻 炙甘草
0.39658 0.317813 0.430508 0.312634 0.379731 0.384531 0.3181 0.322049 0.468279 0.526993
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 浙贝母 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.400000, error: 0.600000
145. 
patient tongue id: 04291454424177_6_5
label yaofang:
甘草 柴胡 白芍 木香 蒲公英 党参 黄连 槟榔 山药 砂仁 柿蒂 麦芽 麸炒枳壳
0.986265 0.516334 0.644522 0.41971 0.441212 0.310509 0.722644 0.604541 0.654246 0.52527 0.54037 0.632506
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
146. 
patient tongue id: 02212216574632_1_6
label yaofang:
甘草 白芍 枳壳 木香 白术 砂仁 莱菔子 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.931006 0.489745 0.518107 0.421117 0.417319 0.311101 0.38004
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
147. 
patient tongue id: 05262213296794_1_2_6
label yaofang:
甘草 枳壳 茯苓 桔梗 太子参 浙贝母 郁金 山药 鳖甲 鸡内金 夏枯草 麦芽 皂角刺 白花蛇舌 天山雪莲 猫爪草
0.94672 0.317891 0.492475 0.54794 0.401341 0.340144 0.497165 0.405495 0.446994 0.328526 0.314261 0.315998
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
148. 
patient tongue id: 06141845556710_6_7
label yaofang:
川芎 茯苓 半夏 薏苡仁 白术 海螵蛸 牡丹皮 杜仲 桑寄生 莪术 续断 蜈蚣
0.436321 0.348306 0.400367 0.325866
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
149. 
patient tongue id: 03242124052755_4_6
label yaofang:
桂枝 牛蒡子 玉竹 海螵蛸 牛膝 大黄 砂仁 萆薢 土茯苓
0.402546 0.392728 0.390445 0.337732 0.367382 0.481205
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
150. 
patient tongue id: 03171206353723_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.433967 0.56321 0.4267 0.479837 0.546649 0.405416 0.445337 0.436639 0.458801 0.438831 0.519442 0.382796 0.49796 0.466196 0.498501
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
151. 
patient tongue id: 05161938550890_2
label yaofang:
甘草 茯苓 葛根 麦冬 玉竹 玄参 生地黄 赤芍 牡丹皮 木瓜 北沙参 百合 干石斛
0.419503 0.938093 0.357731 0.977014 0.567187 0.623481 0.466067 0.428526 0.428163 0.359846 0.942996 0.965649 0.880195 0.957059 0.493685 0.985462 0.386069 0.45438 0.676067 0.860156
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.100000, recall: 0.153846, error: 0.900000
152. 
patient tongue id: 02010218494145_6_2
label yaofang:
甘草 酸枣仁 赤芍 山药 山茱萸 地黄 天麻 菟丝子 桑寄生 益母草 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.986889 0.538273 0.597967 0.399339 0.344895 0.323361 0.32019 0.617067 0.547742 0.559405 0.473341 0.437671 0.439275
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
153. 
patient tongue id: 02110749410392_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.546273 0.37431 0.40114 0.447285 0.359651
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
154. 
patient tongue id: 04291512242065_4_1
label yaofang:
甘草 党参 黄芪 白术 红花 天麻 鳖甲 威灵仙 地肤子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土茯苓
0.985823 0.302285 0.544288 0.60594 0.396845 0.364055 0.31643 0.31106 0.631367 0.574684 0.587746 0.504581 0.472903 0.495715
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.642857, recall: 0.642857, error: 0.357143
155. 
patient tongue id: 05242250369845_1_6
label yaofang:
甘草 薏苡仁 党参 延胡索 赤芍 郁金 山药 天麻 鳖甲 莪术 虎杖 蜈蚣 白花蛇舌 红豆杉
0.994533 0.379783 0.579005 0.604376 0.37378 0.321065 0.612584 0.579059 0.569718 0.50522 0.43737 0.420859
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
156. 
patient tongue id: 02122215112909_1_4
label yaofang:
甘草 独活 薏苡仁 远志 杜仲 牛膝 天麻 桑寄生 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲 牛大力
0.972828 0.514189 0.59285 0.383283 0.347711 0.302062 0.595832 0.474139 0.495027 0.39344 0.363129 0.367496
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
157. 
patient tongue id: 03021258034638_4
label yaofang:
法半夏 前胡 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.401285 0.785586 0.382699 0.875334 0.433343 0.581917 0.427916 0.382849 0.394683 0.393123 0.792808 0.866048 0.731236 0.837433 0.456253 0.925548 0.423011 0.47564 0.589357 0.727346
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.769231, error: 0.500000
158. 
patient tongue id: 01211216530312_2
label yaofang:
茯苓 龙骨 牡蛎 麦冬 党参 酸枣仁 柏子仁 附子 干姜 炙甘草
0.601623 0.37857 0.43377 0.326521 0.381959
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
159. 
patient tongue id: 06031132104638_1_7
label yaofang:
桂枝 甘草 白芍 川芎 桃仁 黄芪 鸡血藤 生地黄 红花 赤芍 牛膝 天麻 威灵仙 木蝴蝶
0.994078 0.30301 0.559729 0.614059 0.386316 0.318277 0.640019 0.570632 0.576344 0.487294 0.438768 0.436796
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
160. 
patient tongue id: 03012006403838_4
label yaofang:
陈皮 法半夏 茯苓 党参 黄芪 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 炒六神曲 甘松
0.364711 0.842434 0.386008 0.904856 0.441174 0.569435 0.402866 0.356303 0.340744 0.361528 0.822822 0.882709 0.745311 0.858979 0.43302 0.924644 0.395807 0.433561 0.584357 0.746399
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.416667, error: 0.750000
161. 
patient tongue id: 04112318500054_4
label yaofang:
麻黄 桂枝 白芍 法半夏 前胡 五味子 浙贝母 细辛 干姜 厚朴 款冬花 苦杏仁 炙甘草
0.534834 0.356985 0.387526 0.38716 0.479868
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
162. 
patient tongue id: 01312301217045_6_2
label yaofang:
甘草 法半夏 桔梗 党参 酸枣仁 丹参 浙贝母 牡丹皮 薤白 水蛭 瓜蒌皮 浮小麦 合欢花 麸炒枳壳
0.985563 0.341271 0.552991 0.584163 0.376152 0.31136 0.319717 0.595244 0.549693 0.547425 0.477294 0.424719 0.414058
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
163. 
patient tongue id: 02272218279158_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 补骨脂 麦芽 百合 紫苏叶
0.38573 0.30737 0.430168 0.312021 0.383464 0.34278 0.304608 0.5084 0.547175
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 柏子仁 姜半夏 炙甘草

------Score: precision: 0.111111, recall: 0.090909, error: 0.888889
164. 
patient tongue id: 06132154043375_1_4
label yaofang:
柴胡 大枣 茯苓 防风 连翘 太子参 昆布 海藻 乌梅 桑叶 石斛 白花蛇舌草 浮小麦 猫爪草 山慈菇
0.312619 0.326191 0.445838 0.346716 0.349109 0.360658 0.324786 0.35291 0.307362 0.577769 0.628838
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 浙贝母 姜半夏 炙甘草

------Score: precision: 0.090909, recall: 0.066667, error: 0.909091
165. 
patient tongue id: 02201755030112_1_4
label yaofang:
陈皮 法半夏 茯苓 党参 海螵蛸 干姜 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 炙黄芪 炒六神曲 甘松
0.389871 0.844614 0.394259 0.905608 0.461068 0.563859 0.424988 0.365219 0.365322 0.359475 0.828775 0.889251 0.754169 0.870779 0.457214 0.927968 0.409303 0.436872 0.602737 0.760534
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.428571, error: 0.700000
166. 
patient tongue id: 06062305528235_5_7
label yaofang:
甘草 金银花 丹参 玄参 红花 延胡索 牡丹皮 细辛 天麻 鳖甲 忍冬藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.994096 0.307656 0.561667 0.628245 0.376643 0.346055 0.300356 0.301496 0.656163 0.575116 0.583255 0.500914 0.460374 0.464792
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.466667, error: 0.500000
167. 
patient tongue id: 05201925429684_5_1
label yaofang:
桂枝 甘草 大枣 竹茹 生牡蛎 石膏 浙贝
0.626988 0.3953 0.311294 0.360491 0.589356 0.659567 0.305321 0.341235 0.444946 0.383417 0.443276 0.318715
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 浙贝母 杜仲 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.083333, recall: 0.142857, error: 0.916667
168. 
patient tongue id: 02182257533049_1_2_7
label yaofang:
甘草 桃仁 党参 鸡血藤 白术 酸枣仁 生地黄 天麻 菟丝子 糯稻根 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.982746 0.532074 0.595517 0.386723 0.321349 0.323562 0.585084 0.514717 0.533405 0.436886 0.407476 0.416295
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.588235, error: 0.166667
169. 
patient tongue id: 06031047394681_1_2_7
label yaofang:
甘草 白芍 木香 薏苡仁 党参 牡丹皮 郁金 山药 鳖甲 莪术 虎杖 蜈蚣 白花蛇舌 天山雪莲 龙葵果
0.987627 0.538672 0.600105 0.378096 0.312036 0.314172 0.594905 0.528859 0.537663 0.449883 0.411906 0.421339
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
170. 
patient tongue id: 05152106551307_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草 山慈菇
0.419251 0.307613 0.411105 0.327116 0.375005 0.408383 0.317678 0.341737 0.39616 0.538517
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 海螵蛸 浙贝母 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.384615, error: 0.500000
171. 
patient tongue id: 05261952114880_1_4_7
label yaofang:
陈皮 当归 茯苓 半夏 黄芪 枸杞子 白术 山药 菟丝子 鸡内金 紫苏子 炙甘草 首乌藤 紫苏叶 黑枣
0.539687 0.391929 0.365171 0.608081 0.607916 0.412296 0.346441 0.523034
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
172. 
patient tongue id: 03231036155787_6_7
label yaofang:
甘草 白芍 川芎 香附 白术 丹参 牛膝 郁金 薤白 厚朴 砂仁 天麻 全蝎 瓜蒌皮 降香
0.987978 0.315503 0.552483 0.602384 0.40577 0.352803 0.33434 0.310291 0.619514 0.565195 0.579587 0.492555 0.455809 0.471309
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.214286, recall: 0.200000, error: 0.785714
173. 
patient tongue id: 02151818584876_1_4_7
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 酸枣仁 五味子 熟地黄 火麻仁 苦参 炙甘草 黑枣
0.514415 0.30024 0.47419 0.418466 0.510127 0.461876 0.368739 0.32819 0.35086 0.328613 0.341839 0.309287
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻 莱菔子 天麻 决明子 夏枯草

------Score: precision: 0.083333, recall: 0.083333, error: 0.916667
174. 
patient tongue id: 02271253152246_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.503632 0.300802 0.430684 0.452856 0.348336 0.425926 0.311216 0.340104 0.327022 0.349418 0.322455 0.400517 0.30714
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 决明子

------Score: precision: 0.692308, recall: 0.750000, error: 0.307692
175. 
patient tongue id: 01190643310777_2_6
label yaofang:
甘草 柴胡 白芍 川芎 茯苓 酸枣仁 生地黄 牛膝 山药 山茱萸 细辛 天麻 全蝎 菟丝子 桑寄生 益母草
0.91681 0.321694 0.453961 0.509185 0.419882 0.330349 0.368572 0.336955
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
176. 
patient tongue id: 01140817402376_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 桔梗 浙贝母 细辛 莱菔子 瓜蒌皮 款冬花 紫菀 枇杷叶 苦杏仁
0.969321 0.513269 0.575835 0.394571 0.32383 0.329568 0.547235 0.459672 0.482939 0.383593 0.361124 0.363165
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
177. 
patient tongue id: 04201918516149_2_1
label yaofang:
白芍 川芎 当归 茯苓 太子参 黄芪 枸杞子 柏子仁 熟地黄 煅牡蛎 炙甘草 续断 盐菟丝子 酒女贞子 煅龙骨 炒酸枣仁
0.366889 0.80321 0.414134 0.896742 0.483741 0.557229 0.388857 0.405335 0.382562 0.383719 0.821439 0.868061 0.712067 0.841464 0.410562 0.908384 0.397818 0.317094 0.430615 0.535386 0.700854
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.142857, recall: 0.187500, error: 0.857143
178. 
patient tongue id: 05241954463133_2_6
label yaofang:
甘草 党参 酸枣仁 生地黄 黄柏 山药 山茱萸 桑叶 荆芥穗 地骨皮 菟丝子 糯稻根 银柴胡 淫羊藿 女贞子 龟甲
0.988403 0.330101 0.556142 0.605141 0.378979 0.347232 0.325783 0.306185 0.618968 0.572991 0.567789 0.497982 0.458451 0.462762
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.250000, error: 0.714286
179. 
patient tongue id: 03022129573516_2_6
label yaofang:
甘草 白芍 牡蛎 玄参 天冬 柏子仁 川楝子 牛膝 茵陈 麦芽 赭石 浮小麦 龟甲
0.30691 0.336414 0.465194 0.383173 0.307871 0.362452 0.355743 0.352253 0.362772 0.308075 0.610666 0.641031 0.320905
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 柏子仁 海螵蛸 浙贝母 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
180. 
patient tongue id: 01032112407541_6_7
label yaofang:
甘草 独活 白术 酸枣仁 天麻 益母草 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 骨碎补 乌梢蛇
0.984117 0.532299 0.59553 0.399562 0.330568 0.304652 0.626063 0.526797 0.547682 0.445103 0.410847 0.438917
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
181. 
patient tongue id: 01130654133756_2_1_6
label yaofang:
甘草 桔梗 龙骨 桃仁 党参 酸枣仁 浙贝母 山茱萸 天麻 糯稻根 鳖甲 白花蛇舌 天山雪莲 半枝莲
0.995023 0.557146 0.636659 0.387697 0.373888 0.309264 0.303878 0.685664 0.590737 0.629179 0.512768 0.48877 0.521506
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
182. 
patient tongue id: 03081816411947_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 柏子仁 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.651368 0.313277 0.407866 0.436474 0.392291
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
183. 
patient tongue id: 04121836206568_1
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.422882 0.850437 0.386975 0.935315 0.507493 0.603851 0.435425 0.418687 0.415679 0.403216 0.878871 0.91862 0.807276 0.90269 0.456087 0.949702 0.437342 0.321249 0.465255 0.601659 0.765706
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
184. 
patient tongue id: 05061437512906_6_5
label yaofang:
甘草 陈皮 茯苓 半夏 瓜蒌皮 川贝母 枇杷叶 夏枯草 北沙参 龙脷叶
0.308095 0.344174 0.391751 0.383253 0.39036 0.404737
predicted yaofang:
甘草 法半夏 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.500000, recall: 0.300000, error: 0.500000
185. 
patient tongue id: 03092002052317_4
label yaofang:
甘草 茯苓 葛根 麦冬 太子参 北沙参 百合 木贼 干石斛
0.406936 0.88462 0.389367 0.944483 0.51231 0.588306 0.44848 0.428589 0.406436 0.374717 0.887775 0.929427 0.817191 0.910524 0.46825 0.958915 0.410371 0.435221 0.63487 0.809481
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.333333, error: 0.850000
186. 
patient tongue id: 05112017269712_1_4_6
label yaofang:
党参 黄芪 枸杞子 熟地黄 杜仲 山药 山茱萸 当归尾 砂仁 炙甘草 茺蔚子 路路通
0.579392 0.404128 0.411006 0.462967 0.457991
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
187. 
patient tongue id: 06080123471129_4_1
label yaofang:
甘草 川芎 法半夏 茯苓 党参 白术 厚朴 天麻 鳖甲 蒺藜 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.993688 0.540693 0.663939 0.407087 0.431186 0.305432 0.735947 0.623661 0.687219 0.541528 0.551073 0.658531
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.625000, error: 0.166667
188. 
patient tongue id: 03151848008043_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.330002 0.342665 0.468361 0.369882 0.368414 0.345886 0.381462 0.336499 0.31924 0.586007 0.629125 0.300939
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
189. 
patient tongue id: 02231827583142_4_2
label yaofang:
麻黄 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 香薷 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子
0.346472 0.339478 0.410705 0.366132 0.31122 0.333543 0.429913 0.302644 0.376328 0.301628 0.394362 0.52665 0.556981
predicted yaofang:
陈皮 法半夏 茯苓 前胡 半夏 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
190. 
patient tongue id: 02151916068464_2_1
label yaofang:
法半夏 前胡 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.343787 0.592844 0.427878 0.633921 0.371114 0.400777 0.363797 0.30968 0.319027 0.54361 0.603708 0.483718 0.582573 0.43718 0.692638 0.326653 0.318703 0.340439 0.473866
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
191. 
patient tongue id: 01201940535619_1_2_6
label yaofang:
甘草 党参 山药 山茱萸 地黄 天麻 菟丝子 益智仁 益母草 金樱子 白花蛇舌草 蜈蚣 棉萆薢 醋鳖甲
0.988399 0.549185 0.615112 0.420435 0.364546 0.304411 0.318114 0.616442 0.547838 0.572842 0.46972 0.440554 0.468518
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
192. 
patient tongue id: 03151940332754_5_7
label yaofang:
桃仁 太子参 黄芪 白术 浙贝母 杜仲 白茅根 生半夏 砂仁 土鳖虫 合欢皮 山慈菇 蛇舌草 鲜龙葵果
0.495012 0.359016 0.37845 0.545779 0.479359 0.339592 0.320396
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
193. 
patient tongue id: 02272224553829_1
label yaofang:
陈皮 当归 党参 黄芪 鸡血藤 白术 升麻 北柴胡 炙甘草 山慈菇
0.391062 0.309456 0.441103 0.315679 0.39123 0.343747 0.311325 0.495712 0.561431
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 柏子仁 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.300000, error: 0.666667
194. 
patient tongue id: 02181635236970_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 黄连 乌梅 山药 干姜 麦芽 建曲 合欢花
0.982659 0.522921 0.589917 0.410302 0.30809 0.315847 0.558986 0.480143 0.517606 0.398716 0.373007 0.391402
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
195. 
patient tongue id: 03020759122561_1_7
label yaofang:
甘草 白芍 茯苓 党参 生地黄 山药 山茱萸 厚朴 肉苁蓉 火麻仁 制川乌 天山雪莲 牛大力
0.931886 0.488349 0.552459 0.425481 0.305507 0.304045 0.498648 0.387053 0.450975 0.310724 0.309821 0.343974
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
196. 
patient tongue id: 05261929472402_5
label yaofang:
甘草 白芍 陈皮 桃仁 麦冬 党参 黄芪 丹参 红花 延胡索 牛膝 苏木 珍珠母 北沙参 浮小麦 威灵仙 宽筋藤
0.897771 0.477584 0.529544 0.422235 0.478206 0.321355 0.398514
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.117647, error: 0.714286
197. 
patient tongue id: 03311652130497_6
label yaofang:
甘草 法半夏 龙齿 酸枣仁 柏子仁 栀子 淡豆豉 天麻 糯稻根 百合 紫苏叶 蜈蚣
0.413173 0.426458 0.384538 0.354266 0.431393 0.544773
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
198. 
patient tongue id: 04222212283838_1_4
label yaofang:
陈皮 茯苓 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.401022 0.842759 0.395595 0.927347 0.483331 0.585889 0.413682 0.400214 0.389137 0.394021 0.861388 0.911095 0.776833 0.886493 0.451648 0.945739 0.426347 0.450945 0.579499 0.74765
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
199. 
patient tongue id: 01062333312019_1_4_7
label yaofang:
丹参 牛膝 钩藤 泽泻 莱菔子 决明子 夏枯草 制何首乌 盐车前子 燀桃仁天麻颗粒
0.913837 0.389688 0.497164 0.42209 0.338878 0.316727 0.305275
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 浙贝母 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
200. 
patient tongue id: 06130946493457_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 红曲
0.526044 0.348683 0.328609 0.410497 0.494636 0.362544 0.319304
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
201. 
patient tongue id: 03011832383913_1_4
label yaofang:
甘草 茯苓 葛根 桔梗 防风 麦冬 玄参 赤芍 白芷 北沙参 辛夷 广藿香 人参叶 炒六神曲 醋香附
0.345655 0.618816 0.418934 0.639707 0.376337 0.402913 0.37608 0.32989 0.342163 0.306505 0.540382 0.630003 0.511582 0.591522 0.442556 0.733169 0.307986 0.326303 0.344504 0.505389
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.466667, error: 0.650000
202. 
patient tongue id: 02161849330929_1_6
label yaofang:
茯苓 前胡 麦冬 太子参 黄芪 郁金 北柴胡 款冬花 紫菀 百部 豆蔻 北沙参 炙甘草 人参叶
0.388562 0.776179 0.416862 0.844277 0.45261 0.518179 0.406002 0.383035 0.36905 0.357138 0.757548 0.814651 0.674989 0.797287 0.436109 0.858753 0.385618 0.414036 0.531113 0.68368
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.571429, error: 0.600000
203. 
patient tongue id: 01042346471467_1_7
label yaofang:
桂枝 甘草 川芎 法半夏 党参 黄芪 丹参 红花 薤白 水蛭 莪术 地龙 麸炒枳壳
0.966787 0.510656 0.577242 0.41825 0.337557 0.320085 0.307368 0.562579 0.482992 0.512268 0.410332 0.393087 0.411132
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.153846, error: 0.846154
204. 
patient tongue id: 04251815414383_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.382168 0.712932 0.421765 0.772871 0.429069 0.457571 0.398711 0.37504 0.36326 0.326512 0.677073 0.719606 0.596472 0.706583 0.414227 0.800234 0.349974 0.380843 0.44896 0.579856
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
205. 
patient tongue id: 05221938550126_6
label yaofang:
甘草 柴胡 川芎 香附 防风 牛蒡子 赤芍 海螵蛸 荆芥穗 白芷 郁李仁 芥子
0.321269 0.333894 0.463563 0.363101 0.361407 0.338353 0.317992 0.330987 0.307782 0.573824 0.628598
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.363636, recall: 0.333333, error: 0.636364
206. 
patient tongue id: 01250628409091_1_6
label yaofang:
甘草 柴胡 白芍 法半夏 龙骨 远志 党参 酸枣仁 天麻 白花蛇舌草 麦芽 首乌藤 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.978286 0.513105 0.598379 0.380907 0.362429 0.332996 0.311586 0.618417 0.511348 0.524083 0.429024 0.414324 0.423248
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.375000, error: 0.538462
207. 
patient tongue id: 04210755347441_1_3
label yaofang:
白芍 金银花 薏苡仁 桃仁 蒲公英 生地黄 苍术 百部 苦参 白鲜皮 关黄柏 地肤子
0.531577 0.35081 0.313002 0.395898 0.452655 0.311956 0.30349
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
208. 
patient tongue id: 01312134327639_5_1
label yaofang:
麻黄 甘草 黄芩 法半夏 茯苓 前胡 薏苡仁 鱼腥草 天麻 鳖甲 款冬花 莪术 苦杏仁 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.985386 0.553812 0.598083 0.41344 0.343971 0.310395 0.314994 0.598657 0.54865 0.569237 0.475642 0.436202 0.440319
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.352941, error: 0.538462
209. 
patient tongue id: 04122112302799_2_8_5
label yaofang:
甘草 黄芩 麦冬 玄参 生地黄 没药 鳖甲 火麻仁 淡竹叶 百合 蜈蚣 白花蛇舌 四季青 川木通
0.981406 0.511411 0.610671 0.410123 0.365959 0.626342 0.522043 0.566425 0.436231 0.42981 0.484345
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
210. 
patient tongue id: 04141810307623_1_4_3
label yaofang:
甘草 茯苓 半夏 党参 白术 海螵蛸 杜仲 黄柏 郁金 山药 干姜 厚朴 砂仁 鸡内金 紫苏叶 黑枣
0.462302 0.359546 0.357839 0.416675 0.474199 0.308132
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 浙贝母

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
211. 
patient tongue id: 03192303369214_4_6_1
label yaofang:
甘草 白芍 川芎 法半夏 茯苓 独活 党参 白术 赤芍 山药 砂仁 天麻 忍冬藤 粉葛 威灵仙 白花蛇舌
0.986441 0.302942 0.549375 0.590848 0.378876 0.31045 0.315933 0.586885 0.519159 0.524336 0.44738 0.404562 0.40917
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.437500, error: 0.461538
212. 
patient tongue id: 02171942336723_2_5
label yaofang:
甘草 柴胡 茯苓 桔梗 半夏 玄参 赤芍 海螵蛸 浙贝母 北沙参 木蝴蝶 猫爪草
0.643142 0.321093 0.44898 0.463611 0.42631 0.443415 0.320768 0.302042 0.320193 0.428072
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻 莱菔子 天麻

------Score: precision: 0.200000, recall: 0.166667, error: 0.800000
213. 
patient tongue id: 04120804559897_1_3
label yaofang:
白芍 金银花 薏苡仁 桃仁 蒲公英 生地黄 苍术 百部 苦参 白鲜皮 关黄柏 地肤子
0.440793 0.310855 0.398674 0.414966 0.395221 0.396127 0.315732 0.302137 0.329804 0.303601
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻 车前子 天麻

------Score: precision: 0.100000, recall: 0.083333, error: 0.900000
214. 
patient tongue id: 05162026118169_4
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 豆蔻 蝉蜕 姜半夏 百合 紫苏叶 广藿香 合欢皮
0.45227 0.394578 0.304367 0.38268 0.401094 0.373756 0.475789
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
215. 
patient tongue id: 04071930080627_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 黄芪 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香
0.314384 0.320889 0.59303 0.44029 0.612798 0.372115 0.39368 0.36107 0.324281 0.31653 0.306425 0.528627 0.5712 0.426687 0.520209 0.393997 0.672245 0.331045 0.310299 0.44164
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
216. 
patient tongue id: 05081759003586_1
label yaofang:
柴胡 白芍 川芎 陈皮 枳壳 麦冬 郁金 瓜蒌皮 炙甘草 醋香附 合欢皮
0.923659 0.316745 0.443815 0.551302 0.397829 0.467643 0.368084
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
217. 
patient tongue id: 03152041314373_4_1_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.382362 0.369827 0.32829 0.454747 0.313437 0.335772
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
218. 
patient tongue id: 02211436357130_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.626324 0.395942 0.447435 0.387291 0.345117 0.345698
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
219. 
patient tongue id: 05222058310121_1_4_7
label yaofang:
陈皮 麦冬 鸡内金 莲子 布渣叶 莲房
0.523609 0.390835 0.338531 0.596396 0.529459 0.381344 0.455569
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
220. 
patient tongue id: 02281303117022_1_2_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.494298 0.36109 0.302406 0.377541
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
221. 
patient tongue id: 05260702508917_2_5
label yaofang:
甘草 柴胡 白芍 茯苓 党参 酸枣仁 生地黄 栀子 牡丹皮 天麻 鳖甲 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.966124 0.512617 0.604736 0.421399 0.41644 0.301603 0.300666 0.325276 0.647473 0.547135 0.587325 0.48171 0.491045 0.557204
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.714286, recall: 0.666667, error: 0.285714
222. 
patient tongue id: 03012125599670_6_1
label yaofang:
甘草 党参 酸枣仁 生地黄 杜仲 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.970388 0.498788 0.570685 0.411141 0.300867 0.307061 0.538388 0.451113 0.482236 0.377017 0.352011 0.369903
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
223. 
patient tongue id: 05191947292297_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 熟地黄 栀子 牡丹皮 山药 菟丝子 桑寄生 女贞子 首乌藤 合欢花 艾叶
0.97368 0.327131 0.527588 0.562973 0.391525 0.325627 0.32717 0.300295 0.559619 0.510014 0.514964 0.441564 0.402806 0.401293
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.312500, error: 0.642857
224. 
patient tongue id: 05050746292112_5
label yaofang:
甘草 黄芩 前胡 桔梗 浙贝母 细辛 桑白皮 干姜 鳖甲 款冬花 白前 苦杏仁 白花蛇舌 天山雪莲
0.95481 0.512392 0.562017 0.415198 0.327668 0.33398 0.301752 0.523887 0.464228 0.483655 0.396011 0.378026 0.382907
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
225. 
patient tongue id: 05221854083618_4
label yaofang:
当归 熟地黄 杜仲 山茱萸 钩藤 厚朴 天麻 巴戟天 茵陈 土茯苓
0.463739 0.312839 0.354635 0.38235 0.32785 0.399588 0.371292
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
226. 
patient tongue id: 02150747509106_1_4_7
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 五味子 熟地黄 火麻仁 苦参 炙甘草 黑枣
0.468955 0.321072 0.346047 0.398742 0.446913 0.302634 0.329111
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
227. 
patient tongue id: 05261941409920_4_1_7
label yaofang:
甘草 党参 白术 浙贝母 乌梅 牛膝 郁金 山药 厚朴 菟丝子 天花粉 莪术 北沙参 桑椹 紫苏梗 红豆杉 预知子 鹿衔草
0.53898 0.386411 0.33559 0.600229 0.58679 0.383966 0.302973 0.428618
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.625000, recall: 0.277778, error: 0.375000
228. 
patient tongue id: 01012058558372_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.446167 0.518933 0.407832 0.455328 0.498675 0.359863 0.393764 0.34949 0.395039 0.3852 0.420985 0.354897 0.421766 0.373999 0.397092
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
229. 
patient tongue id: 05290839556812_7_4_6
label yaofang:
甘草 柴胡 白芍 茯苓 远志 党参 丹参 胆南星 栀子 牡丹皮 川楝子 地黄 厚朴 麦芽 合欢花
0.848874 0.461192 0.454421 0.4396
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.200000, error: 0.250000
230. 
patient tongue id: 03022218484889_1_6
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 浙贝母 桑叶 菊花 天麻 莪术 白花蛇舌草 蜈蚣 醋鳖甲
0.993179 0.305962 0.557714 0.624413 0.405201 0.376088 0.324587 0.316504 0.65983 0.592899 0.611783 0.520237 0.483149 0.505058
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.500000, error: 0.500000
231. 
patient tongue id: 01081920390190_9_6
label yaofang:
柴胡 白芍 黄芩 当归 枳实 干姜 大黄 生地 法夏 旋复花冲剂
0.982653 0.532381 0.586866 0.422166 0.33269 0.31076 0.608835 0.539862 0.581445 0.456285 0.435775 0.472229
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
232. 
patient tongue id: 01012100505502_1_3_7
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 丹参 枳实 竹茹 胆南星 薤白 厚朴 瓜蒌皮
0.547374 0.396801 0.4098 0.410202 0.376953
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
233. 
patient tongue id: 04200259240825_5
label yaofang:
甘草 法半夏 茯苓 桔梗 金银花 牛蒡子 浙贝母 山药 桑白皮 莱菔子 款冬花 紫菀 苦杏仁 紫苏子
0.987978 0.544135 0.605309 0.391135 0.336109 0.320636 0.30595 0.625069 0.543631 0.559256 0.459384 0.427701 0.439322
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
234. 
patient tongue id: 04111958516106_2_1
label yaofang:
桂枝 甘草 白芍 防风 薏苡仁 白术 天麻 桑寄生 鳖甲 补骨脂 麦芽 威灵仙 蜈蚣 白花蛇舌 天山雪莲
0.995111 0.326755 0.574499 0.623545 0.379414 0.344776 0.316617 0.659751 0.600153 0.607005 0.522677 0.47201 0.481837
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
235. 
patient tongue id: 05152107314539_6
label yaofang:
大枣 当归 茯苓 木香 远志 党参 黄芪 白术 酸枣仁 柏子仁 车前子 炙甘草 制白附子
0.737655 0.350375 0.42595 0.467653 0.386011 0.327367
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
236. 
patient tongue id: 03101948109701_4
label yaofang:
茯苓 防风 薄荷 钩藤 荆芥穗 白芷 香薷 炙甘草 首乌藤 紫苏梗 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.379395 0.765381 0.404051 0.841636 0.436698 0.494828 0.415127 0.384915 0.381722 0.358812 0.752381 0.818821 0.680435 0.787675 0.463744 0.874423 0.36087 0.390228 0.520839 0.680355
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.357143, error: 0.750000
237. 
patient tongue id: 01061909494818_4_1
label yaofang:
陈皮 法半夏 前胡 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 炒蔓荆子
0.352149 0.414187 0.389426 0.44612 0.342794 0.346111 0.392392 0.360347 0.448952 0.368117 0.457399 0.509507 0.644964 0.337532
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.857143, recall: 0.750000, error: 0.142857
238. 
patient tongue id: 03151732024557_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.455392 0.333389 0.487819 0.420627 0.487495 0.487138 0.3368 0.39795 0.379512 0.386754 0.352576 0.424539 0.355804 0.41989 0.392746 0.400797
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
239. 
patient tongue id: 02161927452714_5
label yaofang:
橘红 荆芥 防风 桑叶 菊花 桑白皮 白芷 鸡内金 枇杷叶 辛夷 紫苏叶 苍耳子
0.533035 0.406304 0.413396 0.439044 0.414734 0.312183
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
240. 
patient tongue id: 06171335241967_6
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 紫苏叶 山慈菇
0.822088 0.385455 0.406893 0.484543 0.385842 0.33407
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.166667, recall: 0.100000, error: 0.833333
241. 
patient tongue id: 04112035114460_2_6
label yaofang:
甘草 白芍 党参 白术 酸枣仁 柏子仁 厚朴 天麻 鳖甲 火麻仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991942 0.547881 0.615732 0.381595 0.332971 0.318619 0.638408 0.564077 0.576252 0.482162 0.445901 0.458246
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
242. 
patient tongue id: 05290831535119_6_7_4
label yaofang:
甘草 法半夏 茯苓 木香 薏苡仁 党参 白术 山药 灯心草 砂仁 茵陈 扁豆花 三棱 莪术 麦芽
0.984193 0.523858 0.615524 0.395564 0.383599 0.318692 0.650371 0.536349 0.54554 0.453893 0.442569 0.46625
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
243. 
patient tongue id: 01312136500427_4_7
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 白术 山药 厚朴 砂仁 三棱 莪术 豆蔻 麦芽 紫苏梗 广藿香
0.829589 0.315283 0.443011 0.453403 0.402912
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
244. 
patient tongue id: 01201928567500_1_2_6
label yaofang:
甘草 党参 山药 山茱萸 地黄 天麻 菟丝子 益智仁 益母草 金樱子 白花蛇舌草 蜈蚣 棉萆薢 醋鳖甲
0.988399 0.549185 0.615112 0.420435 0.364546 0.304411 0.318114 0.616442 0.547838 0.572842 0.46972 0.440554 0.468518
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
245. 
patient tongue id: 04211351094743_9
label yaofang:
法半夏 前胡 桔梗 防风 白芷 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 百合 广藿香 蜜麻黄 炒苍耳子
0.384737 0.858112 0.395661 0.932228 0.480114 0.603122 0.410748 0.396506 0.374922 0.389601 0.866847 0.915623 0.782467 0.889061 0.449548 0.945998 0.417804 0.443488 0.592423 0.769997
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.812500, error: 0.350000
246. 
patient tongue id: 04141954078167_6_1
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 党参 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.974475 0.517124 0.5975 0.388848 0.350754 0.580624 0.471607 0.497057 0.394434 0.379435 0.399868
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
247. 
patient tongue id: 02181633186933_5_7
label yaofang:
甘草 白芍 茯苓 葛根 羌活 连翘 党参 黄芪 白术 丹参 红花 赤芍 皂角刺 白鲜皮
0.925474 0.481658 0.547212 0.375963 0.305522 0.485514 0.331953 0.392291
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
248. 
patient tongue id: 03291640164304_6
label yaofang:
甘草 白术 酸枣仁 生地黄 郁金 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.966452 0.300526 0.515937 0.561345 0.384035 0.304782 0.329921 0.539015 0.473531 0.482719 0.405932 0.372285 0.3697
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
249. 
patient tongue id: 03231605061969_1_4
label yaofang:
法半夏 前胡 桔梗 防风 黄芪 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 麸炒白术
0.652038 0.42085 0.677141 0.340965 0.371 0.57961 0.600223 0.453173 0.577355 0.316607 0.634904 0.302104 0.450043
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
250. 
patient tongue id: 01172228557270_1_4_7
label yaofang:
甘草 连翘 党参 丹参 玄参 赤芍 浙贝母 天麻 鳖甲 皂角刺 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.780698 0.317562 0.401868 0.507843 0.364518 0.306273 0.361606
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
251. 
patient tongue id: 03151837180467_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 猫爪草
0.596218 0.340091 0.361789 0.416324 0.39492 0.304265
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
252. 
patient tongue id: 03090811520496_1_4
label yaofang:
甘草 茯苓 桔梗 荆芥 阿胶 白术 浙贝母 天麻 诃子 白花蛇舌草 麦芽 白鲜皮 半枝莲 醋鳖甲
0.984454 0.536899 0.617043 0.414981 0.40182 0.315988 0.316263 0.665229 0.579946 0.619568 0.501485 0.496211 0.554703
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
253. 
patient tongue id: 04301133054923_4_7_1
label yaofang:
甘草 法半夏 茯苓 龙骨 党参 酸枣仁 丹参 黄连 山茱萸 天麻 全蝎 补骨脂 麦芽 川加皮
0.987569 0.31211 0.548056 0.601757 0.366686 0.326454 0.307655 0.599863 0.533028 0.524166 0.459437 0.413982 0.412305
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
254. 
patient tongue id: 05290841544761_6_2_4
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 丹参 生地黄 牡丹皮 杜仲 菟丝子 桑寄生 益母草 补骨脂 女贞子
0.974406 0.512698 0.576435 0.376733 0.321047 0.526001 0.435991 0.466462 0.348232 0.327622 0.323181
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
255. 
patient tongue id: 03062127052330_6
label yaofang:
甘草 白芍 酸枣仁 丹参 生地黄 山药 山茱萸 砂仁 天麻 桑寄生 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 半枝莲
0.997211 0.581892 0.637579 0.370132 0.322031 0.682938 0.621995 0.622853 0.532803 0.476816 0.479571
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
256. 
patient tongue id: 06082027497652_2
label yaofang:
甘草 枳壳 薏苡仁 桃仁 蒲公英 太子参 黄芪 白术 生地黄 牡丹皮 乌药 郁金 厚朴 僵蚕 莪术 蜈蚣 姜黄
0.509545 0.36822 0.390837 0.641249 0.657097 0.45782 0.369895 0.531378 0.365863
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.444444, recall: 0.235294, error: 0.555556
257. 
patient tongue id: 04202031084984_2_7
label yaofang:
甘草 柴胡 白芍 茯苓 白术 全蝎 猪苓 莪术 半枝莲 蜂房 瓦楞子 山豆根 半边莲
0.315998 0.342909 0.350144 0.30175 0.352193 0.324473 0.398444 0.499276
predicted yaofang:
甘草 白芍 党参 黄芪 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
258. 
patient tongue id: 01041648186326_6_1
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.614348 0.390291 0.389469 0.48133 0.512504
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
259. 
patient tongue id: 03221629545678_1_4_6
label yaofang:
枳壳 半夏 黄芪 白术 赤芍 海螵蛸 砂仁 菟丝子 桑寄生 鸡内金 莲子 北沙参 红豆杉 合欢皮
0.556748 0.337768 0.36193 0.590873 0.585299 0.357804
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
260. 
patient tongue id: 02202242230635_5
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 牛蒡子 浙贝母 桑白皮 莱菔子 款冬花 枇杷叶 苦杏仁 紫苏子
0.97818 0.351033 0.545667 0.556219 0.390139 0.301654 0.349645 0.303336 0.54074 0.519234 0.520935 0.447672 0.400345 0.387998
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.285714, error: 0.714286
261. 
patient tongue id: 06022133210397_5
label yaofang:
芦根 牛蒡子 薏苡仁 麦冬 黄连 佩兰 三七 茵陈 淡竹叶 扁豆花 百合 土茯苓 木棉花
0.43905 0.349228 0.301103 0.591626 0.562325 0.381068 0.306348 0.462844
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
262. 
patient tongue id: 03111439448754_6_2_1
label yaofang:
甘草 白芍 木香 薏苡仁 玉竹 党参 延胡索 砂仁 天麻 五灵脂 鳖甲 三棱 莪术 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.978503 0.524819 0.586131 0.405278 0.328646 0.315118 0.584897 0.510412 0.542115 0.43546 0.410049 0.439255
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.411765, error: 0.416667
263. 
patient tongue id: 05160609128726_1_4_6
label yaofang:
桂枝 桃仁 黄芪 白术 海螵蛸 牛膝 砂仁 桑寄生 续断 桑椹 首乌藤 土鳖虫 红豆杉 合欢皮
0.543013 0.39758 0.334645 0.345644 0.606928 0.5767 0.429247 0.344687 0.329893 0.485841 0.313146
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
264. 
patient tongue id: 05201455401943_3_2
label yaofang:
柴胡 白芍 当归 茯苓 木香 远志 党参 黄芪 白术 熟附子 熟地黄 细辛 干姜 炙甘草 女贞子 广升麻 墨旱莲
0.9505 0.494419 0.553724 0.392804 0.307177 0.52345 0.428486 0.453278 0.354217 0.330015 0.330726
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.176471, error: 0.727273
265. 
patient tongue id: 05222104225178_4_1
label yaofang:
陈皮 当归 黄芪 白术 杜仲 苍术 厚朴 生半夏 僵蚕 鸡内金 枇杷叶 红豆杉 山慈菇 稻芽
0.455125 0.381381 0.313316 0.309867 0.611456 0.484258 0.363242 0.308397 0.491928
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
266. 
patient tongue id: 02020950137737_6_5
label yaofang:
甘草 柴胡 白芍 黄芩 当归 茯苓 党参 白术 酸枣仁 生地黄 栀子 牡丹皮 合欢花
0.923437 0.329927 0.513089 0.527754 0.399461 0.338687 0.304244 0.482978 0.434706 0.433266 0.379903 0.349177 0.333376
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.307692, error: 0.692308
267. 
patient tongue id: 03240601247005_2_5
label yaofang:
甘草 茯苓 木香 黄连 生地黄 山茱萸 灯心草 山楂 莱菔子 莪术 海金沙 鸡内金 王不留行 广金钱草
0.971108 0.528316 0.574991 0.423224 0.340881 0.328324 0.316297 0.552352 0.495995 0.529164 0.424651 0.399901 0.420989
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.142857, error: 0.846154
268. 
patient tongue id: 03180134191340_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮
0.333195 0.361217 0.349372 0.315625 0.418654 0.373317 0.416424 0.527247 0.320922
predicted yaofang:
甘草 白芍 党参 黄芪 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
269. 
patient tongue id: 05260716182232_1_2_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 天麻 鳖甲 款冬花 蜈蚣 天山雪莲 半枝莲 红豆杉
0.992492 0.544448 0.653567 0.405224 0.439509 0.315583 0.733936 0.633069 0.68033 0.565688 0.560216 0.647145
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
270. 
patient tongue id: 04112235254672_4_6_7
label yaofang:
甘草 香附 茯苓 牛蒡子 白及 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 半枝莲 瓦楞子 猫爪草 半边莲
0.5778 0.343036 0.438969 0.329178 0.3201
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
271. 
patient tongue id: 05221956139677_2_1
label yaofang:
党参 黄芪 白术 附子 车前子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.393112 0.429143 0.373847 0.357346 0.464655 0.557545
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.300000, error: 0.500000
272. 
patient tongue id: 01172237281672_1_5
label yaofang:
甘草 枳壳 茯苓 木香 蒲公英 白及 党参 白术 黄连 赤芍 砂仁 五灵脂 麦芽 白扁豆 稻芽
0.991901 0.555249 0.622597 0.393957 0.382087 0.315051 0.333391 0.678977 0.604227 0.617064 0.531967 0.502052 0.516688
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.266667, error: 0.692308
273. 
patient tongue id: 04122141045729_6_2
label yaofang:
甘草 白芍 当归 党参 生地黄 山药 山茱萸 天麻 糯稻根 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲 龟甲
0.708541 0.404302 0.411921 0.420312 0.545129 0.323952
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 浙贝母

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
274. 
patient tongue id: 06190648385281_6_7_4
label yaofang:
甘草 茯苓 木香 党参 白术 酸枣仁 牡丹皮 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红曲
0.969759 0.32068 0.511077 0.600763 0.413497 0.389172 0.331445 0.3086 0.610364 0.516288 0.558796 0.447344 0.449411 0.502494
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.785714, recall: 0.733333, error: 0.214286
275. 
patient tongue id: 06070653154686_2_4_6
label yaofang:
甘草 法半夏 茯苓 桔梗 橘红 薏苡仁 太子参 酸枣仁 浙贝母 砂仁 鳖甲 火麻仁 莪术 麦芽 苦杏仁 白花蛇舌 天山雪莲
0.974374 0.519927 0.583488 0.391637 0.326734 0.322966 0.304227 0.567327 0.495607 0.502838 0.421804 0.394617 0.398976
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.411765, error: 0.461538
276. 
patient tongue id: 03151954284682_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.498422 0.598332 0.443037 0.393212 0.580601 0.48469 0.489428 0.470785 0.526783 0.497754 0.574424 0.511854 0.560264 0.522584 0.547509
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
277. 
patient tongue id: 02201815225007_1_6
label yaofang:
甘草 陈皮 茯苓 葛根 郁金 佩兰 北柴胡 茵陈 广藿香 干鱼腥草 炒白扁豆 麸炒白术 炒六神曲 布渣叶 木棉花
0.356009 0.748368 0.415536 0.823359 0.422001 0.491312 0.383362 0.353764 0.323403 0.329152 0.724536 0.779996 0.624809 0.744636 0.405631 0.808729 0.374572 0.376945 0.436768 0.628235
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.200000, error: 0.850000
278. 
patient tongue id: 02260652202101_5
label yaofang:
甘草 陈皮 枳壳 黄芩 法半夏 茯苓 桔梗 党参 浙贝母 桑白皮 款冬花 苦杏仁 广藿香
0.969866 0.488223 0.5864 0.398425 0.504617 0.360467 0.444296 0.328107
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
279. 
patient tongue id: 05251957539151_1_4_6
label yaofang:
当归 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 石斛 鸡内金 紫苏梗 稻芽
0.499401 0.341972 0.357144 0.509621 0.504939
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
280. 
patient tongue id: 05181033112886_6
label yaofang:
甘草 柴胡 香附 黄芩 法半夏 茯苓 党参 白术 砂仁 枇杷叶 麦芽 紫苏梗 广藿香
0.969607 0.309416 0.528501 0.580111 0.391011 0.350188 0.339475 0.305888 0.561319 0.494897 0.502639 0.423264 0.400667 0.413861
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.384615, error: 0.642857
281. 
patient tongue id: 03232205582219_2_7
label yaofang:
甘草 白芍 川芎 独活 党参 白术 延胡索 山茱萸 桑寄生 秦艽 浮小麦 威灵仙 合欢花 骨碎补
0.970774 0.508353 0.582291 0.392965 0.327701 0.323858 0.559397 0.443468 0.479375 0.354 0.342992 0.357014
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
282. 
patient tongue id: 03312022058407_6
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 法半夏 大枣 茯苓 牡蛎 白术 酸枣仁 竹茹 干姜 青蒿 浮小麦 首乌藤
0.988586 0.357088 0.563985 0.605745 0.388494 0.333602 0.319369 0.319592 0.606576 0.569085 0.566509 0.501349 0.453998 0.452828
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.312500, error: 0.642857
283. 
patient tongue id: 05102150507876_1
label yaofang:
法半夏 前胡 防风 白芷 款冬花 紫菀 白前 百部 豆蔻 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.300811 0.453337 0.409791 0.45012 0.33652 0.321591 0.347786 0.344858 0.441634 0.34364 0.443146 0.470258 0.640749 0.315976
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.642857, recall: 0.600000, error: 0.357143
284. 
patient tongue id: 04201512393195_1_3
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.467339 0.353022 0.372534 0.505491 0.378425
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
285. 
patient tongue id: 03311649368516_4
label yaofang:
柴胡 黄芩 龙骨 党参 白术 泽泻 天麻 姜半夏 炙甘草 续断
0.391039 0.53738 0.483464 0.308697 0.417305 0.38683 0.301311 0.342421 0.301347 0.759869 0.774837
predicted yaofang:
柴胡 白芍 香附 白术 柏子仁 海螵蛸 浙贝母 干姜 豆蔻 姜半夏 炙甘草

------Score: precision: 0.363636, recall: 0.400000, error: 0.636364
286. 
patient tongue id: 05312144431637_7_4_6
label yaofang:
甘草 川芎 龙骨 桃仁 红花 牛膝 薤白 水蛭 天麻 瓜蒌皮 莪术 蒺藜 沙苑子 酒女贞子 墨旱莲
0.948845 0.493332 0.588615 0.408528 0.368375 0.306735 0.588707 0.453805 0.510568 0.38492 0.38303 0.426019
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
287. 
patient tongue id: 02181602098808_6_4_7
label yaofang:
甘草 香附 枳壳 法半夏 丹参 黄连 延胡索 牛膝 薤白 砂仁 天麻 五灵脂 桑寄生 瓜蒌皮 柿蒂 蒺藜
0.953677 0.503844 0.578034 0.421703 0.370506 0.301308 0.578455 0.469229 0.518848 0.396133 0.395339 0.444426
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.125000, error: 0.833333
288. 
patient tongue id: 04121934187163_2_1
label yaofang:
甘草 白芍 薏苡仁 党参 赤芍 杜仲 天麻 鳖甲 佛手 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤
0.994967 0.555615 0.674719 0.408019 0.459906 0.32148 0.764297 0.658556 0.705561 0.590374 0.588361 0.691261
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
289. 
patient tongue id: 01092039473165_1_6
label yaofang:
甘草 柴胡 白芍 当归 茯苓 党参 白术 丹参 熟地黄 益母草 淫羊藿 仙茅 合欢花
0.955904 0.318078 0.508584 0.571456 0.404713 0.355544 0.332154 0.303585 0.559015 0.477979 0.494756 0.402754 0.398179 0.41639
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.384615, error: 0.642857
290. 
patient tongue id: 06162245121306_1_4
label yaofang:
甘草 陈皮 茯苓 佩兰 砂仁 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶 炒稻芽 炒麦芽
0.376545 0.661701 0.41973 0.753629 0.407897 0.438695 0.404215 0.335208 0.336751 0.324107 0.657066 0.733285 0.582001 0.715716 0.48523 0.814915 0.332713 0.355936 0.448805 0.605741
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.230769, error: 0.850000
291. 
patient tongue id: 04122128100320_1_6
label yaofang:
甘草 薏苡仁 党参 黄芪 熟附子 山药 砂仁 天麻 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.568705 0.38466 0.395813 0.52445 0.516858 0.338069 0.34023
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
292. 
patient tongue id: 03302018324992_1_7
label yaofang:
甘草 当归 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 紫苏叶 蜈蚣 合欢皮 稻芽
0.388251 0.534513 0.412078 0.438761 0.313303 0.345859 0.370265 0.30321 0.31362 0.481309
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 款冬花 紫菀 百部 北沙参 炙甘草

------Score: precision: 0.200000, recall: 0.117647, error: 0.800000
293. 
patient tongue id: 05251941547536_1
label yaofang:
甘草 白芍 陈皮 茯苓 半夏 薏苡仁 党参 黄芪 白术 海螵蛸 车前子 砂仁 白芷 莪术 鸭脚艾
0.576481 0.396405 0.406616 0.439971 0.350333
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 1.000000, recall: 0.333333, error: 0.000000
294. 
patient tongue id: 02182222408105_2_1_5
label yaofang:
甘草 黄芩 桔梗 牛蒡子 浙贝母 郁金 白茅根 茜草 鳖甲 鸡内金 白花蛇舌 蜂房 岗梅根 四季青
0.984864 0.315268 0.546026 0.595742 0.395563 0.339439 0.326114 0.310653 0.588642 0.535526 0.544366 0.454092 0.430792 0.442317
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.285714, error: 0.714286
295. 
patient tongue id: 05092043228184_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.302947 0.336359 0.465634 0.37538 0.358798 0.339621 0.38194 0.340113 0.313531 0.619433 0.6522 0.335744
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
296. 
patient tongue id: 03231306169107_6_1_5
label yaofang:
甘草 川芎 党参 生地黄 赤芍 牡丹皮 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.967493 0.503497 0.596622 0.43243 0.38871 0.301369 0.618953 0.538744 0.585503 0.468813 0.460481 0.534228
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.615385, error: 0.333333
297. 
patient tongue id: 05160627084077_3_1_6
label yaofang:
茯苓 龙骨 熟地黄 牡丹皮 附子 肉桂 山药 山茱萸 干姜 补骨脂 金樱子 益智 黄精
0.596888 0.38914 0.355122 0.607097 0.576818 0.408817 0.319732 0.437005
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
298. 
patient tongue id: 03240604426244_6_2
label yaofang:
甘草 茯苓 薏苡仁 党参 玄参 生地黄 赤芍 浙贝母 郁金 厚朴 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲
0.997876 0.323994 0.593519 0.648606 0.370651 0.35424 0.313315 0.308218 0.707462 0.648014 0.650097 0.569475 0.509908 0.511238
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.642857, recall: 0.562500, error: 0.357143
299. 
patient tongue id: 03061502200607_1
label yaofang:
甘草 柴胡 白芍 枳壳 桔梗 黄芪 白术 生地黄 槟榔 厚朴 肉苁蓉 火麻仁 柿蒂 紫菀
0.35106 0.343292 0.337019 0.38692 0.434937
predicted yaofang:
甘草 党参 黄芪 白术 炙甘草

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
300. 
patient tongue id: 05232016470375_1_7
label yaofang:
甘草 枳壳 茯苓 薏苡仁 蒲公英 白术 黄连 海螵蛸 郁金 厚朴 莪术 北沙参 紫苏叶 蜈蚣 红豆杉 合欢皮 姜黄 蛇舌草
0.562883 0.391286 0.300758 0.366152 0.580342 0.559181 0.406244 0.328517 0.310082 0.436732
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.500000, recall: 0.277778, error: 0.500000
301. 
patient tongue id: 01070841443443_1_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 赤芍 牛膝 郁金 六神曲
0.495584 0.331301 0.404815 0.41955 0.382478 0.403793 0.314362 0.383264
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
302. 
patient tongue id: 05231931246053_1
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.420693 0.933186 0.359496 0.973968 0.538532 0.626175 0.464226 0.429889 0.421372 0.373671 0.933983 0.963628 0.87009 0.947896 0.481061 0.984515 0.399642 0.454979 0.665079 0.852862
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
303. 
patient tongue id: 02211427346053_4_1_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 干姜 鸡内金
0.514391 0.349521 0.387523 0.420786 0.445435 0.369737 0.30002 0.315988
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
304. 
patient tongue id: 04101907167307_1_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.350328 0.619581 0.423463 0.668627 0.356831 0.43601 0.371384 0.336951 0.3455 0.33184 0.562052 0.685031 0.530192 0.639319 0.422928 0.803743 0.304941 0.379841 0.413134 0.558917
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
305. 
patient tongue id: 05140657474380_1
label yaofang:
甘草 川芎 当归 茯苓 党参 黄芪 鸡血藤 白术 山药 山茱萸 砂仁 天麻 桑螵蛸 麦芽 地龙
0.461699 0.378699 0.301636 0.302436 0.586013 0.537017 0.376924 0.309077 0.444049
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.666667, recall: 0.400000, error: 0.333333
306. 
patient tongue id: 03021234054976_1_3
label yaofang:
川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.548758 0.402308 0.389138 0.353417 0.3122
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
307. 
patient tongue id: 05242000125657_5_2
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 茯苓 连翘 红花 牡丹皮 地黄 菟丝子 益母草 皂角刺 醋香附
0.989246 0.540512 0.613607 0.398246 0.360011 0.311451 0.301879 0.635713 0.55927 0.580968 0.485614 0.458875 0.476036
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.142857, error: 0.846154
308. 
patient tongue id: 01042308513562_4
label yaofang:
甘草 香附 茯苓 薏苡仁 党参 白术 海螵蛸 干姜 紫菀 白花蛇舌草 续断 瓦楞子
0.788798 0.447239 0.446503 0.391251 0.523535 0.307157 0.331706
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 浙贝母 蜈蚣

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
309. 
patient tongue id: 02182240354089_6_3_1
label yaofang:
当归 桃仁 黄芪 白术 熟地黄 杜仲 附子 肉桂 山茱萸 厚朴 火麻仁 北沙参 首乌藤 地肤子 土鳖虫
0.513678 0.416881 0.311395 0.382572 0.342262 0.355465
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
310. 
patient tongue id: 04301140576662_1_2
label yaofang:
甘草 香附 枳壳 茯苓 龙骨 党参 酸枣仁 丹参 生地黄 郁金 浮小麦 首乌藤 合欢花
0.966617 0.521363 0.589372 0.387283 0.36974 0.325804 0.601873 0.502937 0.505238 0.435582 0.421481 0.425264
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
311. 
patient tongue id: 02171848405438_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.422984 0.883983 0.38148 0.948667 0.501251 0.619296 0.434663 0.397088 0.390949 0.382543 0.892402 0.935886 0.814726 0.918835 0.448058 0.963564 0.429565 0.470578 0.620692 0.797711
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
312. 
patient tongue id: 03261647030758_2_1
label yaofang:
甘草 白芍 香附 当归 茯苓 党参 黄芪 白术 郁金 山楂 蛇舌草
0.477141 0.338944 0.372744 0.384248 0.61263 0.394088 0.370131 0.333824 0.370266 0.325956 0.365833
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝 厚朴 鸡内金 北沙参

------Score: precision: 0.454545, recall: 0.454545, error: 0.545455
313. 
patient tongue id: 01121848479995_2
label yaofang:
陈皮 前胡 防风 细辛 干姜 款冬花 白前 百部 炙甘草 炒紫苏子 蜜麻黄
0.383597 0.854141 0.366114 0.926169 0.429651 0.61258 0.401398 0.340207 0.336223 0.372663 0.853033 0.911375 0.783228 0.887633 0.444956 0.946051 0.423078 0.463087 0.60937 0.770541
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 1.000000, error: 0.450000
314. 
patient tongue id: 01121852311327_2
label yaofang:
法半夏 前胡 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.357631 0.312857 0.468444 0.433081 0.438976 0.314753 0.304714 0.315757 0.321696 0.357392 0.387001 0.317298 0.36903 0.410881 0.514786
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.600000, recall: 0.600000, error: 0.400000
315. 
patient tongue id: 05222011393645_4
label yaofang:
枳壳 太子参 白术 海螵蛸 神曲 山楂 砂仁 石斛 紫菀 麦芽 百合 紫苏叶 独脚金
0.421388 0.306647 0.317031 0.400643 0.340261 0.389217 0.372916
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
316. 
patient tongue id: 04272315058824_7
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 猪苓 鳖甲 虎杖 白花蛇舌草 瓦楞子
0.766214 0.396359 0.386373 0.466621 0.397413 0.324136
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
317. 
patient tongue id: 06141843553587_6_2_5
label yaofang:
茯苓 牡蛎 熟地黄 牡丹皮 郁金 山药 山茱萸 泽泻 莪术 蜈蚣 土茯苓 合欢皮 姜黄
0.396215 0.355473 0.342204 0.402685
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
318. 
patient tongue id: 03302126207508_1_4
label yaofang:
甘草 薏苡仁 牡丹皮 牛膝 郁金 山药 山茱萸 石菖蒲 天麻 白花蛇舌草 麦芽 蜈蚣 醋鳖甲 麸炒枳壳
0.76704 0.473978 0.419899 0.384453
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
319. 
patient tongue id: 03181800512206_6_4
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 酸枣仁 浙贝母 郁金 天麻 鳖甲 莪术 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲
0.946875 0.470787 0.538964 0.344384 0.405555 0.31092
predicted yaofang:
甘草 法半夏 茯苓 前胡 党参 天麻

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
320. 
patient tongue id: 01050635298145_6_4
label yaofang:
甘草 川芎 法半夏 茯苓 桔梗 赤芍 浙贝母 天麻 僵蚕 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.978176 0.524122 0.606708 0.41047 0.371761 0.311979 0.626268 0.522026 0.554183 0.443172 0.434773 0.475621
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
321. 
patient tongue id: 06132244037705_4_1
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 山慈菇
0.474755 0.403209 0.321174 0.414176 0.38011 0.311057 0.347878 0.465743
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
322. 
patient tongue id: 02142133158258_1_2
label yaofang:
麻黄 陈皮 茯苓 前胡 半夏 防风 钩藤 款冬花 紫菀 百部 紫苏子 蝉蜕 炙甘草
0.423924 0.818378 0.385593 0.906755 0.452506 0.572173 0.424733 0.394448 0.387447 0.372524 0.834775 0.8861 0.757266 0.869638 0.464414 0.927079 0.4258 0.444081 0.601955 0.741871
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.615385, error: 0.600000
323. 
patient tongue id: 04192231237159_6_2
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 杜仲 天麻 桑寄生 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.939049 0.339389 0.334359 0.509706 0.533394 0.388314 0.35496 0.469844 0.411626 0.416099 0.340518 0.31435 0.305822
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
324. 
patient tongue id: 03020735556122_1_4
label yaofang:
甘草 茯苓 党参 酸枣仁 山药 天麻 益母草 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.962939 0.524007 0.589284 0.431949 0.401071 0.316586 0.328806 0.60432 0.533162 0.567512 0.477099 0.460632 0.505713
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
325. 
patient tongue id: 03152012263126_2_1_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.380891 0.353994 0.353034 0.381624 0.503365 0.3085 0.354123 0.304087
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
326. 
patient tongue id: 05181045176169_2_5
label yaofang:
甘草 桔梗 金银花 芦根 牛蒡子 浙贝母 乌梅 白茅根 天麻 鳖甲 诃子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.975428 0.512807 0.597779 0.389329 0.35533 0.615509 0.504089 0.534016 0.420336 0.413681 0.460257
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
327. 
patient tongue id: 02252313550042_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 连翘 党参 栀子 牡丹皮 山药 莱菔子 麦芽 合欢花
0.971756 0.517964 0.582489 0.401351 0.355805 0.311494 0.317801 0.583047 0.508147 0.530967 0.43519 0.420491 0.424195
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
328. 
patient tongue id: 03170933073125_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.615061 0.331959 0.417802 0.430477 0.516562 0.417634 0.321524
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
329. 
patient tongue id: 03191010531123_1_7_2
label yaofang:
蒲公英 黄芪 何首乌 白术 杜仲 砂仁 桑寄生 莪术 北沙参 橘核 桑椹 蜈蚣 红豆杉
0.570723 0.386713 0.355762 0.609568 0.578642 0.416021 0.326906 0.426476
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
330. 
patient tongue id: 05051927181768_5
label yaofang:
茯苓 蒲公英 赤芍 青皮 熟地黄 牡丹皮 郁金 山药 泽泻 莪术 山萸肉 醋香附 穿破石 醋三棱
0.750419 0.366673 0.428368 0.472596 0.413353 0.356633 0.31324
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
331. 
patient tongue id: 04112000388796_1_2_7
label yaofang:
甘草 柴胡 黄芩 半夏 荆芥 丹参 杜仲 牛膝 郁金 厚朴 砂仁 菟丝子 火麻仁 紫苏叶 合欢皮 预知子
0.582622 0.378378 0.305903 0.330202 0.64705 0.648261 0.3046 0.446531 0.35541 0.467131
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.500000, recall: 0.312500, error: 0.500000
332. 
patient tongue id: 01061852563886_1
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.36012 0.716572 0.431322 0.786573 0.420329 0.454102 0.375618 0.353772 0.305813 0.300557 0.682478 0.699608 0.551901 0.673082 0.372288 0.745194 0.326669 0.360406 0.372716 0.529734
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
333. 
patient tongue id: 02141935440123_5
label yaofang:
麻黄 甘草 防风 金银花 连翘 薄荷 芦根 桑叶 菊花 荆芥穗 干鱼腥草 炒苍耳子 炒牛蒡子 燀苦杏仁
0.427259 0.928284 0.361573 0.975374 0.563416 0.64237 0.450178 0.421112 0.408189 0.380109 0.93891 0.966263 0.873718 0.953945 0.469149 0.982331 0.42801 0.464407 0.658598 0.849817
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.050000, recall: 0.071429, error: 0.950000
334. 
patient tongue id: 03141931116081_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.359829 0.755368 0.423955 0.829251 0.438513 0.498546 0.388497 0.36538 0.334918 0.347227 0.7364 0.782212 0.6473 0.750828 0.420791 0.83019 0.368496 0.397371 0.463045 0.629921
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
335. 
patient tongue id: 02191444523221_4_6
label yaofang:
麻黄 甘草 法半夏 当归 茯苓 前胡 橘红 桃仁 远志 厚朴 射干 地龙 苦杏仁 紫苏子
0.989678 0.325654 0.555158 0.597952 0.389927 0.328112 0.321043 0.302572 0.621431 0.569417 0.574042 0.490551 0.457687 0.455962
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.214286, recall: 0.214286, error: 0.785714
336. 
patient tongue id: 02120942350280_1_5
label yaofang:
甘草 防风 金银花 薏苡仁 党参 黄芪 白术 生地黄 山药 荆芥穗 苦参 白鲜皮 浮小麦 地肤子
0.982689 0.514289 0.607763 0.394801 0.363586 0.309268 0.306403 0.640099 0.522872 0.546203 0.442062 0.42351 0.448191
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
337. 
patient tongue id: 02181953024383_4_1_6
label yaofang:
甘草 白芍 陈皮 法半夏 茯苓 前胡 桔梗 桃仁 党参 白术 莱菔子 款冬花 紫菀 白芥子 紫苏子
0.842252 0.452422 0.473985 0.386625 0.346218
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
338. 
patient tongue id: 04250813486406_1_3_7
label yaofang:
甘草 陈皮 茯苓 桔梗 金银花 党参 白术 大腹皮 厚朴 藿香 白芷 六神曲 紫苏叶
0.505692 0.316065 0.500625 0.433011 0.418007 0.487054 0.356068 0.391673 0.316189 0.380889 0.356947 0.397634 0.417323 0.381073 0.342721 0.336192
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.230769, error: 0.812500
339. 
patient tongue id: 04102047531677_1_2
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 牛膝 茵陈 麦芽 赭石 浮小麦 龟甲
0.38401 0.430301 0.367272 0.342621 0.452567 0.585094
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
340. 
patient tongue id: 02191235503344_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.489669 0.367777 0.368612 0.305842 0.361806 0.51915
predicted yaofang:
法半夏 茯苓 前胡 紫菀 北沙参 炙甘草

------Score: precision: 0.833333, recall: 0.312500, error: 0.166667
341. 
patient tongue id: 06191209312987_4
label yaofang:
甘草 川芎 法半夏 茯苓 酸枣仁 延胡索 竹茹 川楝子 杜仲 牛膝 天麻 桑寄生 茵陈 豆蔻
0.979206 0.322273 0.545665 0.556159 0.379725 0.312898 0.503459 0.464632 0.456909 0.380189 0.325271 0.309572
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
342. 
patient tongue id: 03061509474924_6_7_1
label yaofang:
桂枝 甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 党参 枸杞子 白术 生地黄 红花 赤芍 熟地黄 杜仲 牛膝 附子 砂仁 菟丝子 巴戟天 桑寄生 鹿角霜 续断 制何首乌 徐长卿 艾叶
0.630742 0.365076 0.33751 0.430023 0.352465
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.111111, error: 0.400000
343. 
patient tongue id: 04250802507505_1_2_4
label yaofang:
甘草 法半夏 前胡 桔梗 橘红 金银花 薏苡仁 藿香 白前 枇杷叶 苦杏仁 干鱼腥草
0.470683 0.348252 0.388644 0.42101 0.458213 0.377898 0.321352 0.312213
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.125000, recall: 0.083333, error: 0.875000
344. 
patient tongue id: 05222106103753_1_2_5
label yaofang:
甘草 茯苓 龙骨 牡蛎 党参 黄芪 白术 五味子 砂仁 糯稻根 北沙参
0.556302 0.38386 0.3304 0.49164 0.528884 0.349976
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 1.000000, recall: 0.545455, error: 0.000000
345. 
patient tongue id: 05102204108050_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.416782 0.945181 0.352999 0.980864 0.54758 0.637914 0.456188 0.413919 0.410813 0.350294 0.9484 0.971072 0.891218 0.963612 0.489236 0.988076 0.379427 0.451338 0.69076 0.875236
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
346. 
patient tongue id: 04112032569927_1_2
label yaofang:
甘草 白芍 茯苓 桔梗 薏苡仁 党参 白术 浙贝母 山药 砂仁 鳖甲 白扁豆 佛手 白花蛇舌
0.990254 0.302698 0.546238 0.60415 0.372494 0.321128 0.314538 0.617423 0.545986 0.544693 0.474045 0.425615 0.421
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
347. 
patient tongue id: 01070834571715_1_4_6
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.448871 0.36656 0.328921 0.37401 0.338571 0.467329
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
348. 
patient tongue id: 04291517035192_3_5
label yaofang:
桂枝 甘草 党参 丹参 赤芍 黄柏 郁金 山茱萸 淫羊藿 补骨脂 仙茅 鹿角霜 佛手 醋香附
0.983581 0.527859 0.624927 0.388812 0.413976 0.316893 0.674617 0.574398 0.608302 0.508279 0.503117 0.564661
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
349. 
patient tongue id: 03012312250329_4_1
label yaofang:
桂枝 甘草 白芍 法半夏 茯苓 桃仁 鸡血藤 白术 酸枣仁 红花 赤芍 吴茱萸 麦芽 地龙
0.937177 0.316247 0.472172 0.540238 0.406741 0.314753 0.423496 0.368957
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
350. 
patient tongue id: 03171401451683_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.379925 0.624326 0.454282 0.686869 0.421369 0.467137 0.40364 0.364726 0.34959 0.306528 0.350009 0.602186 0.645545 0.542097 0.630004 0.421177 0.680332 0.379981 0.305444 0.393597 0.423129 0.549561
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.636364, recall: 1.000000, error: 0.363636
351. 
patient tongue id: 02212003017639_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗
0.441497 0.327813 0.321781 0.405577 0.312394 0.38871 0.381367
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.285714, recall: 0.222222, error: 0.714286
352. 
patient tongue id: 03090807222395_1_7
label yaofang:
甘草 当归 茯苓 党参 鸡血藤 酸枣仁 浙贝母 郁金 山药 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.976433 0.520699 0.61145 0.421526 0.418284 0.325273 0.65369 0.553999 0.582685 0.483649 0.474883 0.517941
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.687500, error: 0.083333
353. 
patient tongue id: 03311842452266_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.395141 0.863623 0.378116 0.945231 0.498174 0.626364 0.409703 0.396355 0.389463 0.402878 0.887154 0.932811 0.804414 0.911956 0.44494 0.964521 0.422712 0.470059 0.591835 0.770176
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
354. 
patient tongue id: 04271917216591_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 麦冬 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.408236 0.639805 0.424943 0.724332 0.417246 0.46515 0.422024 0.378774 0.372965 0.358852 0.643036 0.714581 0.594104 0.69128 0.469155 0.793924 0.372019 0.325667 0.402161 0.466787 0.593942
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
355. 
patient tongue id: 03291618097049_6_4
label yaofang:
甘草 香附 枳壳 法半夏 茯苓 党参 丹参 郁金 薤白 水蛭 瓜蒌皮 莪术 紫苏梗
0.941942 0.511042 0.526069 0.409351 0.335796 0.449789 0.385166 0.420564 0.308104
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
356. 
patient tongue id: 03312021024146_1_6
label yaofang:
甘草 法半夏 茯苓 远志 党参 厚朴 天麻 鳖甲 紫苏梗 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.868992 0.472805 0.50828 0.462976 0.312096 0.392433 0.406033
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
357. 
patient tongue id: 01032052192556_1_5_6
label yaofang:
甘草 白芍 薏苡仁 党参 黄芪 白术 熟附子 山药 天麻 鳖甲 败酱草 蜈蚣 天山雪莲 半枝莲
0.91776 0.308079 0.366705 0.511587 0.502294 0.370567 0.332748 0.429506 0.342055 0.367814
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
358. 
patient tongue id: 01312251127996_1_2_6
label yaofang:
甘草 白芍 川芎 大枣 茯苓 党参 枸杞子 酸枣仁 熟地黄 黄柏 地黄 泽泻 菟丝子 益母草
0.989321 0.546817 0.618598 0.405402 0.356332 0.305362 0.304555 0.637103 0.559766 0.578979 0.476798 0.447642 0.481419
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
359. 
patient tongue id: 03062153101403_1_2_7
label yaofang:
半夏 黄芪 白术 海螵蛸 浙贝母 砂仁 鸡内金 紫苏梗 合欢皮 山慈菇 蛇舌草 稻芽
0.491775 0.395067 0.337285 0.518896 0.484123 0.315595 0.429514
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
360. 
patient tongue id: 02142335506976_5
label yaofang:
甘草 茯苓 木香 党参 白术 丹参 山药 车前子 菟丝子 猪苓 茵陈 金樱子 虎杖 黄精
0.957367 0.504928 0.565917 0.402906 0.320754 0.310026 0.54253 0.456963 0.49589 0.379741 0.375506 0.398825
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
361. 
patient tongue id: 02141956369706_1
label yaofang:
柴胡 黄芩 党参 白术 丹参 柏子仁 泽泻 天麻 白芷 姜半夏 炙甘草 续断
0.456829 0.35371 0.366223 0.372153 0.401075 0.325576
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
362. 
patient tongue id: 06072250294527_1_2
label yaofang:
甘草 白芍 陈皮 薏苡仁 党参 白术 山药 天麻 鳖甲 白扁豆 建曲 蜈蚣 天山雪莲 半枝莲
0.964087 0.501627 0.592196 0.405546 0.375011 0.61638 0.499722 0.552857 0.429308 0.428146 0.508741
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
363. 
patient tongue id: 04282314345354_1_5_7
label yaofang:
甘草 白芍 当归 连翘 薏苡仁 桃仁 党参 黄芪 熟地黄 牡丹皮 大黄 败酱草 皂角刺 女贞子 广升麻 墨旱莲
0.987581 0.551589 0.593056 0.378448 0.324193 0.306758 0.30652 0.591067 0.541941 0.536221 0.472977 0.425378 0.434186
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.125000, error: 0.846154
364. 
patient tongue id: 05242350543862_2_6
label yaofang:
甘草 黄芩 薏苡仁 远志 生地黄 延胡索 细辛 茜草 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉 龙葵果 制天南星
0.972474 0.496804 0.588657 0.389338 0.341001 0.31173 0.570785 0.450262 0.497998 0.362772 0.363202 0.383212
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
365. 
patient tongue id: 05131617382938_4_6_2
label yaofang:
甘草 法半夏 大枣 茯苓 前胡 龙骨 桃仁 葶苈子 远志 薤白 水蛭 瓜蒌皮 款冬花 莪术 白前
0.971967 0.516164 0.591252 0.420506 0.365056 0.307146 0.315039 0.593878 0.517572 0.547992 0.446444 0.426786 0.452791
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.133333, error: 0.846154
366. 
patient tongue id: 05032301365799_5_6
label yaofang:
甘草 法半夏 茯苓 薏苡仁 远志 党参 酸枣仁 浙贝母 山药 淡豆豉 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.952011 0.492699 0.569789 0.418901 0.349515 0.309738 0.56544 0.457926 0.516085 0.377267 0.375032 0.427712
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.687500, error: 0.083333
367. 
patient tongue id: 03221622080727_6
label yaofang:
甘草 香附 茯苓 党参 白术 酸枣仁 生地黄 黄柏 郁金 山茱萸 菟丝子 益母草 王不留行 浮小麦 合欢花
0.983826 0.307664 0.538297 0.587097 0.389971 0.32801 0.333953 0.584796 0.532173 0.541548 0.459973 0.419903 0.416613
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
368. 
patient tongue id: 05091912102957_4_1
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.358545 0.592048 0.445735 0.670779 0.375441 0.398742 0.368284 0.568983 0.620166 0.482312 0.61972 0.444358 0.71909 0.329779 0.371236 0.520441
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.687500, recall: 0.687500, error: 0.312500
369. 
patient tongue id: 06182229164094_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 砂仁 白扁豆 紫苏梗 广藿香 稻芽 火炭母 手参
0.648191 0.424519 0.396971 0.423218 0.526043 0.316881
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 浙贝母

------Score: precision: 0.833333, recall: 0.384615, error: 0.166667
370. 
patient tongue id: 05262059584070_4_6
label yaofang:
甘草 白芍 法半夏 茯苓 牡蛎 白术 昆布 浙贝母 栀子 郁金 天花粉 瓜蒌皮 紫苏梗 猫爪草
0.943744 0.49675 0.572454 0.430152 0.377679 0.315582 0.314736 0.557544 0.475458 0.517958 0.41133 0.411526 0.449463
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
371. 
patient tongue id: 03142007111945_1_2
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.332547 0.383092 0.302062 0.34257 0.306831 0.378616 0.331752 0.388135 0.587834 0.317519
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
372. 
patient tongue id: 06012058410151_1_7_5
label yaofang:
甘草 半夏 黄芪 黄连 杜仲 僵蚕 补骨脂 北沙参 赭石 辛夷 紫苏叶 蜈蚣 木蝴蝶
0.508858 0.417789 0.346905 0.401484 0.400419 0.34611
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
373. 
patient tongue id: 03291952445184_7
label yaofang:
甘草 半夏 桃仁 蒲公英 黄芪 白术 浙贝母 厚朴 莪术 柿蒂 赭石 紫苏叶 蛇舌草
0.754945 0.420927 0.485093 0.331721 0.32557 0.312896 0.437957
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 天麻

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
374. 
patient tongue id: 05092231174107_6_1_5
label yaofang:
甘草 柴胡 陈皮 茯苓 薏苡仁 党参 赤芍 山药 砂仁 鳖甲 莪术 麦芽 白扁豆 白花蛇舌 红豆杉
0.949875 0.306156 0.321907 0.517813 0.55252 0.419465 0.310124 0.351174 0.497727 0.445893 0.467184 0.381886 0.356822 0.352779
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.357143, recall: 0.333333, error: 0.642857
375. 
patient tongue id: 03111159067124_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.476915 0.311796 0.576599 0.437171 0.464915 0.559596 0.441076 0.454412 0.462247 0.470644 0.452989 0.550074 0.425644 0.555314 0.503842 0.5385
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
376. 
patient tongue id: 05232038297382_1
label yaofang:
甘草 白芍 桃仁 党参 枸杞子 白术 熟地黄 杜仲 砂仁 菟丝子 巴戟天 桑寄生 鳖甲 鹿角霜 续断
0.436026 0.387218 0.305289 0.389011 0.345084 0.314312 0.480859
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
377. 
patient tongue id: 03131245506352_1_2
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.409218 0.735167 0.415918 0.826747 0.446317 0.536265 0.431491 0.398372 0.400747 0.301647 0.392792 0.744372 0.815467 0.680628 0.782763 0.457991 0.87414 0.410296 0.324873 0.453172 0.544414 0.68215
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.733333, error: 0.500000
378. 
patient tongue id: 01122319400083_4_6
label yaofang:
甘草 川芎 法半夏 茯苓 党参 白术 赤芍 牛膝 石菖蒲 泽泻 仙鹤草 天麻 磁石 地龙
0.941967 0.326291 0.46539 0.565457 0.397235 0.318672 0.510922 0.326029 0.408572
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
379. 
patient tongue id: 02182237155530_6_2
label yaofang:
甘草 柴胡 黄芩 法半夏 茯苓 桔梗 橘红 浙贝母 栀子 牡丹皮 款冬花 扁豆花 紫菀 贯众
0.968545 0.30091 0.505665 0.563188 0.404482 0.33172 0.517657 0.46024 0.486737 0.3973 0.35936 0.3676
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
380. 
patient tongue id: 03311650265971_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.42387 0.38204 0.31431 0.383446 0.381704 0.341136 0.463513
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.300000, error: 0.571429
381. 
patient tongue id: 04201443287889_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.670363 0.404047 0.393933 0.531078 0.545647 0.328261 0.307563
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
382. 
patient tongue id: 04141247053435_1_4_3
label yaofang:
法半夏 防风 钩藤 白芷 石决明 豆蔻 炙甘草 首乌藤 广藿香 威灵仙 麸炒白术 甘松 炒蔓荆子 棉萆薢
0.321183 0.459248 0.410508 0.449627 0.317613 0.320187 0.320439 0.358771 0.463112 0.358311 0.44008 0.444542 0.645704 0.335413
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.214286, recall: 0.214286, error: 0.785714
383. 
patient tongue id: 04012014026840_6_3
label yaofang:
柴胡 白芍 香附 黄芪 枸杞子 五味子 郁金 厚朴 佩兰 菟丝子 糯稻根 桑寄生 女贞子 浮小麦 麻黄根 墨旱莲
0.509085 0.383066 0.365769 0.356103 0.323783
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
384. 
patient tongue id: 02141834106990_2
label yaofang:
陈皮 法半夏 前胡 防风 麦冬 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.395039 0.750754 0.413379 0.828601 0.444204 0.544022 0.418221 0.396621 0.393773 0.397733 0.744419 0.812542 0.678077 0.789795 0.447981 0.882028 0.420308 0.309461 0.441735 0.560008 0.682291
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 0.937500, error: 0.285714
385. 
patient tongue id: 03012134200393_1_2
label yaofang:
甘草 柴胡 白芍 远志 党参 白术 酸枣仁 山药 车前子 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.974156 0.33012 0.522704 0.567652 0.420781 0.30956 0.339536 0.563702 0.518729 0.543422 0.453917 0.416303 0.427481
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.625000, error: 0.230769
386. 
patient tongue id: 03272242098637_1_3_7
label yaofang:
桃仁 何首乌 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 夏枯草
0.654375 0.339057 0.475176 0.338445
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.250000, recall: 0.090909, error: 0.750000
387. 
patient tongue id: 06082053373204_5
label yaofang:
半夏 枸杞子 赤芍 牡丹皮 杜仲 白茅根 荷叶 砂仁 麦芽 赭石 合欢皮 稻芽
0.487401 0.379595 0.364794 0.62676 0.632726 0.4457 0.360062 0.519878 0.328838
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
388. 
patient tongue id: 03141250569552_1_3
label yaofang:
人参 当归 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.58442 0.397843 0.409161 0.512897 0.414121 0.320913 0.344728
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
389. 
patient tongue id: 03062151385994_1_4
label yaofang:
当归 半夏 太子参 黄芪 鸡血藤 白术 海螵蛸 厚朴 砂仁 石斛 火麻仁 莪术 柿蒂 鸡内金 北沙参 紫苏梗 红豆杉 蛇舌草 稻芽
0.642032 0.403216 0.406812 0.574747 0.550049 0.408943 0.30822 0.384701
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.625000, recall: 0.263158, error: 0.375000
390. 
patient tongue id: 01041832131333_1_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 薄荷 荆芥穗 款冬花 紫菀 百部 蝉蜕 炙甘草 辛夷 紫苏梗 苍耳子
0.418231 0.887436 0.380774 0.947873 0.501916 0.621364 0.43858 0.410663 0.398104 0.384218 0.894296 0.937312 0.826415 0.918304 0.461009 0.96251 0.433691 0.468049 0.637261 0.813238
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.533333, error: 0.600000
391. 
patient tongue id: 03232313160518_2_5_6
label yaofang:
甘草 茯苓 党参 枸杞子 酸枣仁 丹参 黄连 生地黄 栀子 山茱萸 砂仁 女贞子 粉葛
0.890079 0.49878 0.532385 0.418088 0.330256 0.307804 0.302155 0.476848 0.350035 0.425222
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
392. 
patient tongue id: 05092142378900_2
label yaofang:
法半夏 茯苓 前胡 太子参 柏子仁 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 制远志 炒紫苏子 蜜麻黄
0.402312 0.766619 0.404531 0.859771 0.421124 0.552512 0.407784 0.387106 0.379149 0.388035 0.773575 0.842658 0.675965 0.811706 0.434219 0.911063 0.395978 0.31176 0.447533 0.541618 0.678338
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.875000, error: 0.333333
393. 
patient tongue id: 05102146051069_2_1
label yaofang:
白芍 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 山萸肉 炙甘草 沙苑子 制远志 盐菟丝子 酒女贞子 煅龙骨 炒酸枣仁
0.354891 0.743755 0.414634 0.818381 0.429833 0.46346 0.38636 0.357903 0.325602 0.718016 0.740867 0.610039 0.729038 0.40275 0.793325 0.325096 0.349838 0.406949 0.570119
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.157895, recall: 0.187500, error: 0.842105
394. 
patient tongue id: 03061458189619_2_1
label yaofang:
甘草 防风 鸡血藤 熟地黄 牡丹皮 乌梅 木瓜 莪术 珍珠母 蝉蜕 地肤子 土茯苓 徐长卿
0.378689 0.43328 0.310829 0.334433 0.344116 0.312237 0.36786 0.62201
predicted yaofang:
甘草 白芍 茯苓 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
395. 
patient tongue id: 02111353379767_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌
0.5067 0.352165 0.393283 0.482023 0.355888
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
396. 
patient tongue id: 03290700340959_2_6
label yaofang:
甘草 枳壳 法半夏 茯苓 连翘 党参 白术 黄连 槟榔 砂仁 莱菔子 天花粉 麦芽 紫苏梗 合欢花
0.953651 0.316411 0.499086 0.549511 0.399866 0.318566 0.47765 0.382426 0.415286
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.444444, recall: 0.266667, error: 0.555556
397. 
patient tongue id: 04062008003574_7_4
label yaofang:
黄芩 茯苓 羌活 栀子 杜仲 牛膝 钩藤 天麻 石决明 桑寄生 益母草 首乌藤 鹿衔草
0.434637 0.420279 0.380288 0.397297 0.310298 0.399296 0.520287
predicted yaofang:
甘草 白芍 党参 白术 浙贝母 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
398. 
patient tongue id: 04171835521873_3_1
label yaofang:
白芍 川芎 当归 茯苓 党参 白术 玄参 熟地黄 杜仲 山药 地骨皮 菟丝子 桑寄生 山萸肉 炙甘草
0.718047 0.338134 0.390689 0.467751 0.3898 0.311869
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
399. 
patient tongue id: 03101740290818_2_4
label yaofang:
法半夏 茯苓 前胡 太子参 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 广藿香 麸炒白术 炒六神曲
0.371029 0.357243 0.44131 0.440129 0.468595 0.334997 0.34195 0.363985 0.364229 0.39797 0.433308 0.36785 0.451653 0.471147 0.537956 0.318902 0.368268
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 蜜麻黄

------Score: precision: 0.588235, recall: 0.714286, error: 0.411765
400. 
patient tongue id: 03022141039631_4
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草
0.397852 0.3033 0.430614 0.306439 0.387441 0.373434 0.300242 0.308148 0.456198 0.551724
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 浙贝母 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.416667, error: 0.500000
401. 
patient tongue id: 02222338291741_6_2_1
label yaofang:
黄芪 白术 砂仁 珍珠母 夏枯草 北沙参 橘核 赭石 首乌藤 紫苏梗 红豆杉 合欢皮 墨旱莲
0.399347 0.33689 0.354849 0.428187
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
402. 
patient tongue id: 06191148483905_5
label yaofang:
甘草 法半夏 茯苓 前胡 浙贝母 细辛 桑白皮 天麻 鳖甲 款冬花 麦芽 苦杏仁 紫苏子 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.981319 0.538353 0.580929 0.383952 0.318316 0.314036 0.564237 0.500589 0.508351 0.424986 0.391697 0.390141
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.500000, error: 0.250000
403. 
patient tongue id: 03271408358225_1_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄
0.378154 0.806007 0.407736 0.867826 0.450752 0.510938 0.402356 0.375478 0.36542 0.326886 0.781148 0.838404 0.697232 0.816154 0.426876 0.890126 0.352535 0.408199 0.533811 0.701899
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
404. 
patient tongue id: 06031133028843_4_6
label yaofang:
甘草 枳壳 法半夏 茯苓 桔梗 党参 浙贝母 郁金 厚朴 鳖甲 火麻仁 款冬花 苦杏仁 白花蛇舌 天山雪莲
0.994323 0.559074 0.617853 0.379279 0.314985 0.634622 0.577983 0.568514 0.494182 0.441472 0.427572
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
405. 
patient tongue id: 01132115243283_2_7_1
label yaofang:
甘草 薏苡仁 丹参 浙贝母 薤白 瓜蒌皮 鳖甲 款冬花 莪术 紫菀 苦杏仁 降香 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.979166 0.524562 0.589867 0.384961 0.336668 0.329943 0.307302 0.585265 0.500505 0.514285 0.424458 0.394689 0.399915
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
406. 
patient tongue id: 03272002583273_4_1
label yaofang:
前胡 桔梗 防风 钩藤 荆芥穗 白芷 香薷 百部 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.347892 0.426565 0.396943 0.489476 0.306236 0.34471 0.361017 0.380659 0.495589 0.380491 0.522731 0.554498 0.701618 0.361607
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.285714, recall: 0.285714, error: 0.714286
407. 
patient tongue id: 04181159203581_1_2_7
label yaofang:
甘草 茯苓 木香 牡蛎 麦冬 党参 黄芪 酸枣仁 丹参 草豆蔻 浮小麦 首乌藤 制远志
0.510082 0.371158 0.396444 0.428858 0.361656
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
408. 
patient tongue id: 06051108214309_1_7_4
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子
0.581473 0.341596 0.509957 0.464587 0.445528 0.493262 0.379297 0.396037 0.350606 0.388781 0.359232 0.440383 0.45559 0.428772 0.378854 0.377214
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.125000, recall: 0.181818, error: 0.875000
409. 
patient tongue id: 02171959301394_2
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.349406 0.730944 0.412937 0.794995 0.393326 0.484677 0.388591 0.331995 0.316408 0.312879 0.69217 0.752468 0.627546 0.735778 0.428229 0.803229 0.365594 0.382072 0.482533 0.654548
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
410. 
patient tongue id: 02151816080847_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.417367 0.333599 0.356048 0.406638 0.362969
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
411. 
patient tongue id: 05042121273771_1_4
label yaofang:
甘草 当归 茯苓 牛蒡子 党参 白术 海螵蛸 干姜 补骨脂 浮小麦 瓦楞子
0.304033 0.372309 0.370914 0.31787 0.332379 0.343227 0.460513 0.558452 0.308733
predicted yaofang:
甘草 白芍 党参 黄芪 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.444444, recall: 0.363636, error: 0.555556
412. 
patient tongue id: 05140652280503_4_1
label yaofang:
甘草 茯苓 独活 党参 鸡血藤 白术 红花 山药 天麻 鳖甲 扁豆花 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.983444 0.539363 0.587968 0.380706 0.310793 0.316671 0.576748 0.510381 0.517476 0.425494 0.390693 0.399786
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
413. 
patient tongue id: 02231751486195_1_6
label yaofang:
白芍 川芎 法半夏 当归 茯苓 木香 丹参 川楝子 郁金 北柴胡 炙甘草 麸炒白术 醋香附 麸炒枳壳
0.383916 0.839057 0.400338 0.914571 0.475527 0.566651 0.412515 0.400318 0.376896 0.384378 0.844286 0.897922 0.75601 0.872458 0.444865 0.929469 0.398666 0.428642 0.567344 0.749779
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.214286, error: 0.850000
414. 
patient tongue id: 02231911171128_4
label yaofang:
陈皮 法半夏 葛根 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子
0.369575 0.752852 0.412792 0.815707 0.41599 0.454243 0.389206 0.346142 0.324183 0.71084 0.759198 0.620735 0.740019 0.423899 0.814647 0.333549 0.349862 0.438556 0.616003
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
415. 
patient tongue id: 03111744118922_1_6_7
label yaofang:
甘草 桔梗 桃仁 远志 党参 浙贝母 山药 旋覆花 莪术 紫菀 白花蛇舌草 地龙 丝瓜络 醋鳖甲
0.963193 0.506901 0.578177 0.392655 0.322395 0.318054 0.541904 0.42673 0.461334 0.337706 0.327287 0.338996
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
416. 
patient tongue id: 05140849462443_5
label yaofang:
甘草 柴胡 黄芩 前胡 桔梗 金银花 连翘 牛蒡子 浙贝母 桑叶 款冬花 苦杏仁 炙麻黄 大青叶 青天葵
0.989447 0.338622 0.555619 0.596008 0.387938 0.310687 0.324112 0.301185 0.590124 0.536449 0.542686 0.465165 0.415344 0.411962
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.142857, recall: 0.133333, error: 0.857143
417. 
patient tongue id: 06171319062069_6_1_4
label yaofang:
甘草 炮山甲
0.735085 0.307998 0.363816 0.480909 0.353873 0.328852
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.500000, error: 0.833333
418. 
patient tongue id: 04071920526043_1_4
label yaofang:
甘草 陈皮 茯苓 薏苡仁 佩兰 赤小豆 芡实 豆蔻 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶
0.405926 0.659338 0.382283 0.760473 0.413786 0.48314 0.387656 0.355147 0.367457 0.371726 0.672389 0.764216 0.617081 0.735445 0.450759 0.849359 0.375134 0.336348 0.393744 0.467695 0.576503
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.142857, recall: 0.214286, error: 0.857143
419. 
patient tongue id: 04071426139150_4_2
label yaofang:
法半夏 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.391374 0.774457 0.428067 0.839133 0.450081 0.478895 0.427053 0.380011 0.361245 0.334376 0.744246 0.793791 0.655185 0.774399 0.448414 0.855274 0.346118 0.393944 0.517703 0.675316
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
420. 
patient tongue id: 04062017143715_4_6
label yaofang:
白芍 当归 木香 党参 白术 海螵蛸 肉桂 肉豆蔻 诃子 炙甘草
0.533602 0.351279 0.393197 0.426823 0.411871
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
421. 
patient tongue id: 01211233218159_4
label yaofang:
黄芩 前胡 桔梗 牛蒡子 桑白皮 天花粉 淡竹叶 旋覆花 枇杷叶 赭石 紫苏叶 化橘红
0.586481 0.320647 0.389626 0.405994 0.405198 0.302976
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
422. 
patient tongue id: 01172349445113_1
label yaofang:
甘草 半夏 黄芪 白术 海螵蛸 浙贝母 杜仲 厚朴 石斛 鸡内金 紫苏梗 合欢皮 蛇舌草 云芝
0.926307 0.485784 0.535349 0.472818 0.320607 0.461344 0.37225 0.486302 0.301253 0.309274
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
423. 
patient tongue id: 04282300052667_7_1_6
label yaofang:
甘草 川芎 枸杞子 酸枣仁 生地黄 赤芍 杜仲 牛膝 天麻 全蝎 桑寄生 麦芽 蒺藜 女贞子 粉葛
0.984086 0.314181 0.546803 0.594266 0.387772 0.326356 0.322573 0.587187 0.537865 0.541781 0.461864 0.424112 0.428809
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.200000, error: 0.769231
424. 
patient tongue id: 05140847204491_5_6
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 青皮 浙贝母 郁金 天花粉 瓜蒌皮 款冬花 苦杏仁 紫苏梗
0.973713 0.505884 0.582442 0.394849 0.320747 0.313815 0.556281 0.462648 0.492667 0.38049 0.369482 0.383425
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
425. 
patient tongue id: 03012032234830_6_5
label yaofang:
甘草 茯苓 木香 党参 白术 黄连 砂仁 天麻 鳖甲 柿蒂 粉葛 建曲 蜈蚣 白花蛇舌 天山雪莲 瓦楞子
0.465318 0.346319 0.384879 0.374807 0.423196 0.320411
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.666667, recall: 0.250000, error: 0.333333
426. 
patient tongue id: 05131640337311_5_6
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 白术 厚朴 莱菔子 天麻 扁豆花 豆蔻 苦杏仁 紫苏子
0.980012 0.503152 0.612892 0.389759 0.3691 0.627323 0.50102 0.563028 0.412213 0.429162 0.506175
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
427. 
patient tongue id: 03222002224981_1_4
label yaofang:
甘草 白芍 川芎 独活 杜仲 牛膝 细辛 车前子 干姜 广藿香 蜈蚣 姜黄 海桐皮 鹿衔草
0.456967 0.300853 0.436776 0.380267 0.397034 0.319362 0.412754 0.499365
predicted yaofang:
甘草 柴胡 白芍 党参 白术 浙贝母 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
428. 
patient tongue id: 05180837279222_2_7_6
label yaofang:
甘草 党参 酸枣仁 丹参 浙贝母 郁金 山药 天麻 鳖甲 白花蛇舌草 蜈蚣 天山雪莲 合欢花 半枝莲
0.981848 0.52253 0.614713 0.382051 0.373286 0.645437 0.522361 0.558119 0.432393 0.437876 0.509549
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
429. 
patient tongue id: 05140841095315_1_2_6
label yaofang:
甘草 茯苓 独活 党参 酸枣仁 生地黄 红花 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.988642 0.303208 0.545318 0.606534 0.362515 0.330612 0.311473 0.62493 0.554762 0.544259 0.475242 0.431318 0.431973
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.666667, error: 0.230769
430. 
patient tongue id: 04291507408301_2_6
label yaofang:
甘草 远志 山茱萸 厚朴 荷叶 天麻 磁石 肉苁蓉 火麻仁 补骨脂 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲
0.983902 0.51417 0.631581 0.413504 0.378763 0.660501 0.540921 0.594468 0.458859 0.457897 0.528903
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
431. 
patient tongue id: 04132048179517_1_4
label yaofang:
甘草 枳壳 茯苓 木香 独活 党参 白术 砂仁 天麻 鳖甲 补骨脂 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲
0.877552 0.309143 0.470926 0.526958 0.399292 0.311537 0.448272 0.308288 0.354266
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.777778, recall: 0.437500, error: 0.222222
432. 
patient tongue id: 04131804334165_2_7
label yaofang:
甘草 党参 黄芪 酸枣仁 生地黄 牡丹皮 山茱萸 天麻 金樱子 桑螵蛸 地龙 浮小麦 首乌藤
0.957043 0.319933 0.51901 0.540031 0.412521 0.340259 0.4974 0.472721 0.483146 0.405049 0.364359 0.352851
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
433. 
patient tongue id: 06082052056015_1_6
label yaofang:
桂枝 枳壳 桃仁 太子参 白术 丹参 郁金 厚朴 僵蚕 莪术 柿蒂 北沙参 赭石 蜈蚣 合欢皮 预知子
0.431545 0.401536 0.498885 0.430114 0.475664
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
434. 
patient tongue id: 01090020278958_1
label yaofang:
桂枝 白芍 大枣 茯苓 白术 附子 大黄 天麻 天山雪莲
0.573063 0.363996 0.385629 0.364585 0.426399
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.222222, error: 0.600000
435. 
patient tongue id: 03041405102724_1_6_8
label yaofang:
甘草 白芍 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 白术 款冬花 白前 枇杷叶 紫苏梗 广藿香 浙贝母粉
0.976484 0.515019 0.578209 0.400856 0.302949 0.321518 0.539347 0.470223 0.501159 0.39542 0.372285 0.388248
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
436. 
patient tongue id: 01211258129104_7_1
label yaofang:
白芍 川芎 香附 当归 白术 丹参 熟地黄 益母草 茺蔚子 艾叶
0.573365 0.345559 0.360829 0.422572 0.360117
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
437. 
patient tongue id: 02191442503443_1_7
label yaofang:
甘草 茯苓 桃仁 熟地黄 牡丹皮 杜仲 郁金 山药 山茱萸 泽泻 桑寄生 三棱 莪术 王不留行
0.984221 0.543646 0.594425 0.377249 0.329957 0.30701 0.588297 0.512745 0.510534 0.429673 0.394902 0.406667
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
438. 
patient tongue id: 02142145154899_1_2
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.99084 0.526748 0.643477 0.413383 0.412 0.318328 0.713159 0.613421 0.653078 0.540101 0.527075 0.591198
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
439. 
patient tongue id: 04111956262245_2_4
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 车前子 麦芽 茺蔚子 赭石 泽兰 龟甲
0.972453 0.509423 0.581456 0.387836 0.319441 0.309887 0.575946 0.479333 0.498094 0.403965 0.381678 0.38765
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.076923, error: 0.916667
440. 
patient tongue id: 05182038500290_4
label yaofang:
枳壳 桔梗 牛蒡子 党参 白术 旋覆花 紫菀 百部 北沙参 紫苏子 炙甘草 紫苏梗 化橘红
0.31911 0.303731 0.432231 0.333957 0.377658 0.336315 0.317502 0.495833 0.646953 0.321902
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 浙贝母 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.300000, recall: 0.230769, error: 0.700000
441. 
patient tongue id: 03291647313649_1_2_6
label yaofang:
甘草 党参 酸枣仁 生地黄 山药 山茱萸 天麻 桑寄生 鳖甲 补骨脂 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.82715 0.422967 0.512527 0.319011 0.441319
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
442. 
patient tongue id: 03012051032875_6_7
label yaofang:
甘草 柴胡 白芍 香附 党参 酸枣仁 生地黄 桑寄生 女贞子 续断 合欢花 鱼古
0.984556 0.521159 0.576666 0.387483 0.30597 0.542172 0.47432 0.498674 0.391283 0.35393 0.363185
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.166667, error: 0.818182
443. 
patient tongue id: 03181802505956_1_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 郁金 山药 天麻 鳖甲 莪术 续断 蜈蚣 天山雪莲 半枝莲 骨碎补
0.979407 0.532009 0.586811 0.369373 0.331898 0.303063 0.300531 0.593564 0.5048 0.507804 0.428948 0.395006 0.389065
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.666667, error: 0.230769
444. 
patient tongue id: 02191440325559_6_4
label yaofang:
甘草 川芎 茯苓 党参 白术 酸枣仁 栀子 杜仲 钩藤 天麻 桑寄生 补骨脂 麦芽 红景天
0.978007 0.529551 0.588401 0.395848 0.345465 0.329358 0.314911 0.594332 0.514895 0.527334 0.43516 0.409555 0.421626
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
445. 
patient tongue id: 05222207555699_4
label yaofang:
防风 钩藤 荆芥穗 白芷 香薷 炙甘草 辛夷 首乌藤 紫苏梗 广藿香 威灵仙 炒苍耳子 炒蔓荆子 棉萆薢
0.305877 0.407304 0.404002 0.319156 0.315398 0.346498 0.377017 0.559069
predicted yaofang:
甘草 法半夏 茯苓 前胡 黄芪 紫菀 北沙参 炙甘草

------Score: precision: 0.125000, recall: 0.071429, error: 0.875000
446. 
patient tongue id: 04132049296799_7_5
label yaofang:
桂枝 甘草 川芎 当归 金银花 蒲公英 紫花地丁 黄芪 生地黄 红花 赤芍 吴茱萸 白鲜皮 地肤子
0.854158 0.345109 0.435074 0.500713 0.381049 0.302605 0.363508
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
447. 
patient tongue id: 05140851543837_6_2_7
label yaofang:
甘草 茯苓 龙骨 麦冬 太子参 酸枣仁 丹参 五味子 红花 山茱萸 补骨脂 女贞子 鹿角霜 浮小麦 墨旱莲
0.994055 0.323195 0.5724 0.619219 0.382619 0.338194 0.32136 0.300264 0.633609 0.577198 0.58576 0.499918 0.448629 0.453384
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.214286, recall: 0.200000, error: 0.785714
448. 
patient tongue id: 03211940081317_3_6
label yaofang:
桂枝 甘草 海螵蛸 肉桂 干姜 砂仁 吴茱萸 附片 徐长卿
0.323902 0.455247 0.362449 0.340004 0.308268 0.367164 0.371147 0.325702 0.641126 0.689819 0.330178
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.181818, recall: 0.222222, error: 0.818182
449. 
patient tongue id: 04181146080517_1_4_7
label yaofang:
甘草 枳壳 法半夏 当归 茯苓 木香 党参 黄芪 丹参 厚朴 鸡内金 草豆蔻 麦芽
0.520793 0.361079 0.366708 0.425253 0.42408 0.367502 0.32224
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 天麻

------Score: precision: 0.714286, recall: 0.384615, error: 0.285714
450. 
patient tongue id: 03020723417286_1_2
label yaofang:
甘草 茯苓 太子参 酸枣仁 山药 天麻 鳖甲 北沙参 白扁豆 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.988377 0.534949 0.642895 0.415528 0.452608 0.302582 0.332067 0.702552 0.618884 0.659591 0.548399 0.550122 0.633414
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
451. 
patient tongue id: 02212022235456_2_7
label yaofang:
甘草 白芍 生地黄 红花 延胡索 赤芍 杜仲 牛膝 山茱萸 蒺藜 续断 浮小麦 骨碎补 宽筋藤 牛大力
0.987027 0.342198 0.552467 0.580335 0.377809 0.321123 0.57456 0.536373 0.533837 0.458745 0.407943 0.399206
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.066667, error: 0.916667
452. 
patient tongue id: 04062022569165_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.340428 0.650045 0.414845 0.672158 0.377848 0.434503 0.350935 0.334182 0.337701 0.323701 0.550358 0.688702 0.4951 0.599469 0.355451 0.800882 0.363731 0.349165 0.491305
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
453. 
patient tongue id: 05032242183271_6_1_2
label yaofang:
甘草 陈皮 茯苓 党参 白术 酸枣仁 山药 天麻 菟丝子 益母草 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.977923 0.504034 0.617483 0.406297 0.392379 0.645592 0.529864 0.574709 0.463906 0.458911 0.540319
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
454. 
patient tongue id: 03020849497259_6_4
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 法半夏 茯苓 龙骨 党参 白术 酸枣仁 干姜 扁豆花 浮小麦
0.93041 0.470809 0.544488 0.489764 0.304916 0.30889 0.446158 0.336851 0.476808
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
455. 
patient tongue id: 01250640459767_4_6
label yaofang:
甘草 前胡 橘红 薏苡仁 桃仁 远志 浙贝母 细辛 桑白皮 紫菀 苇茎 北沙参 苦杏仁 瓜蒌子 炙麻黄
0.972565 0.525833 0.5839 0.400411 0.352492 0.324874 0.319068 0.608445 0.528197 0.54543 0.464165 0.432353 0.443671
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.133333, error: 0.846154
456. 
patient tongue id: 06140824471832_1_3_5
label yaofang:
甘草 桔梗 防风 金银花 太子参 藿香 白前 白鲜皮 六神曲 蜜百部 干鱼腥草 地肤子
0.391233 0.660466 0.406874 0.446643 0.64799 0.483777 0.510723 0.521313 0.562328 0.543867 0.660407 0.412873 0.652836 0.589491 0.655374
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.066667, recall: 0.083333, error: 0.933333
457. 
patient tongue id: 01111850402783_1
label yaofang:
甘草 陈皮 茯苓 佩兰 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶 炒稻芽 炒鸡内金 木棉花 炒麦芽
0.390418 0.917997 0.363027 0.967748 0.484322 0.655142 0.414065 0.39388 0.388057 0.401779 0.921965 0.961833 0.838564 0.939507 0.44907 0.9819 0.413043 0.471502 0.632978 0.823766
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.214286, error: 0.850000
458. 
patient tongue id: 02212036343235_1_2
label yaofang:
甘草 茯苓 党参 黄芪 鸡血藤 丹参 生地黄 延胡索 杜仲 山药 桑寄生 补骨脂 地龙 续断 牛大力
0.719493 0.432218 0.398133 0.433557 0.498361 0.326568
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
459. 
patient tongue id: 05181043267137_6_2_7
label yaofang:
桂枝 甘草 党参 黄芪 白术 红花 赤芍 地黄 天麻 白花蛇舌草 忍冬藤 蜈蚣 半枝莲 醋鳖甲
0.982882 0.516906 0.605426 0.405149 0.359439 0.637896 0.549029 0.597633 0.465404 0.469603 0.517307
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
460. 
patient tongue id: 01110351380577_1
label yaofang:
茯苓 麦冬 阿胶 酸枣仁 五味子 泽泻 滑石 猪苓
0.436723 0.329992 0.33027 0.373003 0.317816 0.407606 0.410871
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.142857, recall: 0.125000, error: 0.857143
461. 
patient tongue id: 03022140224422_6
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 鳖甲 姜半夏 紫苏叶 广藿香
0.717416 0.424725 0.424855 0.311627 0.324871
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
462. 
patient tongue id: 04131822166239_6_2_1
label yaofang:
甘草 桔梗 薏苡仁 白及 太子参 仙鹤草 茜草 天麻 鳖甲 补骨脂 蜈蚣 白花蛇舌 天山雪莲 红豆杉 龙葵果
0.951005 0.498107 0.568353 0.442173 0.33824 0.302903 0.525435 0.434835 0.509578 0.365638 0.352515 0.389328
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
463. 
patient tongue id: 05272345494049_4_1_6
label yaofang:
黄芪 白术 砂仁 桑寄生 莲子 白鲜皮 续断 橘络 首乌藤 土鳖虫 红豆杉 合欢皮 山慈菇
0.533722 0.403817 0.395687 0.432681 0.356856
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
464. 
patient tongue id: 03292132476263_4
label yaofang:
麻黄 陈皮 荆芥 防风 石菖蒲 僵蚕 紫菀 白前 百部 炙甘草 辛夷 苍耳子 芥子 青果 咸竹蜂
0.558284 0.350373 0.450548 0.455896 0.384748 0.440903 0.35085 0.36409 0.352887 0.340572 0.351706 0.440656 0.336739 0.303727
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 决明子 夏枯草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
465. 
patient tongue id: 06111111314336_7_5
label yaofang:
甘草 当归 金银花 紫花地丁 党参 黄芪 鸡血藤 白术 生地黄 红花 赤芍 细辛 白芷 吴茱萸 麦芽 忍冬藤 白花蛇舌
0.86109 0.47759 0.470537 0.361356 0.318317
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.176471, error: 0.400000
466. 
patient tongue id: 01121854577887_2
label yaofang:
陈皮 法半夏 前胡 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子
0.410728 0.844928 0.400778 0.914384 0.485277 0.570853 0.423582 0.374059 0.363897 0.373883 0.840071 0.889661 0.753632 0.870284 0.427603 0.918111 0.430729 0.442712 0.567152 0.743915
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
467. 
patient tongue id: 03062146371053_3_1_4
label yaofang:
桂枝 甘草 枳壳 当归 茯苓 黄芪 白术 干姜 厚朴 僵蚕 磁石 肉苁蓉 鸡内金 辛夷
0.646671 0.393285 0.428455 0.409634 0.370767
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
468. 
patient tongue id: 01052205228854_6_1_7
label yaofang:
甘草 茯苓 半夏 橘红 黄芪 白术 厚朴 砂仁 桑寄生 女贞子 桑枝 土鳖虫 墨旱莲 素馨花
0.761042 0.363023 0.464234 0.440635 0.340271 0.3547
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
469. 
patient tongue id: 04261349477632_5_1_7
label yaofang:
当归 牡蛎 党参 黄芪 白术 丹参 延胡索 赤芍 山药 仙鹤草 砂仁 补骨脂 红豆杉 三七粉
0.527421 0.360445 0.343646 0.423516 0.49237 0.354796 0.340708
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
470. 
patient tongue id: 01180623249871_2_6_4
label yaofang:
甘草 法半夏 当归 茯苓 桃仁 远志 天麻 鳖甲 款冬花 川贝母 苦杏仁 紫苏子 炙麻黄 蜈蚣 白花蛇舌 半枝莲
0.86576 0.300131 0.348807 0.484363 0.466658 0.380187 0.327724 0.389387 0.311247 0.365387
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.600000, recall: 0.375000, error: 0.400000
471. 
patient tongue id: 06132017147509_2_5
label yaofang:
甘草 半夏 蒲公英 赤芍 牡丹皮 郁金 僵蚕 没药 莪术 柿蒂 北沙参 蜈蚣 冬凌草
0.572614 0.395463 0.344201 0.359797 0.575985 0.593309 0.344664 0.451263 0.364741 0.325761 0.43437 0.323917
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
472. 
patient tongue id: 01312129035283_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 白术 厚朴 豆蔻 麦芽 丝瓜络 紫苏梗 广藿香 麸炒枳壳
0.955715 0.321226 0.501873 0.56714 0.406106 0.320404 0.346199 0.533068 0.44253 0.477483 0.368213 0.352294 0.366305
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.230769, error: 0.769231
473. 
patient tongue id: 03012206012293_2_6
label yaofang:
甘草 白芍 党参 酸枣仁 生地黄 乌药 山药 山茱萸 泽泻 鳖甲 芡实 桑螵蛸 益智 五倍子 路路通
0.994297 0.566888 0.642687 0.402365 0.373569 0.306829 0.313016 0.660677 0.581116 0.600735 0.501443 0.475073 0.502189
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
474. 
patient tongue id: 06111033158055_4_1
label yaofang:
甘草 独活 党参 黄芪 丹参 生地黄 杜仲 牛膝 山茱萸 水蛭 桑寄生 补骨脂 鹿角霜 续断 川加皮 牛大力
0.988037 0.307196 0.550105 0.599713 0.393509 0.325254 0.308393 0.306762 0.594797 0.542316 0.549259 0.46656 0.420487 0.412931
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.142857, recall: 0.125000, error: 0.857143
475. 
patient tongue id: 04271515340045_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.486082 0.329533 0.442449 0.414252 0.436841 0.434264 0.347864 0.322573 0.319292 0.355518 0.314178
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻 莱菔子 天麻 决明子

------Score: precision: 0.636364, recall: 0.583333, error: 0.363636
476. 
patient tongue id: 02281201118459_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 郁金 山药 天花粉 北沙参
0.534341 0.353851 0.40356 0.42129 0.481778 0.412231 0.339046 0.318172
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
477. 
patient tongue id: 02212027220836_2_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 苍术 山药 厚朴 扁豆花 三棱 豆蔻 麦芽 苦杏仁
0.971746 0.518608 0.585587 0.395955 0.339752 0.31213 0.308049 0.594677 0.50234 0.5168 0.427619 0.408096 0.422934
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.384615, error: 0.615385
478. 
patient tongue id: 04202207212477_2_4_5
label yaofang:
甘草 白芍 前胡 橘红 太子参 丹参 五味子 赤芍 浙贝母 山药 桑白皮 茵陈 紫菀 虎杖 黄精 白花蛇舌
0.833036 0.444797 0.501189 0.459482 0.356944 0.354644
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.062500, error: 0.833333
479. 
patient tongue id: 06181657246058_5
label yaofang:
甘草 薏苡仁 蒲公英 黄芪 白术 丹参 赤芍 牡丹皮 郁金 厚朴 僵蚕 莪术 虎杖 北沙参 蒺藜 郁李仁 紫苏叶 预知子 蛇舌草
0.468467 0.403125 0.459803 0.445799 0.469526
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.800000, recall: 0.210526, error: 0.200000
480. 
patient tongue id: 04210741513835_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.631629 0.43167 0.401318 0.397959 0.477925
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
481. 
patient tongue id: 04211339438450_2_4
label yaofang:
白芍 川芎 法半夏 当归 茯苓 木香 丹参 川楝子 郁金 北柴胡 豆蔻 炙甘草 广藿香 麸炒白术 醋香附 麸炒枳壳
0.379832 0.761332 0.422804 0.852084 0.453138 0.500621 0.419769 0.390121 0.369104 0.346284 0.765691 0.82479 0.67412 0.788539 0.455718 0.875274 0.367994 0.392173 0.492092 0.688852
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
482. 
patient tongue id: 05232121505972_1_4_7
label yaofang:
甘草 陈皮 薏苡仁 党参 白术 海螵蛸 浙贝母 牡丹皮 厚朴 紫草 夏枯草 白鲜皮 紫苏叶 土茯苓
0.446919 0.396211 0.54015 0.437955 0.498722
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
483. 
patient tongue id: 02020824487538_2_7_6
label yaofang:
甘草 木香 党参 酸枣仁 熟地黄 砂仁 天麻 鳖甲 三棱 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.984971 0.516749 0.605557 0.409817 0.346553 0.314031 0.641942 0.539964 0.584984 0.446499 0.438512 0.475988
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
484. 
patient tongue id: 01172250080546_2_7
label yaofang:
甘草 桃仁 党参 丹参 生地黄 红花 赤芍 牡丹皮 车前子 益母草 决明子 麦芽 木贼 有瓜石斛
0.901379 0.351947 0.497425 0.494428 0.389981 0.303992 0.425008 0.348421 0.37701
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣

------Score: precision: 0.222222, recall: 0.142857, error: 0.777778
485. 
patient tongue id: 03282205087340_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 珍珠母 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.50211 0.417508 0.320561 0.394303 0.37107 0.337975 0.318717 0.456834
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
486. 
patient tongue id: 04271825429299_5
label yaofang:
麻黄 甘草 柴胡 黄芩 牛蒡子 厚朴 川贝母 枇杷叶 地龙 苦杏仁 蝉蜕 岗梅
0.479296 0.375223 0.350559 0.550941 0.561355 0.326852 0.306458 0.374862 0.328318 0.368472
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 浙贝母 厚朴 砂仁 北沙参

------Score: precision: 0.200000, recall: 0.166667, error: 0.800000
487. 
patient tongue id: 06132027237493_1_4_6
label yaofang:
陈皮 前胡 半夏 荆芥 浙贝母 僵蚕 百部 苦杏仁 紫苏子 蝉蜕 紫苏叶 人参叶 紫苑
0.571914 0.385095 0.331253 0.347993 0.605707 0.614441 0.440475 0.360896 0.317363 0.461814 0.315562
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.090909, recall: 0.076923, error: 0.909091
488. 
patient tongue id: 04181954003347_6_4
label yaofang:
甘草 柴胡 白芍 香附 当归 茯苓 薄荷 枸杞子 白术 车前子 菟丝子 麦芽 续断 广藿香
0.645513 0.379822 0.384368 0.454483 0.386985 0.332055
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
489. 
patient tongue id: 05090825133960_1_2
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 泽泻 干姜
0.711646 0.355269 0.392488 0.46975 0.351754
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.416667, error: 0.000000
490. 
patient tongue id: 04201421035590_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.461135 0.603568 0.437366 0.44047 0.586112 0.472465 0.488625 0.488958 0.515867 0.492852 0.596171 0.457452 0.578936 0.542475 0.564745
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
491. 
patient tongue id: 04141811589020_1_4_6
label yaofang:
半夏 党参 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 牛膝 山药 厚朴 砂仁 僵蚕 莪术 鸡内金 麦芽 紫苏梗 鲜龙葵果
0.542038 0.413174 0.361156 0.343676 0.333553
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.400000, recall: 0.111111, error: 0.600000
492. 
patient tongue id: 04202057308588_6
label yaofang:
柴胡 大枣 茯苓 防风 连翘 牛蒡子 太子参 昆布 海藻 乌梅 石斛 白花蛇舌草 猫爪草 山慈菇 黄药子
0.364751 0.396374 0.344656 0.303864 0.331041
predicted yaofang:
甘草 党参 黄芪 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
493. 
patient tongue id: 04241859190325_1_4
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.562926 0.384555 0.348038 0.413267 0.388894 0.319432 0.381927
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 炙甘草

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
494. 
patient tongue id: 03211847446186_4_1
label yaofang:
法半夏 茯苓 前胡 防风 钩藤 白芷 款冬花 百部 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子
0.360805 0.737144 0.422604 0.79587 0.426835 0.464332 0.412612 0.37737 0.37118 0.32931 0.703221 0.768859 0.628625 0.734363 0.448792 0.827409 0.34204 0.376173 0.478969 0.663297
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.692308, error: 0.550000
495. 
patient tongue id: 04200629521828_1
label yaofang:
甘草 白芍 独活 党参 白术 生地黄 红花 延胡索 桑寄生 补骨脂 锁阳 续断 牛大力 千斤拔
0.879769 0.309541 0.462519 0.490565 0.393247 0.338767 0.379966 0.331477
predicted yaofang:
甘草 白芍 茯苓 党参 白术 浙贝母 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
496. 
patient tongue id: 04291457028674_4_1
label yaofang:
甘草 党参 杜仲 郁金 地黄 天麻 桑寄生 莪术 白花蛇舌草 续断 蜈蚣 半枝莲 醋鳖甲 炒鸡内金
0.978768 0.53466 0.602804 0.403023 0.390392 0.30161 0.319733 0.639387 0.55658 0.582154 0.489565 0.473524 0.511099
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
497. 
patient tongue id: 04271908230481_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香
0.482062 0.407062 0.518689 0.310482 0.376769 0.435422 0.511369 0.338275 0.452478 0.341306 0.688967
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
498. 
patient tongue id: 04102102518658_7_6
label yaofang:
桂枝 龙骨 麦冬 党参 丹参 生地黄 海螵蛸 车前子 仙鹤草 砂仁 淫羊藿 火麻仁 炙甘草
0.497046 0.321051 0.381154 0.324063 0.455908
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
499. 
patient tongue id: 03020659163910_5_6
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桃仁 远志 五味子 细辛 干姜 款冬花 白前 炙麻黄 苍耳子
0.951524 0.506643 0.551557 0.400416 0.319087 0.504156 0.407185 0.446395 0.33097 0.309348 0.315078
predicted yaofang:
甘草 茯苓 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
------Average Score: average precision: 0.430469, average recall: 0.350619, error: 0.569531
