5216/8539 [=================>............] - ETA: 38s - loss: 0.17962017-10-20 13:22:48.101088: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:247] PoolAllocator: After 31538 get requests, put_count=31534 evicted_count=1000 eviction_rate=0.0317118 and unsatisfied allocation rate=0.0350054
2017-10-20 13:22:48.101148: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
8512/8539 [============================>.] - ETA: 0s - loss: 0.1509Epoch 00000: val_loss improved from inf to 0.08954, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 99s - loss: 0.1507 - val_loss: 0.0895
Epoch 2/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0963Epoch 00001: val_loss improved from 0.08954 to 0.08030, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 96s - loss: 0.0963 - val_loss: 0.0803
Epoch 3/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0903Epoch 00002: val_loss improved from 0.08030 to 0.07823, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0903 - val_loss: 0.0782
Epoch 4/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0875Epoch 00003: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0875 - val_loss: 0.0791
Epoch 5/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0855Epoch 00004: val_loss improved from 0.07823 to 0.07715, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0856 - val_loss: 0.0772
Epoch 6/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0840Epoch 00005: val_loss improved from 0.07715 to 0.07709, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0840 - val_loss: 0.0771
Epoch 7/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0833Epoch 00006: val_loss improved from 0.07709 to 0.07606, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0833 - val_loss: 0.0761
Epoch 8/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0821Epoch 00007: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0821 - val_loss: 0.0812
Epoch 9/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0811Epoch 00008: val_loss improved from 0.07606 to 0.07591, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0811 - val_loss: 0.0759
Epoch 10/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0806Epoch 00009: val_loss improved from 0.07591 to 0.07490, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0806 - val_loss: 0.0749
Epoch 11/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0798Epoch 00010: val_loss improved from 0.07490 to 0.07391, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0798 - val_loss: 0.0739
Epoch 12/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0793Epoch 00011: val_loss improved from 0.07391 to 0.07361, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0793 - val_loss: 0.0736
Epoch 13/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0786Epoch 00012: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0787 - val_loss: 0.0740
Epoch 14/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0783Epoch 00013: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0783 - val_loss: 0.0743
Epoch 15/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0776Epoch 00014: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0776 - val_loss: 0.0741
Epoch 16/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0773Epoch 00015: val_loss improved from 0.07361 to 0.07332, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0773 - val_loss: 0.0733
Epoch 17/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0768Epoch 00016: val_loss improved from 0.07332 to 0.07300, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0768 - val_loss: 0.0730
Epoch 18/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0766Epoch 00017: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0766 - val_loss: 0.0734
Epoch 19/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0763Epoch 00018: val_loss improved from 0.07300 to 0.07291, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0763 - val_loss: 0.0729
Epoch 20/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0760Epoch 00019: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0760 - val_loss: 0.0730
Epoch 21/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0754Epoch 00020: val_loss improved from 0.07291 to 0.07280, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0754 - val_loss: 0.0728
Epoch 22/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0752Epoch 00021: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0752 - val_loss: 0.0733
Epoch 23/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0749Epoch 00022: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0749 - val_loss: 0.0728
Epoch 24/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0747Epoch 00023: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0747 - val_loss: 0.0739
Epoch 25/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0745Epoch 00024: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0746 - val_loss: 0.0729
Epoch 26/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0738Epoch 00025: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0738 - val_loss: 0.0731
Epoch 27/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0736Epoch 00026: val_loss improved from 0.07280 to 0.07249, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0736 - val_loss: 0.0725
Epoch 28/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0735Epoch 00027: val_loss improved from 0.07249 to 0.07202, saving model to /home/superhy/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
8539/8539 [==============================] - 97s - loss: 0.0735 - val_loss: 0.0720
Epoch 29/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0733Epoch 00028: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0733 - val_loss: 0.0730
Epoch 30/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0732Epoch 00029: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0732 - val_loss: 0.0729
Epoch 31/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0729Epoch 00030: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0728 - val_loss: 0.0734
Epoch 32/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0726Epoch 00031: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0726 - val_loss: 0.0737
Epoch 33/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0723Epoch 00032: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0723 - val_loss: 0.0728
Epoch 34/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0720Epoch 00033: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0720 - val_loss: 0.0727
Epoch 35/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0718Epoch 00034: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0718 - val_loss: 0.0729
Epoch 36/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0715Epoch 00035: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0716 - val_loss: 0.0732
Epoch 37/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0714Epoch 00036: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0714 - val_loss: 0.0730
Epoch 38/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0713Epoch 00037: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0713 - val_loss: 0.0726
Epoch 39/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0708Epoch 00038: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0708 - val_loss: 0.0728
Epoch 40/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0707Epoch 00039: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0707 - val_loss: 0.0726
Epoch 41/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0705Epoch 00040: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0705 - val_loss: 0.0728
Epoch 42/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0704Epoch 00041: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0704 - val_loss: 0.0728
Epoch 43/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0701Epoch 00042: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0701 - val_loss: 0.0737
Epoch 44/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0699Epoch 00043: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0699 - val_loss: 0.0735
Epoch 45/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0696Epoch 00044: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0696 - val_loss: 0.0735
Epoch 46/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0694Epoch 00045: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0694 - val_loss: 0.0743
Epoch 47/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0691Epoch 00046: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0691 - val_loss: 0.0731
Epoch 48/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0689Epoch 00047: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0689 - val_loss: 0.0731
Epoch 49/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0687Epoch 00048: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0687 - val_loss: 0.0733
Epoch 50/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0686Epoch 00049: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0686 - val_loss: 0.0733
Epoch 51/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0683Epoch 00050: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0683 - val_loss: 0.0737
Epoch 52/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0680Epoch 00051: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0680 - val_loss: 0.0735
Epoch 53/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0677Epoch 00052: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0677 - val_loss: 0.0737
Epoch 54/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0678Epoch 00053: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0678 - val_loss: 0.0733
Epoch 55/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0674Epoch 00054: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0674 - val_loss: 0.0739
Epoch 56/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0674Epoch 00055: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0674 - val_loss: 0.0742
Epoch 57/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0671Epoch 00056: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0671 - val_loss: 0.0736
Epoch 58/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0667Epoch 00057: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0667 - val_loss: 0.0740
Epoch 59/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0666Epoch 00058: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0666 - val_loss: 0.0745
Epoch 60/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0662Epoch 00059: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0662 - val_loss: 0.0739
Epoch 61/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00060: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0660 - val_loss: 0.0749
Epoch 62/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0659Epoch 00061: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0659 - val_loss: 0.0741
Epoch 63/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0656Epoch 00062: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0656 - val_loss: 0.0757
Epoch 64/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0654Epoch 00063: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0655 - val_loss: 0.0751
Epoch 65/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0652Epoch 00064: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0652 - val_loss: 0.0743
Epoch 66/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0649Epoch 00065: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0649 - val_loss: 0.0742
Epoch 67/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0648Epoch 00066: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0648 - val_loss: 0.0750
Epoch 68/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0647Epoch 00067: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0647 - val_loss: 0.0751
Epoch 69/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0645Epoch 00068: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0645 - val_loss: 0.0749
Epoch 70/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0643Epoch 00069: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0643 - val_loss: 0.0748
Epoch 71/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0640Epoch 00070: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0640 - val_loss: 0.0750
Epoch 72/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0637Epoch 00071: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0637 - val_loss: 0.0751
Epoch 73/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0635Epoch 00072: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0635 - val_loss: 0.0751
Epoch 74/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0634Epoch 00073: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0634 - val_loss: 0.0753
Epoch 75/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0633Epoch 00074: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0633 - val_loss: 0.0749
Epoch 76/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0631Epoch 00075: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0631 - val_loss: 0.0754
Epoch 77/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0628Epoch 00076: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0628 - val_loss: 0.0757
Epoch 78/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0627Epoch 00077: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0627 - val_loss: 0.0748
Epoch 79/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0626Epoch 00078: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0626 - val_loss: 0.0749
Epoch 80/80
8512/8539 [============================>.] - ETA: 0s - loss: 0.0623Epoch 00079: val_loss did not improve
8539/8539 [==============================] - 96s - loss: 0.0623 - val_loss: 0.0756
history: [(0.15071186059279887, None, 0.089543643670204356, None), (0.096287503658796805, None, 0.080300658668353883, None), (0.09031078990124361, None, 0.078230270153873571, None), (0.087473480647558735, None, 0.079062081518627342, None), (0.08555691612207969, None, 0.077153654707657116, None), (0.084016298141192186, None, 0.0770871626151787, None), (0.083340703659278759, None, 0.076060026993244989, None), (0.082065351789904248, None, 0.081210061498395686, None), (0.081128513255294105, None, 0.075910736462135461, None), (0.080580071016181087, None, 0.074900119405089713, None), (0.079774785422583566, None, 0.073911233508324889, None), (0.079259187969073636, None, 0.073613093777017274, None), (0.078657938607865102, None, 0.073977904469320621, None), (0.078256564650438981, None, 0.074254942546179009, None), (0.077616079620879991, None, 0.074144823292454518, None), (0.077281032032878103, None, 0.073315354739571667, None), (0.076807430039099636, None, 0.072996371667900364, None), (0.076583025248230227, None, 0.073439099249385659, None), (0.07630509583798431, None, 0.072912535988367527, None), (0.076028099990111633, None, 0.072992316696233364, None), (0.075375937245631755, None, 0.072802518641119043, None), (0.075217336170189497, None, 0.073320007040387103, None), (0.07490208083795348, None, 0.072815306894071813, None), (0.074694939980302799, None, 0.073903031019500756, None), (0.074563489632886282, None, 0.072858766676523745, None), (0.073809858941615833, None, 0.0731031847742451, None), (0.073644642867448942, None, 0.072490368952681294, None), (0.073544399264210886, None, 0.072024902390254719, None), (0.07325230147425639, None, 0.07299585405723516, None), (0.073190770903694954, None, 0.072916076924556344, None), (0.072829454093700355, None, 0.073444270388983976, None), (0.07264662100435601, None, 0.073668337321325106, None), (0.072326577473913897, None, 0.07276540197732248, None), (0.072007609902765363, None, 0.072659464437009658, None), (0.071820658460714906, None, 0.072855313810018391, None), (0.071552878721025032, None, 0.073157629987477379, None), (0.071387312865701213, None, 0.07304857982383979, None), (0.071298969001893711, None, 0.072625008039858746, None), (0.070848029397845985, None, 0.072829559418089662, None), (0.070743041604474602, None, 0.072590674318018411, None), (0.070533067532453489, None, 0.072797575985992347, None), (0.070391189678238264, None, 0.072801454599960388, None), (0.070094716079146566, None, 0.073712756454726275, None), (0.069865422444846711, None, 0.073467307966270726, None), (0.06957798913280025, None, 0.073456386806982341, None), (0.069390193211633047, None, 0.074337899330116447, None), (0.069069054500812924, None, 0.073060017693173759, None), (0.068913604749604632, None, 0.073099485847539517, None), (0.068714358428208916, None, 0.073291521232861742, None), (0.068554107446604354, None, 0.073292821700319699, None), (0.068280860844492169, None, 0.073678310210014877, None), (0.068028853519737115, None, 0.073533716437580818, None), (0.067712624844489547, None, 0.073675432375499186, None), (0.067757135491618811, None, 0.07325024266928544, None), (0.06735402289291556, None, 0.073879585625269473, None), (0.067385999767461166, None, 0.074236524383445357, None), (0.067113512266867473, None, 0.073630642350558398, None), (0.066698773074225476, None, 0.074010700424075565, None), (0.066594021910735435, None, 0.074460354534697626, None), (0.066243447587618243, None, 0.073916519354114599, None), (0.066010159060894733, None, 0.074852911189143917, None), (0.06588617668719772, None, 0.074126954917069318, None), (0.065644515391004243, None, 0.0757173226648198, None), (0.065471465717588856, None, 0.075052770994085097, None), (0.065203031020035912, None, 0.074342010713322262, None), (0.064940320374340513, None, 0.074192348280887457, None), (0.064820772450273748, None, 0.074954212694377687, None), (0.064685354751143967, None, 0.075104416262754159, None), (0.064508587822609501, None, 0.074871238334711654, None), (0.064274584479034058, None, 0.074792509714325703, None), (0.063982950132381644, None, 0.074992791691542549, None), (0.06369009189676772, None, 0.075128881158409544, None), (0.063515192697646813, None, 0.07506005968148019, None), (0.063395990830755491, None, 0.075308470226032834, None), (0.06327493560511023, None, 0.074942603871062566, None), (0.063100771638426797, None, 0.075364785589577946, None), (0.062757677892804328, None, 0.075681202250085913, None), (0.062741788555495503, None, 0.074847306087340193, None), (0.062550636546081839, None, 0.074926084323680447, None), (0.062282857964246582, None, 0.07560127381330882, None)]
0. 
patient tongue id: 05032315187968_1_2_5
label yaofang:
甘草 黄芩 桔梗 金银花 连翘 薄荷 芦根 牛蒡子 麦冬 太子参 浙贝母 天花粉 鳖甲 诃子 白花蛇舌
0.99585 0.542623 0.638286 0.351778 0.322666 0.347729 0.748713 0.66419 0.647355 0.562162 0.565443 0.630425
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
1. 
patient tongue id: 06121813533688_5
label yaofang:
甘草 金银花 芦根 薏苡仁 黄柏 野菊花 茵陈 夏枯草 土茯苓 木棉花
0.403963 0.338319 0.316064 0.383536 0.486964 0.388571 0.309843
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.142857, recall: 0.100000, error: 0.857143
2. 
patient tongue id: 05192000248873_2_6
label yaofang:
桂枝 甘草 川芎 茯苓 桃仁 党参 白术 生地黄 牡丹皮 山药 菟丝子 益母草 合欢花
0.987834 0.548975 0.593868 0.361777 0.318196 0.6424 0.596215 0.555937 0.504587 0.482897 0.482686
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
3. 
patient tongue id: 04071401296033_1_2_3
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 厚朴 肉苁蓉
0.509058 0.390553 0.359616 0.41115 0.401388
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
4. 
patient tongue id: 02131318351272_1_2_7
label yaofang:
甘草 法半夏 橘红 防风 金银花 太子参 藿香 白前 鸡内金 辛夷 蜜百部 干鱼腥草
0.528548 0.387362 0.353188 0.402791 0.473695
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
5. 
patient tongue id: 02202239234784_4_6_3
label yaofang:
甘草 薏苡仁 党参 黄芪 白术 丹参 熟附子 赤芍 山药 干姜 益母草 鳖甲 射干 莪术 紫苏梗 土鳖虫
0.985224 0.300388 0.544001 0.584902 0.373894 0.323507 0.630648 0.579962 0.549528 0.490676 0.472001 0.475566
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
6. 
patient tongue id: 03012022067732_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.41444 0.736925 0.447864 0.950709 0.454323 0.741477 0.423649 0.339446 0.406739 0.542192 0.880167 0.896522 0.81793 0.911552 0.965686 0.562503 0.720458 0.489261 0.671694
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
7. 
patient tongue id: 03170851202199_1_3
label yaofang:
甘草 当归 木香 党参 黄芪 丹参 枳实 大黄 厚朴 肉苁蓉 草豆蔻 六神曲
0.466091 0.32894 0.45699 0.445256 0.428578 0.463385 0.366322 0.418636 0.432356 0.391371 0.395913 0.470752 0.384858 0.441642 0.442709 0.426699
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.250000, recall: 0.333333, error: 0.750000
8. 
patient tongue id: 05221849341963_3
label yaofang:
桂枝 甘草 川芎 桔梗 薄荷 芦根 牛蒡子 浙贝母 桑叶 菊花 白芷 蔓荆子 苦杏仁 紫苏叶
0.582969 0.31427 0.417191 0.390244 0.320111
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
9. 
patient tongue id: 02211851256656_2
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 火麻仁 麦芽 百合 紫苏叶 姜黄 鹿衔草
0.404476 0.464527 0.353612 0.340298 0.336079 0.383152 0.302567 0.329536 0.51212 0.64456 0.33391
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 浙贝母 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.090909, recall: 0.076923, error: 0.909091
10. 
patient tongue id: 03081426469129_1_2_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 赤芍 牛膝 郁金 六神曲
0.729868 0.4171 0.453366 0.457983
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
11. 
patient tongue id: 02212102000446_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.37652 0.65418 0.437068 0.918589 0.407641 0.699899 0.36966 0.35475 0.512644 0.820279 0.845817 0.770385 0.868849 0.945965 0.525012 0.704943 0.468354 0.632379
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.800000, error: 0.333333
12. 
patient tongue id: 05162221261895_4
label yaofang:
麻黄 前胡 半夏 防风 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 苍耳子
0.391064 0.822751 0.372158 0.991549 0.484321 0.871224 0.429632 0.321392 0.378693 0.652194 0.962529 0.974371 0.939134 0.977931 0.994238 0.664592 0.826703 0.496408 0.788218
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.733333, error: 0.421053
13. 
patient tongue id: 04201438535233_1_4_7
label yaofang:
甘草 麦冬 太子参 枸杞子 丹参 玄参 生地黄 牡丹皮 知母 山药 天花粉 北沙参
0.523832 0.394535 0.396822 0.436934 0.357419 0.308341
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
14. 
patient tongue id: 04251950373840_2_1
label yaofang:
甘草 桔梗 黄芪 白术 柏子仁 枳实 槟榔 厚朴 肉苁蓉 火麻仁 紫菀
0.470552 0.322298 0.411126 0.35743 0.425497 0.326145 0.420657
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
15. 
patient tongue id: 05092010330173_4
label yaofang:
甘草 柴胡 白芍 当归 茯苓 白术 栀子 牡丹皮 牛膝 苏木 败酱草 车前草 墨旱莲 鹿衔草
0.494435 0.319641 0.417638 0.45267 0.37779 0.420136 0.355231 0.391635 0.363258 0.339762 0.370274 0.403032 0.420601 0.375441 0.401043 0.366952
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.214286, error: 0.812500
16. 
patient tongue id: 03021253300788_1_3
label yaofang:
柴胡 法半夏 薏苡仁 党参 黄芪 延胡索 栀子 郁金 炙甘草 白鲜皮 地肤子 大青叶
0.461983 0.407044 0.406269 0.347429 0.303695
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
17. 
patient tongue id: 05241941170238_4_6
label yaofang:
甘草 桔梗 金银花 薏苡仁 党参 白术 浙贝母 泽泻 天麻 鳖甲 豆蔻 苦杏仁 蜈蚣 天山雪莲 半枝莲
0.920527 0.508208 0.522177 0.385671 0.32842 0.519799 0.390698 0.416137 0.30577 0.301657 0.316028
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
18. 
patient tongue id: 03101754205515_4
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.388611 0.442763 0.348078 0.364536 0.361783
predicted yaofang:
甘草 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
19. 
patient tongue id: 02021010331063_1_5
label yaofang:
甘草 茯苓 玉竹 党参 白术 浙贝母 杜仲 牛膝 砂仁 天麻 桑寄生 珍珠母 预知子
0.314632 0.545751 0.440869 0.76292 0.306197 0.523661 0.36115 0.616177 0.618746 0.611172 0.676066 0.31192 0.833848 0.369988 0.537364 0.365808 0.473177
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.058824, recall: 0.076923, error: 0.941176
20. 
patient tongue id: 03132044584392_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.562277 0.418249 0.314953 0.453454 0.36673 0.303354 0.322463 0.302243 0.342516
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 白术 丹参 牛膝 天麻

------Score: precision: 0.444444, recall: 0.333333, error: 0.555556
21. 
patient tongue id: 04131858210536_4_7
label yaofang:
甘草 桃仁 葶苈子 黄芪 红花 赤芍 胆南星 牡丹皮 牛膝 大黄 厚朴 生半夏 砂仁 北沙参 赭石 瓜蒌子 黑枣
0.463439 0.41199 0.337378 0.419431 0.414437 0.300578 0.358184
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.235294, error: 0.428571
22. 
patient tongue id: 05162218534053_2
label yaofang:
法半夏 茯苓 前胡 太子参 柏子仁 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 制远志 炒紫苏子 蜜麻黄
0.386643 0.804864 0.41039 0.981242 0.473727 0.821904 0.430266 0.32573 0.38124 0.598793 0.935407 0.950722 0.894353 0.956429 0.988906 0.605364 0.798115 0.503158 0.747343
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.750000, error: 0.368421
23. 
patient tongue id: 04112256007733_1_6
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶 独脚金
0.4399 0.370125 0.345414 0.362333 0.483268 0.342057 0.305068
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.142857, recall: 0.090909, error: 0.857143
24. 
patient tongue id: 05162137529786_4_2
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 橘红 芦根 酸枣仁 生地黄 浙贝母 鳖甲 白花蛇舌 蜂房 岗梅根 四季青
0.959896 0.513182 0.551522 0.374702 0.307123 0.562439 0.48133 0.470012 0.392237 0.387236 0.380436
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
25. 
patient tongue id: 06022228410780_1_4_7
label yaofang:
甘草 陈皮 半夏 党参 白术 海螵蛸 杜仲 牛膝 山药 僵蚕 莪术 鸡内金 桑椹 紫苏梗 骨碎补 红豆杉 预知子
0.531821 0.384661 0.367872 0.31967 0.496614 0.588729 0.324906 0.313039 0.417093 0.367126 0.334666 0.388043 0.345377
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.538462, recall: 0.411765, error: 0.461538
26. 
patient tongue id: 04202018543058_5_7_6
label yaofang:
甘草 茯苓 太子参 黄芪 白术 赤芍 浙贝母 砂仁 北沙参 辛夷 合欢皮 蛇舌草 鲜龙葵果
0.777767 0.445866 0.425838 0.305841 0.508904
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
27. 
patient tongue id: 03111500081471_6_5_2
label yaofang:
甘草 川芎 茯苓 党参 丹参 生地黄 栀子 牡丹皮 牛膝 石膏 钩藤 天麻 天花粉 石决明 赭石 粉葛
0.991626 0.54605 0.603663 0.366159 0.340067 0.672964 0.606754 0.580627 0.514757 0.502434 0.529003
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
28. 
patient tongue id: 04202008022499_6_1_4
label yaofang:
甘草 茯苓 桔梗 牛蒡子 蒲公英 党参 海螵蛸 郁金 枇杷叶 北沙参 木蝴蝶 龙脷叶
0.617617 0.424741 0.410708 0.324663 0.405698
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
29. 
patient tongue id: 01192144269748_5_1_6
label yaofang:
甘草 枳壳 法半夏 薏苡仁 党参 丹参 赤芍 栀子 薤白 水蛭 厚朴 三棱 莪术 豆蔻 苦杏仁 瓜蒌子
0.793269 0.493178 0.392854 0.434218 0.321223
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
30. 
patient tongue id: 03151849571614_4_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 瓦楞子
0.344014 0.331084 0.351129 0.30319 0.400622 0.397694 0.396991
predicted yaofang:
甘草 白芍 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
31. 
patient tongue id: 06191206377802_1_4
label yaofang:
甘草 枳壳 薏苡仁 生地黄 牡丹皮 郁金 山药 天麻 地骨皮 鳖甲 莪术 浮小麦 蜈蚣 白花蛇舌 天山雪莲
0.986734 0.540792 0.586707 0.36918 0.32692 0.647612 0.586784 0.565745 0.492052 0.47508 0.490436
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
32. 
patient tongue id: 03282216294439_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗
0.360455 0.364506 0.446044 0.368968 0.339533 0.309087 0.367618 0.567506
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.500000, error: 0.375000
33. 
patient tongue id: 06140830371367_1_4_7
label yaofang:
桃仁 丹参 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.511768 0.366186 0.360853 0.438662 0.403087 0.376731 0.342025 0.309977 0.315036 0.350621
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤 莱菔子 天麻

------Score: precision: 0.600000, recall: 0.500000, error: 0.400000
34. 
patient tongue id: 06020745487833_1_3
label yaofang:
甘草 法半夏 桔梗 橘红 金银花 薏苡仁 白前 鸡内金 蜜百部 干鱼腥草 稻芽
0.416372 0.319821 0.408271
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.333333, recall: 0.090909, error: 0.666667
35. 
patient tongue id: 02170747116568_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.384643 0.337556 0.442959 0.302191 0.402875 0.392876 0.433174 0.347106 0.425487 0.47479 0.405094 0.413177 0.431729 0.314388 0.445525 0.450866 0.455923
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.705882, recall: 1.000000, error: 0.294118
36. 
patient tongue id: 03282214315784_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶
0.715967 0.318192 0.408144 0.389383 0.455474 0.376327
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术

------Score: precision: 0.166667, recall: 0.100000, error: 0.833333
37. 
patient tongue id: 05250029577059_1_5_6
label yaofang:
甘草 陈皮 法半夏 茯苓 砂仁 莱菔子 天麻 鳖甲 苦杏仁 紫苏子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.835587 0.479934 0.472463 0.403133 0.396711 0.321736
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
38. 
patient tongue id: 03011855154941_4_1
label yaofang:
法半夏 前胡 防风 钩藤 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子
0.379762 0.713812 0.442387 0.939426 0.422511 0.726233 0.389169 0.315196 0.365924 0.529651 0.852563 0.874911 0.798513 0.888413 0.964873 0.521657 0.733807 0.484581 0.666447
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
39. 
patient tongue id: 01250706281558_6_1_4
label yaofang:
甘草 法半夏 茯苓 龙骨 薏苡仁 远志 酸枣仁 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.942925 0.513125 0.543388 0.363931 0.543013 0.449319 0.431315 0.363996 0.3596 0.341178
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
40. 
patient tongue id: 01202011533510_4_5
label yaofang:
甘草 茯苓 白术 海螵蛸 浙贝母 大黄 厚朴 生半夏 火麻仁 莪术 鸡内金 蜈蚣 山慈菇 稻芽
0.350296 0.322899 0.420692 0.468804 0.487687 0.316269 0.402302 0.318186 0.410449 0.402091 0.403595 0.429537 0.360422 0.562378 0.334027 0.411444 0.327044
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.117647, recall: 0.142857, error: 0.882353
41. 
patient tongue id: 05251935084325_1_5
label yaofang:
甘草 白芍 枳壳 黄芪 白术 杜仲 乌药 厚朴 桑寄生 北沙参 蜈蚣 合欢皮 冬凌草 荔枝核 鸭脚艾
0.591152 0.399957 0.315819 0.339485 0.450019 0.575386 0.305177 0.377545 0.345227 0.358543
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.600000, recall: 0.400000, error: 0.400000
42. 
patient tongue id: 05222256322084_4_1
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.356594 0.334452 0.384803 0.446279 0.44215 0.316073 0.416046 0.335468 0.333063 0.38242 0.380641 0.400037 0.420219 0.368475 0.543158 0.342537 0.410713 0.331548
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
43. 
patient tongue id: 02211819390295_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.459483 0.44407 0.609797 0.488257 0.336454 0.461899 0.484091 0.508412 0.564436 0.754383 0.335503 0.473787 0.304998 0.375415
predicted yaofang:
法半夏 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 0.625000, error: 0.285714
44. 
patient tongue id: 01211156069739_1_7
label yaofang:
甘草 陈皮 葛根 党参 黄芪 赤芍 黄柏 升麻 蔓荆子
0.530257 0.369764 0.387492 0.367796 0.381974
predicted yaofang:
甘草 白芍 茯苓 党参 炙甘草

------Score: precision: 0.400000, recall: 0.222222, error: 0.600000
45. 
patient tongue id: 01140816310922_1_2_6
label yaofang:
甘草 茯苓 龙骨 党参 酸枣仁 黄柏 牛膝 山药 山茱萸 地黄 青蒿 浮小麦 醋龟甲 合欢花
0.929625 0.319212 0.511022 0.531979 0.391843 0.317977 0.52414 0.440809 0.454796 0.349217 0.348972 0.350404
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
46. 
patient tongue id: 05191018286052_1_2
label yaofang:
甘草 法半夏 橘红 防风 金银花 太子参 藿香 白前 鸡内金 辛夷 蜜百部 干鱼腥草
0.344092 0.305401 0.388407 0.339681 0.308474 0.30973 0.339104
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 车前子

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
47. 
patient tongue id: 05262101082118_2_4
label yaofang:
桂枝 甘草 白芍 党参 白术 桑叶 天麻 糯稻根 鳖甲 豆蔻 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.926473 0.492561 0.50894 0.441623 0.307197 0.460069 0.369487 0.462284 0.320455
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.777778, recall: 0.500000, error: 0.222222
48. 
patient tongue id: 05140839544138_5_6
label yaofang:
甘草 柴胡 白芍 枳壳 党参 酸枣仁 生地黄 牡丹皮 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.972758 0.518324 0.558977 0.366441 0.557497 0.487396 0.473043 0.39141 0.385333 0.372105
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.571429, error: 0.200000
49. 
patient tongue id: 03180151242430_1_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮
0.456069 0.319568 0.369512 0.338288 0.382099 0.398481 0.309737 0.390613
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
50. 
patient tongue id: 06071953147055_1
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 知母 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.972334 0.300571 0.519971 0.566381 0.36856 0.306552 0.330308 0.621702 0.552231 0.519752 0.471401 0.462977 0.466836
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
51. 
patient tongue id: 04141858179075_4
label yaofang:
甘草 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 香薷 紫菀 辛夷 紫苏梗 广藿香 苍耳子
0.387508 0.676326 0.429044 0.921866 0.42547 0.711975 0.392732 0.321275 0.368514 0.529591 0.826428 0.855466 0.783296 0.873412 0.953665 0.52493 0.70856 0.484986 0.64603
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.368421, recall: 0.500000, error: 0.631579
52. 
patient tongue id: 01041301307309_6_1
label yaofang:
茯苓 麦冬 党参 酸枣仁 柏子仁 附子 干姜 磁石 炙甘草
0.44989 0.324205 0.374102 0.403921 0.341253 0.332748
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
53. 
patient tongue id: 01101813312426_4_6_1
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.376714 0.644079 0.443005 0.891886 0.413508 0.658574 0.379004 0.321999 0.362748 0.487589 0.791935 0.805398 0.748098 0.838223 0.913202 0.508808 0.652382 0.469094 0.611668
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
54. 
patient tongue id: 03012332349717_2_6
label yaofang:
甘草 川芎 龙骨 党参 枸杞子 酸枣仁 生地黄 牛膝 知母 天麻 桑寄生 麦芽 首乌藤 合欢花
0.95789 0.516957 0.539488 0.417912 0.320822 0.531024 0.476031 0.514157 0.387611 0.378784 0.412625
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
55. 
patient tongue id: 06191327021012_3_4
label yaofang:
甘草 柴胡 白芍 川芎 茯苓 木香 蒲公英 白及 党参 杜仲 牛膝 天麻 五灵脂 桑寄生 建曲 罗布麻
0.864182 0.492495 0.474897 0.423781 0.304772 0.410972 0.381923
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
56. 
patient tongue id: 03231206395312_1_6
label yaofang:
甘草 大枣 茯苓 木香 远志 党参 白术 砂仁 天麻 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.979236 0.509142 0.583427 0.384377 0.315799 0.647313 0.581048 0.573512 0.482873 0.490228 0.532179
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
57. 
patient tongue id: 03192253480337_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 牛蒡子 桃仁 党参 浙贝母 诃子 麦芽 紫苏梗 猫爪草
0.981244 0.535749 0.569007 0.348331 0.312933 0.625947 0.503422 0.476114 0.408738 0.396497 0.396354
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
58. 
patient tongue id: 02271844423461_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.374406 0.614251 0.435812 0.832374 0.405274 0.615419 0.381986 0.339392 0.362658 0.474922 0.724067 0.741747 0.688814 0.768827 0.30986 0.875856 0.474697 0.301303 0.620712 0.452139 0.576464
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
59. 
patient tongue id: 06070700518837_6_5
label yaofang:
甘草 法半夏 茯苓 木香 党参 白术 黄连 生地黄 肉桂 没药 淡竹叶 豆蔻 麦芽 苦杏仁 川木通
0.966432 0.308218 0.539796 0.546526 0.392444 0.322713 0.564297 0.51574 0.493586 0.43622 0.413406 0.399789
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
60. 
patient tongue id: 03311646042802_4
label yaofang:
柴胡 白芍 香附 枳壳 半夏 党参 延胡索 鸡内金 麦芽 炙甘草 紫苏梗 螵蛸
0.324033 0.304045 0.360787 0.346784 0.35971 0.383331 0.305999 0.490499
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
61. 
patient tongue id: 04141308059963_4_2
label yaofang:
法半夏 茯苓 前胡 桔梗 木香 麦冬 太子参 郁金 北柴胡 款冬花 紫菀 白前 百部 北沙参 炙甘草 人参叶
0.301898 0.610513 0.420624 0.826557 0.323991 0.615589 0.401893 0.666072 0.687292 0.685442 0.755221 0.898525 0.39579 0.577719 0.418247 0.53306
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.562500, recall: 0.562500, error: 0.437500
62. 
patient tongue id: 02272210171140_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 侧柏叶 炙甘草 百合 紫苏叶 青葙子
0.456862 0.340631 0.415124 0.339612 0.3981 0.367798 0.433274
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
63. 
patient tongue id: 01052113315962_2
label yaofang:
柴胡 白芍 黄芩 龙骨 牡蛎 麦冬 玄参 枳实 石膏 干姜 大黄 生地 法夏
0.890862 0.469327 0.486013 0.416524 0.352387 0.361161
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
64. 
patient tongue id: 04122131259885_4_2
label yaofang:
陈皮 半夏 芦根 薏苡仁 麦冬 胆南星 石菖蒲 桑白皮 厚朴 瓜蒌皮 炙甘草 广藿香 土茯苓 青果
0.576833 0.417434 0.390825 0.425123
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
65. 
patient tongue id: 05232018459156_1
label yaofang:
甘草 枳壳 茯苓 半夏 牡蛎 赤芍 浙贝母 郁金 厚朴 淡豆豉 砂仁 莪术 王不留行 麦芽 北沙参 合欢皮 预知子 蛇舌草
0.574273 0.420628 0.342549 0.427298 0.496391 0.312548 0.333722
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.222222, error: 0.428571
66. 
patient tongue id: 04261944097030_2
label yaofang:
陈皮 龙骨 牡蛎 薏苡仁 麦冬 酸枣仁 黄连 栀子 灯心草 厚朴 茵陈 莲子心 百合 四季青
0.579263 0.40556 0.406783 0.382113 0.374278
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
67. 
patient tongue id: 05160621245319_5
label yaofang:
陈皮 茯苓 半夏 薏苡仁 延胡索 浙贝母 牛膝 白茅根 厚朴 砂仁 土茯苓 山慈菇 蛇舌草 鲜龙葵果
0.516487 0.436362 0.365709 0.307345 0.422159 0.489798 0.313835 0.387127
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
68. 
patient tongue id: 05191953220086_1_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 郁金 山药 石菖蒲 天麻 鳖甲 扁豆花 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.970916 0.521576 0.562333 0.380956 0.307346 0.569857 0.482597 0.481373 0.388427 0.379308 0.389997
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.733333, error: 0.000000
69. 
patient tongue id: 06080222055171_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 木香 党参 川楝子 山药 山茱萸 灯心草 菟丝子 益智 合欢花 广金钱草 土萆薢
0.937265 0.494337 0.530576 0.398711 0.313063 0.524082 0.406755 0.456204 0.3203 0.323566 0.367437
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
70. 
patient tongue id: 04210415204585_4_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 扁豆花 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97305 0.518206 0.558456 0.389326 0.319147 0.583435 0.516424 0.518037 0.426451 0.425012 0.453718
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.785714, error: 0.000000
71. 
patient tongue id: 03281923313683_6
label yaofang:
麻黄 桂枝 甘草 柴胡 白芍 黄芩 法半夏 当归 葛根 龙骨 桃仁 党参 红花 石膏 滑石 煅牡蛎 苦杏仁 天山雪莲
0.925157 0.495886 0.528409 0.398322 0.474179 0.359604 0.409934
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.111111, error: 0.714286
72. 
patient tongue id: 03242139319596_2_7
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.5789 0.407154 0.386196 0.436189
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
73. 
patient tongue id: 06070237366457_1_2
label yaofang:
甘草 茯苓 龙骨 党参 白术 酸枣仁 杜仲 山药 石菖蒲 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.95724 0.536337 0.541678 0.398327 0.330823 0.565723 0.506813 0.494689 0.424492 0.405866 0.414076
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
74. 
patient tongue id: 03012129244529_6_5
label yaofang:
甘草 香附 陈皮 法半夏 茯苓 桔梗 牛蒡子 桃仁 浙贝母 栀子 牡丹皮 细辛 威灵仙 合欢花
0.886637 0.367589 0.4378 0.504562 0.370814 0.351503 0.309434
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
75. 
patient tongue id: 05140144494434_1_4
label yaofang:
甘草 薏苡仁 党参 鸡血藤 红花 山药 天麻 鳖甲 豆蔻 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.928818 0.302643 0.481803 0.535112 0.387012 0.501243 0.375055 0.412841
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
76. 
patient tongue id: 03022133170102_4_1
label yaofang:
桂枝 白芍 牛蒡子 太子参 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.729796 0.327443 0.449655 0.430274 0.373079
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
77. 
patient tongue id: 01092336447011_4_1
label yaofang:
陈皮 茯苓 蒲公英 丹参 黄连 枳实 竹茹 姜半夏 炙甘草 首乌藤 合欢皮
0.45885 0.365129 0.321888 0.414779 0.379987 0.32725 0.312869
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
78. 
patient tongue id: 02182024440714_1_4_7
label yaofang:
甘草 白芍 木香 薏苡仁 党参 黄连 天麻 赤石脂 鳖甲 莪术 豆蔻 建曲 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.955581 0.342778 0.529549 0.544372 0.390058 0.321481 0.534289 0.501898 0.481662 0.433806 0.404189 0.376896
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
79. 
patient tongue id: 01012048352078_1_5
label yaofang:
甘草 当归 茯苓 木香 党参 黄芪 酸枣仁 丹参 郁金 浮小麦 首乌藤 制远志
0.816941 0.415568 0.512411 0.310434 0.542919
predicted yaofang:
甘草 茯苓 党参 丹参 天麻

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
80. 
patient tongue id: 01051852419566_2
label yaofang:
陈皮 法半夏 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.388565 0.666984 0.452396 0.91379 0.405366 0.678738 0.365831 0.309926 0.357102 0.499014 0.811208 0.828234 0.761027 0.866851 0.937853 0.50964 0.673359 0.480693 0.624445
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
81. 
patient tongue id: 05270619533167_1_4
label yaofang:
甘草 白芍 枳壳 薏苡仁 党参 白术 厚朴 天麻 肉苁蓉 鳖甲 火麻仁 败酱草 蜈蚣 天山雪莲 半枝莲 红豆杉
0.990022 0.553143 0.599808 0.36392 0.305825 0.32782 0.667567 0.613918 0.573852 0.529692 0.502692 0.513612
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
82. 
patient tongue id: 04172227127295_1
label yaofang:
麻黄 桂枝 川芎 陈皮 枳壳 茯苓 桔梗 牛蒡子 蔓荆子 炙甘草 辛夷 百合 紫苏叶 苍耳子
0.395214 0.360689 0.353145 0.324001
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
83. 
patient tongue id: 04120235160216_6_5_2
label yaofang:
甘草 黄芩 桔梗 党参 丹参 浙贝母 乌梅 知母 天花粉 鳖甲 鹿角霜 白花蛇舌 蜂房 岗梅根 四季青
0.957477 0.496285 0.537605 0.381613 0.521892 0.438562 0.451278 0.339926 0.344719 0.347811
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
84. 
patient tongue id: 04071412414750_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.546689 0.415426 0.408711 0.332656 0.382594
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
85. 
patient tongue id: 05181822185525_3
label yaofang:
甘草 麦冬 玉竹 生地黄 附子 干姜 鳖甲 吴茱萸 龟甲
0.96601 0.478101 0.562777 0.349634 0.581136 0.34668 0.405189 0.308788
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.250000, recall: 0.222222, error: 0.750000
86. 
patient tongue id: 04192239251218_2_1
label yaofang:
甘草 黄芩 太子参 生地黄 浙贝母 乌梅 山茱萸 白茅根 鳖甲 北沙参 白花蛇舌 天山雪莲 蜂房 四季青
0.988849 0.535577 0.595111 0.353745 0.319593 0.66975 0.602342 0.564458 0.505264 0.49574 0.510664
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
87. 
patient tongue id: 05131945027570_5_7
label yaofang:
薏苡仁 黄芪 白术 赤芍 浙贝母 山药 车前子 生半夏 砂仁 补骨脂 土鳖虫 红豆杉 山慈菇 预知子 蛇舌草
0.443642 0.379497 0.320655 0.481178 0.465275 0.330546 0.311958 0.366934
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.250000, recall: 0.133333, error: 0.750000
88. 
patient tongue id: 01200707054893_6_2_1
label yaofang:
甘草 白芍 枳壳 当归 连翘 远志 党参 白术 莱菔子 天麻 巴戟天 鳖甲 蜈蚣 白花蛇舌 半枝莲 龙葵果
0.828253 0.474369 0.42632 0.403929
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.187500, error: 0.250000
89. 
patient tongue id: 03301913498992_2_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.464441 0.42051 0.622668 0.502576 0.330468 0.477431 0.474923 0.515804 0.556275 0.751219 0.355196 0.473898 0.312154 0.377831
predicted yaofang:
法半夏 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.642857, recall: 0.642857, error: 0.357143
90. 
patient tongue id: 01122342387626_5_6_2
label yaofang:
甘草 白芍 当归 木香 蒲公英 党参 黄芪 茜草 天麻 赤石脂 鳖甲 蜈蚣 天山雪莲 半枝莲
0.978526 0.301245 0.543002 0.570991 0.381172 0.323662 0.614098 0.562309 0.528933 0.484832 0.461741 0.460241
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
91. 
patient tongue id: 04081600238870_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.679696 0.446083 0.399222 0.359829 0.431892 0.305274
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
92. 
patient tongue id: 02232011405358_4
label yaofang:
陈皮 法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.383106 0.781456 0.430783 0.970951 0.46608 0.790228 0.423156 0.329668 0.383155 0.578906 0.908173 0.931305 0.862547 0.934843 0.984618 0.561083 0.788361 0.512239 0.726506
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
93. 
patient tongue id: 04121327485317_1_2_4
label yaofang:
甘草 茯苓 葛根 麦冬 玉竹 黄芪 玄参 北沙参 百合 麸炒白术 干石斛
0.347887 0.798763 0.405386 0.985078 0.430876 0.838492 0.394214 0.35314 0.598747 0.944628 0.953847 0.898492 0.961242 0.989517 0.622708 0.80754 0.426833 0.737374
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.055556, recall: 0.090909, error: 0.944444
94. 
patient tongue id: 02120746203658_6_5
label yaofang:
甘草 柴胡 黄芩 半夏 党参 郁金 巴戟天 瓜蒌皮 鸡内金 珍珠母 麦芽 首乌藤 黑枣
0.538667 0.400436 0.3431 0.350924 0.489884 0.568242 0.322012 0.334496 0.415456 0.382072 0.338044 0.3946 0.337343
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.307692, recall: 0.307692, error: 0.692308
95. 
patient tongue id: 03101829017847_4
label yaofang:
麻黄 陈皮 前胡 桔梗 半夏 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草
0.411582 0.679785 0.444862 0.915203 0.437483 0.688019 0.423982 0.373883 0.400344 0.538406 0.824605 0.849328 0.778713 0.867061 0.935527 0.54371 0.301076 0.671561 0.504987 0.640598
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
96. 
patient tongue id: 05080855488553_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.543307 0.366308 0.374864 0.419706 0.531945 0.3239 0.330741 0.325859
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
97. 
patient tongue id: 02251231106685_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.322209 0.333017 0.498359 0.478063 0.623642 0.344431 0.46262 0.311385 0.364311 0.528934 0.510535 0.487589 0.54357 0.323297 0.665843 0.375237 0.487371 0.31022 0.419475
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
98. 
patient tongue id: 01130656516962_1_6
label yaofang:
甘草 桔梗 金银花 薏苡仁 赤芍 浙贝母 郁金 莱菔子 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉
0.950157 0.508952 0.537501 0.376269 0.509868 0.404944 0.420577 0.309717 0.307488
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
99. 
patient tongue id: 01132311483011_3_1
label yaofang:
桂枝 柴胡 白芍 黄芩 大枣 党参 牛膝 苏木 姜半夏 炙甘草 嫩桑枝 丝瓜络
0.404819 0.348145 0.393207 0.375824 0.331259
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
100. 
patient tongue id: 03020657106189_4_7_6
label yaofang:
甘草 法半夏 防风 金银花 丹参 红花 郁金 荆芥穗 天麻 火麻仁 麦芽 皂角刺 白鲜皮 天山雪莲 土茯苓
0.931785 0.334289 0.476173 0.529597 0.370492 0.481178 0.370321 0.393663
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.133333, error: 0.750000
101. 
patient tongue id: 06082045162398_1_2
label yaofang:
甘草 陈皮 茯苓 半夏 白术 杜仲 郁金 厚朴 僵蚕 补骨脂 枇杷叶 地龙 北沙参 蝉蜕 白鲜皮 紫苏叶
0.441404 0.408789 0.376364 0.457594 0.516912 0.347637 0.371794 0.342279 0.303198 0.421596 0.344683
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
102. 
patient tongue id: 05160619265255_1_6_4
label yaofang:
陈皮 茯苓 半夏 黄芪 白术 五味子 海螵蛸 杜仲 鸡内金 枇杷叶 北沙参 百合 蜈蚣 鲜龙葵果 守宫
0.627642 0.42802 0.36023 0.407982 0.508554 0.324348 0.320196
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
103. 
patient tongue id: 05290842578937_3_2
label yaofang:
甘草 党参 黄芪 杜仲 天麻 鳖甲 桑螵蛸 锁阳 益智 蜈蚣 天山雪莲 半枝莲 广金钱草 红豆杉
0.992057 0.541009 0.604794 0.345429 0.688667 0.615151 0.567723 0.51437 0.497719 0.510986
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
104. 
patient tongue id: 01062041205222_6_5
label yaofang:
甘草 白芍 陈皮 防风 薏苡仁 党参 白术 熟附子 天麻 鳖甲 败酱草 蜈蚣 天山雪莲 半枝莲 姜黄
0.973543 0.532446 0.567683 0.380183 0.303969 0.56611 0.46978 0.497844 0.36503 0.359566 0.376377
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
105. 
patient tongue id: 02281835596993_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.377969 0.780276 0.410447 0.976108 0.444452 0.804552 0.400679 0.312255 0.369503 0.584126 0.916882 0.936797 0.875729 0.945608 0.987697 0.570875 0.797101 0.514172 0.732322
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
106. 
patient tongue id: 04072023027706_1_4
label yaofang:
牡蛎 黄芪 白术 延胡索 海螵蛸 浙贝母 砂仁 瓜蒌皮 莪术 鸡内金 枇杷叶 北沙参 蜈蚣 山慈菇 蛇舌草 鲜龙葵果
0.441909 0.372434 0.418741 0.501456 0.321733 0.314167 0.31902
predicted yaofang:
甘草 茯苓 黄芪 白术 海螵蛸 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
107. 
patient tongue id: 03090818154829_6_1
label yaofang:
甘草 茯苓 党参 白术 蒲黄 砂仁 天麻 全蝎 五灵脂 白花蛇舌草 麦芽 佛手 半枝莲 醋鳖甲
0.929728 0.506483 0.540033 0.429117 0.342322 0.528948 0.460784 0.487226 0.379408 0.383421 0.417813
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
108. 
patient tongue id: 03091853271768_5_7
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 红花 杜仲 黄柏 苍术 桑寄生 浮小麦 首乌藤 威灵仙 骨碎补 牛大力 千斤拔
0.9573 0.501231 0.541175 0.408728 0.324299 0.555961 0.492525 0.517301 0.403921 0.409034 0.447423
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
109. 
patient tongue id: 03020734569509_6_4
label yaofang:
甘草 桔梗 远志 浙贝母 桑白皮 天麻 补骨脂 白花蛇舌草 北沙参 浮小麦 蜈蚣 半枝莲 醋鳖甲 化橘红
0.98274 0.515231 0.592603 0.374099 0.321816 0.340223 0.664432 0.599416 0.580914 0.504688 0.51141 0.55661
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
110. 
patient tongue id: 02272200037416_1_6
label yaofang:
甘草 川芎 陈皮 枳壳 茯苓 龙骨 牡蛎 远志 柏子仁 竹茹 姜半夏
0.807093 0.401675 0.502452 0.339885 0.359853 0.315601
predicted yaofang:
甘草 法半夏 茯苓 前胡 党参 款冬花

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
111. 
patient tongue id: 01172236297565_2_6
label yaofang:
甘草 枸杞子 生地黄 红花 山药 山茱萸 天麻 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.882554 0.471462 0.518884 0.399584 0.434147 0.364523
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
112. 
patient tongue id: 02231816526293_4
label yaofang:
麻黄 前胡 半夏 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷
0.413873 0.378185 0.30847 0.459295 0.433818 0.31199 0.349659
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 北沙参

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
113. 
patient tongue id: 05172108352529_1_4
label yaofang:
甘草 陈皮 法半夏 茯苓 党参 砂仁 天麻 鳖甲 莪术 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.987621 0.549405 0.580747 0.353014 0.634902 0.565863 0.523514 0.480305 0.449987 0.439024
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.571429, error: 0.200000
114. 
patient tongue id: 06191323471104_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 桃仁 党参 延胡索 川楝子 郁金 车前子 鸡内金 麦芽 广金钱草 石苇 荔枝核
0.875956 0.466463 0.5066 0.400745 0.439012 0.359501
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
115. 
patient tongue id: 03021209571176_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.368083 0.31896 0.394968 0.321511 0.318843 0.312004 0.322895 0.315326 0.562522 0.315919 0.324343
predicted yaofang:
甘草 白芍 茯苓 党参 白术 干姜 白芷 紫菀 炙甘草 紫苏梗 广藿香

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
116. 
patient tongue id: 06182207450196_6_1_3
label yaofang:
大枣 茯苓 丹参 郁金 山药 桑寄生 炙甘草 浮小麦 首乌藤 牛大力 千斤拔
0.682352 0.45794 0.425445 0.301417 0.410617
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
117. 
patient tongue id: 05092124050849_6_4
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 黄芪 酸枣仁 天麻 鳖甲 白扁豆 佛手 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.978146 0.536439 0.574224 0.370638 0.313771 0.620056 0.569525 0.531848 0.487161 0.468453 0.468238
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
118. 
patient tongue id: 04051840590844_3_4
label yaofang:
桂枝 茯苓 半夏 木香 黄芪 白术 附子 山药 泽泻 茯苓皮 猪苓 白扁豆 紫苏叶 玉米须 蜈蚣
0.545416 0.384834 0.32502 0.457473 0.346002 0.332047 0.315015 0.365159
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.250000, recall: 0.133333, error: 0.750000
119. 
patient tongue id: 03291321221871_1
label yaofang:
白芍 香附 枳壳 党参 白芷 北柴胡 紫菀 麦芽 炙甘草 紫苏梗 煅瓦楞子
0.459263 0.338723 0.42294 0.332905 0.413417 0.340239 0.448819
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
120. 
patient tongue id: 03151841014268_1
label yaofang:
桂枝 柴胡 玉竹 丹参 牛膝 干姜 大黄 萆薢 土茯苓 山慈菇
0.445902 0.498014 0.428289 0.32076 0.318722 0.421114 0.323444 0.62758 0.683669 0.335257
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.200000, recall: 0.200000, error: 0.800000
121. 
patient tongue id: 04130415285916_1_6_7
label yaofang:
甘草 木香 薏苡仁 党参 白术 黄连 山药 鳖甲 莪术 建曲 白花蛇舌 红豆杉 鱼古 瓦楞子
0.877368 0.482632 0.485902 0.451287 0.301578 0.417224 0.301226 0.414902
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
122. 
patient tongue id: 04200633558601_1_6_5
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 砂仁 天麻 鳖甲 麦芽 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.946133 0.519248 0.539136 0.367625 0.520068 0.416535 0.410371 0.324664 0.318482
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 1.000000, recall: 0.642857, error: 0.000000
123. 
patient tongue id: 03111614409760_1_7_6
label yaofang:
甘草 玉竹 党参 山药 砂仁 天麻 鳖甲 麦芽 北沙参 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.750599 0.445129 0.462394 0.42342
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
124. 
patient tongue id: 05131455367709_1
label yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 熟附子 山药 天麻 鳖甲 败酱草 蜈蚣 天山雪莲 半枝莲
0.958208 0.525762 0.549541 0.366461 0.565828 0.476378 0.446311 0.391162 0.37028 0.351494
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.642857, error: 0.100000
125. 
patient tongue id: 03312113058012_5
label yaofang:
甘草 法半夏 前胡 桔梗 桃仁 远志 浙贝母 细辛 鳖甲 款冬花 紫菀 白前 诃子 苦杏仁 炙麻黄 白花蛇舌
0.993409 0.554096 0.606302 0.35928 0.320932 0.693055 0.628841 0.59449 0.537332 0.516601 0.540256
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
126. 
patient tongue id: 01312309025668_1_2_6
label yaofang:
甘草 白芍 党参 枸杞子 赤芍 天麻 磁石 鳖甲 火麻仁 麦芽 沙苑子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.949365 0.30977 0.301282 0.517053 0.537159 0.369228 0.550161 0.503569 0.457758 0.42706 0.41257 0.398851
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
127. 
patient tongue id: 05092101551866_2_6
label yaofang:
甘草 桔梗 远志 浙贝母 桑白皮 天麻 款冬花 紫菀 苇茎 白花蛇舌草 百合 蜈蚣 半枝莲 醋鳖甲
0.776288 0.364671 0.438974 0.477119 0.359171 0.303642
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
128. 
patient tongue id: 05221859059633_2_1
label yaofang:
甘草 芦根 薏苡仁 麦冬 黄芪 生地黄 枳实 乌梅 山茱萸 虎杖 决明子 地龙 北沙参 百合
0.546161 0.450478 0.352805 0.328296 0.35251 0.304937
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
129. 
patient tongue id: 01312048229509_1_3
label yaofang:
桃仁 黄芪 白术 海螵蛸 杜仲 牛膝 当归尾 砂仁 鸡内金 北沙参 紫苏梗 骨碎补 土鳖虫 红豆杉 石上柏 稻芽
0.413773 0.309764 0.459299 0.329731 0.313674 0.334201 0.36858 0.394135
predicted yaofang:
甘草 法半夏 茯苓 前胡 防风 黄芪 北沙参 炙甘草

------Score: precision: 0.250000, recall: 0.125000, error: 0.750000
130. 
patient tongue id: 02120930580764_6_7_4
label yaofang:
桂枝 甘草 柴胡 当归 茯苓 桃仁 白术 酸枣仁 赤芍 栀子 牡丹皮 莱菔子 菟丝子 益母草 豆蔻
0.972354 0.517227 0.56225 0.377794 0.55948 0.476921 0.475661 0.385458 0.371067 0.376971
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
131. 
patient tongue id: 02142321119967_6_2_5
label yaofang:
甘草 茯苓 党参 黄芪 酸枣仁 丹参 黄连 赤芍 栀子 石膏 苍术 佩兰 扁豆花 木棉花
0.985031 0.533103 0.599618 0.391548 0.314886 0.307403 0.342628 0.666369 0.61711 0.590116 0.536478 0.531691 0.564821
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
132. 
patient tongue id: 05102149233390_5
label yaofang:
甘草 防风 金银花 薏苡仁 鱼腥草 熟地黄 牡丹皮 荆芥穗 僵蚕 皂角刺 蝉蜕 蒺藜 地肤子
0.363667 0.749018 0.403562 0.974803 0.434569 0.804417 0.375617 0.363511 0.586819 0.918241 0.936199 0.880064 0.947366 0.984544 0.59145 0.788357 0.48391 0.713457
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.111111, recall: 0.153846, error: 0.888889
133. 
patient tongue id: 02281217357589_1_2_7
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.506397 0.37914 0.340108 0.430986 0.362069 0.349264 0.321831 0.321145 0.343485
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤 天麻

------Score: precision: 0.222222, recall: 0.166667, error: 0.777778
134. 
patient tongue id: 05050751063445_1_4
label yaofang:
甘草 独活 党参 白术 杜仲 山药 天麻 桑寄生 鳖甲 麦芽 续断 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.956463 0.311056 0.516975 0.535912 0.387918 0.51865 0.471378 0.472718 0.384764 0.372358 0.353443
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
135. 
patient tongue id: 02182023255241_2
label yaofang:
甘草 茯苓 党参 白术 生地黄 赤芍 牡丹皮 山药 山茱萸 菟丝子 益母草 北沙参 白花蛇舌 天山雪莲
0.988528 0.553322 0.595871 0.367403 0.327117 0.656248 0.607601 0.572613 0.518979 0.495476 0.50736
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
136. 
patient tongue id: 05022013491871_9
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.40066 0.916732 0.363221 0.998868 0.482791 0.92372 0.445526 0.378234 0.690423 0.990926 0.993659 0.976688 0.995614 0.999184 0.723023 0.893455 0.552354 0.862371
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.928571, error: 0.277778
137. 
patient tongue id: 03061816228338_5_6
label yaofang:
甘草 前胡 桔梗 金银花 连翘 芦根 牛蒡子 浙贝母 款冬花 紫菀 白前
0.975007 0.304844 0.518755 0.564319 0.359848 0.559796 0.512979 0.489382 0.417002 0.402984 0.384369
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.090909, error: 0.909091
138. 
patient tongue id: 03151904291657_4_1
label yaofang:
甘草 柴胡 白芍 枳壳 桔梗 黄芪 白术 生地黄 槟榔 厚朴 肉苁蓉 火麻仁 柿蒂 紫菀
0.372003 0.378773 0.434194 0.306385 0.376548 0.376057 0.361221 0.400752 0.497167
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
139. 
patient tongue id: 03022129231719_6
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 丹参 石菖蒲 车前子 磁石 升麻 蝉蜕 炙甘草
0.360747 0.402265 0.465402 0.352444 0.384861 0.35553 0.356557 0.471262 0.56036
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
140. 
patient tongue id: 03011852441603_4
label yaofang:
麻黄 桂枝 白芍 前胡 半夏 太子参 黄芪 五味子 细辛 干姜 白前 百部 北沙参 紫苏子 炙甘草
0.369722 0.572043 0.463958 0.769559 0.389704 0.57436 0.349517 0.312285 0.337306 0.435912 0.652141 0.666637 0.615966 0.696424 0.326388 0.830236 0.442733 0.583907 0.414188 0.522629
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.466667, error: 0.650000
141. 
patient tongue id: 04062048246601_2_7_4
label yaofang:
甘草 枳壳 牛蒡子 桃仁 麦冬 玉竹 丹参 桑叶 天花粉 火麻仁 虎杖 决明子 枇杷叶 北沙参 野马追
0.595943 0.426982 0.388894 0.428882 0.532011 0.305881 0.355173 0.329396 0.32666
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.222222, recall: 0.133333, error: 0.777778
142. 
patient tongue id: 02281159493517_1_7_6
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.435606 0.33657 0.459046 0.449509 0.397558 0.45727 0.384526 0.436927 0.434899 0.4019 0.434258 0.460776 0.390802 0.448068 0.447322 0.448367
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
143. 
patient tongue id: 06031112062526_2_4_6
label yaofang:
甘草 法半夏 茯苓 桔梗 龙骨 党参 黄芪 酸枣仁 浙贝母 郁金 鳖甲 白花蛇舌 天山雪莲 合欢花 猫爪草
0.980697 0.515889 0.580535 0.370421 0.314804 0.6229 0.550056 0.528788 0.46641 0.454457 0.472781
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
144. 
patient tongue id: 06190928468751_1_2_7
label yaofang:
甘草 白芍 茯苓 党参 黄芪 鸡血藤 黄连 生地黄 天麻 菟丝子 益母草 鳖甲 女贞子 蜈蚣 天山雪莲 半枝莲 红豆杉
0.981192 0.515109 0.577571 0.383131 0.322435 0.643328 0.571604 0.564621 0.469462 0.47613 0.533249
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.470588, error: 0.272727
145. 
patient tongue id: 02261801151849_5_1
label yaofang:
甘草 黄芩 桔梗 乌梅 白茅根 细辛 白芷 蔓荆子 麦芽 皂角刺 辛夷 广藿香 苍耳子 蜂房
0.347662 0.523466 0.453514 0.686498 0.401935 0.537149 0.378583 0.342257 0.339313 0.43649 0.56944 0.651932 0.548166 0.620271 0.813972 0.404941 0.338439 0.56395 0.358835 0.465173
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.357143, error: 0.750000
146. 
patient tongue id: 04291630466136_5_6
label yaofang:
甘草 法半夏 桃仁 浙贝母 郁金 天麻 天花粉 白花蛇舌草 苦杏仁 紫苏梗 威灵仙 蜈蚣 半枝莲 醋鳖甲 化橘红
0.926909 0.326054 0.464874 0.539459 0.387837 0.508911 0.391473 0.429546 0.309398 0.315431
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
147. 
patient tongue id: 03222004261246_2
label yaofang:
甘草 白芍 玄参 杜仲 牛膝 地黄 天麻 桑寄生 补骨脂 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.990455 0.547559 0.600335 0.364987 0.320922 0.6706 0.604142 0.571218 0.517095 0.495326 0.510452
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
148. 
patient tongue id: 03161318279740_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.374309 0.5083 0.44372 0.779709 0.362031 0.570115 0.316761 0.425217 0.647666 0.677974 0.612502 0.731763 0.334333 0.847916 0.440383 0.569274 0.38127 0.497801
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 0.933333, error: 0.222222
149. 
patient tongue id: 04260311123007_2_6
label yaofang:
甘草 党参 丹参 生地黄 浙贝母 郁金 山茱萸 天花粉 瓜蒌皮 款冬花 紫菀 王不留行 枇杷叶 苦杏仁
0.948855 0.515608 0.538666 0.380334 0.513303 0.443395 0.44133 0.351673 0.342362 0.325004
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
150. 
patient tongue id: 03291644359202_4_1
label yaofang:
甘草 葛根 鸡血藤 红花 山药 山茱萸 地黄 天麻 僵蚕 天花粉 益母草 木瓜 威灵仙
0.988151 0.548151 0.593755 0.365504 0.308893 0.656234 0.600114 0.558369 0.511396 0.488136 0.495776
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
151. 
patient tongue id: 02181611499233_6_1
label yaofang:
甘草 茯苓 党参 白术 延胡索 海螵蛸 砂仁 柿蒂 鸡内金 麦芽 首乌藤 紫苏梗 合欢皮 稻芽
0.593643 0.398742 0.369501 0.438149 0.546443 0.349582 0.326448 0.315194
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
152. 
patient tongue id: 03040848532852_1
label yaofang:
甘草 当归 黄连 生地黄 茜草 天麻 天花粉 鳖甲 火麻仁 枇杷叶 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.993352 0.302902 0.560802 0.604823 0.352416 0.304753 0.653832 0.609204 0.567136 0.515575 0.485163 0.481631
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
153. 
patient tongue id: 06072100088395_5
label yaofang:
麻黄 甘草 黄芩 法半夏 前胡 鱼腥草 桑白皮 僵蚕 款冬花 地龙 苦杏仁 紫苏子 重楼
0.95755 0.520725 0.555127 0.389798 0.315103 0.347725 0.601385 0.53149 0.519264 0.450371 0.442384 0.456233
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.076923, error: 0.916667
154. 
patient tongue id: 01182104031462_5_6
label yaofang:
甘草 黄芩 法半夏 前胡 桔梗 浙贝母 桑白皮 莱菔子 白芷 苦杏仁 紫苏子 辛夷 炙麻黄 广藿香 苍耳子
0.964358 0.522054 0.553996 0.373586 0.552097 0.46791 0.460809 0.372913 0.364734 0.354561
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.066667, error: 0.900000
155. 
patient tongue id: 01041307584982_2
label yaofang:
陈皮 茯苓 党参 白术 枳实
0.463771 0.332506 0.373914
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.666667, recall: 0.400000, error: 0.333333
156. 
patient tongue id: 04182312333390_6_1_4
label yaofang:
蒲公英 黄芪 白术 海螵蛸 郁金 山药 砂仁 珍珠母 首乌藤 蜈蚣 红豆杉 合欢皮
0.666139 0.447021 0.388244 0.383251 0.490163
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
157. 
patient tongue id: 05242230246027_6_2
label yaofang:
川芎 龙骨 党参 枸杞子 酸枣仁 丹参 山茱萸 地黄 益母草 麦芽 沙苑子 酒女贞子 墨旱莲
0.976588 0.313828 0.536854 0.561797 0.387606 0.331976 0.599593 0.554412 0.528201 0.472324 0.457799 0.451298
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.076923, error: 0.916667
158. 
patient tongue id: 04182211162881_1
label yaofang:
枳壳 黄芪 白术 赤芍 浙贝母 杜仲 砂仁 补骨脂 鸡内金 北沙参 紫苏梗 预知子 稻芽
0.73028 0.45365 0.4287 0.307311 0.435397
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
159. 
patient tongue id: 04201417120633_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.706594 0.412343 0.356993 0.494452 0.301347 0.369256 0.309087 0.329287 0.542736
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 天麻

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
160. 
patient tongue id: 03151841427568_4
label yaofang:
麻黄 陈皮 前胡 桔梗 半夏 防风 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 苍耳子
0.394653 0.686486 0.427428 0.934467 0.436309 0.726104 0.392852 0.320788 0.370351 0.531635 0.852652 0.868162 0.800686 0.893032 0.951678 0.557184 0.699502 0.46571 0.651657
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.714286, error: 0.473684
161. 
patient tongue id: 01041813358826_2
label yaofang:
麻黄 甘草 葛根 前胡 桔梗 半夏 防风 荆芥穗 石斛 紫菀 蝉蜕 辛夷 广藿香 苍耳子
0.378309 0.370911 0.455562 0.391782 0.387076 0.405435 0.428035 0.786686
predicted yaofang:
法半夏 茯苓 前胡 防风 紫菀 白前 百部 炙甘草

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
162. 
patient tongue id: 01180605332418_6_1_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 酸枣仁 黄连 川楝子 乌梅 山药 细辛 合欢花
0.918285 0.499204 0.527452 0.374983 0.305072 0.507816 0.349834 0.382519
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
163. 
patient tongue id: 02201311365886_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 肉桂 豆蔻 制川乌 姜半夏 炙甘草 紫苏梗
0.587678 0.335364 0.41835 0.359722 0.441582 0.358517
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
164. 
patient tongue id: 02251232411241_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 广藿香
0.379642 0.610007 0.453494 0.849467 0.397946 0.629241 0.356818 0.31295 0.35464 0.469415 0.739067 0.758007 0.700411 0.791678 0.322935 0.895312 0.475348 0.638046 0.463793 0.58634
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.923077, error: 0.400000
165. 
patient tongue id: 04250816363920_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.435084 0.309383 0.544763 0.315918 0.441731 0.421321 0.535803 0.456029 0.491007 0.548417 0.47146 0.473874 0.579703 0.436789 0.558863 0.549364 0.545416
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.705882, recall: 1.000000, error: 0.294118
166. 
patient tongue id: 01202014305224_4_1
label yaofang:
甘草 茯苓 白术 海螵蛸 浙贝母 款冬花 诃子 枇杷叶 北沙参
0.450284 0.430766 0.320417 0.410663 0.387127 0.391112
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.444444, error: 0.333333
167. 
patient tongue id: 05222101141649_5_4
label yaofang:
麦冬 黄芪 五味子 杜仲 厚朴 僵蚕 瓜蒌皮 莪术 诃子 鸡内金 枇杷叶 地龙 北沙参 蝉蜕
0.62603 0.423037 0.354879 0.428305 0.519664 0.302532 0.352784 0.303723 0.357177
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
168. 
patient tongue id: 04300909341453_5
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 黄连 苍术 山药 厚朴 菟丝子 益母草 豆蔻 合欢花 麸炒枳壳
0.918989 0.487225 0.510677 0.394135 0.463091 0.36577 0.404873
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
169. 
patient tongue id: 04122041301217_6_2
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 桃仁 远志 浙贝母 款冬花 紫菀 苦杏仁 紫苏子 炙麻黄
0.931067 0.497701 0.493844 0.423551 0.301445 0.449658 0.321879 0.419478
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
170. 
patient tongue id: 02221240487142_1_2
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.426054 0.324949 0.376316 0.370811
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 1.000000, recall: 0.307692, error: 0.000000
171. 
patient tongue id: 05171901408977_4
label yaofang:
陈皮 前胡 桔梗 防风 款冬花 紫菀 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.389639 0.827257 0.409619 0.986556 0.467104 0.821111 0.430646 0.307665 0.379925 0.594113 0.949041 0.961818 0.908195 0.964579 0.99222 0.604544 0.814808 0.507251 0.763106
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 1.000000, error: 0.368421
172. 
patient tongue id: 06181705535673_1_5
label yaofang:
甘草 桃仁 太子参 黄芪 赤芍 厚朴 生半夏 僵蚕 北沙参 苦杏仁 赭石 辛夷 蜈蚣 紫苑
0.410718 0.420113 0.366355 0.439131 0.438374 0.408841
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
173. 
patient tongue id: 04112052569546_6_1
label yaofang:
甘草 白芍 川芎 防风 白及 党参 白术 黄连 乌梅 山药 薤白 干姜 桑寄生 建曲
0.953968 0.305886 0.503038 0.543547 0.381737 0.522768 0.434168 0.43891 0.343186 0.33939 0.324977
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
174. 
patient tongue id: 05162058092285_6_4
label yaofang:
麻黄 桂枝 白芍 牛蒡子 鱼腥草 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.307034 0.382449 0.438011 0.327422 0.358787 0.348044 0.382138 0.465353 0.5723
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
175. 
patient tongue id: 05160620241721_5
label yaofang:
陈皮 茯苓 半夏 牡蛎 防风 薏苡仁 黄芪 赤芍 浙贝母 桑叶 辛夷 苍耳子
0.537486 0.421049 0.334982 0.36575 0.438502 0.519962 0.324325 0.315372 0.381628 0.34164 0.318698 0.37409 0.313691
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.230769, recall: 0.250000, error: 0.769231
176. 
patient tongue id: 01031824153244_5
label yaofang:
防风 钩藤 荆芥穗 白芷 炙甘草 首乌藤 广藿香 威灵仙 香薰 炒六神曲 炒蔓荆子 棉萆薢 醋香附
0.40343 0.836602 0.399379 0.990992 0.496911 0.866059 0.446319 0.331479 0.391653 0.646285 0.958874 0.973194 0.927759 0.974862 0.994803 0.650246 0.842078 0.525946 0.787941
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.263158, recall: 0.384615, error: 0.736842
177. 
patient tongue id: 01012115347471_1_3
label yaofang:
丹参 牛膝 泽泻 莱菔子 天麻 决明子 夏枯草 制何首乌 盐车前子 燀桃仁
0.854908 0.49381 0.492645 0.386753 0.301101 0.460385 0.351735
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.142857, recall: 0.100000, error: 0.857143
178. 
patient tongue id: 05092054069181_4_6
label yaofang:
桂枝 甘草 茯苓 桔梗 薏苡仁 党参 白术 海螵蛸 山药 砂仁 王不留行 白扁豆 泽兰
0.359136 0.392725 0.447706 0.321798 0.315814 0.3688 0.361388 0.359955 0.303718 0.431064 0.576793 0.335287
predicted yaofang:
甘草 柴胡 白芍 香附 茯苓 党参 白术 海螵蛸 浙贝母 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
179. 
patient tongue id: 04301051453407_5_7_1
label yaofang:
甘草 白芍 牛蒡子 薏苡仁 白术 熟附子 大黄 天麻 鳖甲 火麻仁 败酱草 地龙 首乌藤 蜈蚣 天山雪莲 半枝莲
0.969512 0.333321 0.544662 0.553947 0.362361 0.588174 0.521303 0.478325 0.44385 0.412765 0.377082
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
180. 
patient tongue id: 04271532307560_1_4_7
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.450862 0.36206 0.401381 0.337393 0.34023
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
181. 
patient tongue id: 02141828438609_4
label yaofang:
陈皮 法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.420114 0.745465 0.411263 0.969141 0.461013 0.78952 0.423047 0.34423 0.399645 0.576842 0.90706 0.926157 0.863121 0.939663 0.976137 0.605568 0.748832 0.506853 0.70917
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
182. 
patient tongue id: 03282206291109_4
label yaofang:
白芍 当归 茯苓 薄荷 白术 柏子仁 枳实 北柴胡 炙甘草 猫爪草
0.452369 0.513637 0.432881 0.304439 0.303921 0.417839 0.310389 0.643778 0.715144 0.325456
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.300000, recall: 0.300000, error: 0.700000
183. 
patient tongue id: 02201838153825_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.357689 0.478675 0.442357 0.764411 0.350343 0.534356 0.389973 0.633242 0.661483 0.594161 0.708124 0.342311 0.828242 0.422999 0.532383 0.330652 0.443457
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.812500, error: 0.235294
184. 
patient tongue id: 05160610216675_1_3_4
label yaofang:
甘草 陈皮 前胡 桔梗 厚朴 僵蚕 川贝母 紫菀 百部 虎杖 枇杷叶 地龙 紫苏叶
0.489738 0.408589 0.364237 0.424681 0.381165 0.352974
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
185. 
patient tongue id: 03032024280406_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.383233 0.714504 0.450202 0.93674 0.427725 0.712529 0.392184 0.319103 0.371448 0.524423 0.848522 0.870805 0.797567 0.887749 0.962103 0.524074 0.717844 0.490515 0.661485
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
186. 
patient tongue id: 06191205259030_7_4_6
label yaofang:
甘草 茯苓 木香 连翘 党参 白术 大腹皮 砂仁 天麻 麦芽 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.934959 0.329934 0.529153 0.510975 0.388231 0.314217 0.517411 0.412114 0.434818 0.321568 0.311758 0.306084
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
187. 
patient tongue id: 02181954033451_6_4
label yaofang:
甘草 川芎 法半夏 茯苓 枸杞子 白术 牛膝 天麻 麦芽 女贞子 首乌藤 墨旱莲
0.968597 0.525826 0.564287 0.367761 0.326611 0.595996 0.468126 0.475477 0.376942 0.370114 0.382207
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.333333, error: 0.636364
188. 
patient tongue id: 05232036456742_5_2
label yaofang:
甘草 茯苓 半夏 薏苡仁 白术 红花 赤芍 海螵蛸 杜仲 郁金 僵蚕 麦芽 白鲜皮 土茯苓 合欢皮 蛇舌草
0.51407 0.413875 0.402851 0.32592 0.482012 0.56101 0.350888 0.33998 0.433593 0.380528 0.364112 0.429039 0.365307
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.538462, recall: 0.437500, error: 0.461538
189. 
patient tongue id: 06031115585166_6_4
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 知母 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.957141 0.305679 0.518516 0.560054 0.388158 0.303088 0.315426 0.585619 0.505531 0.495507 0.422981 0.416005 0.423979
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
190. 
patient tongue id: 04202215219709_2_1_7
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 丹参 生地黄 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989751 0.511181 0.618986 0.34256 0.695532 0.606469 0.582281 0.498586 0.508106 0.558358
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.600000, error: 0.100000
191. 
patient tongue id: 04201425287126_1_2_7
label yaofang:
甘草 当归 茯苓 党参 黄芪 酸枣仁 丹参 鸡内金 浮小麦 首乌藤 百合 制远志
0.534074 0.38133 0.36524 0.456344 0.363294 0.380458 0.353007 0.330123 0.316879 0.368275
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 车前子 莱菔子 天麻

------Score: precision: 0.500000, recall: 0.416667, error: 0.500000
192. 
patient tongue id: 05162235022126_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 砂仁 紫菀 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.312793 0.379982 0.447083 0.487626 0.398002 0.387545 0.411227 0.41128 0.460339 0.359964 0.634312 0.403461 0.304597
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.538462, recall: 0.437500, error: 0.461538
193. 
patient tongue id: 04221902591730_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.366538 0.587201 0.449491 0.832088 0.397018 0.614859 0.344685 0.339131 0.451098 0.715644 0.73284 0.682241 0.768953 0.308733 0.868724 0.467389 0.607843 0.430198 0.556389
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
194. 
patient tongue id: 06070022342291_1_6
label yaofang:
甘草 柴胡 白芍 茯苓 木香 党参 酸枣仁 槟榔 山药 桑叶 厚朴 砂仁 五灵脂 浮小麦 合欢花
0.957148 0.51656 0.550472 0.377244 0.554876 0.447298 0.447839 0.353244 0.346424 0.344839
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
195. 
patient tongue id: 03232309041318_2_4_6
label yaofang:
甘草 白芍 川芎 黄芩 远志 党参 白术 杜仲 牛膝 钩藤 天麻 僵蚕 防己 石决明 桑寄生 益母草 麦芽
0.962205 0.504707 0.546195 0.374306 0.311453 0.57334 0.48572 0.483272 0.392667 0.391748 0.393667
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.235294, error: 0.636364
196. 
patient tongue id: 06022234091124_1_4_7
label yaofang:
甘草 陈皮 茯苓 半夏 党参 白术 海螵蛸 杜仲 厚朴 僵蚕 桑寄生 鸡内金 苦杏仁 紫苏子 紫苏叶 三七粉
0.574627 0.405063 0.386867 0.444403 0.487403 0.323097 0.314482
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
197. 
patient tongue id: 05191941300488_7_2
label yaofang:
甘草 白芍 川芎 龙骨 桃仁 生地黄 红花 赤芍 山药 山茱萸 补骨脂 浮小麦 首乌藤 川木瓜
0.959639 0.318781 0.527119 0.543013 0.386183 0.537122 0.483514 0.481588 0.393159 0.377346 0.361388
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
198. 
patient tongue id: 05221858010019_6
label yaofang:
陈皮 党参 黄芪 乌药 升麻 路路通 五指毛桃
0.844527 0.466601 0.47063 0.444596 0.332958 0.338875
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
199. 
patient tongue id: 01202005541697_1_7_4
label yaofang:
黄芪 白术 海螵蛸 浙贝母 砂仁 瓜蒌皮 莪术 鸡内金 北沙参 蛤壳 威灵仙 山慈菇 蛇舌草 鲜龙葵果
0.714952 0.474741 0.373647 0.405801
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
200. 
patient tongue id: 03301936137931_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄 炒蔓荆子
0.327699 0.38731 0.450573 0.465636 0.408461 0.311464 0.379535 0.402941 0.39162 0.441995 0.380883 0.638247 0.312121 0.418177 0.332556
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.733333, recall: 0.733333, error: 0.266667
201. 
patient tongue id: 06092002532115_1_2_7
label yaofang:
甘草 陈皮 茯苓 半夏 木香 远志 党参 枸杞子 白术 柏子仁 海螵蛸 山药 菟丝子 鸡内金 紫苏子 红豆杉 岗梅
0.496652 0.4262 0.34717 0.426686 0.451712 0.365647
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.666667, recall: 0.235294, error: 0.333333
202. 
patient tongue id: 02151811281936_1_4_7
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.507257 0.338495 0.455584 0.459387 0.403024 0.453744 0.37057 0.41878 0.402376 0.368591 0.376595 0.441639 0.436987 0.416382 0.413303 0.388994
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.125000, recall: 0.166667, error: 0.875000
203. 
patient tongue id: 06062242229137_2_1
label yaofang:
甘草 玉竹 太子参 山茱萸 天麻 猪苓 鳖甲 鸡内金 麦芽 北沙参 蜈蚣 天山雪莲 半枝莲 广金钱草
0.97033 0.307726 0.52751 0.553375 0.34973 0.581136 0.512682 0.468221 0.435612 0.411918 0.391628
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
204. 
patient tongue id: 06052008134039_5
label yaofang:
柴胡 川芎 香附 陈皮 橘红 芦根 蒲公英 竹茹 桑白皮 砂仁 白芷 瓜蒌皮 扁豆花 百合 土茯苓
0.420475 0.3584 0.338179 0.469948 0.553214 0.396152 0.383715 0.34803 0.319323 0.381417 0.351709
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.090909, recall: 0.066667, error: 0.909091
205. 
patient tongue id: 02141950490270_2_7
label yaofang:
金樱子 覆盆子
0.857596 0.300643 0.496677 0.419078 0.364542
predicted yaofang:
甘草 法半夏 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
206. 
patient tongue id: 01012109111003_1_4_6
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.454383 0.316173 0.348996 0.439292 0.351941 0.35749 0.33219 0.324203 0.303454 0.322637
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 车前子 莱菔子 天麻

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
207. 
patient tongue id: 03020846301098_6
label yaofang:
甘草 茯苓 白术 酸枣仁 栀子 牡丹皮 桑叶 天麻 鳖甲 白花蛇舌草 浮小麦 蜈蚣 天山雪莲 半枝莲
0.935539 0.482739 0.488713 0.48576 0.384555 0.446201
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
208. 
patient tongue id: 05092036130253_7_4
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮
0.340062 0.386031 0.454297 0.323337 0.357429 0.341507 0.338084 0.450864 0.595861 0.300308
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.200000, recall: 0.153846, error: 0.800000
209. 
patient tongue id: 03291852466870_4_6
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草
0.371899 0.375336 0.449074 0.372754 0.336527 0.305813 0.393985 0.546017
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
210. 
patient tongue id: 02231829161766_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.349309 0.643268 0.425398 0.907908 0.383207 0.697945 0.316841 0.325 0.486324 0.804032 0.81618 0.781617 0.86537 0.932045 0.511974 0.655957 0.450638 0.609615
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.800000, error: 0.333333
211. 
patient tongue id: 05131450331869_1_2_7
label yaofang:
甘草 茯苓 独活 党参 黄芪 丹参 赤芍 牛膝 山茱萸 水蛭 桑寄生 补骨脂 鹿角霜 续断 川加皮 牛大力
0.995611 0.573248 0.623367 0.350534 0.302486 0.322046 0.712241 0.659168 0.615128 0.569577 0.538883 0.556756
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
212. 
patient tongue id: 01201841171872_1_4
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 远志 党参 黄芪 酸枣仁 黄连 乌梅 皂角刺 首乌藤 建曲 麸炒枳壳
0.972298 0.309821 0.534935 0.573515 0.392103 0.333645 0.309037 0.349854 0.622395 0.572379 0.544357 0.50473 0.485254 0.499225
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.266667, error: 0.714286
213. 
patient tongue id: 01110410437100_2
label yaofang:
白芍 薏苡仁 延胡索 牛膝 全蝎 木瓜 苏木 炙甘草 蜈蚣 两面针
0.438012 0.417665 0.342606 0.367933
predicted yaofang:
甘草 茯苓 党参 炙甘草

------Score: precision: 0.250000, recall: 0.100000, error: 0.750000
214. 
patient tongue id: 05112014197641_1_2_5
label yaofang:
甘草 牡蛎 黄芪 白术 生地黄 海螵蛸 浙贝母 山茱萸 枇杷叶 北沙参 辛夷 红豆杉 合欢皮 山慈菇 蛇舌草
0.496428 0.354995 0.305544 0.326787 0.501485 0.594647 0.391766 0.399619 0.382771 0.33915 0.349093
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
215. 
patient tongue id: 02201804227201_4_1
label yaofang:
法半夏 茯苓 前胡 麦冬 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.407809 0.70974 0.424803 0.949871 0.437352 0.747435 0.396729 0.32504 0.381832 0.54781 0.869384 0.890536 0.822326 0.91166 0.965793 0.562568 0.727663 0.483653 0.673514
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.785714, error: 0.421053
216. 
patient tongue id: 02171932515469_1_2
label yaofang:
当归 黄芪 鸡血藤 白术 仙鹤草 砂仁 补骨脂 莪术 鹿角胶 鸡内金 女贞子 黄精 骨碎补 稻芽 红芪 红参
0.403 0.366821 0.444021 0.306983 0.331872
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
217. 
patient tongue id: 04202104064834_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 蜜枇杷叶 龙脷叶
0.315046 0.31682 0.377112 0.352746 0.313 0.361298 0.369896 0.504746
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
218. 
patient tongue id: 03020235042112_6_2
label yaofang:
甘草 独活 党参 白术 杜仲 地黄 天麻 桑寄生 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲 烫狗脊
0.969339 0.523385 0.545676 0.381404 0.318439 0.575237 0.510839 0.490491 0.422623 0.410265 0.410048
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
219. 
patient tongue id: 04291846378756_1_2_7
label yaofang:
甘草 薏苡仁 太子参 黄芪 生地黄 天麻 鳖甲 补骨脂 地龙 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫
0.709525 0.410105 0.443849 0.450359
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
220. 
patient tongue id: 04281833289090_5
label yaofang:
甘草 柴胡 白芍 桃仁 鸡血藤 红花 制枳壳
0.530907 0.329971 0.381513 0.369841 0.417803 0.410509 0.319827
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.428571, recall: 0.428571, error: 0.571429
221. 
patient tongue id: 05042045323541_4
label yaofang:
甘草 生地黄 浙贝母 石膏 苍术 细辛 紫苏叶 川木通
0.323803 0.412822 0.47384 0.349312 0.362735 0.343583 0.360501 0.310782 0.318902 0.474676 0.62729 0.343012
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 浙贝母 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.166667, recall: 0.250000, error: 0.833333
222. 
patient tongue id: 05272331421838_2_5
label yaofang:
黄芪 白术 生地黄 山茱萸 天麻 僵蚕 芡实 枇杷叶 北沙参 辛夷 山慈菇 蛇舌草 冬凌草
0.568896 0.395425 0.408932 0.334832 0.438584
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
223. 
patient tongue id: 06080204163206_5_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 远志 枸杞子 白术 酸枣仁 泽泻 天麻 麦芽 女贞子 首乌藤 沙苑子
0.977707 0.502705 0.574542 0.372333 0.302314 0.602961 0.532946 0.520422 0.431865 0.437559 0.467286
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
224. 
patient tongue id: 04291627449856_1_2_5
label yaofang:
甘草 远志 党参 酸枣仁 生地黄 山药 天麻 鳖甲 豆蔻 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.899528 0.501237 0.467579 0.487427 0.308686 0.364577 0.437364
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
225. 
patient tongue id: 04202222399246_6_3
label yaofang:
桂枝 甘草 当归 茯苓 桃仁 党参 酸枣仁 红花 赤芍 杜仲 郁金 薤白 桑寄生 瓜蒌皮 醋香附
0.985164 0.504368 0.593593 0.373123 0.31664 0.658482 0.564513 0.561597 0.454485 0.464649 0.537821
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
226. 
patient tongue id: 02142327391310_1_5_6
label yaofang:
甘草 法半夏 茯苓 桔梗 酸枣仁 浙贝母 栀子 天麻 扁豆花 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 木棉花
0.984812 0.519349 0.585209 0.386257 0.333864 0.646622 0.583383 0.576345 0.484293 0.482992 0.533831
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
227. 
patient tongue id: 03230709325389_6_4_7
label yaofang:
甘草 香附 茯苓 桔梗 党参 丹参 浙贝母 郁金 佩兰 鳖甲 扁豆花 莪术 诃子 夏枯草 猫爪草
0.983379 0.528647 0.582873 0.384337 0.324069 0.630076 0.582406 0.563087 0.490076 0.478953 0.503281
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
228. 
patient tongue id: 04300853010361_6_2
label yaofang:
甘草 荆芥 桃仁 蒲公英 红花 牡丹皮 郁金 地黄 地骨皮 天花粉 紫草 瓜蒌皮 王不留行 麦芽 白鲜皮
0.921814 0.454904 0.526186 0.410852 0.461306 0.327779 0.419799
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.142857, recall: 0.066667, error: 0.857143
229. 
patient tongue id: 04150749217863_1_3
label yaofang:
桃仁 丹参 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.46323 0.335755 0.42612 0.44439 0.407445 0.419172 0.342686 0.394684 0.382786 0.354564 0.372686 0.411084 0.372378 0.385062 0.397035 0.37764
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.687500, recall: 0.916667, error: 0.312500
230. 
patient tongue id: 04221854155670_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.373052 0.589565 0.463323 0.808215 0.386442 0.563984 0.35399 0.314961 0.321288 0.416708 0.683743 0.702879 0.638788 0.725418 0.347052 0.85517 0.42512 0.576273 0.41029 0.529009
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.937500, error: 0.250000
231. 
patient tongue id: 02242336085557_4_1
label yaofang:
甘草 海螵蛸 桑白皮 僵蚕 川贝母 枇杷叶 地龙 苦杏仁 紫苏子 蝉蜕 炙麻黄
0.524573 0.361658 0.356323 0.362381 0.479475
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
232. 
patient tongue id: 01200647426200_1_4
label yaofang:
甘草 薏苡仁 党参 白术 酸枣仁 砂仁 天麻 豆蔻 白花蛇舌草 白扁豆 建曲 蜈蚣 半枝莲 醋鳖甲
0.989778 0.538307 0.59033 0.378894 0.307621 0.338392 0.677781 0.624419 0.606099 0.51924 0.514418 0.562983
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
233. 
patient tongue id: 01070848167168_1_4_5
label yaofang:
甘草 枳壳 木香 党参 酸枣仁 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.446594 0.329832 0.509578 0.456883 0.407399 0.511226 0.440895 0.481663 0.514764 0.453098 0.475854 0.542749 0.435182 0.519091 0.513529 0.504706
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.250000, recall: 0.333333, error: 0.750000
234. 
patient tongue id: 04222109289231_1_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.370494 0.809707 0.404818 0.987091 0.448515 0.816582 0.411512 0.355217 0.582662 0.948466 0.962371 0.915565 0.965977 0.991936 0.594539 0.807584 0.507598 0.763771
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.928571, error: 0.277778
235. 
patient tongue id: 04141831574013_4_7
label yaofang:
甘草 柴胡 白芍 当归 茯苓 薄荷 白术 栀子 牡丹皮 杜仲 郁金 菟丝子 鸡内金 紫苏梗
0.530479 0.427755 0.383245 0.396208 0.420544 0.32611
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
236. 
patient tongue id: 03240106147377_7_2
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 薏苡仁 党参 酸枣仁 天麻 肉苁蓉 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 土鳖虫
0.966309 0.520308 0.555393 0.375953 0.563708 0.49355 0.473784 0.402273 0.393243 0.382832
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.500000, error: 0.200000
237. 
patient tongue id: 03301924065599_2
label yaofang:
陈皮 法半夏 前胡 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.354761 0.605534 0.456672 0.859721 0.399536 0.65823 0.33457 0.351317 0.480839 0.756004 0.762193 0.705774 0.80843 0.903213 0.500136 0.666131 0.426363 0.581323
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.800000, error: 0.333333
238. 
patient tongue id: 06071854140427_4
label yaofang:
甘草 陈皮 茯苓 半夏 龙骨 牡蛎 白术 酸枣仁 钩藤 菊花 天麻 首乌藤 广金钱草
0.577791 0.358033 0.395111 0.343882 0.445159
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
239. 
patient tongue id: 06031722190912_1_4
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.357582 0.485157 0.45222 0.725075 0.355884 0.525201 0.39407 0.603979 0.621895 0.582004 0.677261 0.356667 0.802416 0.422827 0.540473 0.37921 0.485257
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.647059, recall: 0.785714, error: 0.352941
240. 
patient tongue id: 02190536266329_1_7_6
label yaofang:
甘草 酸枣仁 生地黄 乌药 山药 山茱萸 天麻 鳖甲 桑螵蛸 益智 鹿角霜 浮小麦 蜈蚣 天山雪莲 半枝莲
0.780707 0.332388 0.417572 0.500922 0.397514 0.364794
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
241. 
patient tongue id: 04121330297024_4
label yaofang:
麻黄 茯苓 葛根 前胡 桔梗 半夏 防风 款冬花 紫菀 白前 百部 紫苏子 炙甘草 广藿香
0.398595 0.764755 0.419341 0.968769 0.475543 0.80577 0.428672 0.33756 0.393469 0.60272 0.904789 0.931714 0.861916 0.934503 0.982185 0.597258 0.301624 0.777027 0.464838 0.704803
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
242. 
patient tongue id: 05312254443887_2_4_6
label yaofang:
甘草 桔梗 金银花 芦根 牛蒡子 白术 浙贝母 乌梅 鳖甲 皂角刺 白花蛇舌 蜂房 岗梅根 四季青
0.957884 0.486062 0.549331 0.375578 0.5388 0.412697 0.440903 0.306816 0.317588 0.335941
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
243. 
patient tongue id: 04141828577813_1_4_6
label yaofang:
党参 枸杞子 白术 浙贝母 杜仲 牛膝 桑叶 厚朴 僵蚕 百部 北沙参 紫苏子 紫苏叶 紫苑 南杏仁
0.488964 0.362479 0.35242 0.301038 0.4993 0.590836 0.359962 0.409616 0.363368 0.323833 0.377127 0.359888
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
244. 
patient tongue id: 03020817068483_5_6
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 党参 白术 浙贝母 细辛 款冬花 苦杏仁 紫苏子 炙麻黄
0.975242 0.516261 0.561035 0.407922 0.326029 0.603701 0.547433 0.561738 0.44046 0.452106 0.513824
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
245. 
patient tongue id: 03132043551916_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.454623 0.430254 0.340164 0.339583
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
246. 
patient tongue id: 05021912574027_7
label yaofang:
白芍 川芎 当归 茯苓 党参 白术 熟地黄 杜仲 升麻 三七 炙甘草 炙黄芪 血余炭
0.423906 0.306659 0.345306 0.351213 0.334236 0.465952 0.404777 0.304513 0.367173
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 海螵蛸 浙贝母 炙甘草

------Score: precision: 0.555556, recall: 0.384615, error: 0.444444
247. 
patient tongue id: 01012057139636_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.498048 0.341568 0.413181 0.412595 0.307372
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
248. 
patient tongue id: 06070654263175_7_4
label yaofang:
甘草 川芎 法半夏 茯苓 白术 红花 杜仲 牛膝 郁金 石菖蒲 天麻 桑螵蛸 益智 天山雪莲
0.945335 0.502981 0.553808 0.370807 0.303359 0.553765 0.423105 0.422258 0.331436 0.331703 0.32383
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
249. 
patient tongue id: 01041647064004_6_1
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.705619 0.434776 0.440831 0.323491 0.414712
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
250. 
patient tongue id: 03012046007710_2
label yaofang:
甘草 玉竹 太子参 浙贝母 郁金 天麻 天花粉 鳖甲 北沙参 白扁豆 浮小麦 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.959713 0.525073 0.546684 0.4051 0.310904 0.536944 0.492873 0.495382 0.408508 0.394204 0.393515
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
251. 
patient tongue id: 05222126267759_2_1_7
label yaofang:
蒲公英 龙齿 太子参 黄芪 白术 延胡索 海螵蛸 郁金 砂仁 三七 桑寄生 鸡内金 北沙参 首乌藤
0.488818 0.383671 0.311741 0.32366 0.436878 0.536057 0.333546 0.355331 0.339672 0.338614 0.30192
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
252. 
patient tongue id: 03211943521366_1_4
label yaofang:
甘草 陈皮 当归 党参 黄芪 白术 肉桂 干姜 砂仁 升麻 北柴胡 金钱草 桑螵蛸 炙甘草 附片 覆盆子 车前草
0.417904 0.476725 0.388994 0.348284 0.332122 0.382809 0.302735 0.556749 0.640565 0.30723
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.400000, recall: 0.235294, error: 0.600000
253. 
patient tongue id: 05260637133544_1_2
label yaofang:
甘草 茯苓 党参 白术 生地黄 山药 天麻 鳖甲 桑螵蛸 益智 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.977595 0.522051 0.561569 0.38651 0.331759 0.601283 0.527919 0.53775 0.427135 0.430997 0.465812
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.785714, error: 0.000000
254. 
patient tongue id: 03291357396673_1_2
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 生地黄 栀子 黄柏 牛膝 山药 灯心草 淡竹叶 麦芽 浮小麦 百合
0.94282 0.51995 0.52422 0.408115 0.316577 0.482512 0.418874 0.456866 0.332554 0.325722 0.321567
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.294118, error: 0.545455
255. 
patient tongue id: 01130645266672_6_7_2
label yaofang:
柴胡 白芍 法半夏 党参 延胡索 槟榔 厚朴 天麻 五灵脂 鳖甲 炙甘草 蜈蚣 天山雪莲 半枝莲 姜黄
0.984433 0.311576 0.551247 0.582786 0.345012 0.311588 0.661288 0.55882 0.517708 0.467937 0.44818 0.434294
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
256. 
patient tongue id: 02141908353026_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.418147 0.755139 0.419925 0.967674 0.461781 0.789997 0.423616 0.336676 0.405866 0.591786 0.902474 0.924264 0.855148 0.936022 0.978721 0.594023 0.761998 0.508312 0.710591
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
257. 
patient tongue id: 02182308122067_1_6
label yaofang:
甘草 太子参 酸枣仁 丹参 五味子 山药 天麻 鳖甲 补骨脂 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.975899 0.531545 0.575519 0.376923 0.314448 0.328139 0.629882 0.561108 0.532421 0.482125 0.461962 0.477112
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
258. 
patient tongue id: 02122223403050_1_7
label yaofang:
甘草 薏苡仁 党参 黄芪 白术 丹参 熟附子 赤芍 山药 干姜 菟丝子 益母草 鳖甲 莪术 土鳖虫
0.986344 0.551427 0.584025 0.373609 0.313002 0.624821 0.590071 0.550244 0.503941 0.478341 0.475859
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
259. 
patient tongue id: 03240616592582_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 桔梗 白术 丹参 浙贝母 郁金 麦芽 猫爪草 红曲
0.957387 0.304417 0.515377 0.538661 0.366529 0.517532 0.449211 0.439597 0.359303 0.348114 0.323014
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
260. 
patient tongue id: 03091854342645_5_6
label yaofang:
甘草 枳壳 桔梗 金银花 连翘 牛蒡子 白术 浙贝母 莱菔子 麦芽 苦杏仁 独脚金 稻芽
0.96617 0.50392 0.571532 0.409395 0.327778 0.350472 0.615586 0.542477 0.555156 0.454919 0.462029 0.528489
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
261. 
patient tongue id: 03311827135004_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄
0.374501 0.659596 0.420796 0.913923 0.434373 0.715011 0.371937 0.316493 0.36999 0.525429 0.816746 0.838867 0.784876 0.866811 0.938686 0.534624 0.684997 0.458648 0.636406
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
262. 
patient tongue id: 04241916421754_2_5
label yaofang:
甘草 陈皮 金银花 芦根 浙贝母 扁豆花 三棱 莪术 黑枣 半枝莲 猫爪草 蛇舌草
0.44139 0.338447 0.408704 0.385284
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
263. 
patient tongue id: 02212123403940_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.38908 0.725725 0.428455 0.955212 0.453463 0.771693 0.396625 0.307383 0.372171 0.558062 0.878955 0.903651 0.830479 0.914565 0.970956 0.565997 0.753597 0.477605 0.685975
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.812500, error: 0.315789
264. 
patient tongue id: 01192242058142_6_4
label yaofang:
甘草 桃仁 远志 细辛 天麻 鳖甲 款冬花 紫菀 诃子 苦杏仁 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991473 0.53166 0.594258 0.351074 0.642687 0.586484 0.557617 0.482668 0.474021 0.485862
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.466667, error: 0.300000
265. 
patient tongue id: 04200312336406_1_2
label yaofang:
甘草 党参 酸枣仁 生地黄 延胡索 杜仲 细辛 天麻 鳖甲 补骨脂 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.973268 0.535943 0.563543 0.395672 0.332414 0.599845 0.549185 0.530086 0.466684 0.453093 0.469493
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
266. 
patient tongue id: 04300851441426_5_1
label yaofang:
甘草 茯苓 党参 白术 佩兰 天麻 鳖甲 莪术 豆蔻 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.942992 0.474328 0.544744 0.407167 0.543234 0.436628 0.482976 0.33061 0.35607 0.396649
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.642857, error: 0.100000
267. 
patient tongue id: 03302134133528_6_2_4
label yaofang:
甘草 川芎 法半夏 茯苓 牡蛎 白术 酸枣仁 黄连 生地黄 肉桂 灯心草 天麻 滑石 麦芽 艾叶
0.929766 0.31065 0.504765 0.504267 0.391784 0.436347 0.359556 0.396391
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.333333, error: 0.375000
268. 
patient tongue id: 03012043402562_6_5
label yaofang:
甘草 白芍 川芎 茯苓 党参 黄芪 牛膝 山药 山茱萸 天麻 磁石 蔓荆子 女贞子 墨旱莲
0.775696 0.459142 0.471275 0.397435 0.349259
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
269. 
patient tongue id: 01211238133672_4_7_1
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 鸡血藤 牡丹皮 干姜 全蝎 天花粉 炙甘草 蜈蚣 土鳖虫 狗脊
0.467021 0.378803 0.40623
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.333333, recall: 0.058824, error: 0.666667
270. 
patient tongue id: 06162224154952_1_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.376611 0.627559 0.423004 0.916821 0.403611 0.698883 0.35768 0.348462 0.499531 0.814872 0.842385 0.770167 0.871965 0.939326 0.53038 0.679815 0.451443 0.616037
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.833333, recall: 0.937500, error: 0.166667
271. 
patient tongue id: 05242226331835_2_4
label yaofang:
甘草 桔梗 芦根 牛蒡子 麦冬 太子参 浙贝母 天麻 白花蛇舌草 北沙参 紫苏子 蜈蚣 半枝莲 醋鳖甲
0.984211 0.533993 0.577041 0.367574 0.301131 0.629453 0.559584 0.528389 0.475592 0.45033 0.451201
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
272. 
patient tongue id: 05191940070762_2_1
label yaofang:
甘草 薏苡仁 桃仁 太子参 红花 延胡索 浙贝母 川楝子 郁金 天麻 鳖甲 苦杏仁 百合 蜈蚣 白花蛇舌 红豆杉
0.981033 0.541386 0.582399 0.36487 0.311963 0.626323 0.569179 0.52681 0.48216 0.461636 0.457444
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
273. 
patient tongue id: 03240557245976_7_4_6
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 法半夏 大枣 茯苓 龙骨 牡蛎 远志 党参 丹参 干姜 浮小麦 首乌藤
0.957119 0.300709 0.5166 0.527675 0.350892 0.301715 0.539022 0.409435 0.411146 0.315077 0.309225
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
274. 
patient tongue id: 04101858078843_1_4
label yaofang:
甘草 前胡 桔梗 防风 薄荷 荆芥穗 白芷 北柴胡 香薷 紫菀 百部 辛夷 紫苏梗 广藿香
0.392274 0.668784 0.424245 0.926075 0.435605 0.718307 0.38479 0.312761 0.371648 0.524735 0.835481 0.854595 0.79376 0.880558 0.944336 0.544448 0.694588 0.458244 0.646773
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.642857, error: 0.526316
275. 
patient tongue id: 01062042235429_5_6_7
label yaofang:
白芍 陈皮 当归 防风 白术 黄连 乌梅 山药 干姜 仙鹤草 败酱草 皂角刺 炙甘草 姜黄 艾叶
0.978809 0.524972 0.574854 0.371639 0.579421 0.509008 0.512496 0.400969 0.388919 0.407816
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.066667, error: 0.900000
276. 
patient tongue id: 06181846209617_2_7
label yaofang:
甘草 茯苓 桃仁 党参 生地黄 赤芍 山茱萸 天麻 鳖甲 女贞子 浮小麦 首乌藤 沙苑子 蜈蚣 白花蛇舌 半枝莲
0.953848 0.51362 0.537183 0.383712 0.528546 0.44607 0.450992 0.357615 0.350519 0.345178
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.500000, error: 0.200000
277. 
patient tongue id: 04131817492617_4_6
label yaofang:
甘草 茯苓 木香 薏苡仁 党参 酸枣仁 生地黄 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.911471 0.513753 0.506778 0.414339 0.318093 0.463759 0.373227 0.415267
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.428571, error: 0.250000
278. 
patient tongue id: 01250639374407_1_7
label yaofang:
甘草 茯苓 龙骨 党参 酸枣仁 丹参 柏子仁 生地黄 山药 山茱萸 补骨脂
0.963318 0.520772 0.542601 0.393788 0.316678 0.541469 0.470773 0.476136 0.383991 0.368562 0.369094
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.363636, error: 0.636364
279. 
patient tongue id: 04020849361473_1
label yaofang:
甘草 陈皮 法半夏 茯苓 橘红 远志 党参 杜仲 山药 山茱萸 巴戟天 补骨脂 金樱子 佛手
0.97041 0.529926 0.568007 0.388028 0.321955 0.591346 0.536068 0.520966 0.449792 0.437347 0.448904
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
280. 
patient tongue id: 01180606399632_4
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 桑白皮 款冬花 射干 紫菀 苦杏仁 炙麻黄
0.993314 0.54471 0.616026 0.364132 0.318725 0.352126 0.690153 0.631261 0.607337 0.541912 0.53182 0.562482
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
281. 
patient tongue id: 02122119459694_6_1
label yaofang:
甘草 白芍 龙骨 赤芍 天麻 鳖甲 补骨脂 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜 宽筋藤
0.968334 0.515891 0.557421 0.369559 0.305862 0.58919 0.5149 0.501837 0.42752 0.423693 0.42453
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
282. 
patient tongue id: 03012152059904_6_2
label yaofang:
甘草 茯苓 白术 酸枣仁 生地黄 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.853525 0.496808 0.478863 0.369342 0.42067 0.323513
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
283. 
patient tongue id: 04071309309172_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.346763 0.508772 0.44193 0.707161 0.352295 0.522058 0.325079 0.304785 0.303752 0.413285 0.59006 0.627706 0.590645 0.648247 0.336605 0.797236 0.4014 0.544313 0.381692 0.474389
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
284. 
patient tongue id: 02191223545516_1_2_6
label yaofang:
甘草 白芍 防风 丹参 黄连 生地黄 红花 天麻 僵蚕 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 乌梢蛇
0.959589 0.489788 0.558498 0.389497 0.553262 0.46753 0.47979 0.359855 0.365232 0.396882
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.411765, error: 0.300000
285. 
patient tongue id: 03170957243964_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.431909 0.348453 0.432174 0.300642 0.433992 0.422303 0.429247 0.341031 0.403086 0.421332 0.380163 0.387653 0.43136 0.31353 0.406516 0.419294 0.406695
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.705882, recall: 1.000000, error: 0.294118
286. 
patient tongue id: 05092120334896_2_5
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 茯苓 党参 白术 生地黄 牛膝 石膏 淡竹叶 麦芽 广藿香 莲须
0.988728 0.548496 0.594967 0.352336 0.640052 0.584939 0.542026 0.493181 0.470322 0.463205
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
287. 
patient tongue id: 03192257565883_1_5_6
label yaofang:
甘草 柴胡 白芍 茯苓 木香 党参 白术 酸枣仁 黄连 延胡索 川楝子 乌梅 山药 白扁豆 建曲
0.95291 0.50501 0.551539 0.37185 0.549418 0.404585 0.421135 0.314598 0.310967 0.30824
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
288. 
patient tongue id: 02151909348614_4
label yaofang:
陈皮 法半夏 前胡 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.381696 0.606287 0.418034 0.884826 0.391055 0.663905 0.385803 0.344659 0.342052 0.501013 0.776436 0.823885 0.723817 0.830604 0.924515 0.522781 0.303146 0.644671 0.453044 0.572876
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.833333, error: 0.500000
289. 
patient tongue id: 04181924281899_4_6
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.418192 0.479015 0.40075 0.344296 0.325744 0.40007 0.57306 0.63852
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.166667, error: 0.750000
290. 
patient tongue id: 06072126078339_4_1
label yaofang:
桂枝 甘草 柴胡 枳壳 法半夏 党参 丹参 赤芍 川楝子 郁金 薤白 瓜蒌皮 补骨脂 麦芽 田七末
0.98925 0.30506 0.532168 0.591584 0.376707 0.309415 0.341456 0.681729 0.617161 0.59894 0.533095 0.517846 0.559365
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.200000, error: 0.769231
291. 
patient tongue id: 02141941523676_6
label yaofang:
海螵蛸 肉桂 干姜 附片
0.390932 0.342708 0.3929 0.382268
predicted yaofang:
甘草 茯苓 党参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
292. 
patient tongue id: 03012059522541_1_4_6
label yaofang:
甘草 法半夏 大枣 葶苈子 党参 浙贝母 厚朴 砂仁 天麻 鳖甲 苦杏仁 丝瓜络 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.744533 0.465226 0.452376 0.391588
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.750000, recall: 0.187500, error: 0.250000
293. 
patient tongue id: 04150810567070_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.430349 0.300972 0.489655 0.430937 0.411441 0.491552 0.406073 0.454159 0.487553 0.416295 0.431476 0.503031 0.398165 0.483266 0.491444 0.470549
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
294. 
patient tongue id: 05080758021113_1_4_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 黄芪 生地黄 红花 赤芍 牛膝 六神曲
0.466986 0.41194 0.394177 0.388217
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.500000, recall: 0.153846, error: 0.500000
295. 
patient tongue id: 02241437124070_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 海螵蛸 山药 砂仁 菟丝子 白扁豆 续断
0.44327 0.502226 0.446021 0.306905 0.307831 0.308312 0.432632 0.30982 0.366027 0.311784 0.653902 0.72688 0.351968
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 浙贝母 干姜 豆蔻 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.230769, recall: 0.272727, error: 0.769231
296. 
patient tongue id: 03311700454911_1_7
label yaofang:
当归 茯苓 木香 党参 黄芪 鸡血藤 白术 柏子仁 海螵蛸 炙甘草 百合 紫苏叶
0.641629 0.316737 0.406861 0.42633 0.43025
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
297. 
patient tongue id: 03171210478673_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.415853 0.348968 0.321867 0.391446 0.409709 0.33823 0.328253 0.302424
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
298. 
patient tongue id: 05131603487038_3
label yaofang:
甘草 茯苓 桃仁 党参 生地黄 红花 肉桂 山药 山茱萸 菟丝子 益母草 淫羊藿 仙茅 女贞子
0.972845 0.534104 0.54871 0.355468 0.560414 0.488157 0.455643 0.396316 0.379215 0.35305
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
299. 
patient tongue id: 06071851467799_1
label yaofang:
茯苓 薏苡仁 党参 黄芪 白术 酸枣仁 五味子 鸡内金 珍珠母 麦芽 炙甘草 煅龙骨 稻芽
0.521454 0.368135 0.383624 0.405048 0.436871
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
300. 
patient tongue id: 01041629189215_6
label yaofang:
柴胡 黄芩 大枣 龙骨 党参 白术 泽泻 天麻 姜半夏 炙甘草 续断
0.637098 0.321036 0.391437 0.396309 0.440812 0.398332 0.304175
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 浙贝母

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
301. 
patient tongue id: 01172359288914_1_5
label yaofang:
甘草 茯苓 半夏 橘红 太子参 白术 酸枣仁 砂仁 北沙参 首乌藤 合欢皮 山慈菇
0.765493 0.461904 0.434525 0.38568 0.317631
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
302. 
patient tongue id: 04071400063437_1_2_7
label yaofang:
甘草 法半夏 前胡 桔梗 橘红 金银花 薏苡仁 藿香 白前 枇杷叶 苦杏仁 干鱼腥草
0.317516 0.381128 0.344786 0.454154
predicted yaofang:
甘草 茯苓 黄芪 炙甘草

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
303. 
patient tongue id: 04182036131258_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 姜半夏 炙甘草 龙脷叶
0.762148 0.314709 0.454428 0.443969 0.375057 0.315698
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
304. 
patient tongue id: 06012114330427_1_7
label yaofang:
甘草 枳壳 半夏 黄芪 黄连 杜仲 乌药 柿蒂 赭石 紫苏叶 蜈蚣 荔枝核
0.411027 0.376764 0.345161 0.451941 0.507917 0.37241 0.348515 0.33597 0.386965 0.348407
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.300000, recall: 0.250000, error: 0.700000
305. 
patient tongue id: 03101937397240_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.379838 0.564697 0.470485 0.790974 0.388954 0.578314 0.351918 0.305704 0.354962 0.44263 0.682747 0.678608 0.635946 0.739455 0.325146 0.815183 0.459844 0.565624 0.423071 0.536645
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
306. 
patient tongue id: 05092147229753_4
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.302 0.48777 0.435315 0.733232 0.300909 0.497624 0.323197 0.580503 0.589031 0.574392 0.661517 0.337146 0.816197 0.350984 0.498027 0.326448 0.429487
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.647059, recall: 0.785714, error: 0.352941
307. 
patient tongue id: 01201325217604_1_2_5
label yaofang:
甘草 薏苡仁 鸡血藤 生地黄 天麻 肉苁蓉 鳖甲 火麻仁 补骨脂 莪术 蜈蚣 天山雪莲 半枝莲 乌梢蛇
0.982655 0.307862 0.543772 0.577699 0.37295 0.321568 0.59426 0.554373 0.527244 0.470175 0.442503 0.432488
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
308. 
patient tongue id: 02142157329991_2_7_6
label yaofang:
甘草 生地黄 山药 山茱萸 菊花 天麻 鳖甲 扁豆花 莪术 桑螵蛸 麦芽 益智 蜈蚣 天山雪莲 半枝莲 木棉花
0.4467 0.461754 0.361407 0.374733 0.375135
predicted yaofang:
甘草 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
309. 
patient tongue id: 05162139537286_1_2_4
label yaofang:
甘草 玉竹 太子参 灯心草 天麻 鳖甲 茵陈 扁豆花 麦芽 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.968458 0.300176 0.504214 0.567521 0.356631 0.558722 0.474773 0.460541 0.376935 0.371357 0.363085
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
310. 
patient tongue id: 01052140268764_4_6_7
label yaofang:
法半夏 茯苓 薏苡仁 酸枣仁 浙贝母 郁金 天麻 鳖甲 补骨脂 莪术 蜈蚣 天山雪莲 半枝莲
0.985346 0.524072 0.582498 0.363273 0.31857 0.643103 0.592871 0.561355 0.501091 0.494664 0.505371
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
311. 
patient tongue id: 01250632548641_1_7_4
label yaofang:
甘草 茯苓 党参 白术 丹参 赤芍 郁金 山楂 益母草 首乌藤 建曲 制何首乌 土茯苓 三七粉
0.936278 0.517954 0.535385 0.395707 0.344011 0.541885 0.457674 0.462657 0.381958 0.369644 0.377063
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
312. 
patient tongue id: 05131635049192_6_2
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 砂仁 天麻 鳖甲 扁豆花 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.856649 0.313675 0.456596 0.49168 0.378389 0.365074
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
313. 
patient tongue id: 04112154475540_1_2
label yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 黄柏 山药 白茅根 砂仁 菟丝子 桑寄生 益母草 白花蛇舌
0.895526 0.495319 0.508889 0.391651 0.441518 0.310448 0.363149
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
314. 
patient tongue id: 04130049495240_6_1
label yaofang:
甘草 党参 丹参 生地黄 杜仲 天麻 桑寄生 鳖甲 补骨脂 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.960675 0.499767 0.525435 0.453167 0.313129 0.490479 0.40454 0.513868 0.313687 0.38664
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
315. 
patient tongue id: 03281927383412_6_2
label yaofang:
甘草 柴胡 白芍 当归 芦根 桃仁 丹参 枳实 栀子 桑叶 菊花 地黄 瓜蒌皮 北沙参 苦杏仁
0.567367 0.405275 0.417884 0.311126 0.408449
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
316. 
patient tongue id: 05261944346435_1_4_3
label yaofang:
甘草 陈皮 茯苓 半夏 木香 远志 太子参 枸杞子 白术 海螵蛸 杜仲 山药 砂仁 菟丝子 鸡内金 紫苏子 红豆杉
0.445941 0.386677 0.362746 0.462442 0.535201 0.315527 0.362485 0.317718 0.300502 0.405417 0.306861
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.636364, recall: 0.411765, error: 0.363636
317. 
patient tongue id: 03171357254611_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.416406 0.862837 0.399176 0.994646 0.484903 0.886118 0.457412 0.316097 0.404543 0.675539 0.971245 0.981276 0.938572 0.983702 0.997283 0.672634 0.866815 0.520318 0.801902
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
318. 
patient tongue id: 04251856245791_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.39473 0.738097 0.41605 0.962031 0.459136 0.785014 0.409588 0.323911 0.38889 0.586715 0.895738 0.917777 0.853118 0.927361 0.976674 0.590885 0.756911 0.469413 0.694362
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
319. 
patient tongue id: 03012037039230_6_1_2
label yaofang:
甘草 党参 生地黄 赤芍 浙贝母 郁金 天麻 鳖甲 莪术 麦芽 续断 蜈蚣 白花蛇舌 红豆杉 猫爪草
0.985205 0.319141 0.56319 0.582291 0.36728 0.331776 0.632699 0.575117 0.538687 0.48719 0.462046 0.454281
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
320. 
patient tongue id: 02122113083107_2
label yaofang:
甘草 白芍 川芎 当归 防风 黄芪 何首乌 白术 五味子 生地黄 红花 牡丹皮 荆芥穗 火麻仁 麦芽 白鲜皮
0.871099 0.483436 0.484585 0.424707 0.356752 0.34246
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
321. 
patient tongue id: 05162148409727_2_5
label yaofang:
甘草 白芍 茯苓 木香 党参 白术 生地黄 牡丹皮 黄柏 山药 山茱萸 菟丝子 巴戟天 益母草 补骨脂 白花蛇舌
0.90675 0.478717 0.519901 0.558871
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.750000, recall: 0.187500, error: 0.250000
322. 
patient tongue id: 02141952414943_4
label yaofang:
甘草 法半夏 黄连 栀子 泽泻 大黄 淡豆豉 紫草 莪术 皂角刺 紫苏叶
0.781378 0.467007 0.438029 0.397363
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.090909, error: 0.750000
323. 
patient tongue id: 01182204187497_2
label yaofang:
甘草 茯苓 桔梗 麦冬 太子参 丹参 浙贝母 乌梅 郁金 天花粉 鳖甲 白花蛇舌 蜂房 岗梅根 四季青
0.971044 0.538292 0.556999 0.355705 0.583553 0.454628 0.439357 0.35832 0.35229 0.326477
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
324. 
patient tongue id: 03012319140950_6_4
label yaofang:
甘草 川芎 法半夏 茯苓 桔梗 赤芍 浙贝母 牛膝 天麻 豆蔻 白花蛇舌草 浮小麦 蜈蚣 合欢花 醋鳖甲
0.982069 0.537357 0.582343 0.362559 0.308343 0.630591 0.556728 0.521523 0.469604 0.450947 0.447922
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
325. 
patient tongue id: 02212049084926_5_3
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 黄连 熟附子 杜仲 肉桂 山药 泽泻 蛇床子 首乌藤 覆盆子
0.967876 0.302177 0.32107 0.535158 0.558832 0.388012 0.308533 0.335933 0.592581 0.545441 0.514447 0.473124 0.450379 0.438843
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.285714, recall: 0.285714, error: 0.714286
326. 
patient tongue id: 01211230117926_2_1_7
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 牡丹皮 干姜 天花粉 炙甘草 猫爪草 风栗壳 石见穿
0.303684 0.327387 0.411027 0.348076 0.302416 0.379278 0.526218
predicted yaofang:
甘草 柴胡 白芍 党参 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
327. 
patient tongue id: 01121839383441_4
label yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.408138 0.825563 0.412299 0.985719 0.47148 0.83145 0.425403 0.339192 0.407273 0.615478 0.94398 0.95574 0.90597 0.966679 0.991101 0.611197 0.806877 0.544585 0.763652
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
328. 
patient tongue id: 04132028204014_1_7_2
label yaofang:
当归 党参 黄芪 鸡血藤 白术 砂仁 瓜蒌皮 补骨脂 鸡内金 北沙参 女贞子 首乌藤 稻芽
0.496546 0.401409 0.359045 0.322361 0.461226 0.552472 0.344815 0.390319 0.350991 0.319369 0.391353 0.336006
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.500000, recall: 0.461538, error: 0.500000
329. 
patient tongue id: 03022049238883_1_2
label yaofang:
甘草 当归 茯苓 桃仁 玉竹 党参 黄芪 枸杞子 山药 鸡内金 虎杖 麦芽 北沙参 六神曲 五指毛桃 有瓜石斛 三七粉
0.470636 0.349583 0.378626 0.446766 0.410171 0.389318 0.369173 0.329313 0.304149 0.32301 0.337172 0.325368 0.316698 0.316259 0.304459
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.333333, recall: 0.294118, error: 0.666667
330. 
patient tongue id: 02150738158983_1_4_7
label yaofang:
甘草 薏苡仁 麦冬 太子参 枸杞子 丹参 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 黄精 三七粉
0.416719 0.326793 0.364637 0.367423 0.316575 0.304811
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 钩藤

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
331. 
patient tongue id: 03291852082375_4_7
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.349668 0.398675 0.443098 0.355917 0.371549 0.372279 0.390749 0.469865 0.538151 0.30345
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.700000, recall: 0.636364, error: 0.300000
332. 
patient tongue id: 04282032543123_2_6
label yaofang:
甘草 白芍 川芎 茯苓 党参 枸杞子 白术 牛膝 山药 天麻 麦芽 蒺藜 首乌藤 沙苑子
0.984159 0.532455 0.580717 0.362106 0.313955 0.623026 0.555804 0.523737 0.46235 0.448199 0.450197
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
333. 
patient tongue id: 04260639165286_2
label yaofang:
甘草 茯苓 党参 玄参 赤芍 浙贝母 郁金 山药 地黄 天麻 白花蛇舌草 蜈蚣 醋鳖甲
0.946084 0.489202 0.527729 0.383583 0.474841 0.375058 0.413268
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.384615, error: 0.285714
334. 
patient tongue id: 03141630584108_1_3_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.427732 0.312542 0.431703 0.347983 0.304163 0.303954
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
335. 
patient tongue id: 06170923024864_1_4
label yaofang:
黄芪 白术 赤芍 海螵蛸 浙贝母 砂仁 莪术 鸡内金 北沙参 首乌藤 红豆杉 合欢皮 预知子 稻芽
0.389296 0.303261 0.451745 0.346871 0.361807 0.392043
predicted yaofang:
甘草 法半夏 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
336. 
patient tongue id: 04202112383755_4_1
label yaofang:
柴胡 黄芩 党参 白术 石菖蒲 泽泻 天麻 姜半夏 炙甘草 续断
0.385978 0.391877 0.357496 0.422746 0.535859 0.331385 0.570715 0.645641 0.312133 0.345513
predicted yaofang:
柴胡 白芍 香附 白术 海螵蛸 浙贝母 姜半夏 炙甘草 紫苏叶 紫苏梗

------Score: precision: 0.400000, recall: 0.400000, error: 0.600000
337. 
patient tongue id: 03292057207162_1_3
label yaofang:
桂枝 当归 党参 黄芪 枸杞子 杜仲 肉桂 泽泻 芡实 桑椹
0.448634 0.413744 0.304796 0.322225 0.41728 0.439939 0.365131
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 北沙参

------Score: precision: 0.285714, recall: 0.200000, error: 0.714286
338. 
patient tongue id: 05242107063927_6_1
label yaofang:
甘草 黄芩 党参 玄参 黄连 生地黄 牛膝 知母 石膏 苍术 细辛 白芷 天花粉
0.951722 0.511229 0.546999 0.38784 0.316556 0.568469 0.488905 0.477868 0.405214 0.39605 0.399101
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
339. 
patient tongue id: 04112209487787_4_2
label yaofang:
甘草 独活 党参 白术 延胡索 杜仲 天麻 桑寄生 补骨脂 白花蛇舌草 威灵仙 蜈蚣 半枝莲 醋鳖甲
0.977388 0.524682 0.570184 0.383653 0.301714 0.338443 0.621775 0.540453 0.52739 0.451568 0.442812 0.47454
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
340. 
patient tongue id: 05162036179097_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.342453 0.429869 0.488283 0.385838 0.36971 0.344206 0.364909 0.308209 0.511605 0.590747 0.316871
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 浙贝母 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.727273, recall: 0.727273, error: 0.272727
341. 
patient tongue id: 05221909407436_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 黄芪 白术 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香
0.361974 0.409271 0.367922 0.415654 0.35389 0.424424 0.374592
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
342. 
patient tongue id: 04142003101879_6_4
label yaofang:
甘草 川芎 茯苓 党参 酸枣仁 牛膝 天麻 桑寄生 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.791709 0.450371 0.429344 0.309747 0.500044
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
343. 
patient tongue id: 02211822043233_4
label yaofang:
甘草 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 香薷 辛夷 紫苏叶 广藿香 苍耳子
0.390016 0.774724 0.406598 0.981008 0.453067 0.817752 0.404447 0.305352 0.379882 0.593238 0.934997 0.948193 0.893298 0.957437 0.986369 0.618717 0.787097 0.47834 0.73291
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.315789, recall: 0.461538, error: 0.684211
344. 
patient tongue id: 06141842372673_5
label yaofang:
前胡 半夏 牛蒡子 桃仁 蒲公英 白术 赤芍 浙贝母 郁金 大黄 厚朴 瓜蒌皮 莪术 北沙参 苦杏仁 赭石 瓜蒌子 紫苑
0.504533 0.404554 0.348127 0.351476 0.445461
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.055556, error: 0.800000
345. 
patient tongue id: 06092000121530_1_2_7
label yaofang:
陈皮 半夏 远志 党参 黄芪 枸杞子 白术 杜仲 牛膝 山药 鳖甲 麦芽 炙甘草 首乌藤 紫苏梗 龟甲 蛇舌草
0.497146 0.391521 0.392468 0.375753 0.462447 0.328765
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.500000, recall: 0.176471, error: 0.500000
346. 
patient tongue id: 04071421166889_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 细辛 白芷 款冬花 紫菀 百部 紫苏子 炙甘草 辛夷 广藿香
0.415521 0.834489 0.383008 0.992077 0.496379 0.872939 0.449852 0.335979 0.417916 0.670969 0.966669 0.976718 0.939405 0.980166 0.994057 0.68951 0.833264 0.501049 0.784805
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.785714, error: 0.421053
347. 
patient tongue id: 04181912250648_4_1
label yaofang:
陈皮 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄
0.369011 0.569177 0.458287 0.797551 0.396505 0.58848 0.346706 0.307765 0.334685 0.437833 0.677256 0.701116 0.653119 0.726933 0.337607 0.839908 0.450882 0.597398 0.424586 0.539745
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
348. 
patient tongue id: 02211846378512_3
label yaofang:
桂枝 白芍 当归 茯苓 龙骨 牡蛎 牛蒡子 党参 黄芪 白术 附子 生石膏 炙甘草
0.525487 0.327317 0.389457 0.374507 0.423289 0.392967 0.354321
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.714286, recall: 0.384615, error: 0.285714
349. 
patient tongue id: 01040102132409_1_4_7
label yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 红花 延胡索 赤芍 牛膝 桑寄生 补骨脂 续断 威灵仙
0.981082 0.522817 0.583242 0.356356 0.614249 0.547065 0.526435 0.450628 0.443792 0.455696
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
350. 
patient tongue id: 03231250362498_4_1
label yaofang:
陈皮 法半夏 茯苓 葛根 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香
0.35891 0.528568 0.473548 0.69108 0.374048 0.52608 0.339219 0.300029 0.31202 0.408913 0.582307 0.592836 0.550466 0.626865 0.340472 0.78247 0.403754 0.546965 0.383018 0.482767
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
351. 
patient tongue id: 03022148335899_4
label yaofang:
当归 木香 党参 黄芪 鸡血藤 白术 柏子仁 虎杖 白花蛇舌草 炙甘草 百合 紫苏叶
0.489656 0.394013 0.404016 0.350931 0.392779
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
352. 
patient tongue id: 03290654197935_6_4_7
label yaofang:
甘草 茯苓 生地黄 牡丹皮 杜仲 黄柏 牛膝 山药 山茱萸 桑寄生 淡竹叶 补骨脂 续断
0.981124 0.520241 0.584649 0.364261 0.304645 0.312165 0.63517 0.562797 0.532806 0.474211 0.462085 0.480633
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
353. 
patient tongue id: 03231125431416_2_7_6
label yaofang:
甘草 党参 生地黄 杜仲 郁金 山药 白茅根 天麻 菟丝子 益母草 鳖甲 蜈蚣 天山雪莲 半枝莲 龙葵果
0.989521 0.508095 0.609669 0.372924 0.316073 0.687405 0.59318 0.602492 0.487735 0.494508 0.578256
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
354. 
patient tongue id: 04130644000681_1_6
label yaofang:
甘草 白芍 川芎 龙骨 酸枣仁 玄参 天冬 红花 栀子 牛膝 桑寄生 麦芽 赭石 首乌藤 醋鳖甲
0.988508 0.537545 0.592941 0.352047 0.643412 0.573519 0.535342 0.480971 0.45616 0.45717
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.066667, error: 0.900000
355. 
patient tongue id: 03022120589835_6_1_4
label yaofang:
当归 茯苓 桔梗 远志 党参 酸枣仁 丹参 玄参 五味子 天冬 柏子仁 生地黄 厚朴 火麻仁
0.497131 0.396129 0.313794 0.318891 0.449547 0.531972 0.324472 0.358411 0.323117 0.370733
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 北沙参

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
356. 
patient tongue id: 03151829210567_3
label yaofang:
白芍 川芎 大枣 当归 党参 太子参 枸杞子 熟地黄 山萸肉 炙甘草 续断 制何首乌 炙黄芪 盐菟丝子 酒女贞子
0.377123 0.3609
predicted yaofang:
茯苓 钩藤

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
357. 
patient tongue id: 01200638521477_6_5
label yaofang:
金银花 党参 红花 厚朴 荆芥穗 天麻 鳖甲 火麻仁 麦芽 白鲜皮 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 土茯苓
0.946259 0.479013 0.553796 0.385169 0.542626 0.425712 0.450888 0.324183 0.337496 0.368215
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.437500, error: 0.300000
358. 
patient tongue id: 05250457504045_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 芦根 桃仁 麦冬 浙贝母 细辛 射干 诃子 蝉蜕
0.609318 0.446873 0.401309 0.384666 0.424726 0.321822
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
359. 
patient tongue id: 02161925157422_4_1
label yaofang:
甘草 茯苓 半夏 橘红 太子参 山药 桑白皮 僵蚕 枇杷叶 地龙 紫苏叶 黑枣
0.472538 0.412594 0.349359 0.344007
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
360. 
patient tongue id: 04062006015367_1_4
label yaofang:
白芍 香附 枳壳 法半夏 党参 海螵蛸 车前子 北柴胡 麦芽 炙甘草 紫苏梗 威灵仙
0.413359 0.46841 0.357197 0.335853 0.349132 0.394974 0.517748 0.630986 0.317644
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
361. 
patient tongue id: 05182054080989_6_4
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 广金钱草
0.399324 0.397329 0.461884 0.308365 0.311292 0.389788 0.35628 0.312769 0.40464 0.520932
predicted yaofang:
甘草 柴胡 白芍 香附 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.600000, recall: 0.500000, error: 0.400000
362. 
patient tongue id: 04282256596421_2_6
label yaofang:
甘草 茯苓 远志 党参 鸡血藤 白术 酸枣仁 赤芍 天麻 菟丝子 鳖甲 蜈蚣 天山雪莲 半枝莲 红豆杉
0.989752 0.540871 0.604213 0.33567 0.676498 0.592575 0.541126 0.490306 0.476053 0.484406
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.600000, error: 0.100000
363. 
patient tongue id: 01192140304600_2_5
label yaofang:
甘草 川芎 牡蛎 党参 酸枣仁 牛膝 钩藤 泽泻 天麻 磁石 麦芽 地龙 蒺藜 首乌藤 谷精子
0.923309 0.487437 0.507432 0.431092 0.431275 0.318859 0.425005
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
364. 
patient tongue id: 03012219456301_2_4_7
label yaofang:
甘草 浙贝母 郁金 山药 地黄 车前子 天麻 白花蛇舌草 茺蔚子 鹿角霜 浮小麦 百合 蜈蚣 合欢花 醋鳖甲 炒鸡内金
0.954255 0.302238 0.523668 0.543282 0.379506 0.310454 0.548019 0.480275 0.458631 0.39883 0.386419 0.366665
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
365. 
patient tongue id: 03022215287708_6_4
label yaofang:
甘草 白芍 川芎 茯苓 枸杞子 牛膝 天麻 全蝎 鳖甲 益智 女贞子 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.978521 0.541112 0.573662 0.387587 0.325038 0.612936 0.575028 0.543675 0.4975 0.470458 0.475263
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
366. 
patient tongue id: 05182015393434_1_4_6
label yaofang:
薏苡仁 黄芪 何首乌 白术 海螵蛸 厚朴 菟丝子 桑寄生 橘络 桑枝 土鳖虫 红豆杉 山慈菇 黑老虎
0.480666 0.371395 0.354499 0.451876 0.45307 0.306884 0.305626
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
367. 
patient tongue id: 02202219177280_6_4
label yaofang:
甘草 法半夏 党参 酸枣仁 竹茹 浙贝母 郁金 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.975158 0.316809 0.526973 0.553435 0.372689 0.302732 0.565257 0.513784 0.49598 0.423685 0.409468 0.395448
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
368. 
patient tongue id: 05140651214677_3_4
label yaofang:
甘草 白芍 茯苓 党参 生地黄 熟附子 杜仲 山药 山茱萸 车前子 桑寄生 猪苓 补骨脂 牛大力
0.925251 0.507276 0.526158 0.385637 0.30598 0.503553 0.348165 0.396198
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
369. 
patient tongue id: 03021321513709_5
label yaofang:
甘草 陈皮 茯苓 薏苡仁 滑石 萹蓄 广藿香 焦栀子 干鱼腥草 麸炒白术 炒六神曲 川木通 广金钱草 车前草
0.392527 0.65769 0.467835 0.894654 0.424078 0.68503 0.394811 0.318045 0.383872 0.513117 0.795918 0.81432 0.725083 0.835065 0.925327 0.526654 0.687058 0.445998 0.606131
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.157895, recall: 0.214286, error: 0.842105
370. 
patient tongue id: 05221925279841_1
label yaofang:
麻黄 陈皮 前胡 桔梗 半夏 防风 白芷 款冬花 紫菀 白前 百部 蝉蜕 炙甘草 辛夷 紫苏梗
0.3792 0.799368 0.428119 0.982502 0.447197 0.807114 0.401247 0.358312 0.580572 0.935404 0.951927 0.88819 0.955738 0.990734 0.581419 0.811641 0.487295 0.736644
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.733333, error: 0.388889
371. 
patient tongue id: 02142002447507_1
label yaofang:
柴胡 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.416023 0.365076 0.392665 0.3374 0.365695
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
372. 
patient tongue id: 03311811209880_1_4
label yaofang:
陈皮 法半夏 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.390817 0.722165 0.440885 0.947296 0.446888 0.739342 0.396559 0.318904 0.379206 0.537894 0.865201 0.887862 0.814796 0.901605 0.965659 0.538969 0.739708 0.495077 0.677097
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
373. 
patient tongue id: 06190157216929_2_4
label yaofang:
甘草 法半夏 茯苓 桔梗 橘红 芦根 太子参 浙贝母 鳖甲 紫菀 苦杏仁 百合 白花蛇舌 蜂房 四季青
0.938236 0.32803 0.528487 0.526187 0.371543 0.502706 0.461668 0.420941 0.388347 0.355924 0.313715
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
374. 
patient tongue id: 02212041172234_5_6
label yaofang:
甘草 薏苡仁 丹参 杜仲 黄柏 苍术 山楂 天麻 决明子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 三七粉
0.992196 0.552914 0.597617 0.365246 0.644948 0.592239 0.564796 0.495759 0.466301 0.482868
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
375. 
patient tongue id: 01211235585240_4_7
label yaofang:
白芍 麦冬 党参 三七 鳖甲 酒萸肉
0.379557 0.347888 0.362128 0.360568 0.36797 0.304678 0.352255
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.142857, recall: 0.166667, error: 0.857143
376. 
patient tongue id: 05231133267962_1_4_7
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 厚朴
0.382377 0.335925 0.390867 0.365289 0.328933
predicted yaofang:
甘草 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
377. 
patient tongue id: 05260712482286_1_2_7
label yaofang:
桂枝 甘草 柴胡 白芍 茯苓 桃仁 党参 青皮 牡丹皮 山药 菟丝子 益母草 王不留行 合欢花
0.992452 0.522162 0.617075 0.369212 0.313849 0.327915 0.711717 0.627997 0.623329 0.525185 0.532571 0.608886
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
378. 
patient tongue id: 05222048283442_1_6_5
label yaofang:
牡蛎 连翘 党参 白术 赤芍 山药 厚朴 砂仁 北沙参 土鳖虫 红豆杉 山慈菇 预知子 蛇舌草
0.480124 0.382468 0.381695 0.302264 0.525169 0.576594 0.328392 0.425839 0.359132 0.372747 0.426175 0.340237
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
379. 
patient tongue id: 02142200252756_6_4
label yaofang:
甘草 川芎 党参 丹参 栀子 苍术 天麻 全蝎 磁石 白芷 蔓荆子 麦芽 首乌藤 谷精子
0.944884 0.490466 0.529872 0.424545 0.315222 0.46749 0.350615 0.457308 0.305249
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.333333, recall: 0.214286, error: 0.666667
380. 
patient tongue id: 04180847010682_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.566043 0.381133 0.440856 0.301306 0.302535
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
381. 
patient tongue id: 01190059503846_5
label yaofang:
陈皮 黄芩 法半夏 茯苓 桔梗 芦根 牛蒡子 薏苡仁 鱼腥草 浙贝母 桑白皮 款冬花 紫菀 白前 苦杏仁 板蓝根
0.975631 0.301291 0.339294 0.529641 0.560729 0.376094 0.326821 0.586347 0.555499 0.531149 0.479431 0.462229 0.457636
predicted yaofang:
甘草 白芍 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.125000, error: 0.846154
382. 
patient tongue id: 03032026199387_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.382168 0.543869 0.468274 0.697249 0.38247 0.514758 0.330811 0.365734 0.333825 0.334681 0.400869 0.595345 0.608271 0.559353 0.625155 0.368214 0.766407 0.40994 0.300351 0.526083 0.397925 0.481174
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.727273, recall: 1.000000, error: 0.272727
383. 
patient tongue id: 03232300296240_1_7
label yaofang:
甘草 白芍 川芎 法半夏 茯苓 党参 枸杞子 白术 黄连 生地黄 牛膝 天麻 麦芽 首乌藤
0.962935 0.511266 0.573284 0.384667 0.326046 0.60421 0.535452 0.516864 0.447246 0.440134 0.477172
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
384. 
patient tongue id: 03090800372196_5
label yaofang:
甘草 前胡 桔梗 芦根 牛蒡子 浙贝母 天麻 鳖甲 款冬花 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.903198 0.489607 0.468303 0.464968 0.338406 0.373778
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
385. 
patient tongue id: 05262056463081_5_2
label yaofang:
甘草 柴胡 白芍 连翘 生地黄 石膏 山药 白芷 胡黄连 淡竹叶 芡实 麦芽 广藿香 天山雪莲 川木通
0.992261 0.519152 0.626276 0.370615 0.331507 0.34849 0.725177 0.643062 0.636893 0.546173 0.551112 0.636044
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
386. 
patient tongue id: 04261328517448_6_1
label yaofang:
甘草 柴胡 川芎 香附 防风 赤芍 荆芥穗 白芷 郁李仁 芥子
0.46303 0.510243 0.467926 0.312975 0.312556 0.327727 0.456671 0.316875 0.307013 0.305153 0.63915 0.694677 0.363068
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 浙贝母 干姜 豆蔻 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.153846, recall: 0.200000, error: 0.846154
387. 
patient tongue id: 01042313228497_2
label yaofang:
枳壳 太子参 白术 枳实 神曲 山楂 砂仁 石斛 火麻仁 麦芽 郁李仁 百合 紫苏叶
0.376919 0.37932 0.453056 0.301144 0.304719 0.381829 0.334516 0.310652 0.40784 0.556371
predicted yaofang:
甘草 柴胡 白芍 香附 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.100000, recall: 0.076923, error: 0.900000
388. 
patient tongue id: 03281921581672_4
label yaofang:
麻黄 桂枝 甘草 柴胡 白芍 陈皮 黄芩 法半夏 当归 葛根 桔梗 龙骨 牡蛎 桃仁 麦冬 丹参 黄连 熟地黄 胆南星 栀子 细辛 地黄 干姜 石斛 三七 半边莲
0.962465 0.528386 0.551839 0.386538 0.319261 0.580317 0.490655 0.479099 0.410349 0.399347 0.395374
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.038462, error: 0.909091
389. 
patient tongue id: 01090003183397_1_4
label yaofang:
桂枝 白芍 茯苓 薏苡仁 桃仁 牡丹皮
0.300232 0.318916 0.395275 0.31755 0.351858 0.355565 0.40966 0.682694 0.314156 0.38708
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 白芷 紫菀 炙甘草 紫苏梗 广藿香

------Score: precision: 0.100000, recall: 0.166667, error: 0.900000
390. 
patient tongue id: 02261310500870_5_6
label yaofang:
甘草 白术 丹参 杜仲 钩藤 天麻 天花粉 桑寄生 扁豆花 决明子 浮小麦 首乌藤
0.914524 0.472442 0.510827 0.412 0.458472 0.346381 0.417269
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
391. 
patient tongue id: 05092233355207_1_3
label yaofang:
甘草 荆芥 防风 连翘 牛蒡子 党参 白术 杜仲 郁金 厚朴 火麻仁 枇杷叶 辛夷
0.799567 0.427988 0.447871 0.33089 0.415747
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
392. 
patient tongue id: 05231946058412_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 蜜麻黄 麸炒白术
0.325017 0.376689 0.456041 0.531255 0.391779 0.424762 0.409468 0.401146 0.478752 0.400838 0.63436 0.319942 0.390835 0.312834
predicted yaofang:
陈皮 法半夏 茯苓 前胡 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.714286, recall: 0.625000, error: 0.285714
393. 
patient tongue id: 05112033504579_5_7_1
label yaofang:
黄芪 白术 海螵蛸 浙贝母 杜仲 山楂 仙鹤草 砂仁 芡实 鸡内金 北沙参 紫苏梗 鲜龙葵果
0.50824 0.399336 0.385794 0.339039 0.413192
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
394. 
patient tongue id: 03291326435181_1_7
label yaofang:
甘草 柴胡 白芍 香附 当归 茯苓 薄荷 白术 丹参 砂仁 麦芽 广藿香
0.340648 0.350002 0.389481 0.3425 0.411334 0.390812 0.334276 0.513183
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
395. 
patient tongue id: 05162149389680_2
label yaofang:
陈皮 法半夏 葛根 前胡 桔梗 麦冬 玉竹 太子参 款冬花 紫菀 北沙参 炙甘草 人参叶
0.369174 0.634042 0.436848 0.889763 0.383425 0.66835 0.356379 0.304542 0.341068 0.491553 0.779067 0.803624 0.73511 0.832268 0.929719 0.501577 0.662057 0.45428 0.597753
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.368421, recall: 0.538462, error: 0.631579
396. 
patient tongue id: 05191947588652_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 熟地黄 栀子 牡丹皮 山药 菟丝子 桑寄生 女贞子 首乌藤 合欢花 艾叶
0.972534 0.315768 0.541546 0.558329 0.400333 0.322512 0.570566 0.541303 0.533948 0.450664 0.427562 0.425341
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
397. 
patient tongue id: 01052206203844_1_3_7
label yaofang:
甘草 桔梗 黄芪 白术 熟地黄 浙贝母 山茱萸 桑螵蛸 夏枯草 北沙参 首乌藤 蜈蚣 合欢皮 墨旱莲
0.366091 0.417701 0.320292 0.417746 0.340839 0.409854 0.361516
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
398. 
patient tongue id: 02161855556278_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 紫菀 北沙参 炙甘草 广藿香 威灵仙 炒紫苏子 蜜麻黄 醋五味子
0.39768 0.758837 0.420175 0.972436 0.448904 0.785695 0.396832 0.316109 0.372133 0.573568 0.913633 0.934373 0.874948 0.943362 0.982024 0.579835 0.767489 0.502349 0.714663
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.562500, error: 0.526316
399. 
patient tongue id: 04132033420666_1_2_6
label yaofang:
甘草 茯苓 桔梗 半夏 橘红 白术 枇杷叶 北沙参 苦杏仁 炙麻黄 首乌藤 合欢皮
0.383469 0.360158 0.365355 0.484084
predicted yaofang:
茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
400. 
patient tongue id: 01201308575284_1_2_4
label yaofang:
桂枝 甘草 茯苓 薏苡仁 党参 红花 郁金 山药 荆芥穗 鳖甲 莪术 白鲜皮 蜈蚣 白花蛇舌 天山雪莲 红豆杉 土茯苓
0.912024 0.490611 0.47908 0.463047 0.317371 0.400242 0.336928 0.45644
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.352941, error: 0.250000
401. 
patient tongue id: 04120319427338_4_6
label yaofang:
甘草 柴胡 白芍 茯苓 木香 蒲公英 白及 党参 白术 延胡索 五灵脂 合欢花 麸炒枳壳
0.93125 0.469267 0.544893 0.346791 0.554946 0.317649 0.355457
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
402. 
patient tongue id: 01041317288799_6
label yaofang:
柴胡 白芍 当归 茯苓 薄荷 白术 栀子 淡豆豉 炙甘草 首乌藤
0.466789 0.312228 0.335552 0.413173
predicted yaofang:
甘草 白芍 茯苓 党参

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
403. 
patient tongue id: 05131443176807_7_2_6
label yaofang:
甘草 白芍 川芎 茯苓 桃仁 酸枣仁 丹参 红花 赤芍 薤白 水蛭 砂仁 瓜蒌皮 降香
0.938996 0.508344 0.538737 0.38367 0.486286 0.384429 0.400567
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
404. 
patient tongue id: 01211210478406_4
label yaofang:
桂枝 柴胡 黄芩 桔梗 牡蛎 干姜 天花粉 炙甘草 玉米须
0.435471 0.384308 0.346714 0.416246 0.483656 0.371698 0.3267 0.306321 0.307699
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁 炙甘草

------Score: precision: 0.111111, recall: 0.111111, error: 0.888889
405. 
patient tongue id: 03200652043789_4
label yaofang:
甘草 法半夏 茯苓 薏苡仁 细辛 天麻 款冬花 莪术 诃子 白花蛇舌草 地龙 紫苏梗 蜈蚣 醋鳖甲
0.963942 0.520685 0.562786 0.396614 0.3254 0.57085 0.492748 0.506292 0.401878 0.391752 0.425476
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
406. 
patient tongue id: 05152045310016_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 黄芩 薏苡仁 黄芪 丹参 五味子 桑寄生 白花蛇舌草 制何首乌
0.45465 0.513555 0.439572 0.307372 0.350217 0.331242 0.412977 0.321652 0.365238 0.313904 0.604139 0.672264 0.351048
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 浙贝母 干姜 豆蔻 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.230769, recall: 0.250000, error: 0.769231
407. 
patient tongue id: 05022032291976_2_1
label yaofang:
甘草 桔梗 芦根 太子参 浙贝母 鳖甲 北沙参 辛夷 苍耳子 白花蛇舌 天山雪莲 蜂房 岗梅根 四季青
0.971411 0.523195 0.566895 0.367732 0.313826 0.610433 0.550269 0.507563 0.465599 0.452944 0.446501
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
408. 
patient tongue id: 03151923165052_4_6
label yaofang:
甘草 茯苓 薏苡仁 白术 海螵蛸 山药 砂仁 姜半夏
0.398 0.35426 0.395236 0.367955 0.401521 0.373531 0.32615 0.44207
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.500000, error: 0.500000
409. 
patient tongue id: 05201501056523_1_6_7
label yaofang:
甘草 柴胡 黄芩 茯苓 龙骨 牡蛎 桃仁 远志 党参 白术 酸枣仁 生地黄 红花 莪术 浮小麦
0.949255 0.517255 0.545855 0.38395 0.334356 0.571151 0.5005 0.472199 0.422759 0.411023 0.404164
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
410. 
patient tongue id: 06050808094870_1_3_7
label yaofang:
桂枝 茯苓 白术 栀子 通草 泽泻 车前子 大黄 滑石 猪苓 瞿麦 萹蓄 炙甘草
0.423917 0.314997 0.474857 0.433015 0.410215 0.474005 0.388853 0.438743 0.471267 0.420678 0.435955 0.498027 0.359066 0.48077 0.487818 0.478141
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.230769, error: 0.812500
411. 
patient tongue id: 03282241538585_4_6
label yaofang:
甘草 川芎 黄芩 法半夏 茯苓 薏苡仁 黄芪 山药 厚朴 白芷 蔓荆子 豆蔻 苦杏仁 皂角刺 辛夷 苍耳子
0.975671 0.522978 0.582466 0.350794 0.307954 0.641782 0.502786 0.479239 0.405567 0.399246 0.416106
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
412. 
patient tongue id: 05290752497715_5_6
label yaofang:
甘草 法半夏 前胡 桔梗 桃仁 远志 浙贝母 天麻 鳖甲 炙甘草 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.992403 0.547656 0.60627 0.352897 0.314198 0.684405 0.622661 0.580757 0.530579 0.510306 0.519873
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
413. 
patient tongue id: 02111316314212_1_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.517256 0.363747 0.358828 0.338112 0.489341
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
414. 
patient tongue id: 05262159370822_3_5_6
label yaofang:
甘草 白芍 薏苡仁 党参 黄芪 白术 熟附子 天麻 巴戟天 鳖甲 建曲 蜈蚣 天山雪莲 半枝莲 广升麻
0.937191 0.509288 0.541346 0.385036 0.326061 0.54728 0.455235 0.453306 0.378469 0.372193 0.378839
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
415. 
patient tongue id: 04021228157134_1_2_5
label yaofang:
甘草 茯苓 党参 白术 丹参 浙贝母 杜仲 厚朴 砂仁 火麻仁 金樱子 北沙参 木蝴蝶
0.657272 0.439793 0.36605 0.406839 0.539802 0.305248 0.340193 0.315056 0.325515
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.888889, recall: 0.615385, error: 0.111111
416. 
patient tongue id: 03111736170323_2_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 延胡索 川楝子 山药 桑叶 鳖甲 扁豆花 莪术 佛手 蜈蚣 白花蛇舌 天山雪莲
0.979497 0.518449 0.56996 0.365999 0.304342 0.592252 0.544854 0.524657 0.451727 0.440876 0.446635
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
417. 
patient tongue id: 02241402106682_1_7_4
label yaofang:
黄芪 白术 厚朴 当归尾 砂仁 桑寄生 火麻仁 莪术 鸡内金 北沙参 女贞子 红豆杉 墨旱莲 稻芽
0.528251 0.410247 0.356469 0.411083 0.423944 0.312104
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
418. 
patient tongue id: 05242242445813_1_2
label yaofang:
甘草 柴胡 白芍 枳壳 薏苡仁 党参 山药 天麻 鳖甲 莪术 建曲 蜈蚣 白花蛇舌 天山雪莲 红豆杉 龙葵果
0.968421 0.520403 0.560888 0.373827 0.312802 0.587928 0.489898 0.473963 0.396796 0.389936 0.388192
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
419. 
patient tongue id: 02231916522230_2_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.315895 0.342551 0.453172 0.428817 0.351123 0.302021 0.344079 0.318925 0.345044 0.391341 0.391178 0.535451 0.340104
predicted yaofang:
甘草 法半夏 茯苓 前胡 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
420. 
patient tongue id: 01070839503393_1_2_6
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志 黄精
0.356663 0.477693
predicted yaofang:
茯苓 炙甘草

------Score: precision: 0.500000, recall: 0.083333, error: 0.500000
421. 
patient tongue id: 04142231049780_6_4_1
label yaofang:
甘草 柴胡 白芍 茯苓 木香 党参 白术 酸枣仁 黄连 延胡索 乌梅 山药 砂仁 首乌藤 建曲 合欢花
0.922913 0.502577 0.536499 0.357824 0.307262 0.551569 0.364873 0.378893
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.312500, error: 0.375000
422. 
patient tongue id: 04260622320798_5
label yaofang:
甘草 黄芩 茯苓 前胡 桔梗 浙贝母 细辛 车前子 白前 苦杏仁 炙麻黄 广金钱草
0.981478 0.541563 0.578142 0.382111 0.301702 0.334472 0.625832 0.572439 0.543919 0.488773 0.470457 0.476688
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.166667, error: 0.833333
423. 
patient tongue id: 03101954444297_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 蜜麻黄
0.370017 0.418423 0.361537 0.325846 0.320329 0.497466
predicted yaofang:
法半夏 茯苓 前胡 防风 白前 炙甘草

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
424. 
patient tongue id: 04101853358815_4
label yaofang:
法半夏 前胡 桔梗 防风 黄芪 白术 钩藤 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.390375 0.434343 0.327472 0.391864 0.329242 0.396986 0.400774
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
425. 
patient tongue id: 02120928504219_5_6
label yaofang:
甘草 白芍 防风 独活 薏苡仁 白及 党参 白术 黄连 苍术 山药 干姜 桑寄生 豆蔻 建曲
0.965766 0.309678 0.514624 0.559088 0.358417 0.31804 0.604558 0.512755 0.490651 0.419163 0.409727 0.423443
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
426. 
patient tongue id: 04112046581453_6_4
label yaofang:
甘草 白芍 太子参 车前子 天麻 桑寄生 鳖甲 补骨脂 瞿麦 鸡内金 鹿角霜 蜈蚣 天山雪莲 半枝莲 广金钱草 泽兰
0.976645 0.546689 0.576137 0.387252 0.311661 0.351676 0.631506 0.571093 0.542517 0.496081 0.474433 0.487159
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
427. 
patient tongue id: 03022151247743_1_4
label yaofang:
甘草 柴胡 白芍 香附 枳壳 茯苓 葛根 党参 太子参 白术 延胡索 海螵蛸 浙贝母 车前子 豆蔻 姜半夏 炙甘草 紫苏梗 瓦楞子 猫爪草
0.357028 0.323442 0.384009 0.30695 0.372008 0.369211 0.342791 0.316194 0.460871
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 1.000000, recall: 0.450000, error: 0.000000
428. 
patient tongue id: 04130628445294_6_4
label yaofang:
甘草 龙骨 牡蛎 酸枣仁 栀子 山茱萸 薤白 地黄 砂仁 蔓荆子 瓜蒌皮 麦芽 麸炒枳壳
0.9038 0.49026 0.513939 0.401924 0.44891 0.359106 0.412804
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
429. 
patient tongue id: 04202108513924_6_1
label yaofang:
党参 枸杞子 白术 柏子仁 熟地黄 海螵蛸 杜仲 菟丝子 巴戟天 桑寄生 续断 制何首乌 艾叶
0.395678 0.458077 0.3521 0.309805 0.310605 0.392701 0.314615 0.537602 0.680045 0.319113
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.300000, recall: 0.230769, error: 0.700000
430. 
patient tongue id: 03312107129125_2_1
label yaofang:
甘草 大枣 茯苓 党参 酸枣仁 生地黄 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.98806 0.533175 0.591271 0.365783 0.32322 0.652682 0.595277 0.563664 0.501803 0.492166 0.507304
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
431. 
patient tongue id: 03020825322183_6_1
label yaofang:
甘草 川芎 茯苓 党参 酸枣仁 生地黄 牛膝 天麻 鳖甲 白花蛇舌草 浮小麦 蜈蚣 天山雪莲 半枝莲 红豆杉
0.832513 0.45426 0.467243 0.437059 0.309282 0.316875
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
432. 
patient tongue id: 03221614105456_6_5
label yaofang:
甘草 柴胡 白芍 木香 蒲公英 白及 延胡索 川楝子 山药 砂仁 桑寄生 芡实 桑螵蛸 姜黄 麸炒枳壳
0.983388 0.533352 0.584616 0.377069 0.319369 0.612743 0.570887 0.542845 0.488696 0.46807 0.47515
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
433. 
patient tongue id: 03282219499527_6_2
label yaofang:
甘草 白芍 陈皮 茯苓 防风 党参 白术 酸枣仁 黄连 乌梅 黄柏 山药 干姜 佛手 合欢花 花椒
0.945581 0.520929 0.547374 0.400163 0.300279 0.344612 0.57224 0.483395 0.483422 0.405751 0.399345 0.408946
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
434. 
patient tongue id: 02122125163675_5
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 鱼腥草 浙贝母 细辛 桑白皮 蔓荆子 款冬花 诃子 苦杏仁 紫苏子
0.982018 0.536347 0.569471 0.383263 0.326855 0.593574 0.538207 0.535868 0.444334 0.429054 0.438358
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
435. 
patient tongue id: 03171030054772_1_3
label yaofang:
黄芩 金银花 牛蒡子 蒲公英 麦冬 太子参 细辛 蔓荆子 鸡内金 苍耳子 炒六神曲
0.425621 0.330828 0.442486 0.451875 0.366858 0.433579 0.372452 0.421159 0.415278 0.391841 0.434244 0.448344 0.370689 0.426479 0.436177 0.441558
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
436. 
patient tongue id: 02141946009950_1_2
label yaofang:
大枣 当归 茯苓 木香 龙骨 牡蛎 远志 党参 白术 酸枣仁 柏子仁 肉桂 炙甘草
0.468746 0.313993 0.396169 0.40348 0.357722
predicted yaofang:
甘草 白芍 茯苓 党参 炙甘草

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
437. 
patient tongue id: 04282227441751_2
label yaofang:
甘草 白芍 茯苓 酸枣仁 生地黄 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 宽筋藤
0.866234 0.391914 0.522735 0.308279 0.361299
predicted yaofang:
甘草 法半夏 茯苓 前胡 党参

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
438. 
patient tongue id: 04112005011337_6_2
label yaofang:
甘草 酸枣仁 生地黄 延胡索 杜仲 天麻 桑寄生 瓜蒌皮 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97085 0.522562 0.55698 0.363964 0.546988 0.495667 0.474712 0.401434 0.389476 0.369558
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.500000, error: 0.300000
439. 
patient tongue id: 04200637551984_5_6
label yaofang:
甘草 柴胡 法半夏 茯苓 龙骨 牡蛎 远志 党参 酸枣仁 丹参 黄连 胆南星 栀子 桑白皮 淡豆豉
0.973464 0.517048 0.568555 0.355849 0.579996 0.495258 0.466723 0.397292 0.383627 0.370774
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
440. 
patient tongue id: 01042351459091_6_1
label yaofang:
甘草 柴胡 茯苓 桃仁 酸枣仁 丹参 生地黄 赤芍 青皮 郁金 王不留行 天山雪莲 路路通
0.988203 0.527954 0.600509 0.371473 0.324432 0.344042 0.680216 0.610053 0.590804 0.518304 0.521219 0.563846
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
441. 
patient tongue id: 03221626506476_2_7
label yaofang:
甘草 独活 麦冬 党参 白术 熟地黄 紫河车 天麻 鳖甲 补骨脂 蜈蚣 天山雪莲 半枝莲
0.482343 0.439806 0.310415 0.301209 0.340578
predicted yaofang:
甘草 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
442. 
patient tongue id: 01250627408011_1_6
label yaofang:
甘草 柴胡 白芍 川芎 金银花 连翘 党参 酸枣仁 生地黄 黄柏 石膏 苍术 车前子 天麻 全蝎 麦芽
0.787676 0.491443 0.430955 0.348964 0.31786
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
443. 
patient tongue id: 02142155594604_2
label yaofang:
甘草 丹参 山药 地黄 天麻 菟丝子 益母草 白花蛇舌草 建曲 蜈蚣 醋香附 半枝莲 醋鳖甲 酒女贞子 墨旱莲
0.951029 0.50261 0.532465 0.407679 0.32578 0.545616 0.434148 0.485948 0.338313 0.344773 0.383002
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
444. 
patient tongue id: 01042312130377_1
label yaofang:
茯苓 红花 熟地黄 牡丹皮 山药 泽泻 砂仁 菟丝子 金樱子 黄精 楮实子 酒萸肉
0.321668 0.316599 0.389881 0.37053 0.305572 0.31999 0.376176 0.490288
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
445. 
patient tongue id: 03292130074047_4
label yaofang:
薏苡仁 白术 酸枣仁 五味子 厚朴 莱菔子 扁豆花 鸡内金 豆蔻 麦芽 广藿香 石榴皮
0.570881 0.383049 0.378599 0.429882 0.471087 0.303699
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
446. 
patient tongue id: 03232319532562_6_2
label yaofang:
甘草 薏苡仁 远志 酸枣仁 生地黄 天麻 鳖甲 莪术 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 四季青
0.913176 0.304454 0.49764 0.520689 0.368108 0.479759 0.368248 0.387849
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
447. 
patient tongue id: 05222050374383_7_5_1
label yaofang:
甘草 黄芪 白术 海螵蛸 砂仁 三七 桑寄生 火麻仁 鸡内金 北沙参 首乌藤 紫苏梗 瓦楞子 合欢皮
0.455069 0.374117 0.316345 0.307439 0.469653 0.47023 0.345374 0.373836
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
448. 
patient tongue id: 04301143580580_4_7
label yaofang:
甘草 川芎 法半夏 茯苓 桃仁 白术 生地黄 红花 赤芍 天麻 僵蚕 麦芽 首乌藤 威灵仙 骨碎补
0.97681 0.30954 0.527792 0.56391 0.358881 0.591278 0.534469 0.492593 0.447704 0.42745 0.412016
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
449. 
patient tongue id: 02201257050750_1_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 石菖蒲 炙甘草 百合 紫苏叶 青葙子
0.326652 0.360915 0.42731 0.364429 0.332716 0.332927 0.407822 0.562642
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
450. 
patient tongue id: 03132020080823_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.473043 0.358986 0.374942 0.42168 0.389755 0.374376 0.347632 0.346091 0.320895 0.320283 0.312198 0.302653
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤 莱菔子 天麻 决明子 夏枯草

------Score: precision: 0.250000, recall: 0.250000, error: 0.750000
451. 
patient tongue id: 01211313548550_1_4
label yaofang:
桂枝 陈皮 大枣 茯苓 龙骨 牡蛎 白术 泽泻 姜半夏 炙甘草
0.531008 0.432745 0.430795 0.401439 0.360143 0.327866
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
452. 
patient tongue id: 01101812592766_1
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 白芷 紫菀 白前 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄 醋五味子
0.375099 0.517679 0.476009 0.707303 0.380293 0.517024 0.340812 0.328396 0.403202 0.604469 0.599283 0.535027 0.630394 0.342968 0.735952 0.421533 0.510251 0.31949 0.433565
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.687500, error: 0.421053
453. 
patient tongue id: 01312120493005_1_5_2
label yaofang:
甘草 当归 连翘 党参 黄芪 丹参 生地黄 天麻 鳖甲 皂角刺 蜈蚣 白花蛇舌 龙葵果 广升麻
0.74006 0.447774 0.45111 0.313202 0.402285 0.305753
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
454. 
patient tongue id: 01100134308971_4
label yaofang:
胆南星 牛膝 莱菔子 冬瓜子 皂角刺 紫苏子 海风藤 芥子 苍苏木
0.393417 0.330978 0.401553 0.339144 0.385143 0.347738 0.30736 0.486492
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
455. 
patient tongue id: 05130828099434_4_6
label yaofang:
甘草 法半夏 龙骨 连翘 远志 党参 黄连 竹茹 胆南星 石菖蒲 莱菔子 白芷 麦芽 皂角刺
0.968471 0.524641 0.562229 0.385683 0.3268 0.59509 0.513983 0.502974 0.432251 0.417385 0.426257
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
456. 
patient tongue id: 02241408255759_1_4
label yaofang:
桂枝 白芍 大枣 当归 黄芪 细辛 通草 水蛭 炙甘草
0.331835 0.409313 0.470067 0.363718 0.368074 0.346961 0.364706 0.308378 0.309989 0.504407 0.609391 0.316609
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 浙贝母 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.166667, recall: 0.222222, error: 0.833333
457. 
patient tongue id: 02020953237783_1_2_6
label yaofang:
甘草 柴胡 香附 党参 延胡索 赤芍 青皮 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.979842 0.319 0.532425 0.588756 0.352109 0.35919 0.338734 0.348494 0.690304 0.590119 0.5644 0.506306 0.506734 0.545787
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.642857, recall: 0.642857, error: 0.357143
458. 
patient tongue id: 04252305076626_1_4
label yaofang:
甘草 黄芩 法半夏 大枣 茯苓 前胡 葶苈子 细辛 干姜 莱菔子 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲
0.930426 0.310854 0.485192 0.525146 0.382267 0.451647 0.36132 0.391683
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.333333, error: 0.375000
459. 
patient tongue id: 04130749583497_1_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 丹参 生地黄 天麻 鳖甲 麦芽 紫苏梗 蜈蚣 天山雪莲 半枝莲
0.93927 0.515404 0.528054 0.41012 0.314546 0.501647 0.415696 0.453354 0.324074 0.317323 0.323447
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
460. 
patient tongue id: 02251135181772_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.418527 0.772863 0.42098 0.97554 0.469827 0.801784 0.431382 0.344871 0.404451 0.600005 0.919154 0.938391 0.880544 0.950043 0.98296 0.607929 0.768226 0.524522 0.727992
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
461. 
patient tongue id: 04121953566816_1_4_2
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.387444 0.546953 0.460697 0.77368 0.40418 0.598289 0.361771 0.317656 0.374036 0.473765 0.666491 0.688277 0.64116 0.725701 0.319701 0.830288 0.479896 0.303283 0.60298 0.440409 0.536575
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 0.937500, error: 0.285714
462. 
patient tongue id: 02122058104687_1_4_6
label yaofang:
甘草 茯苓 龙骨 远志 党参 酸枣仁 生地黄 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.903311 0.320158 0.507538 0.486837 0.393742 0.429677 0.317682 0.371616
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.428571, error: 0.250000
463. 
patient tongue id: 02161933236938_4
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.458208 0.346203 0.419944 0.341368 0.399083 0.365797 0.452648
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
464. 
patient tongue id: 01081926499206_9
label yaofang:
柴胡 白芍 黄芩 当归 党参 枳实 石膏 干姜 大黄 生地 法夏 旋复花冲剂
0.914692 0.312003 0.495054 0.510523 0.354655 0.42875 0.328083 0.33211
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.166667, error: 0.750000
465. 
patient tongue id: 03221633143469_1_5_3
label yaofang:
桂枝 黄芪 白术 海螵蛸 当归尾 砂仁 鸡内金 首乌藤 蜈蚣 合欢皮 山慈菇 石上柏 稻芽 鲜龙葵果
0.473846 0.454344 0.363686 0.371814
predicted yaofang:
甘草 茯苓 黄芪 北沙参

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
466. 
patient tongue id: 05191935110809_2
label yaofang:
甘草 党参 鸡血藤 红花 赤芍 杜仲 山药 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.978653 0.519794 0.569779 0.36551 0.600406 0.507136 0.493005 0.408183 0.401961 0.405554
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
467. 
patient tongue id: 03231421213911_1_6
label yaofang:
甘草 白芍 薏苡仁 党参 黄芪 白术 天麻 肉苁蓉 鳖甲 火麻仁 补骨脂 莪术 蜈蚣 天山雪莲 半枝莲 红豆杉
0.576736 0.434129 0.352398 0.401443 0.507021 0.31664 0.331995
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
468. 
patient tongue id: 04171746511486_6_7
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.448986 0.517855 0.445533 0.301247 0.418054 0.30797 0.667982 0.72554 0.320803
predicted yaofang:
柴胡 白芍 香附 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.777778, recall: 0.636364, error: 0.222222
469. 
patient tongue id: 03101853053004_6
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 干姜 豆蔻 姜半夏 炙甘草 紫苏梗
0.328357 0.350501 0.437491 0.480801 0.302037 0.385565 0.553583 0.309816
predicted yaofang:
柴胡 白芍 白术 海螵蛸 浙贝母 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.750000, recall: 0.545455, error: 0.250000
470. 
patient tongue id: 06022252446099_1_4_6
label yaofang:
甘草 陈皮 茯苓 半夏 党参 黄芪 枸杞子 白术 赤芍 牡丹皮 杜仲 山药 紫苏子 紫苏叶
0.467989 0.423001 0.409973 0.304373 0.480191 0.533695 0.337981 0.312557 0.405819 0.365168 0.356864 0.460734 0.369632
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.538462, recall: 0.500000, error: 0.461538
471. 
patient tongue id: 03141556479906_1_4_7
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 厚朴
0.434229 0.329144 0.373819 0.395232 0.426452 0.388469 0.341417 0.330209 0.335195 0.306421 0.306422
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤 莱菔子 决明子 夏枯草

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
472. 
patient tongue id: 03012338069598_6_2_1
label yaofang:
白芍 枳壳 党参 酸枣仁 延胡索 天麻 五灵脂 鳖甲 火麻仁 麦芽 炙甘草 蜈蚣 天山雪莲 合欢花 半枝莲 姜黄
0.983566 0.539117 0.575035 0.366715 0.305013 0.611794 0.562988 0.527178 0.474377 0.454581 0.444505
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
473. 
patient tongue id: 04122158242782_6_4
label yaofang:
甘草 独活 党参 白术 延胡索 川楝子 杜仲 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.752625 0.450418 0.419421 0.418166 0.304871
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
474. 
patient tongue id: 01101816345087_4_1
label yaofang:
陈皮 法半夏 前胡 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.338869 0.400329 0.428778 0.54465 0.308286 0.47102 0.375166 0.425559 0.501465 0.446517 0.51931 0.309418 0.721611 0.358352 0.458465 0.321217
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.750000, recall: 0.857143, error: 0.250000
475. 
patient tongue id: 04171933015354_1_4
label yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.387521 0.73234 0.439079 0.939418 0.438012 0.704529 0.414997 0.350045 0.393824 0.523513 0.855856 0.88209 0.80894 0.888845 0.96702 0.522216 0.713707 0.500819 0.658421
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
476. 
patient tongue id: 06070651122142_6_5
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 牛蒡子 白术 酸枣仁 山药 诃子 紫苏子 益智 白扁豆 建曲
0.97278 0.524453 0.568316 0.376457 0.302631 0.325821 0.616231 0.534085 0.515808 0.44918 0.437131 0.454531
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
477. 
patient tongue id: 01132128328959_5_1
label yaofang:
甘草 桔梗 薏苡仁 浙贝母 苍术 天麻 滑石 鳖甲 豆蔻 苦杏仁 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.804037 0.465839 0.444951 0.436307 0.318302 0.313543
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
478. 
patient tongue id: 03291337145529_1_6_4
label yaofang:
甘草 川芎 金银花 浙贝母 牛膝 郁金 天麻 蔓荆子 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.840089 0.453415 0.500469 0.38999 0.399044 0.303577
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
479. 
patient tongue id: 02241435137246_4
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 海螵蛸 山药 砂仁 白扁豆
0.500478 0.389339 0.382298 0.350816 0.447348
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.400000, error: 0.200000
480. 
patient tongue id: 06022256283823_1_4
label yaofang:
陈皮 半夏 白术 浙贝母 山药 厚朴 僵蚕 紫苏子 紫苏叶 人参叶 龙脷叶 紫苑 南杏仁
0.390569 0.418969 0.418377 0.436874 0.482452 0.318752 0.44512 0.332866
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 北沙参 炙甘草

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
481. 
patient tongue id: 05092100473520_2_6
label yaofang:
甘草 白芍 薏苡仁 太子参 牡丹皮 山药 天麻 鳖甲 莪术 虎杖 麦芽 女贞子 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.962167 0.522549 0.540874 0.383869 0.531518 0.48826 0.468677 0.39662 0.383874 0.365978
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.375000, error: 0.400000
482. 
patient tongue id: 01092050087697_4_6
label yaofang:
甘草 川芎 香附 陈皮 当归 茯苓 半夏 黄芪 白术 厚朴 北沙参 合欢皮
0.69442 0.442679 0.405671 0.386203 0.522733 0.306412
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.833333, recall: 0.416667, error: 0.166667
483. 
patient tongue id: 03291643402571_1_2
label yaofang:
甘草 法半夏 茯苓 桔梗 羌活 薏苡仁 桃仁 远志 白术 生地黄 延胡索 浙贝母 郁金 桑叶 桑白皮 天麻 鳖甲 款冬花 王不留行 枇杷叶 苦杏仁 浮小麦 威灵仙 白花蛇舌 天山雪莲 半枝莲 贯众
0.958306 0.499028 0.548303 0.381258 0.548804 0.480493 0.472155 0.387699 0.384013 0.389055
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.296296, error: 0.200000
484. 
patient tongue id: 02191220419381_1_5_7
label yaofang:
桂枝 甘草 白芍 薏苡仁 党参 黄芪 鸡血藤 白术 熟附子 红花 延胡索 知母 苍术 忍冬藤 续断 威灵仙
0.889023 0.346421 0.413769 0.49157 0.356074 0.37997 0.318428
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
485. 
patient tongue id: 02271241496111_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.470349 0.356203 0.38645 0.424867 0.391816 0.398859 0.364784 0.352577 0.30467 0.310277 0.343495 0.338393 0.320254 0.315604 0.301351
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.266667, recall: 0.307692, error: 0.733333
486. 
patient tongue id: 05180834032409_6_2
label yaofang:
甘草 柴胡 白芍 党参 牡丹皮 山药 天麻 菟丝子 益母草 鳖甲 佛手 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.99164 0.52609 0.626959 0.363546 0.327208 0.332201 0.714344 0.632439 0.613984 0.534146 0.539922 0.616775
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.529412, error: 0.250000
487. 
patient tongue id: 05131602393507_2_6
label yaofang:
甘草 白芍 香附 枳壳 黄芩 茯苓 桃仁 党参 白术 生地黄 菟丝子 桑寄生 艾叶
0.954802 0.511423 0.54671 0.384804 0.514354 0.438096 0.444813 0.343181 0.337542 0.324805
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
488. 
patient tongue id: 02212238528554_1_2_7
label yaofang:
甘草 薏苡仁 党参 浙贝母 郁金 山药 砂仁 天麻 鳖甲 莪术 丝瓜络 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.964639 0.528321 0.553375 0.39101 0.311461 0.560966 0.489037 0.493942 0.396605 0.382956 0.390573
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
489. 
patient tongue id: 01211220036923_6
label yaofang:
桂枝 柴胡 白芍 大枣 薏苡仁 蒲公英 党参 黄芪 牛膝 苏木 败酱草 姜半夏 炙甘草
0.336429 0.337113 0.308515 0.651585 0.328551
predicted yaofang:
白芍 茯苓 干姜 炙甘草 紫苏梗

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
490. 
patient tongue id: 04111954484446_1_4_7
label yaofang:
甘草 枳壳 半夏 牛蒡子 薏苡仁 黄芪 枸杞子 赤芍 海螵蛸 杜仲 黄柏 牛膝 山药 厚朴 鳖甲 北沙参 紫苏梗 黑枣 骨碎补 红豆杉 蛇舌草 稻芽
0.489503 0.372456 0.363531 0.479235 0.45943 0.335125 0.303284 0.339641
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.500000, recall: 0.181818, error: 0.500000
491. 
patient tongue id: 02281838178579_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.417951 0.427728 0.347901 0.413995 0.408793 0.407131 0.310204
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
492. 
patient tongue id: 02142346012127_2_7_4
label yaofang:
甘草 柴胡 白芍 薏苡仁 延胡索 砂仁 天麻 五灵脂 白花蛇舌草 蜈蚣 醋香附 半枝莲 醋鳖甲 麸炒枳壳
0.855246 0.486635 0.459757 0.475037 0.37069
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
493. 
patient tongue id: 04291624182539_1_2_6
label yaofang:
甘草 生地黄 红花 牡丹皮 山茱萸 天麻 地骨皮 鳖甲 火麻仁 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲
0.947558 0.491223 0.519487 0.42797 0.464782 0.349725 0.440137
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
494. 
patient tongue id: 06062255050519_2
label yaofang:
甘草 白芍 茯苓 桔梗 荆芥 金银花 红花 浙贝母 地黄 白花蛇舌草 麦芽 白鲜皮 蜂房 醋鳖甲
0.989194 0.304317 0.55301 0.587608 0.366832 0.314107 0.645119 0.611785 0.567019 0.52827 0.498936 0.493938
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
495. 
patient tongue id: 05131846201235_5
label yaofang:
甘草 柴胡 白芍 川芎 黄芩 茯苓 防风 金银花 荆芥穗 蔓荆子 麦芽 板蓝根 辛夷 四季青
0.768997 0.435258 0.49971 0.370765 0.383548
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
496. 
patient tongue id: 04180818390156_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 党参 黄芪 酸枣仁 郁金 首乌藤 百合 制远志 牡荆子
0.466638 0.34381 0.383664 0.360518 0.45119 0.345564
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
497. 
patient tongue id: 02122116201507_7_2
label yaofang:
甘草 白芍 川芎 香附 枳壳 黄芩 当归 茯苓 党参 白术 生地黄 砂仁 菟丝子 桑寄生
0.982446 0.527745 0.578366 0.388267 0.316462 0.625568 0.583891 0.567573 0.496969 0.490067 0.515446
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
498. 
patient tongue id: 01192225448529_4_7
label yaofang:
桂枝 甘草 川芎 防风 羌活 白术 红花 赤芍 牛膝 知母 细辛 白芷 桑枝 威灵仙 乌梢蛇
0.936533 0.508497 0.527162 0.403349 0.329511 0.519765 0.452375 0.464234 0.367703 0.365896 0.371247
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
499. 
patient tongue id: 05131654054133_5
label yaofang:
甘草 柴胡 黄芩 法半夏 薏苡仁 石菖蒲 滑石 茵陈 淡竹叶 豆蔻 板蓝根 广藿香 川木通 大青叶
0.973974 0.502019 0.580741 0.390778 0.319417 0.631942 0.541005 0.548047 0.449456 0.458467 0.521262
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
------Average Score: average precision: 0.468508, average recall: 0.355553, error: 0.531492