5568/20571 [=======>......................] - ETA: 125s - loss: 0.17342017-11-10 15:04:19.235133: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:247] PoolAllocator: After 34619 get requests, put_count=34615 evicted_count=1000 eviction_rate=0.0288892 and unsatisfied allocation rate=0.03189
2017-11-10 15:04:19.235201: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
20544/20571 [============================>.] - ETA: 0s - loss: 0.1179Epoch 00000: val_loss improved from inf to 0.08027, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 167s - loss: 0.1178 - val_loss: 0.0803
Epoch 2/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0878Epoch 00001: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0878 - val_loss: 0.0808
Epoch 3/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0840Epoch 00002: val_loss improved from 0.08027 to 0.07609, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0840 - val_loss: 0.0761
Epoch 4/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0824Epoch 00003: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0824 - val_loss: 0.0767
Epoch 5/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0810Epoch 00004: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0810 - val_loss: 0.0764
Epoch 6/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0800Epoch 00005: val_loss improved from 0.07609 to 0.07384, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0799 - val_loss: 0.0738
Epoch 7/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0792Epoch 00006: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0793 - val_loss: 0.0739
Epoch 8/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0784Epoch 00007: val_loss improved from 0.07384 to 0.07310, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0784 - val_loss: 0.0731
Epoch 9/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0779Epoch 00008: val_loss improved from 0.07310 to 0.07239, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0778 - val_loss: 0.0724
Epoch 10/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0772Epoch 00009: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0772 - val_loss: 0.0726
Epoch 11/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0766Epoch 00010: val_loss improved from 0.07239 to 0.07209, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 162s - loss: 0.0766 - val_loss: 0.0721
Epoch 12/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0764Epoch 00011: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0765 - val_loss: 0.0722
Epoch 13/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0759Epoch 00012: val_loss improved from 0.07209 to 0.07184, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 162s - loss: 0.0759 - val_loss: 0.0718
Epoch 14/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0755Epoch 00013: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0755 - val_loss: 0.0719
Epoch 15/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0750Epoch 00014: val_loss improved from 0.07184 to 0.07124, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0750 - val_loss: 0.0712
Epoch 16/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0747Epoch 00015: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0747 - val_loss: 0.0714
Epoch 17/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0743Epoch 00016: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0742 - val_loss: 0.0715
Epoch 18/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0739Epoch 00017: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0739 - val_loss: 0.0716
Epoch 19/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0735Epoch 00018: val_loss improved from 0.07124 to 0.07121, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0735 - val_loss: 0.0712
Epoch 20/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0732Epoch 00019: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0732 - val_loss: 0.0718
Epoch 21/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0729Epoch 00020: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0729 - val_loss: 0.0714
Epoch 22/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0725Epoch 00021: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0725 - val_loss: 0.0716
Epoch 23/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0722Epoch 00022: val_loss improved from 0.07121 to 0.07101, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 162s - loss: 0.0722 - val_loss: 0.0710
Epoch 24/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0717Epoch 00023: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0717 - val_loss: 0.0714
Epoch 25/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0715Epoch 00024: val_loss improved from 0.07101 to 0.07059, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 162s - loss: 0.0715 - val_loss: 0.0706
Epoch 26/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0711Epoch 00025: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0711 - val_loss: 0.0714
Epoch 27/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0708Epoch 00026: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0708 - val_loss: 0.0707
Epoch 28/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0706Epoch 00027: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0706 - val_loss: 0.0713
Epoch 29/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0702Epoch 00028: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0702 - val_loss: 0.0709
Epoch 30/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0700Epoch 00029: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0700 - val_loss: 0.0710
Epoch 31/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0697Epoch 00030: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0697 - val_loss: 0.0713
Epoch 32/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0694Epoch 00031: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0694 - val_loss: 0.0709
Epoch 33/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0691Epoch 00032: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0691 - val_loss: 0.0713
Epoch 34/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0687Epoch 00033: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0687 - val_loss: 0.0719
Epoch 35/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0683Epoch 00034: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0683 - val_loss: 0.0719
Epoch 36/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0682Epoch 00035: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0682 - val_loss: 0.0714
Epoch 37/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0679Epoch 00036: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0679 - val_loss: 0.0717
Epoch 38/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0674Epoch 00037: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0674 - val_loss: 0.0720
Epoch 39/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0673Epoch 00038: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0673 - val_loss: 0.0716
Epoch 40/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0669Epoch 00039: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0669 - val_loss: 0.0712
Epoch 41/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0666Epoch 00040: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0666 - val_loss: 0.0723
Epoch 42/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0663Epoch 00041: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0663 - val_loss: 0.0714
Epoch 43/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00042: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0660 - val_loss: 0.0721
Epoch 44/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0656Epoch 00043: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0656 - val_loss: 0.0735
Epoch 45/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0654Epoch 00044: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0654 - val_loss: 0.0721
Epoch 46/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0651Epoch 00045: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0651 - val_loss: 0.0716
Epoch 47/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0648Epoch 00046: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0648 - val_loss: 0.0722
Epoch 48/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0646Epoch 00047: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0646 - val_loss: 0.0724
Epoch 49/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0643Epoch 00048: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0643 - val_loss: 0.0721
Epoch 50/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0641Epoch 00049: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0641 - val_loss: 0.0728
Epoch 51/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0638Epoch 00050: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0638 - val_loss: 0.0723
Epoch 52/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0635Epoch 00051: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0635 - val_loss: 0.0731
Epoch 53/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0633Epoch 00052: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0633 - val_loss: 0.0729
Epoch 54/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0630Epoch 00053: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0630 - val_loss: 0.0727
Epoch 55/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0627Epoch 00054: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0627 - val_loss: 0.0726
Epoch 56/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0626Epoch 00055: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0626 - val_loss: 0.0730
Epoch 57/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0624Epoch 00056: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0624 - val_loss: 0.0730
Epoch 58/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0619Epoch 00057: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0619 - val_loss: 0.0733
Epoch 59/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0619Epoch 00058: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0619 - val_loss: 0.0735
Epoch 60/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0617Epoch 00059: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0617 - val_loss: 0.0738
Epoch 61/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0614Epoch 00060: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0614 - val_loss: 0.0739
Epoch 62/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0613Epoch 00061: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0613 - val_loss: 0.0739
Epoch 63/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0612Epoch 00062: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0612 - val_loss: 0.0733
Epoch 64/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0608Epoch 00063: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0608 - val_loss: 0.0736
Epoch 65/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0607Epoch 00064: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0607 - val_loss: 0.0729
Epoch 66/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0605Epoch 00065: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0605 - val_loss: 0.0735
Epoch 67/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0603Epoch 00066: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0603 - val_loss: 0.0741
Epoch 68/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0600Epoch 00067: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0601 - val_loss: 0.0734
Epoch 69/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0601Epoch 00068: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0601 - val_loss: 0.0739
Epoch 70/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0597Epoch 00069: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0597 - val_loss: 0.0731
Epoch 71/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0596Epoch 00070: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0596 - val_loss: 0.0739
Epoch 72/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0595Epoch 00071: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0595 - val_loss: 0.0732
Epoch 73/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0592Epoch 00072: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0592 - val_loss: 0.0738
Epoch 74/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0592Epoch 00073: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0592 - val_loss: 0.0748
Epoch 75/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0590Epoch 00074: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0590 - val_loss: 0.0739
Epoch 76/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0587Epoch 00075: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0587 - val_loss: 0.0744
Epoch 77/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0584Epoch 00076: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0584 - val_loss: 0.0744
Epoch 78/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0585Epoch 00077: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0585 - val_loss: 0.0740
Epoch 79/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0582Epoch 00078: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0582 - val_loss: 0.0746
Epoch 80/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0581Epoch 00079: val_loss did not improve
20571/20571 [==============================] - 162s - loss: 0.0581 - val_loss: 0.0749
history: [(0.1178478534950894, None, 0.080269007230548917, None), (0.087801875846919439, None, 0.080777746402691128, None), (0.083995654629221525, None, 0.076085794053665584, None), (0.082390808346645764, None, 0.076674567748150319, None), (0.081010118229006375, None, 0.076393415264025488, None), (0.079943570494506913, None, 0.073835246831949808, None), (0.079255554543465931, None, 0.073892284439851158, None), (0.078404352868613372, None, 0.073101046921818583, None), (0.077847271457196415, None, 0.072390038123187048, None), (0.077236791814684971, None, 0.072595974643072575, None), (0.076636234986597218, None, 0.072094968073580359, None), (0.076452946420671131, None, 0.072242935804743738, None), (0.075875031465871767, None, 0.071843087843291839, None), (0.075456428014103794, None, 0.071931221021999864, None), (0.075004962713408618, None, 0.071238346409217043, None), (0.074653020302729897, None, 0.071416486451569575, None), (0.074248190322903279, None, 0.071498564740747797, None), (0.073883732412740058, None, 0.071631513921546791, None), (0.073511618407505919, None, 0.071208578980948831, None), (0.073199314139933691, None, 0.071791084593833848, None), (0.072913091988129147, None, 0.07136908965114408, None), (0.072453428619940946, None, 0.071583894471236739, None), (0.072206027303449688, None, 0.071007415368767451, None), (0.071711359233291416, None, 0.071431281802044611, None), (0.071461221480191656, None, 0.07058699940482957, None), (0.07112627067977538, None, 0.07144068039760923, None), (0.070803976525169052, None, 0.07069405832836799, None), (0.070602597189682079, None, 0.071326336331518095, None), (0.070233061117569245, None, 0.070861498957083102, None), (0.069970728420682735, None, 0.071003625501100329, None), (0.069662035542716952, None, 0.071285838972850846, None), (0.069448572154348423, None, 0.070889680007050204, None), (0.069098246974205857, None, 0.071327091051517924, None), (0.068693945093169048, None, 0.07191094220863993, None), (0.068339263157500094, None, 0.07190724677169523, None), (0.068152823083268949, None, 0.071384130712014535, None), (0.067851478914214086, None, 0.071720759708950324, None), (0.067439339306707327, None, 0.071959003726732057, None), (0.067273861398428475, None, 0.071587257370738316, None), (0.066917957100318393, None, 0.071189111623136236, None), (0.066599281819582648, None, 0.072251462512273948, None), (0.066328260350932033, None, 0.07144412531586905, None), (0.065998167956737699, None, 0.072120689938647203, None), (0.065598586657590732, None, 0.07349189675924804, None), (0.065367852415212022, None, 0.072085552836117672, None), (0.065101827943144244, None, 0.071629800401412549, None), (0.064829430752367065, None, 0.072159804494504334, None), (0.064575210026771898, None, 0.07243618551114378, None), (0.064273337743353129, None, 0.072092712861081779, None), (0.064067218115675589, None, 0.072776676409366109, None), (0.063812264104235086, None, 0.072254465521515959, None), (0.063472824960303792, None, 0.073070828104037311, None), (0.063303111837376858, None, 0.072897662021662007, None), (0.062982491294111223, None, 0.072693931854569571, None), (0.062720595245579575, None, 0.072583954917377527, None), (0.062572196005013223, None, 0.072954884005917445, None), (0.062371278771767784, None, 0.073015282783923816, None), (0.061934626205019307, None, 0.073252699509421801, None), (0.061897200147839691, None, 0.073469028500570729, None), (0.061689980054811779, None, 0.07383882927976243, None), (0.061375075245041488, None, 0.073943940993494814, None), (0.061346408569913032, None, 0.073947044438150922, None), (0.061151057166299524, None, 0.073290817915848946, None), (0.060772813716796936, None, 0.073551145386478126, None), (0.060728630644915474, None, 0.072890764235588337, None), (0.060515519339127848, None, 0.073525427093607473, None), (0.060289270102877789, None, 0.074082980462586684, None), (0.060056901612352963, None, 0.073448483842103271, None), (0.060101594745310211, None, 0.073904870092143027, None), (0.059728022146674671, None, 0.073072331340889959, None), (0.05958892846649607, None, 0.073947062361503488, None), (0.059476597750634873, None, 0.07317993586352789, None), (0.059229861097935946, None, 0.073815666365931926, None), (0.059157898717574223, None, 0.074812213545792719, None), (0.058981791754369517, None, 0.073866368831338042, None), (0.058681595374944925, None, 0.07442037170381488, None), (0.058433021156118314, None, 0.074392210437010414, None), (0.05846308683068796, None, 0.074021344071699247, None), (0.05817477138826458, None, 0.074605378034543049, None), (0.058118697245165274, None, 0.074871617365101159, None)]
0. 
patient tongue id: 02122059160135_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桃仁 远志 五味子 浙贝母 细辛 干姜 地龙 紫苏子 炙麻黄
0.972506 0.461137 0.586554 0.371251 0.307455 0.544348 0.413541 0.400526 0.314519 0.327554 0.303133
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
1. 
patient tongue id: 05092230212086_2_4_6
label yaofang:
甘草 白芍 黄芩 桔梗 麦冬 太子参 浙贝母 乌梅 鳖甲 北沙参 白花蛇舌 蜂房 岗梅根 四季青
0.982351 0.31712 0.475095 0.583044 0.36735 0.318299 0.55244 0.480019 0.457287 0.388781 0.389008 0.362877
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
2. 
patient tongue id: 06070237366457_1_2
label yaofang:
甘草 茯苓 龙骨 党参 白术 酸枣仁 杜仲 山药 石菖蒲 天麻 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.957118 0.446946 0.556978 0.416707 0.325221 0.489479 0.418276 0.441027 0.322697 0.34066 0.331353
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
3. 
patient tongue id: 05222128038888_7_2_1
label yaofang:
牡蛎 蒲公英 黄芪 白术 浙贝母 砂仁 莪术 王不留行 麦芽 橘络 墨旱莲
0.666951 0.326162 0.365901 0.494625 0.611551 0.387016 0.321643
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.428571, recall: 0.272727, error: 0.571429
4. 
patient tongue id: 05182037284021_1_4
label yaofang:
柴胡 黄芩 党参 白术 泽泻 天麻 白芷 姜半夏 炙甘草 续断
0.38417 0.534361 0.418168 0.359349 0.453135 0.37714 0.765885 0.773627
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.300000, error: 0.625000
5. 
patient tongue id: 05222054130477_1_2_6
label yaofang:
龙骨 黄芪 白术 五味子 海螵蛸 糯稻根 鸡内金 首乌藤 紫苏梗 合欢皮 墨旱莲 稻芽
0.551198 0.352236 0.329309 0.371943 0.471291 0.526951 0.368669 0.31991 0.328691
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.222222, recall: 0.166667, error: 0.777778
6. 
patient tongue id: 06130818199397_1_2
label yaofang:
川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.417198 0.314214 0.396849 0.498971 0.362994 0.355052 0.312407 0.30213
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 厚朴 夏枯草

------Score: precision: 0.250000, recall: 0.166667, error: 0.750000
7. 
patient tongue id: 01132320412873_1
label yaofang:
桂枝 白芍 川芎 当归 党参 阿胶 红花 牡丹皮 吴茱萸 姜半夏 炙甘草 天山雪莲
0.85074 0.353268 0.382764 0.495931 0.339802 0.347548
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
8. 
patient tongue id: 05262109501026_1_6
label yaofang:
甘草 陈皮 茯苓 防风 党参 白术 酸枣仁 山药 天麻 扁豆花 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.978445 0.430719 0.645848 0.396985 0.358779 0.374677 0.684887 0.594703 0.592102 0.461352 0.531868 0.579656
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
9. 
patient tongue id: 05182057208000_4
label yaofang:
龙骨 党参 枸杞子 白术 熟地黄 杜仲 车前子 砂仁 菟丝子 巴戟天 桑寄生 鹿角霜 续断 制何首乌 艾叶
0.327496 0.355037 0.354856 0.365384 0.364573 0.300755 0.402434
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.133333, error: 0.714286
10. 
patient tongue id: 02231818378983_4_2
label yaofang:
甘草 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.460211 0.711201 0.953282 0.556746 0.733653 0.485671 0.319793 0.329906 0.434351 0.84486 0.885358 0.84087 0.880626 0.317485 0.935257 0.505358 0.633546 0.522049 0.618262
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
11. 
patient tongue id: 05162057467576_2_1
label yaofang:
甘草 薏苡仁 远志 党参 浙贝母 天麻 鳖甲 款冬花 莪术 紫菀 诃子 紫苏梗 蜈蚣 白花蛇舌 天山雪莲
0.994529 0.48438 0.645901 0.368625 0.320681 0.352442 0.68378 0.605343 0.574623 0.493091 0.517376 0.513415
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
12. 
patient tongue id: 05242226331835_2_4
label yaofang:
甘草 桔梗 芦根 牛蒡子 麦冬 太子参 浙贝母 天麻 白花蛇舌草 北沙参 紫苏子 蜈蚣 半枝莲 醋鳖甲
0.99467 0.493538 0.630604 0.361913 0.304036 0.350155 0.661474 0.588731 0.552837 0.486301 0.498104 0.471681
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
13. 
patient tongue id: 05042137439481_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 麦芽 炙甘草 百合 紫苏叶
0.883512 0.4281 0.497865 0.360464 0.377419 0.319857
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
14. 
patient tongue id: 03091854342645_5_6
label yaofang:
甘草 枳壳 桔梗 金银花 连翘 牛蒡子 白术 浙贝母 莱菔子 麦芽 苦杏仁 独脚金 稻芽
0.987293 0.460103 0.629761 0.401665 0.323585 0.368928 0.641923 0.567474 0.559834 0.447451 0.487211 0.500311
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
15. 
patient tongue id: 05311935319321_5
label yaofang:
甘草 桔梗 金银花 连翘 薄荷 芦根 牛蒡子 桑白皮 淡豆豉 淡竹叶 射干 板蓝根 龙脷叶
0.475703 0.343991 0.346225 0.357184 0.409143
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
16. 
patient tongue id: 02211904112611_1_7
label yaofang:
大枣 当归 茯苓 木香 远志 党参 黄芪 白术 柏子仁 仙鹤草 炙甘草
0.341915 0.383225 0.334787 0.313383 0.51923
predicted yaofang:
甘草 白芍 党参 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
17. 
patient tongue id: 03021838351229_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 荆芥穗 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 苍耳子
0.435722 0.668811 0.305923 0.920241 0.513771 0.672675 0.326079 0.478193 0.336148 0.31859 0.404788 0.789061 0.837208 0.804414 0.836274 0.352851 0.904037 0.461596 0.584315 0.534357 0.6083
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.476190, recall: 0.714286, error: 0.523810
18. 
patient tongue id: 03281919403467_7
label yaofang:
白芍 当归 桃仁 鱼腥草 麦冬 玉竹 红花 熟地黄 栀子 黄柏 地黄 石菖蒲 滑石 茵陈 鸡内金 败酱草 北沙参 车前草
0.863696 0.316055 0.411156 0.497034 0.368505 0.31157
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.055556, error: 0.833333
19. 
patient tongue id: 04062030120916_4
label yaofang:
甘草 陈皮 法半夏 前胡 防风 细辛 干姜 木瓜 款冬花 紫菀 白前 百部 紫苏梗 蜜麻黄
0.380092 0.573 0.374729 0.772562 0.454304 0.550366 0.33137 0.388895 0.302393 0.340534 0.633298 0.653938 0.634142 0.657957 0.343081 0.709981 0.370591 0.472457 0.416094 0.47643
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
20. 
patient tongue id: 04261334490446_2_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.378376 0.309612 0.387304 0.443283 0.573269
predicted yaofang:
白芍 党参 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
21. 
patient tongue id: 01032302546094_6_5
label yaofang:
甘草 白芍 茯苓 薏苡仁 党参 白术 郁金 山药 天麻 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲 红豆杉
0.99281 0.47177 0.62684 0.382198 0.343765 0.645623 0.587414 0.575304 0.479107 0.500146 0.479314
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
22. 
patient tongue id: 04200637551984_5_6
label yaofang:
甘草 柴胡 法半夏 茯苓 龙骨 牡蛎 远志 党参 酸枣仁 丹参 黄连 胆南星 栀子 桑白皮 淡豆豉
0.955858 0.321892 0.436488 0.577012 0.409796 0.311019 0.506707 0.433128 0.447111 0.331901 0.356984 0.349589
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
23. 
patient tongue id: 06190812318319_4_6_7
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 杜仲 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 宽筋藤
0.996625 0.476999 0.684299 0.392615 0.374774 0.326936 0.388511 0.761867 0.700315 0.694442 0.590547 0.629434 0.665004
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
24. 
patient tongue id: 03180110107314_1
label yaofang:
桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.351034 0.301403 0.412138 0.375499 0.419622 0.488401
predicted yaofang:
甘草 柴胡 白芍 党参 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
25. 
patient tongue id: 02260707247775_1_4
label yaofang:
甘草 前胡 桔梗 浙贝母 桑白皮 天麻 鳖甲 款冬花 枇杷叶 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 田七末
0.98655 0.467997 0.604887 0.361888 0.314907 0.597343 0.490435 0.49431 0.38685 0.403287 0.417411
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
26. 
patient tongue id: 05140851543837_6_2_7
label yaofang:
甘草 茯苓 龙骨 麦冬 太子参 酸枣仁 丹参 五味子 红花 山茱萸 补骨脂 女贞子 鹿角霜 浮小麦 墨旱莲
0.990632 0.302886 0.479962 0.623358 0.380868 0.313025 0.353379 0.645514 0.588942 0.560228 0.486318 0.505909 0.502429
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.200000, error: 0.769231
27. 
patient tongue id: 03240601247005_2_5
label yaofang:
甘草 茯苓 木香 黄连 生地黄 山茱萸 灯心草 山楂 莱菔子 莪术 海金沙 鸡内金 王不留行 广金钱草
0.87882 0.419541 0.495432 0.396632 0.318334
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
28. 
patient tongue id: 04261327508651_1_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.412419 0.31551 0.319193 0.309321 0.457345 0.589059
predicted yaofang:
白芍 党参 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
29. 
patient tongue id: 03231105005908_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 鱼腥草 浙贝母 细辛 桑白皮 款冬花 紫菀 苇茎 苦杏仁 瓜蒌子
0.932061 0.406618 0.545957 0.504331 0.308853 0.375265 0.301179 0.454266
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
30. 
patient tongue id: 04172001566944_4_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 麦冬 款冬花 紫菀 百部 炙甘草 紫苏梗 蜜麻黄
0.437122 0.697504 0.946163 0.528113 0.708307 0.48429 0.314965 0.309232 0.421933 0.834371 0.871733 0.839148 0.874707 0.328449 0.925402 0.4715 0.605964 0.519058 0.617597
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.750000, error: 0.526316
31. 
patient tongue id: 05092125018057_6_4
label yaofang:
甘草 茯苓 桔梗 薏苡仁 白术 浙贝母 郁金 佩兰 天麻 鳖甲 广藿香 蜈蚣 白花蛇舌 四季青
0.845085 0.345528 0.385573 0.499747 0.384214 0.325974
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
32. 
patient tongue id: 05112035227912_6_7_4
label yaofang:
甘草 茯苓 牡蛎 党参 黄芪 枸杞子 白术 海螵蛸 浙贝母 厚朴 生半夏 砂仁 北沙参 蜈蚣 合欢皮 鲜龙葵果
0.44078 0.356585 0.486592 0.538942 0.336936 0.405566 0.302485
predicted yaofang:
甘草 党参 黄芪 白术 海螵蛸 厚朴 砂仁

------Score: precision: 1.000000, recall: 0.437500, error: 0.000000
33. 
patient tongue id: 01061616560202_5
label yaofang:
甘草 薏苡仁 黄连 石膏 苍术 天麻 鳖甲 麦芽 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.99396 0.306215 0.497296 0.620419 0.357049 0.302872 0.347645 0.642991 0.582734 0.541419 0.49048 0.491981 0.466537
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.538462, error: 0.461538
34. 
patient tongue id: 04121855583643_1_7
label yaofang:
甘草 半夏 桃仁 蒲公英 党参 黄芪 白术 厚朴 僵蚕 莪术 柿蒂 北沙参 赭石 蛇舌草
0.685096 0.350468 0.379312 0.47096 0.374194
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
35. 
patient tongue id: 01172243587825_5_6_7
label yaofang:
甘草 陈皮 法半夏 茯苓 龙骨 牡蛎 党参 丹参 黄连 竹茹 胆南星 磁石 补骨脂 麦芽 紫苏梗
0.98583 0.466924 0.615986 0.387396 0.309646 0.353206 0.620109 0.557113 0.528848 0.452276 0.475742 0.462899
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
36. 
patient tongue id: 03101853053004_6
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 干姜 豆蔻 姜半夏 炙甘草 紫苏梗
0.408519 0.351738 0.336992 0.399489
predicted yaofang:
甘草 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
37. 
patient tongue id: 04271429367693_1_3
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.404232 0.407373 0.412797 0.495628 0.489414 0.375921 0.440215 0.35465 0.429877 0.353895 0.478992 0.420451 0.476561 0.425277
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.214286, recall: 0.250000, error: 0.785714
38. 
patient tongue id: 05050746292112_5
label yaofang:
甘草 黄芩 前胡 桔梗 浙贝母 细辛 桑白皮 干姜 鳖甲 款冬花 白前 苦杏仁 白花蛇舌 天山雪莲
0.966334 0.452309 0.573322 0.383628 0.311787 0.520315 0.422607 0.412756 0.326197 0.338992 0.328694
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
39. 
patient tongue id: 02201311365886_6
label yaofang:
甘草 柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 肉桂 豆蔻 制川乌 姜半夏 炙甘草 紫苏梗
0.475024 0.39149 0.404159 0.354572 0.359197
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
40. 
patient tongue id: 01140445488548_6_7
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 桃仁 党参 白术 酸枣仁 延胡索 川楝子 五灵脂 麦芽 首乌藤
0.988783 0.301849 0.467121 0.612527 0.374828 0.33552 0.620896 0.559269 0.549045 0.455795 0.475791 0.487934
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
41. 
patient tongue id: 04282202376289_5_1
label yaofang:
甘草 柴胡 前胡 羌活 金银花 薏苡仁 赤芍 郁金 桑白皮 水牛角 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 龙葵果
0.921719 0.426998 0.530567 0.442051 0.354129 0.346877
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
42. 
patient tongue id: 02111355251651_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.664678 0.343148 0.435407 0.447257 0.458977 0.318392
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
43. 
patient tongue id: 03221622080727_6
label yaofang:
甘草 香附 茯苓 党参 白术 酸枣仁 生地黄 黄柏 郁金 山茱萸 菟丝子 益母草 王不留行 浮小麦 合欢花
0.947969 0.300374 0.451339 0.536482 0.373493 0.430634 0.33388 0.345291
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.266667, error: 0.500000
44. 
patient tongue id: 04301136059351_2_6
label yaofang:
甘草 柴胡 白芍 木香 党参 太子参 黄连 延胡索 砂仁 五灵脂 麦芽 北沙参 鱼古 瓦楞子
0.974458 0.459467 0.597842 0.383183 0.331633 0.584304 0.467589 0.453146 0.360148 0.388404 0.372817
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
45. 
patient tongue id: 04131719335955_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.316467 0.352488
predicted yaofang:
甘草 黄芪

------Score: precision: 1.000000, recall: 0.153846, error: 0.000000
46. 
patient tongue id: 02020954233530_1_4
label yaofang:
甘草 白芍 川芎 法半夏 党参 白术 赤芍 钩藤 天麻 木瓜 决明子 地龙 首乌藤 沙苑子 宽筋藤
0.97883 0.464382 0.585177 0.390287 0.328739 0.556841 0.479372 0.45901 0.384022 0.398718 0.384212
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
47. 
patient tongue id: 04201954060958_2_6_1
label yaofang:
桂枝 甘草 川芎 茯苓 白术 牛膝 山药 车前子 天麻 菟丝子 益母草 猪苓 泽兰
0.823828 0.38066 0.501908 0.344342 0.392507
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
48. 
patient tongue id: 01250629444905_1_5
label yaofang:
甘草 白芍 当归 木香 蒲公英 白及 茜草 天麻 赤石脂 白头翁 鳖甲 蜈蚣 天山雪莲 半枝莲
0.982286 0.315954 0.456347 0.604937 0.365511 0.315693 0.607507 0.505918 0.484416 0.401818 0.421014 0.415493
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
49. 
patient tongue id: 06182032076538_1_2
label yaofang:
薏苡仁 黄芪 白术 黄柏 牛膝 苍术 砂仁 桑寄生 首乌藤 桑枝 宽筋藤 合欢皮
0.659476 0.370577 0.408831 0.393699 0.516353
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
50. 
patient tongue id: 03012125599670_6_1
label yaofang:
甘草 党参 酸枣仁 生地黄 杜仲 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 牛大力
0.870805 0.317961 0.403065 0.484545 0.366085
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
51. 
patient tongue id: 03282242173733_4
label yaofang:
甘草 白芍 川芎 羌活 细辛 干姜 豆蔻 蜈蚣 姜黄 海桐皮 鹿衔草
0.366067 0.50092 0.350588 0.324998 0.351552 0.314325 0.360969 0.303025 0.573712 0.588305
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.181818, error: 0.800000
52. 
patient tongue id: 04181939084290_6
label yaofang:
甘草 当归 党参 黄连 牡丹皮 牛膝 知母 石膏 山药 细辛 地黄 白芷 升麻 麦芽
0.989284 0.47752 0.609043 0.378154 0.342578 0.615028 0.537207 0.511819 0.434052 0.448803 0.431892
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
53. 
patient tongue id: 04071316549792_4
label yaofang:
甘草 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 香薷 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子
0.417772 0.585226 0.323965 0.845809 0.496461 0.633475 0.309656 0.448481 0.355627 0.360525 0.428221 0.716027 0.759947 0.727368 0.764269 0.305736 0.819913 0.475572 0.546175 0.472459 0.557532
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.380952, recall: 0.571429, error: 0.619048
54. 
patient tongue id: 04181942494246_6
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 当归 茯苓 龙骨 白术 酸枣仁 川楝子 佛手 浮小麦 合欢花
0.940345 0.444197 0.535998 0.417135 0.306246 0.436712 0.393454 0.435438 0.304956 0.32039 0.312985
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
55. 
patient tongue id: 05021912082838_3
label yaofang:
桂枝 白芍 法半夏 防风 玄参 五味子 细辛 干姜 白芷 款冬花 川贝母 射干 蝉蜕 炙甘草 蜜麻黄 木蝴蝶
0.588963 0.342019 0.398727 0.469193 0.552558 0.353782
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
56. 
patient tongue id: 01062041205222_6_5
label yaofang:
甘草 白芍 陈皮 防风 薏苡仁 党参 白术 熟附子 天麻 鳖甲 败酱草 蜈蚣 天山雪莲 半枝莲 姜黄
0.979226 0.463579 0.571267 0.385909 0.315645 0.497858 0.426223 0.437487 0.319534 0.328566 0.304815
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
57. 
patient tongue id: 03301936137931_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄 炒蔓荆子
0.40977 0.611892 0.354646 0.832009 0.466303 0.590704 0.342873 0.413904 0.303046 0.308898 0.351502 0.681986 0.719321 0.694109 0.726416 0.365527 0.793673 0.394267 0.508342 0.476501 0.52528
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.866667, error: 0.380952
58. 
patient tongue id: 05232222235011_1_4
label yaofang:
茯苓 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.429774 0.636151 0.319566 0.893829 0.508178 0.658001 0.31094 0.471316 0.338698 0.326776 0.426718 0.758424 0.803244 0.773045 0.806001 0.323221 0.882153 0.459573 0.575047 0.499909 0.582338
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 1.000000, error: 0.380952
59. 
patient tongue id: 02260649080182_1_6
label yaofang:
甘草 远志 党参 黄芪 白术 酸枣仁 生地黄 天麻 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.996397 0.477233 0.669182 0.378066 0.334998 0.302221 0.368537 0.739825 0.67012 0.649614 0.557179 0.592707 0.606111
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
60. 
patient tongue id: 05131626542431_6_1
label yaofang:
甘草 茯苓 薏苡仁 太子参 白术 郁金 山药 砂仁 天麻 鳖甲 莪术 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.992783 0.473042 0.651847 0.386835 0.344162 0.309286 0.365126 0.704029 0.635303 0.634165 0.524417 0.566832 0.596326
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.562500, error: 0.307692
61. 
patient tongue id: 03171503401181_4_1
label yaofang:
甘草 法半夏 前胡 防风 薄荷 荆芥穗 白芷 百部 豆蔻 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术
0.371614 0.518244 0.34655 0.726807 0.406232 0.526826 0.32281 0.337732 0.57965 0.618226 0.650515 0.658818 0.363608 0.74074 0.324762 0.444019 0.464432 0.4873
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.333333, recall: 0.428571, error: 0.666667
62. 
patient tongue id: 03222002224981_1_4
label yaofang:
甘草 白芍 川芎 独活 杜仲 牛膝 细辛 车前子 干姜 广藿香 蜈蚣 姜黄 海桐皮 鹿衔草
0.431387 0.34505 0.462359 0.374813 0.348154 0.402065 0.467696
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
63. 
patient tongue id: 03081821199316_1_7_6
label yaofang:
桃仁 黄芪 白术 海螵蛸 浙贝母 砂仁 秦艽 北沙参 桑枝 土鳖虫 红豆杉 合欢皮 山慈菇 预知子 蛇舌草
0.437361 0.33374 0.337385 0.310762 0.494936 0.374094 0.306567 0.399947
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
64. 
patient tongue id: 05162106199672_2_6_7
label yaofang:
甘草 丹参 杜仲 郁金 天麻 桑寄生 鳖甲 莪术 诃子 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.919193 0.437265 0.545021 0.38191 0.306939 0.459434 0.304401 0.333307
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
65. 
patient tongue id: 01042341105713_1_7
label yaofang:
甘草 党参 白术 红花 赤芍 山药 天麻 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲 狗脊
0.984904 0.306221 0.471715 0.59828 0.371264 0.333386 0.597502 0.529409 0.517995 0.431573 0.447345 0.450356
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
66. 
patient tongue id: 01101808080037_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.474956 0.793972 0.983688 0.603097 0.798878 0.530005 0.301905 0.449064 0.910679 0.943803 0.908807 0.935717 0.30213 0.97318 0.543444 0.686582 0.553965 0.680375
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
67. 
patient tongue id: 03311621410847_5_4_7
label yaofang:
牡蛎 薏苡仁 桃仁 黄芪 白术 浙贝母 杜仲 牛膝 厚朴 砂仁 北沙参 土鳖虫 红豆杉 山慈菇 蛇舌草
0.595442 0.330834 0.393702 0.401304 0.563683 0.343209 0.304201
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
68. 
patient tongue id: 02020832320086_1_6_5
label yaofang:
甘草 白芍 黄芩 当归 茯苓 党参 白术 黄柏 地黄 菟丝子 益母草 续断 醋香附
0.420338 0.397681 0.396033 0.315386 0.402985
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
69. 
patient tongue id: 03101922172879_5_7
label yaofang:
甘草 陈皮 茯苓 桔梗 薏苡仁 鱼腥草 黄芪 海螵蛸 浙贝母 苍术 生半夏 莪术 北沙参 蜈蚣 红豆杉
0.320219 0.310933 0.341256 0.391986 0.507688
predicted yaofang:
茯苓 半夏 黄芪 北沙参 炙甘草

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
70. 
patient tongue id: 04111905410371_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 款冬花 紫菀 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.455763 0.768766 0.976795 0.58555 0.77186 0.516883 0.301334 0.302797 0.432118 0.893982 0.929127 0.897642 0.923174 0.965815 0.509943 0.661629 0.549962 0.667321
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
71. 
patient tongue id: 04131358566698_4_7_6
label yaofang:
甘草 法半夏 茯苓 桔梗 远志 党参 丹参 黄连 竹茹 浙贝母 栀子 牡丹皮 厚朴 浮小麦 紫苏梗
0.97459 0.323151 0.467786 0.590089 0.38551 0.300227 0.342557 0.580424 0.520896 0.503685 0.435755 0.451606 0.436867
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.200000, error: 0.769231
72. 
patient tongue id: 05160613207537_1_3_6
label yaofang:
甘草 龙骨 牡蛎 黄芪 五味子 厚朴 糯稻根 桑寄生 火麻仁 浮小麦 首乌藤 黑枣 合欢皮 墨旱莲
0.432722 0.369108 0.310189 0.352428 0.315207
predicted yaofang:
甘草 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
73. 
patient tongue id: 05140832195840_6_7_1
label yaofang:
甘草 川芎 党参 鸡血藤 杜仲 牛膝 山药 山茱萸 钩藤 泽泻 天麻 桑寄生 豆蔻 蒺藜 首乌藤
0.98456 0.469862 0.597061 0.383932 0.342214 0.583848 0.502981 0.475685 0.405155 0.41337 0.378697
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
74. 
patient tongue id: 02190642028124_2_6_1
label yaofang:
甘草 党参 酸枣仁 丹参 生地黄 山药 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.990838 0.306446 0.482403 0.617383 0.369242 0.308989 0.343454 0.639512 0.571815 0.561914 0.472796 0.491072 0.499181
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.666667, error: 0.230769
75. 
patient tongue id: 03142047540413_4
label yaofang:
甘草 防风 丹参 生地黄 牡丹皮 乌梅 紫草 莪术 珍珠母 白鲜皮 紫苏叶 土茯苓 徐长卿
0.397184 0.400456 0.384101 0.311759 0.332446 0.441195
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
76. 
patient tongue id: 02202318375561_5
label yaofang:
枳壳 黄芩 黄连 海螵蛸 厚朴 山楂 火麻仁 鸡内金 枇杷叶 北沙参 紫苏梗 布渣叶
0.473422 0.314879 0.461135 0.546308 0.583525 0.302907 0.437308 0.352459 0.30134 0.388521
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.400000, recall: 0.333333, error: 0.600000
77. 
patient tongue id: 05021432333785_1_3
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.380074 0.342429 0.38307 0.302509 0.304228 0.479563
predicted yaofang:
甘草 法半夏 茯苓 防风 紫菀 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
78. 
patient tongue id: 03152021467591_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.411937 0.463129 0.427486 0.514198 0.571217 0.428755 0.502599 0.409306 0.511294 0.43047 0.600004 0.328633 0.5383 0.612862 0.550137
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
79. 
patient tongue id: 02122108129471_6_2
label yaofang:
甘草 白芍 法半夏 茯苓 白术 酸枣仁 牛膝 白茅根 地黄 天麻 桑寄生 百合 建曲
0.964448 0.458013 0.550886 0.373618 0.470113 0.378917 0.383278
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
80. 
patient tongue id: 05102011484721_1
label yaofang:
甘草 陈皮 法半夏 大枣 当归 茯苓 防风 党参 熟地黄 炒紫苏子 醋五味子
0.457074 0.730106 0.963462 0.565793 0.749659 0.512075 0.327542 0.319721 0.444435 0.863988 0.905482 0.867523 0.900223 0.300755 0.949251 0.518147 0.643867 0.53286 0.642937
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.210526, recall: 0.363636, error: 0.789474
81. 
patient tongue id: 03221817596943_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.415006 0.581365 0.363118 0.780766 0.459163 0.564814 0.346213 0.39226 0.307358 0.300532 0.339972 0.628603 0.673569 0.653984 0.676989 0.362627 0.776413 0.374779 0.485448 0.454014 0.50398
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
82. 
patient tongue id: 01062342105694_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.41221 0.368692 0.350224 0.365475 0.330538
predicted yaofang:
甘草 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
83. 
patient tongue id: 03101954444297_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 蜜麻黄
0.399606 0.597386 0.333243 0.826567 0.458642 0.586031 0.341939 0.379857 0.315404 0.675569 0.715701 0.713759 0.736035 0.377866 0.806494 0.369139 0.495199 0.500556 0.541005
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.785714, error: 0.421053
84. 
patient tongue id: 01042308513562_4
label yaofang:
甘草 香附 茯苓 薏苡仁 党参 白术 海螵蛸 干姜 紫菀 白花蛇舌草 续断 瓦楞子
0.755675 0.395735 0.44689 0.459096
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.333333, error: 0.000000
85. 
patient tongue id: 04271850594482_1_6
label yaofang:
甘草 枳壳 茯苓 半夏 龙骨 薏苡仁 黄芪 白术 赤芍 浙贝母 郁金 厚朴 砂仁 莪术 麦芽 合欢皮 预知子 冬凌草
0.392433 0.394977 0.554111 0.477758 0.369723 0.390682
predicted yaofang:
甘草 半夏 黄芪 白术 厚朴 北沙参

------Score: precision: 0.833333, recall: 0.277778, error: 0.166667
86. 
patient tongue id: 03231042469629_6_2_7
label yaofang:
白芍 党参 延胡索 杜仲 天麻 菟丝子 五灵脂 鳖甲 火麻仁 补骨脂 麦芽 炙甘草 蜈蚣 天山雪莲 合欢花 半枝莲 姜黄
0.989369 0.302553 0.477245 0.604175 0.368975 0.32556 0.607958 0.528326 0.509567 0.431839 0.4415 0.427616
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.411765, error: 0.416667
87. 
patient tongue id: 04260445471322_1_6
label yaofang:
甘草 茯苓 龙骨 牡蛎 党参 丹参 竹茹 胆南星 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.982458 0.463674 0.616887 0.381582 0.305387 0.349419 0.610992 0.521547 0.487501 0.412387 0.434046 0.416935
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
88. 
patient tongue id: 04112315282386_1
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 郁金 鸡内金 炙甘草 百合 紫苏叶
0.373428 0.505714 0.35662 0.35223 0.38012 0.679178 0.735949
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
89. 
patient tongue id: 03312121440579_1_4
label yaofang:
甘草 茯苓 木香 远志 党参 白术 酸枣仁 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.996528 0.494243 0.656973 0.360941 0.326549 0.306247 0.356737 0.707107 0.626536 0.577797 0.521059 0.530982 0.511795
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.733333, error: 0.153846
90. 
patient tongue id: 03291622503569_6_7
label yaofang:
甘草 白芍 川芎 茯苓 羌活 黄芪 酸枣仁 生地黄 赤芍 牛膝 细辛 天麻 白芷 蒿苯
0.979198 0.466501 0.583863 0.37559 0.323414 0.553629 0.445714 0.431297 0.346463 0.358702 0.333433
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
91. 
patient tongue id: 04020814309348_5_6
label yaofang:
甘草 柴胡 白芍 蒲公英 白及 党参 白术 黄连 延胡索 五灵脂 莪术 麦芽 皂角刺 建曲 合欢花 姜黄
0.964558 0.460331 0.566925 0.391261 0.313114 0.494613 0.401485 0.4245 0.306428 0.324418 0.316528
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
92. 
patient tongue id: 03271536347983_4_5
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 大枣 当归 牡蛎 防风 麦冬 党参 黄连 生地黄 栀子 糯稻根 生石膏 鸡内金 姜半夏 浮小麦 广藿香 蜈蚣 红芪
0.85665 0.375514 0.360476 0.495643 0.374659
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.136364, error: 0.400000
93. 
patient tongue id: 03091855486678_1_6_5
label yaofang:
甘草 茯苓 党参 白术 丹参 赤芍 杜仲 山药 鳖甲 茵陈 虎杖 麦芽 黄精
0.832965 0.301065 0.369449 0.536843 0.446332 0.365572 0.392156
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
94. 
patient tongue id: 01042327249414_6_1_5
label yaofang:
甘草 连翘 党参 白术 槟榔 砂仁 莱菔子 天麻 火麻仁 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.581555 0.367957 0.422292 0.382043 0.422648
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
95. 
patient tongue id: 03062131282000_6_2
label yaofang:
甘草 白芍 法半夏 茯苓 牛蒡子 党参 白术 浙贝母 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲 贯众
0.993892 0.479888 0.645031 0.379353 0.332513 0.301073 0.367331 0.692225 0.610001 0.58247 0.496674 0.526648 0.523821
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
96. 
patient tongue id: 03311803378194_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.421533 0.62488 0.325741 0.87659 0.48505 0.627843 0.330028 0.426515 0.312075 0.362248 0.733692 0.777678 0.758019 0.787276 0.366015 0.859492 0.415308 0.541947 0.499983 0.564412
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
97. 
patient tongue id: 04202039135681_2_6_1
label yaofang:
桂枝 甘草 党参 黄芪 黄连 赤芍 石膏 山药 山茱萸 天花粉 补骨脂 桑螵蛸 益智 粉葛
0.989305 0.464286 0.638062 0.397875 0.33203 0.363608 0.669422 0.609654 0.598799 0.492192 0.534195 0.546858
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
98. 
patient tongue id: 06080203217118_2_7
label yaofang:
甘草 茯苓 酸枣仁 玄参 生地黄 牡丹皮 山药 山茱萸 天麻 鳖甲 建曲 蜈蚣 半枝莲 龙葵果
0.956464 0.460474 0.588692 0.408196 0.320564 0.365124 0.565525 0.501673 0.496345 0.397081 0.429375 0.430707
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
99. 
patient tongue id: 06080144204730_1_2
label yaofang:
甘草 党参 丹参 生地黄 浙贝母 天麻 益母草 鳖甲 虎杖 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.987841 0.460808 0.64625 0.36968 0.351683 0.304853 0.359154 0.69113 0.596304 0.559738 0.480096 0.518509 0.520854
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.642857, error: 0.307692
100. 
patient tongue id: 04282207188400_2_6
label yaofang:
桂枝 甘草 香附 茯苓 桃仁 生地黄 牡丹皮 山药 山茱萸 益母草 决明子 红曲
0.966246 0.310892 0.44467 0.590131 0.394598 0.540073 0.43481 0.442538 0.331734 0.358644 0.352095
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.166667, error: 0.818182
101. 
patient tongue id: 04260658431213_1_4_6
label yaofang:
甘草 柴胡 法半夏 薏苡仁 党参 赤芍 青蒿 天麻 瓜蒌皮 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.896585 0.414473 0.516397 0.478647 0.301753 0.320371 0.356204
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
102. 
patient tongue id: 03020849497259_6_4
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 法半夏 茯苓 龙骨 党参 白术 酸枣仁 干姜 扁豆花 浮小麦
0.943023 0.414335 0.533379 0.467244 0.311447 0.396609 0.338049 0.472411
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
103. 
patient tongue id: 06071900303961_2
label yaofang:
甘草 陈皮 半夏 龙骨 牡蛎 远志 酸枣仁 五味子 黄连 竹茹 山药 糯稻根 珍珠母 浮小麦 黄精 合欢皮
0.410168 0.348028 0.342084 0.323162 0.312191
predicted yaofang:
甘草 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
104. 
patient tongue id: 01180612303331_2_6
label yaofang:
甘草 桔梗 麦冬 太子参 玄参 浙贝母 桑叶 白茅根 地黄 茜草 白花蛇舌草 蜂房 岗梅根 醋鳖甲
0.95599 0.307862 0.4485 0.547374 0.376987 0.450213 0.360924 0.379111
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.125000, recall: 0.071429, error: 0.875000
105. 
patient tongue id: 05162151387474_6_1_2
label yaofang:
甘草 川芎 桃仁 酸枣仁 红花 赤芍 杜仲 牛膝 天麻 桑寄生 益母草 补骨脂 续断 牛大力
0.991738 0.476884 0.638046 0.381941 0.320529 0.362394 0.669339 0.595077 0.562131 0.48587 0.511844 0.499898
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
106. 
patient tongue id: 05232009207607_1
label yaofang:
桂枝 白芍 枳壳 半夏 薏苡仁 黄芪 枸杞子 白术 海螵蛸 杜仲 郁金 厚朴 砂仁 莪术 蜈蚣 五指毛桃 蛇舌草 稻芽
0.513072 0.46254 0.337267 0.64729 0.668634 0.356039 0.375448 0.567552 0.415265 0.303593 0.417506 0.392382 0.386121 0.336988
predicted yaofang:
甘草 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 鸡内金 北沙参 合欢皮 蛇舌草

------Score: precision: 0.571429, recall: 0.444444, error: 0.428571
107. 
patient tongue id: 01070845025107_1_4
label yaofang:
川芎 香附 法半夏 当归 桃仁 丹参 生地黄 红花 延胡索 赤芍 青皮 鸡内金
0.443237 0.348158 0.379814 0.304513 0.49504 0.365563 0.312131 0.428659
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
108. 
patient tongue id: 06031113103621_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 薏苡仁 桃仁 远志 五味子 浙贝母 细辛 鳖甲 款冬花 苦杏仁 炙麻黄 白花蛇舌
0.994437 0.482956 0.642723 0.381078 0.323777 0.362213 0.684585 0.620757 0.594886 0.512554 0.53701 0.538033
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
109. 
patient tongue id: 03231310554451_1_5
label yaofang:
甘草 白芍 薏苡仁 党参 白术 熟附子 山药 天麻 巴戟天 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.932959 0.313047 0.430547 0.558601 0.361366 0.475293 0.343596 0.369226
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.875000, recall: 0.466667, error: 0.125000
110. 
patient tongue id: 06132009531066_1_7
label yaofang:
甘草 枳壳 薏苡仁 黄芪 阿胶 白术 黄连 浙贝母 杜仲 郁金 厚朴 生半夏 莪术 柿蒂 赭石 紫苏叶 蜈蚣 蛇舌草
0.4567 0.38418 0.307538 0.558869 0.664869 0.379691 0.481204 0.366815 0.331489
predicted yaofang:
甘草 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 合欢皮

------Score: precision: 0.444444, recall: 0.222222, error: 0.555556
111. 
patient tongue id: 06190152201086_2_3
label yaofang:
甘草 茯苓 党参 黄连 熟附子 赤芍 熟地黄 牡丹皮 肉桂 山药 山茱萸 泽泻 粉葛
0.987598 0.463612 0.624937 0.346529 0.315739 0.348394 0.646485 0.504003 0.464887 0.382417 0.409004 0.378487
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
112. 
patient tongue id: 04261336505310_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 赤芍 牛膝
0.338317 0.311316 0.402455 0.350462 0.341528 0.333202 0.405544 0.509171
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.181818, error: 0.750000
113. 
patient tongue id: 03012033364823_7_4
label yaofang:
甘草 党参 白术 郁金 山药 天麻 鳖甲 茵陈 莪术 虎杖 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.961818 0.301803 0.458497 0.564235 0.420077 0.336487 0.496233 0.468076 0.480319 0.384171 0.390643 0.380815
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
114. 
patient tongue id: 01062335078914_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草
0.694319 0.398472 0.47785 0.345133
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.250000, recall: 0.090909, error: 0.750000
115. 
patient tongue id: 04301141524707_6_4
label yaofang:
甘草 白芍 党参 酸枣仁 黄连 杜仲 黄柏 牛膝 山茱萸 天麻 菟丝子 桑寄生 续断
0.930245 0.453782 0.539285 0.388357 0.305722 0.441741 0.360802 0.374947
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
116. 
patient tongue id: 01031834204300_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 炒苍耳子
0.449744 0.70109 0.953826 0.534691 0.726179 0.300192 0.479012 0.324574 0.305339 0.396452 0.843429 0.882357 0.851762 0.884202 0.324692 0.926755 0.501156 0.615884 0.530376 0.618363
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
117. 
patient tongue id: 03230737255157_6_2
label yaofang:
甘草 柴胡 白芍 茯苓 桃仁 党参 何首乌 酸枣仁 丹参 牡丹皮 郁金 莪术 女贞子 首乌藤 合欢花
0.987116 0.312311 0.47768 0.594442 0.359121 0.320152 0.58582 0.500572 0.470338 0.406449 0.409544 0.387587
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
118. 
patient tongue id: 03181802505956_1_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 郁金 山药 天麻 鳖甲 莪术 续断 蜈蚣 天山雪莲 半枝莲 骨碎补
0.745306 0.362192 0.369068 0.480167 0.363312
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.266667, error: 0.200000
119. 
patient tongue id: 06031742008962_1_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.446367 0.741879 0.978069 0.582871 0.79296 0.525902 0.312894 0.319329 0.472976 0.901562 0.933487 0.900726 0.931344 0.962893 0.552374 0.673918 0.509334 0.654654
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.785714, error: 0.388889
120. 
patient tongue id: 01061853443097_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 干姜 款冬花 白前 百部 豆蔻 北沙参 炙甘草 广藿香 炒紫苏子 麸炒白术 甘松
0.431245 0.620282 0.903404 0.506462 0.672377 0.312945 0.421613 0.318992 0.304693 0.378416 0.773925 0.80961 0.782581 0.825215 0.34946 0.873315 0.461037 0.575312 0.510916 0.579626
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.750000, error: 0.400000
121. 
patient tongue id: 02201756231562_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.477295 0.780158 0.98329 0.609023 0.802903 0.529167 0.307342 0.324347 0.471442 0.913694 0.943685 0.904056 0.936627 0.969464 0.567575 0.69017 0.53031 0.668665
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 1.000000, error: 0.222222
122. 
patient tongue id: 05262206226520_1_2_7
label yaofang:
甘草 茯苓 党参 白术 熟附子 杜仲 黄柏 牛膝 山茱萸 车前子 天麻 补骨脂 桑螵蛸 地龙 益智 女贞子
0.923549 0.445743 0.533643 0.310414 0.461938
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 1.000000, recall: 0.312500, error: 0.000000
123. 
patient tongue id: 02171933452205_1_7_4
label yaofang:
桃仁 黄芪 鸡血藤 白术 浙贝母 杜仲 山药 砂仁 淫羊藿 莪术 玉米须 土鳖虫 合欢皮 山慈菇 预知子
0.34364 0.303553 0.431717 0.332351
predicted yaofang:
甘草 茯苓 黄芪 白术

------Score: precision: 0.500000, recall: 0.133333, error: 0.500000
124. 
patient tongue id: 04181141248791_1_3_4
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 厚朴
0.379345 0.506615 0.429991 0.41858 0.628105 0.498366 0.540458 0.539923 0.566091 0.564044 0.685009 0.42657 0.612343 0.671342 0.64888
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.333333, recall: 0.416667, error: 0.666667
125. 
patient tongue id: 02260020275618_1_2
label yaofang:
甘草 党参 白术 生地黄 杜仲 山药 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.987757 0.466756 0.601058 0.383737 0.330474 0.593298 0.500283 0.553852 0.370394 0.414927 0.439524
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
126. 
patient tongue id: 02021010331063_1_5
label yaofang:
甘草 茯苓 玉竹 党参 白术 浙贝母 杜仲 牛膝 砂仁 天麻 桑寄生 珍珠母 预知子
0.356957 0.374408 0.385592 0.342835 0.344183 0.335205 0.34931 0.319083 0.357153 0.44702
predicted yaofang:
甘草 法半夏 茯苓 前胡 防风 黄芪 白前 百部 北沙参 炙甘草

------Score: precision: 0.200000, recall: 0.153846, error: 0.800000
127. 
patient tongue id: 05221905448655_2
label yaofang:
甘草 芦根 麦冬 玉竹 黄柏 知母 钩藤 桑叶 天麻 天花粉 鳖甲 北沙参 白扁豆 龟甲
0.714788 0.353734 0.438599 0.421256 0.545442 0.305376
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
128. 
patient tongue id: 03291358321471_5_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 党参 杜仲 郁金 山药 石菖蒲 桑寄生 益智 蜈蚣 鹿衔草
0.919738 0.311346 0.417394 0.542816 0.375415 0.413071
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
129. 
patient tongue id: 04251950373840_2_1
label yaofang:
甘草 桔梗 黄芪 白术 柏子仁 枳实 槟榔 厚朴 肉苁蓉 火麻仁 紫菀
0.323777 0.36744 0.473967 0.322901 0.338725 0.326356 0.302705 0.335473 0.54676 0.597255
predicted yaofang:
甘草 柴胡 白芍 香附 党参 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.100000, recall: 0.090909, error: 0.900000
130. 
patient tongue id: 01042314293995_1
label yaofang:
甘草 白芍 枳壳 桔梗 黄芪 白术 枳实 槟榔 厚朴 肉苁蓉 火麻仁 紫菀 郁李仁
0.770893 0.352966 0.36738 0.516988 0.356848 0.363502
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
131. 
patient tongue id: 03111450108273_5
label yaofang:
甘草 黄芩 法半夏 前胡 桔梗 薏苡仁 鱼腥草 浙贝母 厚朴 款冬花 苇茎 苦杏仁 炙麻黄
0.974045 0.301811 0.456783 0.576535 0.389502 0.314022 0.540134 0.457886 0.455524 0.362927 0.372264 0.363855
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.076923, error: 0.916667
132. 
patient tongue id: 04120008338976_7_4
label yaofang:
甘草 香附 茯苓 葛根 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草
0.333284 0.454402 0.316434 0.347818 0.348608 0.453734 0.576016 0.607996 0.327675
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
133. 
patient tongue id: 05161931009416_4
label yaofang:
法半夏 茯苓 前胡 防风 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 蝉蜕 炙甘草 广藿香 麸炒白术
0.447867 0.722123 0.972116 0.577767 0.77949 0.529678 0.325466 0.348297 0.481434 0.886226 0.920358 0.8831 0.917838 0.951348 0.558574 0.661648 0.503177 0.637346
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.733333, error: 0.388889
134. 
patient tongue id: 03291509437282_1
label yaofang:
甘草 茯苓 木香 薏苡仁 党参 白术 砂仁 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.983806 0.468762 0.611643 0.393839 0.317342 0.356987 0.625034 0.550932 0.535193 0.445852 0.472294 0.471256
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
135. 
patient tongue id: 02142148471120_6_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 牛蒡子 浙贝母 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.973058 0.309429 0.449065 0.599249 0.380874 0.300411 0.326108 0.593709 0.493295 0.495619 0.391683 0.420582 0.440807
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
136. 
patient tongue id: 06111036539798_4_5_6
label yaofang:
甘草 柴胡 茯苓 牡蛎 连翘 蒲公英 玄参 浙贝母 郁金 蔓荆子 莪术 麦芽 辛夷 苍耳子 蜂房 猫爪草
0.973278 0.463442 0.580277 0.38535 0.322367 0.532418 0.461432 0.436335 0.367988 0.372078 0.349972
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
137. 
patient tongue id: 03221316088197_1_6_2
label yaofang:
甘草 川芎 茯苓 党参 白术 生地黄 杜仲 天麻 桑寄生 鳖甲 威灵仙 蜈蚣 天山雪莲 半枝莲 骨碎补 红豆杉
0.968314 0.325265 0.462131 0.568432 0.37113 0.505911 0.411731 0.408343 0.321894 0.327258 0.317431
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
138. 
patient tongue id: 03011845172788_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.475541 0.335709 0.369919 0.36253 0.317692 0.446073
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
139. 
patient tongue id: 01062332507065_1_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.482245 0.377744 0.368145
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.666667, recall: 0.166667, error: 0.333333
140. 
patient tongue id: 05042033497300_4_1
label yaofang:
甘草 柴胡 白芍 香附 黄芩 当归 茯苓 薄荷 白术 黄连 麦芽 广藿香
0.75317 0.364422 0.351844 0.48814 0.347956
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
141. 
patient tongue id: 05201510246732_6_4
label yaofang:
柴胡 法半夏 茯苓 木香 蒲公英 白及 党参 黄连 竹茹 干姜 厚朴 柿蒂 麦芽 紫苏梗
0.860471 0.405298 0.517583 0.416328 0.368183
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
142. 
patient tongue id: 03021848107399_1_4
label yaofang:
枳壳 当归 枸杞子 白术 海螵蛸 浙贝母 厚朴 生半夏 火麻仁 鸡内金 北沙参 山慈菇 蛇舌草
0.583731 0.370577 0.444784 0.391046 0.306466 0.303005
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
143. 
patient tongue id: 01202015416381_1_4
label yaofang:
太子参 黄芪 白术 海螵蛸 浙贝母 山药 砂仁 石斛 鸡内金 紫苏梗 红豆杉 稻芽
0.914733 0.41992 0.50968 0.431008 0.361722 0.335568
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
144. 
patient tongue id: 04111936070295_1_4_6
label yaofang:
当归 半夏 党参 黄芪 枸杞子 白术 杜仲 山药 大腹皮 厚朴 僵蚕 白芷 桑寄生 鸡内金 紫苏叶 鲜龙葵果
0.486397 0.331453 0.406474 0.499834 0.345809 0.323213 0.318261 0.333327
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 牛膝 厚朴

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
145. 
patient tongue id: 04131815291922_6_2
label yaofang:
甘草 独活 党参 白术 生地黄 天麻 桑寄生 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.809868 0.395859 0.42713 0.303756 0.49476
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
146. 
patient tongue id: 04282318301211_7_1_6
label yaofang:
甘草 白芍 茯苓 党参 枸杞子 白术 生地黄 杜仲 山茱萸 菟丝子 补骨脂 女贞子 续断
0.967818 0.444386 0.561377 0.395766 0.309523 0.495938 0.388381 0.424989 0.306258
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
147. 
patient tongue id: 01250654172977_2_1
label yaofang:
甘草 黄芩 桔梗 芦根 远志 酸枣仁 浙贝母 郁金 天麻 鳖甲 蜈蚣 白花蛇舌 蜂房 四季青
0.908687 0.327184 0.427009 0.515362 0.366064 0.361038
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
148. 
patient tongue id: 05111913083848_5
label yaofang:
甘草 薏苡仁 蒲公英 麦冬 枸杞子 黄连 厚朴 生半夏 补骨脂 莪术 麦芽 北沙参 苇根 蛤壳 粉葛 蜈蚣 蛇舌草 冬凌草
0.433691 0.326861 0.302026 0.440425 0.462381 0.320432
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.111111, error: 0.666667
149. 
patient tongue id: 05140649284527_1_5
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 薏苡仁 鱼腥草 党参 浙贝母 天麻 鳖甲 款冬花 苦杏仁 紫苏子 炙麻黄 蜈蚣 白花蛇舌 天山雪莲
0.989218 0.3101 0.486725 0.593198 0.365111 0.320019 0.576044 0.50982 0.475599 0.416999 0.409632 0.382246
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.444444, error: 0.333333
150. 
patient tongue id: 05272349588036_1_2_5
label yaofang:
茯苓 黄芪 白术 延胡索 海螵蛸 浙贝母 山药 砂仁 三七 补骨脂 枇杷叶 北沙参 紫苏梗
0.411337 0.313183 0.495041 0.539292 0.32097 0.387906
predicted yaofang:
甘草 党参 黄芪 白术 海螵蛸 厚朴

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
151. 
patient tongue id: 04131904345463_1_4
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 百部 紫苏梗 广藿香
0.480768 0.812446 0.988242 0.618725 0.818213 0.527612 0.433747 0.927403 0.954611 0.925774 0.950349 0.979777 0.53402 0.694211 0.563889 0.690557
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.562500, recall: 0.750000, error: 0.437500
152. 
patient tongue id: 04151221485307_1_2_4
label yaofang:
桂枝 白芍 法半夏 茯苓 前胡 麦冬 太子参 细辛 干姜 紫菀 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.377479 0.372231 0.373236 0.306351 0.374321 0.31666 0.321341 0.39024 0.380457 0.359287 0.524773
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 黄芪 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
153. 
patient tongue id: 04101940126145_1_4_2
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 麦冬 玉竹 太子参 郁金 北柴胡 款冬花 紫菀 芡实 北沙参 人参叶
0.451179 0.697015 0.951169 0.543844 0.728453 0.493368 0.323335 0.315607 0.428069 0.842061 0.879267 0.84867 0.882128 0.322105 0.933066 0.497792 0.627212 0.517102 0.615856
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.315789, recall: 0.400000, error: 0.684211
154. 
patient tongue id: 03012247157400_6_2_4
label yaofang:
甘草 黄芩 桔梗 芦根 薏苡仁 党参 浙贝母 郁金 天麻 鳖甲 诃子 板蓝根 蜈蚣 白花蛇舌 天山雪莲
0.992925 0.312195 0.488872 0.626283 0.376342 0.309168 0.354718 0.647249 0.586271 0.548912 0.493414 0.500323 0.47519
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
155. 
patient tongue id: 04112158211623_5
label yaofang:
甘草 前胡 桔梗 金银花 浙贝母 荆芥穗 天麻 鳖甲 款冬花 白前 蜈蚣 白花蛇舌 天山雪莲 半枝莲 贯众
0.956151 0.438139 0.599831 0.339096 0.343981 0.337752 0.617847 0.39896 0.388771 0.319813 0.30674
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
156. 
patient tongue id: 02181958375831_6_5_7
label yaofang:
甘草 龙骨 独活 白术 丹参 黄连 红花 延胡索 细辛 僵蚕 桑寄生 秦艽 补骨脂 麦芽 牛大力 千斤拔
0.96112 0.31546 0.454615 0.561823 0.382647 0.307084 0.502515 0.424883 0.429918 0.335597 0.349074 0.339774
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.125000, error: 0.833333
157. 
patient tongue id: 02202246296718_1_6_2
label yaofang:
甘草 白芍 枸杞子 酸枣仁 生地黄 山茱萸 菊花 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 木贼
0.935506 0.438326 0.571685 0.440016 0.331325 0.504663 0.437362 0.474769 0.341829 0.36846 0.36832
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
158. 
patient tongue id: 01140806328188_5_6
label yaofang:
甘草 川芎 茯苓 党参 白术 丹参 赤芍 杜仲 牛膝 天麻 蔓荆子 桑寄生 地龙 蒺藜
0.990103 0.464217 0.634082 0.385741 0.311604 0.353817 0.661778 0.585062 0.582155 0.472981 0.509339 0.530617
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
159. 
patient tongue id: 04111844323899_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.447147 0.687253 0.938504 0.538037 0.70486 0.313712 0.493784 0.333289 0.322589 0.433886 0.819057 0.861442 0.829157 0.860965 0.336857 0.921898 0.478822 0.60607 0.530532 0.613378
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
160. 
patient tongue id: 03012323333606_7_6
label yaofang:
桂枝 甘草 白芍 茯苓 薏苡仁 党参 红花 赤芍 知母 地黄 忍冬藤 桑枝 牛大力 千斤拔
0.989696 0.317901 0.470959 0.629276 0.380607 0.301742 0.340856 0.642257 0.573181 0.548152 0.466125 0.489605 0.489796
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
161. 
patient tongue id: 06071937388774_2_5_6
label yaofang:
桂枝 甘草 川芎 茯苓 桃仁 党参 生地黄 牡丹皮 天麻 磁石 桑寄生 麦芽 女贞子 墨旱莲
0.971018 0.305059 0.46587 0.573532 0.369599 0.316569 0.534096 0.431135 0.417212 0.339962 0.349488 0.327843
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
162. 
patient tongue id: 03041119063783_4_1
label yaofang:
陈皮 法半夏 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.417622 0.646824 0.310022 0.891265 0.489323 0.637495 0.328854 0.422286 0.305721 0.345085 0.745675 0.793954 0.773112 0.798004 0.361549 0.877291 0.403546 0.543875 0.516079 0.578991
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
163. 
patient tongue id: 05310759345798_1_4_7
label yaofang:
白芍 当归 茯苓 木香 党参 黄芪 丹参 熟附子 山药 高良姜 鸡内金 草豆蔻 麦芽
0.310538 0.372776 0.324673
predicted yaofang:
甘草 党参 炙甘草

------Score: precision: 0.333333, recall: 0.076923, error: 0.666667
164. 
patient tongue id: 06082042297182_5
label yaofang:
甘草 连翘 薏苡仁 蒲公英 黄连 赤芍 浙贝母 牡丹皮 水蛭 僵蚕 莪术 北沙参 忍冬藤 蜂房 猫爪草 姜黄 山慈菇 冬凌草
0.504882 0.352214 0.338403 0.313036 0.450282 0.454661 0.31453 0.354549
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.250000, recall: 0.111111, error: 0.750000
165. 
patient tongue id: 06082001004237_1_7
label yaofang:
白芍 桃仁 麦冬 黄芪 丹参 红花 延胡索 牛膝 三七 珍珠母 北沙参 浮小麦 威灵仙 宽筋藤 黑老虎 制草乌
0.369413 0.34311 0.316816 0.328732 0.462493
predicted yaofang:
甘草 茯苓 半夏 黄芪 炙甘草

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
166. 
patient tongue id: 01112024451603_1
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.441388 0.686496 0.930301 0.544865 0.69604 0.319565 0.492813 0.331724 0.339172 0.42887 0.805506 0.85276 0.804574 0.838746 0.320939 0.912245 0.489683 0.606899 0.493237 0.595461
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
167. 
patient tongue id: 01201953419882_1
label yaofang:
甘草 川芎 茯苓 酸枣仁 生地黄 牡丹皮 牛膝 山药 山茱萸 天麻 益母草 女贞子 浮小麦 墨旱莲
0.991185 0.471477 0.613956 0.384201 0.335968 0.607062 0.531557 0.512375 0.423935 0.437745 0.420029
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
168. 
patient tongue id: 01122224439561_1_2_7
label yaofang:
甘草 川芎 党参 酸枣仁 杜仲 山药 山茱萸 天麻 肉苁蓉 桑寄生 补骨脂 地龙 续断 首乌藤
0.984807 0.449812 0.61363 0.409386 0.353055 0.612884 0.528709 0.542604 0.401392 0.444016 0.450399
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
169. 
patient tongue id: 06031053412668_1_7_6
label yaofang:
甘草 白芍 当归 薏苡仁 党参 黄芪 山药 天麻 鳖甲 补骨脂 莪术 皂角刺 建曲 蜈蚣 白花蛇舌 龙葵果
0.962201 0.322444 0.474554 0.544598 0.363143 0.466641 0.412217 0.40097 0.33681 0.328369 0.301319
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
170. 
patient tongue id: 05191920567686_1_2
label yaofang:
甘草 川芎 茯苓 太子参 浙贝母 郁金 山药 天麻 鳖甲 女贞子 沙苑子 蜈蚣 白花蛇舌 天山雪莲 墨旱莲
0.993311 0.497807 0.624788 0.361585 0.318208 0.300214 0.356818 0.657334 0.598458 0.555944 0.506921 0.509538 0.488212
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.533333, error: 0.384615
171. 
patient tongue id: 04141304546821_4
label yaofang:
法半夏 前胡 桔梗 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.45645 0.751272 0.964912 0.579826 0.746834 0.309033 0.505819 0.319991 0.413147 0.863908 0.906909 0.873888 0.896585 0.32019 0.957396 0.492521 0.644164 0.565393 0.658211
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 0.937500, error: 0.210526
172. 
patient tongue id: 06052015342367_2
label yaofang:
甘草 芦根 麦冬 玉竹 生地黄 知母 桑叶 天花粉 北沙参 白扁豆 布渣叶
0.597991 0.312531 0.340987 0.444936 0.40553
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
173. 
patient tongue id: 03040844543696_5
label yaofang:
甘草 白芍 川芎 金银花 何首乌 酸枣仁 玄参 黄连 生地黄 红花 火麻仁 白鲜皮 浮小麦 百合
0.971621 0.302098 0.465138 0.562951 0.372157 0.30148 0.503033 0.431717 0.427645 0.339637 0.344496 0.309544
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
174. 
patient tongue id: 03282238173263_2_6
label yaofang:
党参 白术 枳实 附子 干姜 桑寄生 火麻仁 炙甘草 紫苏叶
0.312374 0.325721 0.43575 0.323552 0.347367 0.345269 0.315649 0.455793 0.592138
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.444444, error: 0.555556
175. 
patient tongue id: 04201438535233_1_4_7
label yaofang:
甘草 麦冬 太子参 枸杞子 丹参 玄参 生地黄 牡丹皮 知母 山药 天花粉 北沙参
0.467957 0.386558 0.45756 0.417242 0.472709 0.394952 0.427002 0.351071 0.425306 0.381103 0.471574 0.380161 0.419677 0.451005 0.414112
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.133333, recall: 0.166667, error: 0.866667
176. 
patient tongue id: 03101921374709_1_4
label yaofang:
当归 太子参 黄芪 鸡血藤 白术 海螵蛸 浙贝母 山药 砂仁 补骨脂 女贞子 山慈菇 蛇舌草 稻芽
0.316016 0.331329 0.369807 0.402372 0.406238 0.370885
predicted yaofang:
甘草 茯苓 半夏 黄芪 北沙参 炙甘草

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
177. 
patient tongue id: 01040654075894_5_6
label yaofang:
甘草 法半夏 茯苓 薏苡仁 茜草 天麻 鳖甲 款冬花 紫菀 百部 苦杏仁 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.941239 0.307223 0.440279 0.556054 0.365561 0.470906 0.333799 0.333208
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.333333, error: 0.375000
178. 
patient tongue id: 04282037541702_5
label yaofang:
陈皮 黄芩 黄连 赤芍 黄柏 郁金 白茅根 枇杷叶 夏枯草 北沙参 白扁豆 东风桔 咸竹蜂
0.575108 0.318779 0.426363 0.493376 0.405114 0.336815
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
179. 
patient tongue id: 03290656123143_3_4
label yaofang:
甘草 川芎 薏苡仁 党参 黄芪 白术 熟附子 赤芍 山药 干姜 白芷 菟丝子 蔓荆子 鳖甲 蒺藜 土鳖虫
0.975916 0.471736 0.567623 0.369618 0.309746 0.510719 0.412255 0.419882 0.320684 0.325145 0.302133
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
180. 
patient tongue id: 06190149568031_1_2
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 丹参 山药 天麻 菟丝子 益母草 鳖甲 蜈蚣 天山雪莲 半枝莲 红豆杉
0.989049 0.303344 0.477743 0.618784 0.381909 0.304183 0.351531 0.627755 0.563358 0.53073 0.465363 0.480692 0.469521
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.733333, error: 0.153846
181. 
patient tongue id: 03221944325654_1_4
label yaofang:
甘草 白芍 茯苓 生地黄 杜仲 山药 山茱萸 车前子 天麻 桑寄生 猪苓 茺蔚子 泽兰
0.900245 0.415111 0.515641 0.44075 0.357489 0.365147
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
182. 
patient tongue id: 06072239555962_4
label yaofang:
甘草 柴胡 白芍 枳壳 黄芩 丹参 苍术 山药 车前子 菟丝子 益母草 补骨脂 女贞子
0.939226 0.316728 0.437884 0.580095 0.397672 0.323624 0.536967 0.47327 0.490294 0.372249 0.412024 0.448609
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
183. 
patient tongue id: 04272306317116_9
label yaofang:
麻黄 前胡 半夏 防风 细辛 白芷 白前 百部 紫苏子 炙甘草 辛夷 紫苏梗 广藿香 苍耳子
0.438275 0.708783 0.9529 0.548483 0.724443 0.481263 0.301435 0.30574 0.408959 0.844704 0.880314 0.851387 0.881289 0.332643 0.93538 0.473237 0.612454 0.522413 0.623661
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.642857, error: 0.526316
184. 
patient tongue id: 03151940332754_5_7
label yaofang:
桃仁 太子参 黄芪 白术 浙贝母 杜仲 白茅根 生半夏 砂仁 土鳖虫 合欢皮 山慈菇 蛇舌草 鲜龙葵果
0.454203 0.333918 0.362027 0.34551 0.409787
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
185. 
patient tongue id: 05131456329234_1_2
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 赤芍 天麻 鳖甲 补骨脂 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.995964 0.487615 0.65283 0.377985 0.325817 0.300351 0.366214 0.705177 0.63934 0.61023 0.532171 0.55434 0.546343
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
186. 
patient tongue id: 05251937575866_1_2
label yaofang:
甘草 柴胡 枳壳 黄芩 枸杞子 杜仲 郁金 厚朴 莪术 麦芽 北沙参 蜈蚣 合欢皮 预知子
0.733939 0.322053 0.399024 0.514871 0.635695 0.314448 0.393013 0.330333
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
187. 
patient tongue id: 02190530393201_2_6
label yaofang:
甘草 茯苓 荆芥 金银花 牡丹皮 山药 山茱萸 地黄 天麻 白花蛇舌草 白鲜皮 蜈蚣 半枝莲 醋鳖甲
0.984625 0.464178 0.620029 0.373373 0.322639 0.348927 0.644424 0.566002 0.540231 0.4568 0.487827 0.4961
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
188. 
patient tongue id: 05092059497731_4
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 连翘 鱼腥草 浙贝母 桑白皮 款冬花 紫菀 苦杏仁 紫苏梗
0.982061 0.301618 0.465622 0.616974 0.382357 0.316795 0.344184 0.630323 0.54134 0.522911 0.437052 0.464471 0.461915
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.142857, error: 0.846154
189. 
patient tongue id: 02182015027796_1_6
label yaofang:
甘草 柴胡 白芍 当归 茯苓 党参 鸡血藤 白术 酸枣仁 黄连 乌梅 补骨脂 麸炒枳壳
0.938123 0.445259 0.524121 0.373612 0.398089 0.314236
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
190. 
patient tongue id: 05042016057503_7_4_6
label yaofang:
甘草 龙骨 牡蛎 党参 赤芍 莪术 北沙参 女贞子 首乌藤 木蝴蝶 合欢皮 墨旱莲
0.545455 0.330462 0.457605 0.383894 0.338495 0.307781 0.313709
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
191. 
patient tongue id: 04182001138946_2_5
label yaofang:
甘草 陈皮 法半夏 茯苓 桔梗 芦根 牛蒡子 浙贝母 苍术 厚朴 鳖甲 板蓝根 忍冬藤 白花蛇舌 天山雪莲 岗梅根
0.885351 0.323505 0.415961 0.514112 0.36782 0.378674
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
192. 
patient tongue id: 02202219177280_6_4
label yaofang:
甘草 法半夏 党参 酸枣仁 竹茹 浙贝母 郁金 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.989046 0.300026 0.478706 0.597763 0.35815 0.318952 0.587575 0.510992 0.486469 0.411371 0.417835 0.400184
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
193. 
patient tongue id: 03180154085892_6
label yaofang:
柴胡 大枣 茯苓 防风 连翘 太子参 昆布 海藻 乌梅 石斛 白花蛇舌草 猫爪草 山慈菇
0.31982 0.348763
predicted yaofang:
党参 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
194. 
patient tongue id: 04120519530407_1_2_6
label yaofang:
甘草 白芍 大枣 茯苓 薏苡仁 党参 郁金 山药 天麻 鳖甲 虎杖 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.974804 0.323817 0.476462 0.556212 0.350448 0.502308 0.426898 0.410838 0.348258 0.341071 0.312587
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
195. 
patient tongue id: 06111039383433_4_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 昆布 海藻 浙贝母 牡丹皮 郁金 山药 莪术 夏枯草 白花蛇舌 黄药子
0.995921 0.484436 0.652956 0.366023 0.319918 0.365478 0.70328 0.608738 0.576059 0.489782 0.516041 0.497733
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
196. 
patient tongue id: 06031532032162_1_2
label yaofang:
法半夏 前胡 桔梗 防风 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 炒紫苏子 蜜麻黄 麸炒白术
0.476036 0.778994 0.978349 0.595221 0.781626 0.523418 0.307053 0.309067 0.442784 0.896005 0.93085 0.897794 0.922962 0.323917 0.968056 0.528664 0.670605 0.56126 0.668606
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.812500, error: 0.315789
197. 
patient tongue id: 04072024072540_1_4_7
label yaofang:
陈皮 茯苓 黄芪 白术 熟地黄 牡丹皮 郁金 山药 山茱萸 砂仁 鸡内金 北沙参 益智
0.528612 0.345305 0.394144 0.382085 0.532716 0.564137 0.328192 0.452525 0.349626 0.331291 0.357302
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
198. 
patient tongue id: 04151218075798_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.400627 0.573022 0.317348 0.822499 0.461557 0.597611 0.31434 0.405301 0.321535 0.354542 0.671464 0.726904 0.705835 0.731287 0.319211 0.827231 0.387279 0.515412 0.460896 0.531597
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
199. 
patient tongue id: 04222240029844_2_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.442257 0.667303 0.93069 0.515577 0.690091 0.302227 0.460411 0.318232 0.301456 0.401103 0.812712 0.84828 0.816976 0.857768 0.340736 0.906303 0.461093 0.591065 0.511209 0.593665
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
200. 
patient tongue id: 01182120071674_6_4
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 丹参 浙贝母 郁金 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲
0.991261 0.468208 0.617971 0.383893 0.340137 0.62192 0.545489 0.52824 0.430346 0.453523 0.429747
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
201. 
patient tongue id: 04141855449311_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 薄荷 荆芥穗 款冬花 紫菀 百部 炙甘草 紫苏梗 蜜麻黄
0.424429 0.639512 0.313565 0.888536 0.48995 0.640024 0.332651 0.418635 0.306971 0.35327 0.743759 0.790548 0.775708 0.803542 0.379037 0.873017 0.411124 0.541293 0.533835 0.585724
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.769231, error: 0.500000
202. 
patient tongue id: 02142147380561_2_1_4
label yaofang:
甘草 白芍 川芎 枸杞子 白术 杜仲 牛膝 菊花 天麻 蔓荆子 桑寄生 麦芽 地龙 蒺藜 粉葛
0.987691 0.315224 0.464139 0.604911 0.350579 0.312605 0.612639 0.527057 0.530162 0.421106 0.443854 0.458826
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
203. 
patient tongue id: 01122347198413_6_4
label yaofang:
甘草 柴胡 白芍 香附 枳壳 法半夏 茯苓 党参 丹参 郁金 山药 薤白 降香 川加皮
0.996086 0.488598 0.649407 0.380138 0.30181 0.364385 0.690969 0.635738 0.605292 0.522388 0.546113 0.536923
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
204. 
patient tongue id: 02191640433472_4_6_7
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 桃仁 远志 浙贝母 薤白 瓜蒌皮 款冬花 紫菀 白前 降香 骨碎补
0.691386 0.395287 0.421424
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.666667, recall: 0.133333, error: 0.333333
205. 
patient tongue id: 01091940447099_1_4
label yaofang:
甘草 枳壳 茯苓 薏苡仁 远志 党参 白术 郁金 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.953853 0.448954 0.542616 0.445813 0.323983 0.409971 0.383102 0.447934
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 1.000000, recall: 0.500000, error: 0.000000
206. 
patient tongue id: 03091907518402_4_1
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 丹参 生地黄 天麻 鳖甲 莪术 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991535 0.459897 0.664345 0.406718 0.35187 0.381137 0.715804 0.671306 0.683742 0.54928 0.611888 0.670243
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.687500, error: 0.083333
207. 
patient tongue id: 02202304283951_7
label yaofang:
甘草 柴胡 茯苓 桃仁 党参 延胡索 赤芍 牡丹皮 川楝子 杜仲 乌药 菟丝子 五灵脂 吴茱萸
0.977934 0.316484 0.461743 0.573803 0.386132 0.312089 0.528965 0.476429 0.470971 0.385563 0.390742 0.373301
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
208. 
patient tongue id: 04052125326499_6
label yaofang:
陈皮 枳壳 党参 延胡索 川楝子 乌药 佛手 紫苏梗
0.483884 0.367121 0.364894
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
209. 
patient tongue id: 03231111289022_5_6
label yaofang:
甘草 黄芩 法半夏 金银花 牛蒡子 薏苡仁 荆芥穗 天麻 鳖甲 苦杏仁 蜈蚣 天山雪莲 半枝莲 红豆杉 贯众
0.522775 0.477149 0.400034 0.345967 0.307216
predicted yaofang:
甘草 党参 黄芪 白术 丹参

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
210. 
patient tongue id: 02161931499928_6_2
label yaofang:
甘草 白术 柏子仁 枳实 肉桂 大黄 附片
0.437418 0.387349 0.32213 0.408582 0.345569 0.302307 0.416412
predicted yaofang:
甘草 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.285714, error: 0.714286
211. 
patient tongue id: 02212111194915_4_1
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.418327 0.580736 0.35961 0.802155 0.458111 0.579034 0.344015 0.418981 0.325755 0.311756 0.363164 0.658274 0.691481 0.682832 0.710861 0.377326 0.78015 0.409343 0.501138 0.481898 0.528372
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 1.000000, error: 0.285714
212. 
patient tongue id: 05022127203511_6_4
label yaofang:
甘草 川芎 党参 生地黄 杜仲 牛膝 细辛 天麻 全蝎 桑寄生 鳖甲 续断 天山雪莲 半枝莲
0.689668 0.39956 0.403676 0.339434
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
213. 
patient tongue id: 06190210439274_2_1
label yaofang:
甘草 茯苓 桔梗 太子参 鸡血藤 白术 浙贝母 白茅根 地黄 补骨脂 白花蛇舌草 醋鳖甲 岗梅
0.943959 0.334881 0.42847 0.516506 0.358351 0.404554 0.303836
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
214. 
patient tongue id: 06022234091124_1_4_7
label yaofang:
甘草 陈皮 茯苓 半夏 党参 白术 海螵蛸 杜仲 厚朴 僵蚕 桑寄生 鸡内金 苦杏仁 紫苏子 紫苏叶 三七粉
0.537771 0.328854 0.300524 0.383755 0.513019 0.568955 0.430433 0.329557
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.750000, recall: 0.375000, error: 0.250000
215. 
patient tongue id: 05172109374413_2_6
label yaofang:
甘草 茯苓 太子参 白术 酸枣仁 红花 山药 山茱萸 天麻 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.998397 0.496549 0.678991 0.369172 0.329473 0.302051 0.377237 0.750213 0.685777 0.652721 0.569917 0.59488 0.586372
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.571429, error: 0.384615
216. 
patient tongue id: 05042129390042_6_4
label yaofang:
白芍 当归 木香 党参 白术 酸枣仁 肉桂 肉苁蓉 诃子 炙甘草
0.586497 0.355497 0.403596 0.383717
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
217. 
patient tongue id: 06080138238120_4_6
label yaofang:
甘草 川芎 法半夏 茯苓 龙骨 远志 党参 鸡血藤 酸枣仁 龙眼肉 丹参 知母 浮小麦 合欢花
0.793238 0.340091 0.566237 0.309169 0.5381
predicted yaofang:
甘草 茯苓 党参 丹参 天麻

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
218. 
patient tongue id: 02212030556008_2_5
label yaofang:
甘草 白芍 川芎 桔梗 浙贝母 牛膝 天花粉 夏枯草 白花蛇舌草 浮小麦 蜂房 醋鳖甲 骨碎补 南杏仁
0.979388 0.454021 0.579407 0.407783 0.32892 0.547755 0.481864 0.492213 0.383142 0.396105 0.384433
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
219. 
patient tongue id: 05042056275507_4
label yaofang:
甘草 防风 丹参 生地黄 牡丹皮 乌梅 紫草 莪术 珍珠母 白鲜皮 紫苏叶 土茯苓 徐长卿
0.354714 0.350674 0.471513 0.350013 0.304658 0.302973 0.504301 0.542366
predicted yaofang:
甘草 柴胡 白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
220. 
patient tongue id: 01250650350883_5
label yaofang:
甘草 川芎 茯苓 桔梗 荆芥 防风 金银花 浙贝母 桑白皮 款冬花 苦杏仁 辛夷 炒苍耳子 贯众
0.993432 0.317556 0.485383 0.611003 0.351989 0.318948 0.610461 0.542816 0.511682 0.44328 0.442964 0.420502
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
221. 
patient tongue id: 06191332022646_2
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 牡丹皮 杜仲 山药 山茱萸 鳖甲 金樱子 桑螵蛸 锁阳 益智 合欢花
0.993993 0.489564 0.630784 0.362611 0.3124 0.353849 0.664199 0.586346 0.544953 0.486944 0.497473 0.471546
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
222. 
patient tongue id: 06041110499392_2_4
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.404197 0.561895 0.341346 0.805734 0.448723 0.58498 0.340632 0.402308 0.328335 0.303083 0.36719 0.647405 0.700594 0.686881 0.718958 0.38251 0.797518 0.409956 0.50294 0.495273 0.535797
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 1.000000, error: 0.285714
223. 
patient tongue id: 02202242230635_5
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 牛蒡子 浙贝母 桑白皮 莱菔子 款冬花 枇杷叶 苦杏仁 紫苏子
0.944021 0.315383 0.463113 0.527381 0.391873 0.30219 0.421474 0.363914 0.383884
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.222222, recall: 0.142857, error: 0.777778
224. 
patient tongue id: 03141922419578_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 薄荷 荆芥穗 紫菀 百部 紫苏梗 广藿香
0.466307 0.749108 0.96994 0.572476 0.755153 0.518819 0.321437 0.324251 0.452242 0.880987 0.916046 0.877187 0.910714 0.31013 0.953574 0.524595 0.649689 0.532873 0.653899
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.421053, recall: 0.666667, error: 0.578947
225. 
patient tongue id: 06181859076194_6_1
label yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 山药 菟丝子 益母草 鳖甲 虎杖 建曲 黄精 川加皮 土鳖虫 鹿衔草
0.631699 0.358457 0.434104 0.38977
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.250000, error: 0.000000
226. 
patient tongue id: 03161414543342_1_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.440119 0.688231 0.315629 0.907943 0.521835 0.658408 0.333536 0.438942 0.30404 0.368375 0.777086 0.812348 0.783974 0.809435 0.353927 0.877132 0.431434 0.559449 0.513378 0.586297
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.875000, error: 0.300000
227. 
patient tongue id: 04252005127007_1_6
label yaofang:
甘草 白芍 川芎 羌活 独活 牛膝 细辛 车前子 干姜 仙茅 蜈蚣 姜黄 海桐皮 鹿衔草
0.374624 0.493948 0.356985 0.340423 0.333985 0.322182 0.37856 0.307094 0.59879 0.587875
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
228. 
patient tongue id: 04071943149083_5
label yaofang:
柴胡 香附 陈皮 半夏 薏苡仁 玄参 枳实 莱菔子 火麻仁 茵陈 扁豆花 鸡内金 虎杖 珍珠母
0.534876 0.348666 0.469697 0.301198 0.343793 0.314533 0.367006
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
229. 
patient tongue id: 06171333445688_1_4
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.405494 0.382951 0.34407 0.356852 0.477362
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
230. 
patient tongue id: 04071911519201_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.390744 0.519444 0.349843 0.733949 0.416985 0.542717 0.344402 0.350001 0.304579 0.305119 0.58906 0.625702 0.652497 0.678017 0.403554 0.739417 0.345829 0.457394 0.504914 0.513814
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
231. 
patient tongue id: 02272223316068_6_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 青蒿 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.344265 0.398418 0.36858 0.364147 0.338361 0.358241 0.448925
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
232. 
patient tongue id: 06051116119107_1_2
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.480091 0.413178 0.452895 0.500548 0.447342 0.462561 0.407714 0.495484 0.509676 0.532975 0.436185 0.478743 0.498788 0.485515
predicted yaofang:
甘草 桃仁 党参 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.285714, recall: 0.333333, error: 0.714286
233. 
patient tongue id: 01190647240629_6_4_2
label yaofang:
甘草 白芍 陈皮 葛根 木香 羌活 苍术 厚朴 砂仁 天麻 豆蔻 紫苏梗 广藿香 蜈蚣 半枝莲 醋鳖甲
0.987513 0.320248 0.473904 0.59023 0.370134 0.306806 0.559531 0.494859 0.469241 0.402618 0.400352 0.37126
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
234. 
patient tongue id: 01061618022755_5_6
label yaofang:
甘草 枳壳 法半夏 当归 茯苓 连翘 远志 党参 白术 黄连 胆南星 莱菔子 白芷 麦芽
0.980205 0.456461 0.606533 0.363704 0.325647 0.596811 0.464499 0.462821 0.343342 0.378318 0.37774
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
235. 
patient tongue id: 05042018320795_1_4_7
label yaofang:
甘草 牡蛎 黄芪 白术 赤芍 浙贝母 郁金 芡实 鸡内金 北沙参 紫苏梗 土鳖虫 红豆杉 山慈菇 蛇舌草
0.421475 0.37344 0.602179 0.553014 0.362214 0.486306 0.325586 0.379352 0.313305
predicted yaofang:
甘草 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 合欢皮

------Score: precision: 0.444444, recall: 0.266667, error: 0.555556
236. 
patient tongue id: 03171447453456_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄
0.436444 0.685147 0.938794 0.534553 0.706024 0.312399 0.484074 0.330539 0.305911 0.403681 0.811738 0.861292 0.829005 0.856167 0.323874 0.928552 0.472574 0.612752 0.538602 0.611333
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
237. 
patient tongue id: 01061619043480_1_2_4
label yaofang:
甘草 法半夏 茯苓 薏苡仁 黄芪 白术 熟附子 天麻 鳖甲 败酱草 蜈蚣 半枝莲 红豆杉
0.985345 0.473616 0.608629 0.378912 0.343054 0.606857 0.523806 0.506132 0.415052 0.437801 0.426285
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.538462, error: 0.363636
238. 
patient tongue id: 03152039295956_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.486869 0.34746 0.455747 0.34728 0.429237 0.352321 0.399528 0.384787 0.383656 0.395396 0.364335 0.353351 0.374437 0.335085
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.214286, recall: 0.230769, error: 0.785714
239. 
patient tongue id: 05262057517765_4_6
label yaofang:
甘草 黄芩 法半夏 前胡 五味子 细辛 桑白皮 干姜 款冬花 川贝母 白前 苦杏仁 紫苏子 炙麻黄
0.816118 0.367788 0.363971 0.500407 0.370436 0.323699
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.071429, error: 0.833333
240. 
patient tongue id: 02020818582951_2_7_6
label yaofang:
甘草 茯苓 龙骨 牡蛎 桃仁 酸枣仁 杜仲 黄柏 知母 钩藤 桑寄生 淫羊藿 仙茅 浮小麦 谷精草
0.959214 0.31769 0.446845 0.56529 0.365609 0.495949 0.391497 0.403887 0.314316 0.318406
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.133333, error: 0.800000
241. 
patient tongue id: 01042346471467_1_7
label yaofang:
桂枝 甘草 川芎 法半夏 党参 黄芪 丹参 红花 薤白 水蛭 莪术 地龙 麸炒枳壳
0.974964 0.445414 0.586907 0.397161 0.329994 0.574656 0.478977 0.506073 0.374301 0.404784 0.41416
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
242. 
patient tongue id: 06190521032351_1_4
label yaofang:
甘草 柴胡 当归 薏苡仁 党参 黄芪 丹参 熟地黄 牡丹皮 川楝子 败酱草 皂角刺 女贞子 广升麻
0.98122 0.311246 0.469627 0.61434 0.395995 0.347398 0.596729 0.548041 0.523265 0.44763 0.467253 0.461612
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
243. 
patient tongue id: 04062219418873_1_2_4
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子
0.458073 0.306084 0.303854 0.457821 0.32341 0.37566 0.305223 0.355867 0.325018 0.351616 0.311393 0.336306
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻

------Score: precision: 0.166667, recall: 0.181818, error: 0.833333
244. 
patient tongue id: 01132133136618_1_6_7
label yaofang:
甘草 龙骨 远志 党参 何首乌 酸枣仁 生地黄 栀子 牡丹皮 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.971432 0.453675 0.569172 0.381497 0.30686 0.521474 0.451266 0.464513 0.354163 0.374162 0.380584
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
245. 
patient tongue id: 03090806214320_1_4
label yaofang:
甘草 薏苡仁 党参 鸡血藤 牡丹皮 山药 天麻 鳖甲 扁豆花 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.964493 0.438948 0.595708 0.401367 0.303335 0.344718 0.58314 0.513419 0.522329 0.400805 0.44348 0.470528
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
246. 
patient tongue id: 05262051059841_1_6
label yaofang:
甘草 黄芩 法半夏 前胡 桔梗 浙贝母 细辛 桑白皮 天麻 鳖甲 款冬花 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.994218 0.471673 0.655668 0.386402 0.341688 0.302766 0.369463 0.703737 0.634299 0.613713 0.522022 0.552176 0.564533
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.437500, error: 0.461538
247. 
patient tongue id: 04150552024120_1_2_6
label yaofang:
甘草 当归 党参 黄芪 鸡血藤 丹参 生地黄 砂仁 天麻 鳖甲 补骨脂 紫苏梗 蜈蚣 天山雪莲 半枝莲
0.878392 0.387916 0.530095 0.381983 0.357666
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
248. 
patient tongue id: 05191959444025_2_6
label yaofang:
甘草 香附 茯苓 桔梗 远志 党参 酸枣仁 浙贝母 知母 桑白皮 瓜蒌皮 枇杷叶 苦杏仁 合欢花
0.988537 0.303201 0.480101 0.616419 0.381219 0.304143 0.349547 0.624176 0.550146 0.518595 0.450635 0.464316 0.443004
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
249. 
patient tongue id: 06130809082072_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.367409 0.57288 0.400992 0.421087 0.666052 0.562724 0.587556 0.601861 0.633426 0.620415 0.742051 0.445567 0.677986 0.720394 0.707523
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
250. 
patient tongue id: 01090030437084_1_3_6
label yaofang:
桂枝 白芍 川芎 当归 麦冬 党参 阿胶 牡丹皮 吴茱萸 姜半夏 炙甘草
0.400372 0.403194 0.347454 0.327283 0.321635 0.496395
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.666667, recall: 0.363636, error: 0.333333
251. 
patient tongue id: 03151923165052_4_6
label yaofang:
甘草 茯苓 薏苡仁 白术 海螵蛸 山药 砂仁 姜半夏
0.544004 0.377261 0.306248 0.425067 0.401433
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.375000, error: 0.400000
252. 
patient tongue id: 06012133591797_6_4_7
label yaofang:
桂枝 甘草 茯苓 羌活 鸡血藤 白术 红花 赤芍 牡丹皮 天麻 僵蚕 粉葛 蜈蚣
0.985154 0.475744 0.602384 0.386874 0.34585 0.595903 0.529206 0.503733 0.430899 0.441797 0.415906
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
253. 
patient tongue id: 04020804118017_6_4
label yaofang:
甘草 柴胡 白芍 陈皮 白术 山药 车前子 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.909792 0.302929 0.42106 0.501289 0.361657 0.348376
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
254. 
patient tongue id: 03151923561595_4_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.875595 0.425626 0.499929 0.301648 0.414755
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
255. 
patient tongue id: 06190750555727_2_5
label yaofang:
甘草 前胡 桔梗 牛蒡子 浙贝母 天麻 瓜蒌皮 枇杷叶 白花蛇舌草 苦杏仁 蜈蚣 半枝莲 醋鳖甲 大青叶
0.997055 0.469141 0.697807 0.405835 0.387232 0.327962 0.401216 0.778112 0.714974 0.718478 0.599642 0.648076 0.697259
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
256. 
patient tongue id: 06052025526771_5
label yaofang:
甘草 金银花 连翘 芦根 蒲公英 小蓟 荷叶 野菊花 香薷 百合 四季青 车前草
0.385415 0.491708 0.359686 0.698952 0.410941 0.521872 0.332347 0.356455 0.306942 0.567754 0.588647 0.618091 0.644627 0.386783 0.706413 0.345337 0.448204 0.431029 0.467255
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
257. 
patient tongue id: 02151909348614_4
label yaofang:
陈皮 法半夏 前胡 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.456254 0.685631 0.950341 0.530011 0.713814 0.483559 0.330067 0.301584 0.44917 0.854176 0.885992 0.845064 0.892188 0.924636 0.502037 0.628423 0.501365 0.618873
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.555556, recall: 0.833333, error: 0.444444
258. 
patient tongue id: 04150840560973
label yaofang:
桂枝 葛根 桃仁 延胡索 杜仲 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.48132 0.405168 0.451083 0.451651 0.5124 0.392276 0.42053 0.389121 0.440626 0.391701 0.507829 0.372606 0.440584 0.493422 0.4543
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.066667, recall: 0.083333, error: 0.933333
259. 
patient tongue id: 04241859190325_1_4
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.392911 0.534503 0.366751 0.310077 0.306976 0.36208 0.329802 0.360762 0.629148 0.681037
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.357143, error: 0.500000
260. 
patient tongue id: 02161857328336_4
label yaofang:
法半夏 前胡 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.488832 0.831777 0.989314 0.61833 0.813356 0.545134 0.428166 0.930107 0.955938 0.928186 0.949415 0.31514 0.981956 0.538904 0.704509 0.57532 0.69591
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.928571, error: 0.235294
261. 
patient tongue id: 06072124090365_4_1
label yaofang:
甘草 枳壳 连翘 党参 白术 酸枣仁 山药 莱菔子 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989094 0.45635 0.655687 0.400736 0.346685 0.377416 0.700676 0.646225 0.65834 0.520894 0.585765 0.634812
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
262. 
patient tongue id: 02241408255759_1_4
label yaofang:
桂枝 白芍 大枣 当归 黄芪 细辛 通草 水蛭 炙甘草
0.451981 0.305052 0.428925 0.390702 0.330031 0.304598 0.438555
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.222222, error: 0.714286
263. 
patient tongue id: 02221240487142_1_2
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.522702 0.338999 0.432714 0.41577 0.333575
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
264. 
patient tongue id: 02190456571456_5_6
label yaofang:
甘草 柴胡 川芎 黄芩 桔梗 金银花 白术 浙贝母 白芷 皂角刺 辛夷 苍耳子 蜂房
0.973928 0.304145 0.455675 0.577868 0.389271 0.30559 0.500997 0.428889 0.436444 0.331541 0.340823 0.333934
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
265. 
patient tongue id: 02190534212581_1_7_2
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 砂仁 天麻 鳖甲 莪术 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.985335 0.452556 0.633191 0.358963 0.334308 0.343357 0.677095 0.545464 0.517669 0.422961 0.466086 0.475137
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.733333, error: 0.083333
266. 
patient tongue id: 06132026186905_1_4_6
label yaofang:
甘草 陈皮 半夏 黄芪 白术 海螵蛸 杜仲 牛膝 山药 厚朴 僵蚕 桑寄生 鸡内金 紫苏梗 蜈蚣 红豆杉
0.461423 0.332336 0.345289 0.322516 0.495612 0.486454 0.352005 0.33216
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.625000, recall: 0.312500, error: 0.375000
267. 
patient tongue id: 03221305244162_1_2
label yaofang:
甘草 党参 浙贝母 山药 天麻 鳖甲 扁豆花 白扁豆 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.819184 0.394678 0.37011 0.46645 0.330657
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
268. 
patient tongue id: 04131847561813_4_7
label yaofang:
甘草 川芎 茯苓 半夏 薏苡仁 黄芪 白术 浙贝母 杜仲 泽泻 僵蚕 白芷 蝉蜕 辛夷 紫苏叶 猫爪草 冬凌草
0.500215 0.318283 0.414498 0.323628 0.300355 0.338951
predicted yaofang:
甘草 法半夏 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.500000, recall: 0.176471, error: 0.500000
269. 
patient tongue id: 03301357578344_4
label yaofang:
甘草 陈皮 法半夏 葛根 前胡 桔梗 麦冬 玉竹 山药 款冬花 紫菀 北沙参 人参叶
0.402042 0.560931 0.315848 0.835156 0.444563 0.591552 0.307166 0.403378 0.308468 0.361926 0.686189 0.729296 0.719089 0.759176 0.359699 0.832131 0.386896 0.509497 0.455634 0.532781
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.538462, error: 0.650000
270. 
patient tongue id: 06181704221521_2_1
label yaofang:
甘草 半夏 黄芪 枸杞子 黄连 牡丹皮 杜仲 僵蚕 莪术 柿蒂 枇杷叶 北沙参 赭石 紫苏叶 合欢皮 蛇舌草
0.750349 0.363712 0.428072 0.373975 0.528207 0.30371
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.333333, recall: 0.125000, error: 0.666667
271. 
patient tongue id: 04071240154242_2_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.354105 0.444017 0.381128 0.538681 0.364071 0.438036 0.323778 0.303417 0.426752 0.449001 0.481916 0.50354 0.389464 0.591994 0.365044 0.342203 0.360959
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.705882, recall: 0.857143, error: 0.294118
272. 
patient tongue id: 06111044584201_7_2
label yaofang:
甘草 芦根 桃仁 远志 酸枣仁 生地黄 浙贝母 天麻 鳖甲 紫菀 蜈蚣 白花蛇舌 天山雪莲 半枝莲 土鳖虫
0.987489 0.479001 0.620099 0.370373 0.311025 0.356073 0.629144 0.529367 0.500341 0.424163 0.443695 0.420888
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.533333, error: 0.333333
273. 
patient tongue id: 05201511329088_5
label yaofang:
甘草 茯苓 前胡 桔梗 金银花 浙贝母 天麻 鳖甲 诃子 苦杏仁 蜈蚣 木蝴蝶 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.994116 0.481029 0.637953 0.358471 0.321015 0.354885 0.682427 0.602857 0.564461 0.494697 0.511515 0.495331
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
274. 
patient tongue id: 03061813160290_2_5
label yaofang:
甘草 桔梗 荆芥 金银花 玄参 浙贝母 地黄 天麻 白花蛇舌草 麦芽 白鲜皮 蜈蚣 蜂房 岗梅根 醋鳖甲
0.995203 0.491434 0.637166 0.365968 0.31132 0.350484 0.680776 0.624034 0.602469 0.521946 0.53984 0.54216
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
275. 
patient tongue id: 02212002549775_1_6
label yaofang:
甘草 茯苓 党参 黄芪 白术 山药 干姜 砂仁 天麻 鳖甲 豆蔻 白扁豆 蜈蚣 天山雪莲 半枝莲
0.905598 0.429779 0.524325 0.403856 0.414579 0.303335 0.353977
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 1.000000, recall: 0.466667, error: 0.000000
276. 
patient tongue id: 06190134137826_6
label yaofang:
甘草 柴胡 白芍 茯苓 酸枣仁 竹茹 郁金 灯心草 厚朴 浮小麦 首乌藤 合欢花 麸炒枳壳
0.871548 0.422112 0.511516 0.401175 0.37585
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
277. 
patient tongue id: 04112217493264_2_6
label yaofang:
甘草 龙骨 党参 白术 生地黄 黄柏 山药 山茱萸 地骨皮 糯稻根 银柴胡 胡黄连 淫羊藿 首乌藤 龟甲
0.975599 0.462989 0.57321 0.378355 0.325671 0.535599 0.438932 0.437533 0.343867 0.355172 0.337504
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
278. 
patient tongue id: 02211854096249_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.340564 0.458344 0.332101 0.31465 0.377131 0.406883 0.306399 0.508858 0.559475 0.301627
predicted yaofang:
柴胡 白芍 枳壳 党参 白术 海螵蛸 浙贝母 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
279. 
patient tongue id: 02182318365359_1_2_6
label yaofang:
甘草 茯苓 党参 白术 生地黄 山药 青蒿 天麻 地骨皮 鳖甲 浮小麦 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.964975 0.310095 0.456739 0.547724 0.374326 0.469615 0.383617 0.388032
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.875000, recall: 0.437500, error: 0.125000
280. 
patient tongue id: 03012139128664_6_1
label yaofang:
甘草 茯苓 远志 党参 白术 山药 砂仁 天麻 赤石脂 鳖甲 建曲 蜈蚣 天山雪莲 半枝莲
0.970047 0.31783 0.465492 0.599596 0.391576 0.30422 0.343737 0.569303 0.503138 0.467572 0.409767 0.419003 0.395218
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
281. 
patient tongue id: 03040910180364_2_7_6
label yaofang:
甘草 茯苓 连翘 薏苡仁 桃仁 党参 郁金 山药 砂仁 鳖甲 莪术 麦芽 紫苏梗 白花蛇舌
0.958781 0.312846 0.450941 0.569593 0.374123 0.300892 0.503855 0.412204 0.405775 0.320233 0.330603 0.320177
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
282. 
patient tongue id: 02202245359230_1_4_6
label yaofang:
甘草 前胡 黄连 浙贝母 细辛 厚朴 砂仁 鳖甲 白前 枇杷叶 粉葛 紫苏梗 蜈蚣 白花蛇舌 天山雪莲
0.941009 0.440556 0.542357 0.386426 0.445316 0.309882 0.348847
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
283. 
patient tongue id: 04252320339922_2_4
label yaofang:
甘草 芦根 生地黄 浙贝母 郁金 天麻 鳖甲 蝉蜕 紫苏梗 威灵仙 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.96657 0.306855 0.45506 0.573275 0.380528 0.307915 0.519879 0.420778 0.41375 0.326207 0.33686 0.315303
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
284. 
patient tongue id: 02182310202535_1_6
label yaofang:
甘草 独活 生地黄 延胡索 赤芍 细辛 天麻 桑寄生 鳖甲 补骨脂 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989479 0.45956 0.62275 0.404747 0.343332 0.627603 0.566677 0.566688 0.451985 0.47998 0.480012
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
285. 
patient tongue id: 04301138541182_5_6
label yaofang:
甘草 川芎 羌活 党参 白术 酸枣仁 杜仲 牛膝 钩藤 菊花 天麻 白芷 桑寄生 麦芽 谷精子
0.977311 0.461391 0.598176 0.389638 0.343369 0.579486 0.49689 0.49053 0.391752 0.414518 0.407352
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
286. 
patient tongue id: 02161936191444_1_4
label yaofang:
麻黄 桂枝 白芍 川芎 当归 黄芪 鸡血藤 红花 嫩桑枝 威灵仙 蜈蚣 土鳖虫 姜黄
0.328092 0.341328 0.478127 0.307651 0.367973 0.313447 0.320543 0.513776 0.544919
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.111111, recall: 0.076923, error: 0.888889
287. 
patient tongue id: 05260624039219_1_7
label yaofang:
甘草 柴胡 党参 丹参 生地黄 延胡索 赤芍 青皮 天麻 鳖甲 王不留行 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97844 0.457584 0.590051 0.392323 0.324294 0.540231 0.460297 0.452413 0.359001 0.368869 0.368895
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
288. 
patient tongue id: 03312032190490_2_5
label yaofang:
甘草 川芎 黄芩 桔梗 麦冬 太子参 浙贝母 天花粉 鳖甲 广藿香 苍耳子 白花蛇舌 蜂房 四季青
0.952529 0.42957 0.597304 0.434067 0.340339 0.536058 0.469049 0.481204 0.351472 0.390751 0.391785
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
289. 
patient tongue id: 06072116185055_4
label yaofang:
甘草 陈皮 薏苡仁 远志 党参 白术 牛膝 苍术 厚朴 佩兰 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.940403 0.446599 0.564935 0.366004 0.306249 0.319241 0.534312 0.367625 0.388064
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.666667, recall: 0.375000, error: 0.333333
290. 
patient tongue id: 03111527124442_1_6
label yaofang:
甘草 枳壳 茯苓 酸枣仁 丹参 山药 山茱萸 薤白 砂仁 瓜蒌皮 补骨脂 首乌藤 降香 合欢花
0.890419 0.317728 0.432885 0.554902 0.413449 0.302173 0.443893 0.382142 0.395782 0.310758
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
291. 
patient tongue id: 03111433583975_7_6
label yaofang:
甘草 白芍 当归 桃仁 党参 鸡血藤 白术 生地黄 熟附子 红花 延胡索 赤芍 全蝎 制川乌 麦芽 忍冬藤 络石藤
0.977695 0.323798 0.459226 0.580443 0.377621 0.305263 0.528462 0.462454 0.444954 0.370139 0.373206 0.360831
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.235294, error: 0.666667
292. 
patient tongue id: 03090840391203_6_1_2
label yaofang:
甘草 大枣 当归 茯苓 木香 远志 太子参 黄芪 白术 酸枣仁 地黄 砂仁 浮小麦 合欢花
0.97948 0.30379 0.461462 0.591383 0.371353 0.323057 0.566244 0.492237 0.50335 0.389193 0.41196 0.429546
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
293. 
patient tongue id: 02161927452714_5
label yaofang:
橘红 荆芥 防风 桑叶 菊花 桑白皮 白芷 鸡内金 枇杷叶 辛夷 紫苏叶 苍耳子
0.629247 0.371928 0.395493 0.4173 0.495783 0.329326
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
294. 
patient tongue id: 04130629414181_6_2
label yaofang:
甘草 木香 党参 白术 玄参 厚朴 砂仁 天麻 肉苁蓉 鳖甲 火麻仁 麦芽 蜈蚣 天山雪莲 半枝莲
0.771903 0.400663 0.467207 0.300173 0.438401
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
295. 
patient tongue id: 01141832049702_1_5_6
label yaofang:
甘草 茯苓 党参 白术 生地黄 牡丹皮 杜仲 山药 山茱萸 白茅根 茜草 女贞子 续断 广金钱草
0.960835 0.441093 0.5555 0.407722 0.31355 0.485514 0.405588 0.467617 0.305055 0.332796 0.351288
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
296. 
patient tongue id: 03231024504978_1_6
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 杜仲 山药 天麻 桑寄生 白扁豆 续断 蜈蚣 半枝莲 醋鳖甲
0.919908 0.316759 0.447695 0.559559 0.429281 0.330639 0.463982 0.432823 0.442542 0.344399 0.357584 0.350765
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
297. 
patient tongue id: 02211903260256_1
label yaofang:
大枣 茯苓 薏苡仁 党参 白术 海螵蛸 山药 石斛 白扁豆 炙甘草
0.378323 0.489377 0.335053 0.303213 0.377729 0.577223 0.684379
predicted yaofang:
柴胡 白芍 香附 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.200000, error: 0.714286
298. 
patient tongue id: 02191630582725_6
label yaofang:
甘草 茯苓 桃仁 麦冬 党参 赤芍 牡丹皮 山药 鳖甲 茵陈 虎杖 麦芽 黄精 土鳖虫
0.528292 0.366786 0.348696 0.380426 0.369249 0.365911
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
299. 
patient tongue id: 02212012276430_1_7
label yaofang:
甘草 大枣 黄芪 鸡血藤 酸枣仁 生地黄 杜仲 山药 山茱萸 天麻 桑寄生 补骨脂 地龙 浮小麦 灯盏细辛
0.996475 0.479187 0.662984 0.386786 0.337249 0.301344 0.376746 0.727223 0.662571 0.646005 0.550711 0.580401 0.589845
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
300. 
patient tongue id: 01211300052209_7
label yaofang:
甘草 白芍 胆南星 钩藤 僵蚕 地龙 蝉蜕 嫩桑枝 丝瓜络 豨莶草 宽筋藤 海风藤 徐长卿 三七粉
0.409693 0.321986 0.349259 0.479486 0.663521
predicted yaofang:
白芍 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
301. 
patient tongue id: 03101902205051_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 乌药 豆蔻 姜半夏 炙甘草 紫苏梗
0.396467 0.395191 0.309307
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
302. 
patient tongue id: 05271854469478_2
label yaofang:
甘草 白芍 香附 丹参 五味子 栀子 钩藤 厚朴 天麻 菟丝子 金樱子 蒺藜 合欢皮
0.648574 0.351924 0.435618 0.410728
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
303. 
patient tongue id: 05161925032456_1_5
label yaofang:
甘草 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 麸炒苍术 炒僵蚕
0.409041 0.565404 0.336319 0.834188 0.46415 0.607183 0.31707 0.435162 0.336929 0.317172 0.387301 0.690544 0.734209 0.721653 0.752967 0.349192 0.826392 0.424082 0.52426 0.469821 0.539737
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.095238, recall: 0.142857, error: 0.904762
304. 
patient tongue id: 01090020278958_1
label yaofang:
桂枝 白芍 大枣 茯苓 白术 附子 大黄 天麻 天山雪莲
0.404502 0.302574 0.357774 0.3739 0.35225
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.222222, error: 0.600000
305. 
patient tongue id: 02020849336048_2_7
label yaofang:
甘草 薏苡仁 党参 酸枣仁 熟附子 赤芍 山药 天麻 赤石脂 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 合欢花 半枝莲
0.98051 0.461714 0.597409 0.365203 0.324921 0.588709 0.467798 0.453653 0.363282 0.38315 0.371984
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
306. 
patient tongue id: 03141838487453_4
label yaofang:
陈皮 法半夏 茯苓 党参 黄芪 海螵蛸 肉桂 干姜 砂仁 炙甘草 广藿香 麸炒白术 麸炒苍术 甘松
0.432231 0.318223 0.428727 0.400847 0.508094 0.338579 0.37738 0.400807 0.357959 0.353581 0.385868 0.338938 0.469274 0.304173
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香

------Score: precision: 0.357143, recall: 0.357143, error: 0.642857
307. 
patient tongue id: 03291902183138_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.398763 0.609212 0.337429 0.839863 0.464323 0.589515 0.335685 0.381464 0.314587 0.6982 0.726081 0.717221 0.744116 0.370009 0.79433 0.3729 0.5018 0.483748 0.535563
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.785714, error: 0.421053
308. 
patient tongue id: 03101846119948_4_1
label yaofang:
玉竹 丹参 海螵蛸 浙贝母 川牛膝 土茯苓 山慈菇 粉萆薢
0.331921 0.378156 0.496155 0.327829 0.331095 0.302349 0.332594 0.560512 0.606736
predicted yaofang:
甘草 柴胡 白芍 香附 党参 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.111111, recall: 0.125000, error: 0.888889
309. 
patient tongue id: 01250630558797_1_4
label yaofang:
甘草 陈皮 薏苡仁 党参 山药 砂仁 天麻 鳖甲 茵陈 莪术 白扁豆 紫苏梗 广藿香 蜈蚣 天山雪莲 半枝莲
0.759663 0.332552 0.373369 0.466617 0.359065
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
310. 
patient tongue id: 04131902036042_1_4_7
label yaofang:
麦冬 生地黄 牡丹皮 郁金 白茅根 大腹皮 猪苓 柿蒂 北沙参 赭石 玉米须 预知子 半边莲
0.341243 0.304526 0.361903 0.410116 0.402081 0.432135 0.416884
predicted yaofang:
甘草 陈皮 茯苓 半夏 黄芪 北沙参 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
311. 
patient tongue id: 06171159505866_1_4
label yaofang:
法半夏 前胡 防风 麦冬 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.425513 0.610339 0.328522 0.878005 0.481432 0.632952 0.311506 0.440311 0.330453 0.314874 0.404834 0.74465 0.781319 0.753496 0.793204 0.346306 0.853277 0.444118 0.54524 0.482455 0.560334
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 0.937500, error: 0.285714
312. 
patient tongue id: 06111047385908_2_4
label yaofang:
甘草 川芎 桃仁 党参 杜仲 黄柏 肉桂 山药 菟丝子 益智仁 益母草 桑螵蛸 麦芽 醋香附 合欢花
0.992233 0.303742 0.483929 0.625107 0.374535 0.312607 0.34598 0.648787 0.569477 0.53601 0.467817 0.481214 0.465432
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.200000, error: 0.769231
313. 
patient tongue id: 06022217022998_1_4_7
label yaofang:
陈皮 当归 龙骨 黄芪 枸杞子 白术 杜仲 牛膝 山药 车前子 厚朴 麦芽 桑椹 紫苏叶 预知子
0.520922 0.356196 0.417668 0.438902 0.330173
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
314. 
patient tongue id: 03311656017417_1_6
label yaofang:
桃仁 党参 枸杞子 白术 熟地黄 杜仲 牛膝 砂仁 菟丝子 巴戟天 桑寄生 续断 制何首乌 艾叶
0.457482 0.30059 0.420354
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.333333, recall: 0.071429, error: 0.666667
315. 
patient tongue id: 01211203028841_7_4
label yaofang:
桂枝 柴胡 黄芩 牡蛎 干姜 天花粉 升麻 炙甘草
0.770629 0.318417 0.374614 0.454231 0.338276
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
316. 
patient tongue id: 04071432258249_3_4
label yaofang:
陈皮 法半夏 茯苓 党参 黄芪 海螵蛸 砂仁 炙甘草 广藿香 麸炒白术 麸炒苍术 甘松
0.440621 0.651143 0.908562 0.50338 0.663156 0.326258 0.466918 0.339891 0.308667 0.397209 0.774934 0.821174 0.796981 0.828812 0.357485 0.891942 0.452458 0.573111 0.531749 0.597885
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.333333, error: 0.800000
317. 
patient tongue id: 03151848008043_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.321559 0.364465 0.477932 0.337367 0.308569 0.353469 0.320386 0.339577 0.311363 0.540778 0.566463
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
318. 
patient tongue id: 02281931253064_4
label yaofang:
大枣 党参 海藻 苍术 泽泻 荷叶 决明子 紫苏叶 焦山楂 芥子
0.413718 0.33091 0.434951 0.372313 0.342553 0.380508 0.459394
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.142857, recall: 0.100000, error: 0.857143
319. 
patient tongue id: 06082011522058_1_4
label yaofang:
甘草 茯苓 半夏 薏苡仁 黄芪 白术 浙贝母 牡丹皮 杜仲 石菖蒲 泽泻 僵蚕 莪术 蝉蜕 赭石 辛夷 紫苏叶 猫爪草 冬凌草
0.578236 0.347082 0.378733 0.408656 0.489094 0.308041
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.210526, error: 0.333333
320. 
patient tongue id: 05221914346645_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 黄芪 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 麸炒白术
0.417298 0.600058 0.304788 0.891644 0.493742 0.66139 0.457016 0.329739 0.332153 0.411568 0.766894 0.79831 0.77893 0.823888 0.314848 0.864899 0.478419 0.576294 0.461555 0.573414
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
321. 
patient tongue id: 04272311010970_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.462846 0.355068 0.489217 0.416997 0.362665 0.314593 0.416681 0.437428
predicted yaofang:
甘草 柴胡 白芍 党参 白术 浙贝母 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.500000, error: 0.375000
322. 
patient tongue id: 03141630584108_1_3_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.433173 0.321864 0.451403 0.421139 0.338762 0.394029 0.372507 0.422727 0.367072 0.374872 0.313388 0.337926 0.314165
predicted yaofang:
甘草 桃仁 党参 丹参 红花 牛膝 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.846154, recall: 0.916667, error: 0.153846
323. 
patient tongue id: 05220907253136_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.416616 0.315084 0.372868 0.365488
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
324. 
patient tongue id: 02212011270440_2
label yaofang:
甘草 白芍 当归 白术 栀子 牡丹皮 牛膝 山药 山茱萸 地黄 天麻 肉苁蓉 火麻仁 珍珠母 浮小麦 制何首乌
0.964826 0.453724 0.537259 0.37302 0.435063 0.341568 0.368007
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.187500, error: 0.571429
325. 
patient tongue id: 01132141507251_6_1
label yaofang:
甘草 党参 白术 酸枣仁 丹参 大腹皮 砂仁 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.981995 0.437365 0.614032 0.445847 0.305885 0.354992 0.609766 0.541781 0.587633 0.418934 0.471251 0.505492
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
326. 
patient tongue id: 06121758067022_1
label yaofang:
甘草 川芎 当归 龙骨 牡蛎 桃仁 党参 黄芪 酸枣仁 红花 泽泻 磁石 糯稻根 浮小麦
0.56783 0.358831 0.391271 0.322437 0.41873
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
327. 
patient tongue id: 05130635525900_2_1_4
label yaofang:
甘草 茯苓 防风 薏苡仁 党参 黄芪 白术 酸枣仁 五味子 郁金 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲
0.91486 0.30211 0.405278 0.522281 0.379605 0.374474
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.833333, recall: 0.312500, error: 0.166667
328. 
patient tongue id: 04071611410545_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.333242 0.305865 0.400058
predicted yaofang:
甘草 茯苓 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
329. 
patient tongue id: 06191331054339_1_4
label yaofang:
甘草 薏苡仁 党参 黄芪 赤芍 郁金 山茱萸 天麻 鳖甲 地龙 黄精 白花蛇舌 天山雪莲 红豆杉
0.977922 0.303432 0.462875 0.596848 0.397409 0.340079 0.58489 0.520235 0.508664 0.423322 0.444877 0.441337
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
330. 
patient tongue id: 05092058517993_7_6
label yaofang:
甘草 柴胡 白芍 川芎 枳壳 羌活 枸杞子 赤芍 牛膝 细辛 砂仁 天麻 白芷 决明子 麦芽 女贞子
0.672955 0.392372 0.446373 0.411027
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.062500, error: 0.750000
331. 
patient tongue id: 05221902373110_3
label yaofang:
枳壳 桔梗 荆芥 防风 羌活 牛蒡子 细辛 淡竹叶 款冬花 紫菀 苦杏仁 蝉蜕 紫苏叶
0.627883 0.342729 0.360089 0.44741 0.377822
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
332. 
patient tongue id: 01041317288799_6
label yaofang:
柴胡 白芍 当归 茯苓 薄荷 白术 栀子 淡豆豉 炙甘草 首乌藤
0.458619 0.33788 0.357666
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.333333, recall: 0.100000, error: 0.666667
333. 
patient tongue id: 03171158048943_1_2
label yaofang:
桂枝 葛根 桃仁 延胡索 杜仲 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.525211 0.461185 0.453795 0.364201 0.558332 0.484508 0.475135 0.451009 0.523396 0.482282 0.594808 0.472881 0.526904 0.555403 0.533266
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.066667, recall: 0.083333, error: 0.933333
334. 
patient tongue id: 01312115248826_6_1_2
label yaofang:
甘草 川芎 茯苓 党参 白术 酸枣仁 丹参 地黄 天麻 白花蛇舌草 麦芽 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.971626 0.458515 0.572201 0.377854 0.306644 0.506329 0.407635 0.398013 0.314852 0.317533
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.600000, recall: 0.400000, error: 0.400000
335. 
patient tongue id: 02190546131497_5_6
label yaofang:
甘草 鱼腥草 党参 生地黄 乌药 山药 白茅根 菟丝子 益母草 鳖甲 建曲 蜈蚣 半枝莲 广金钱草 红豆杉
0.990975 0.460769 0.602097 0.364846 0.34534 0.598914 0.497842 0.545687 0.384974 0.410901 0.40547
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
336. 
patient tongue id: 02190526587057_2_6
label yaofang:
甘草 川芎 法半夏 茯苓 羌活 牛膝 苍术 细辛 天麻 全蝎 白芷 蔓荆子 麦芽 蒿苯
0.978149 0.303836 0.464968 0.579879 0.371822 0.320465 0.542522 0.461668 0.460672 0.364821 0.375235 0.373733
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
337. 
patient tongue id: 04150809486316_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.312763 0.320374
predicted yaofang:
党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
338. 
patient tongue id: 03161848267142_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.381959 0.644287 0.301965 0.876193 0.470578 0.621504 0.313288 0.363197 0.706419 0.760409 0.757361 0.774928 0.339886 0.86721 0.355328 0.507919 0.508307 0.547647
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.722222, recall: 0.866667, error: 0.277778
339. 
patient tongue id: 02120826159409_5_6
label yaofang:
甘草 柴胡 白芍 枳壳 党参 白术 郁金 钩藤 大黄 厚朴 火麻仁 豆蔻 决明子 苦杏仁 谷精子
0.985195 0.460401 0.585974 0.400393 0.319112 0.513082 0.461105 0.468572 0.352282 0.361688 0.349469
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
340. 
patient tongue id: 04011953317462_2
label yaofang:
甘草 川芎 桔梗 荆芥 防风 芦根 牛蒡子 桑叶 菊花 紫苏叶 黑枣 木蝴蝶 四季青
0.555511 0.369355 0.398694 0.348122 0.435467
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
341. 
patient tongue id: 02251122563013_4
label yaofang:
陈皮 茯苓 防风 黄芪 荆芥穗 白芷 炙甘草 辛夷 紫苏梗 广藿香 麸炒白术
0.411043 0.624946 0.348634 0.843977 0.470656 0.603979 0.329596 0.420787 0.304057 0.348117 0.697655 0.72633 0.699947 0.730714 0.338401 0.794292 0.403149 0.511702 0.447794 0.515113
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.727273, error: 0.600000
342. 
patient tongue id: 02142152203344_6_1_2
label yaofang:
甘草 党参 白术 山药 天麻 鳖甲 扁豆花 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 木棉花
0.993025 0.325004 0.489227 0.639642 0.382674 0.367347 0.335556 0.376166 0.709792 0.6506 0.635512 0.560062 0.582146 0.603311
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.714286, recall: 0.714286, error: 0.285714
343. 
patient tongue id: 03192239366050_1_2_6
label yaofang:
甘草 茯苓 党参 酸枣仁 熟地黄 牡丹皮 黄柏 山药 山茱萸 泽泻 菟丝子 益智仁 桑螵蛸
0.995414 0.491407 0.641166 0.36542 0.318674 0.365222 0.694276 0.634739 0.608998 0.530767 0.550938 0.551992
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
344. 
patient tongue id: 04151213515221_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.449946 0.738804 0.953087 0.558927 0.719658 0.314393 0.466229 0.377766 0.837948 0.882465 0.850863 0.874613 0.338923 0.940578 0.456712 0.609327 0.55532 0.638572
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 0.875000, error: 0.222222
345. 
patient tongue id: 01211240516602_7_4
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 鸡血藤 牡丹皮 干姜 全蝎 天花粉 炙甘草 蜈蚣 土鳖虫 狗脊
0.326163 0.305448 0.317017 0.494998
predicted yaofang:
甘草 白芍 党参 炙甘草

------Score: precision: 0.500000, recall: 0.117647, error: 0.500000
346. 
patient tongue id: 02210450457672_5_1
label yaofang:
薏苡仁 黄芪 白术 浙贝母 厚朴 地榆 槐花 瓜蒌皮 鸡内金 北沙参 红豆杉 预知子 蛇舌草 稻芽
0.353742 0.340519 0.373132 0.40543 0.337182 0.349879 0.328778
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
347. 
patient tongue id: 02261922523541_2_5_6
label yaofang:
甘草 茯苓 远志 党参 枸杞子 栀子 牡丹皮 山药 山茱萸 泽泻 金樱子 王不留行 蛇床子 浮小麦 沙苑子
0.989278 0.461656 0.629415 0.375152 0.311398 0.341106 0.659747 0.552252 0.551027 0.431877 0.474686 0.474076
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
348. 
patient tongue id: 04061843117190_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.363135 0.30496 0.331416 0.384009 0.301074 0.316179 0.358042 0.391338 0.427892
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 防风 黄芪 北沙参 炙甘草

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
349. 
patient tongue id: 04222204329164_2_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.342053 0.355206 0.46498 0.404662 0.561568 0.372245 0.444969 0.308984 0.314744 0.454258 0.459542 0.442515 0.470985 0.351796 0.594211 0.379174 0.319407
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.705882, recall: 0.857143, error: 0.294118
350. 
patient tongue id: 03291624470070_1_2_6
label yaofang:
甘草 桔梗 薏苡仁 浙贝母 天麻 鳖甲 紫菀 百部 苦杏仁 炙麻黄 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.84848 0.366743 0.411837 0.459135 0.344259
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
351. 
patient tongue id: 02260709320621_5_1_6
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 桔梗 党参 浙贝母 细辛 砂仁 鳖甲 款冬花 苦杏仁 炙麻黄 白花蛇舌 四季青
0.991497 0.454715 0.65985 0.382395 0.363299 0.30539 0.377388 0.744924 0.655634 0.642717 0.52683 0.58788 0.616633
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.312500, error: 0.615385
352. 
patient tongue id: 03021135241660_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.40474 0.30538 0.378429 0.445372 0.302483
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
353. 
patient tongue id: 01052135261906_2_6
label yaofang:
甘草 党参 黄芪 黄连 生地黄 熟地黄 黄柏 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 龟甲
0.986655 0.451327 0.647008 0.369588 0.359592 0.369804 0.692765 0.511891 0.507451 0.373874 0.432218 0.453881
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
354. 
patient tongue id: 05241954463133_2_6
label yaofang:
甘草 党参 酸枣仁 生地黄 黄柏 山药 山茱萸 桑叶 荆芥穗 地骨皮 菟丝子 糯稻根 银柴胡 淫羊藿 女贞子 龟甲
0.987252 0.475963 0.603096 0.37408 0.341162 0.616724 0.541051 0.512784 0.442289 0.458246 0.44811
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
355. 
patient tongue id: 04272254599804_4_7
label yaofang:
黄芩 丹参 牛膝 钩藤 白茅根 车前子 厚朴 石决明 猪苓 姜半夏 广藿香
0.413473 0.550713 0.410153 0.337727 0.309124 0.371232 0.321608 0.34228 0.688514 0.668978
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.100000, recall: 0.090909, error: 0.900000
356. 
patient tongue id: 04112355407926_6
label yaofang:
甘草 柴胡 白芍 海藻 海螵蛸 枳实 乌梅 大腹皮 莪术 豆蔻 败酱草 姜半夏 土鳖虫 猫爪草 木贼 山慈菇
0.51494 0.314562 0.435301 0.308524 0.416953
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
357. 
patient tongue id: 02202314152655_1_7_2
label yaofang:
桂枝 当归 黄芪 鸡血藤 白术 海螵蛸 厚朴 砂仁 菟丝子 桑寄生 北沙参 蜈蚣 合欢皮
0.931984 0.417157 0.533611 0.453684 0.326192 0.410244 0.333478 0.42913
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
358. 
patient tongue id: 02150742467256_1_3
label yaofang:
法半夏 橘红 防风 金银花 薏苡仁 桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 藿香 莱菔子 天麻 白前 鸡内金 决明子 夏枯草 苦杏仁 六神曲 制何首乌 蜜百部 干鱼腥草
0.301117 0.306679 0.320653
predicted yaofang:
党参 黄芪 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
359. 
patient tongue id: 02272239202252_4_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 砂仁 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.415135 0.583257 0.422239 0.338986 0.3113 0.371942 0.316523 0.370419 0.714669 0.713059
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 海螵蛸 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.312500, error: 0.500000
360. 
patient tongue id: 03092256474879_6_7
label yaofang:
甘草 法半夏 茯苓 葛根 独活 桃仁 黄芪 鸡血藤 红花 延胡索 天麻 五灵脂 麦芽 地龙 威灵仙
0.991895 0.461499 0.665483 0.402591 0.328334 0.361919 0.685904 0.628569 0.645816 0.512886 0.556072 0.606533
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
361. 
patient tongue id: 03231437076546_4
label yaofang:
陈皮 法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.404061 0.606593 0.313435 0.87438 0.468321 0.633684 0.41809 0.304321 0.357439 0.737704 0.773804 0.763933 0.80018 0.320504 0.841542 0.410551 0.527286 0.485332 0.557902
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
362. 
patient tongue id: 03141542060287_1_3_7
label yaofang:
法半夏 橘红 防风 金银花 薏苡仁 荆芥穗 白前 鸡内金 紫苏梗 蜜百部 蜜枇杷叶 干鱼腥草
0.608492 0.319573 0.517774 0.354741 0.363841 0.339087 0.410784
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
363. 
patient tongue id: 04202217444247_1_6
label yaofang:
甘草 茯苓 木香 薏苡仁 远志 党参 白术 山药 天麻 鳖甲 扁豆花 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.988786 0.31026 0.463828 0.630526 0.374602 0.306515 0.337061 0.630996 0.547896 0.531133 0.437725 0.460717 0.475788
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.846154, recall: 0.687500, error: 0.153846
364. 
patient tongue id: 04102102317750_2_5
label yaofang:
甘草 桔梗 天冬 浙贝母 桑白皮 紫菀 百部 枇杷叶 苦杏仁 紫苏子
0.691454 0.33016 0.492608 0.451549 0.465461 0.301895
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.166667, recall: 0.100000, error: 0.833333
365. 
patient tongue id: 04102057362916_1_6
label yaofang:
龙骨 丹参 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 合欢皮
0.452883 0.302604 0.411019 0.422615 0.302676 0.304364 0.381147
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
366. 
patient tongue id: 04182153410414_2_7
label yaofang:
甘草 酸枣仁 生地黄 黄柏 山茱萸 天麻 糯稻根 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 龟甲
0.950771 0.439685 0.612322 0.364438 0.309926 0.340432 0.583855 0.414972 0.405599 0.336598 0.344253
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
367. 
patient tongue id: 03311616152078_1_4_7
label yaofang:
甘草 薏苡仁 太子参 黄芪 白术 海螵蛸 浙贝母 生半夏 砂仁 巴戟天 鸡内金 北沙参 蜈蚣 山慈菇 鲜龙葵果
0.301764 0.301014 0.320064 0.385155 0.313575 0.4155
predicted yaofang:
甘草 茯苓 半夏 黄芪 北沙参 炙甘草

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
368. 
patient tongue id: 04121844039717_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.435897 0.662781 0.93706 0.521544 0.701574 0.486376 0.323282 0.323912 0.43375 0.821874 0.860266 0.820818 0.867002 0.314471 0.910232 0.483442 0.606398 0.49124 0.599106
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 1.000000, error: 0.210526
369. 
patient tongue id: 06091950127204_3
label yaofang:
当归 枸杞子 熟地黄 杜仲 附子 肉桂 山药 山茱萸 菟丝子 巴戟天 芡实 鹿角霜 广藿香 沙苑子
0.512788 0.319628 0.351419 0.503004 0.537399 0.375538
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
370. 
patient tongue id: 05222124106125_2_1_7
label yaofang:
蒲公英 龙齿 太子参 黄芪 白术 延胡索 海螵蛸 郁金 砂仁 三七 桑寄生 鸡内金 北沙参 首乌藤
0.48607 0.302483 0.366661 0.358798 0.550719 0.58071 0.351281 0.459533 0.351094 0.328725 0.313996 0.311526
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
371. 
patient tongue id: 06012053018938_1_7
label yaofang:
甘草 枳壳 半夏 黄芪 牡丹皮 杜仲 牛膝 郁金 厚朴 僵蚕 莪术 蜈蚣
0.477655 0.558655 0.68173 0.733867 0.382286 0.39827 0.624587 0.450166 0.336043 0.425894 0.413671 0.429137 0.320734 0.390094
predicted yaofang:
甘草 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 鸡内金 北沙参 合欢皮 预知子 蛇舌草

------Score: precision: 0.428571, recall: 0.500000, error: 0.571429
372. 
patient tongue id: 03012032372955_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.33828 0.344946 0.445166
predicted yaofang:
甘草 茯苓 炙甘草

------Score: precision: 0.333333, recall: 0.071429, error: 0.666667
373. 
patient tongue id: 01041840522397_1_3
label yaofang:
法半夏 前胡 桔梗 防风 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.471966 0.760969 0.972864 0.577467 0.765503 0.522996 0.320067 0.314244 0.443538 0.881763 0.919163 0.879962 0.911573 0.319603 0.959001 0.532943 0.662339 0.548167 0.653512
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
374. 
patient tongue id: 06031123351548_2_6
label yaofang:
甘草 枸杞子 山茱萸 地黄 天麻 糯稻根 白花蛇舌草 浮小麦 首乌藤 醋龟甲 蜈蚣 半枝莲 醋鳖甲 酒女贞子
0.967967 0.320922 0.451182 0.59704 0.39689 0.322178 0.568097 0.477396 0.466803 0.376207 0.402384 0.396774
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
375. 
patient tongue id: 05162221261895_4
label yaofang:
麻黄 前胡 半夏 防风 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 苍耳子
0.460713 0.798242 0.991176 0.623321 0.846222 0.564358 0.304437 0.313184 0.491372 0.940133 0.963893 0.9361 0.96044 0.98202 0.597879 0.72221 0.524232 0.688319
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.611111, recall: 0.733333, error: 0.388889
376. 
patient tongue id: 03151919252520_1_2_5
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.468474 0.398961 0.453725 0.324375 0.488689 0.424249 0.435215 0.404174 0.471941 0.457645 0.51341 0.420406 0.46094 0.486384 0.474451
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
377. 
patient tongue id: 05201504259416_5_7_6
label yaofang:
甘草 蒲公英 党参 红花 浙贝母 郁金 厚朴 天麻 天花粉 瓜蒌皮 鳖甲 麦芽 蜈蚣 白花蛇舌 半枝莲 红豆杉 猫爪草
0.699115 0.392934 0.370217 0.461562 0.342838
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.117647, error: 0.600000
378. 
patient tongue id: 01312047227859_1_2
label yaofang:
甘草 茯苓 桔梗 薏苡仁 桃仁 鱼腥草 党参 浙贝母 杜仲 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.996211 0.460638 0.687903 0.393108 0.340531 0.385767 0.738032 0.65327 0.634048 0.500908 0.567912 0.572306
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.562500, error: 0.250000
379. 
patient tongue id: 02191227233340_4
label yaofang:
甘草 黄芩 前胡 桔梗 牛蒡子 桃仁 远志 浙贝母 桑白皮 蔓荆子 款冬花 苦杏仁 辛夷 贯众
0.972283 0.317929 0.446962 0.600597 0.37625 0.314517 0.587694 0.490164 0.507327 0.378982 0.420198 0.446399
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.083333, recall: 0.071429, error: 0.916667
380. 
patient tongue id: 03092002052317_4
label yaofang:
甘草 茯苓 葛根 麦冬 太子参 北沙参 百合 木贼 干石斛
0.435484 0.698884 0.946923 0.538732 0.709103 0.50373 0.331947 0.328373 0.448334 0.836087 0.880302 0.843569 0.875713 0.308628 0.930125 0.494361 0.617034 0.52408 0.631597
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.052632, recall: 0.111111, error: 0.947368
381. 
patient tongue id: 01031827288533_2
label yaofang:
茯苓 防风 薄荷 钩藤 荆芥穗 白芷 北柴胡 炙甘草 首乌藤 广藿香 威灵仙 香薰 炒蔓荆子 棉萆薢
0.412239 0.546732 0.341508 0.761354 0.462148 0.574962 0.349827 0.411543 0.352704 0.326941 0.369293 0.638528 0.673494 0.66743 0.701383 0.354091 0.754785 0.433078 0.509284 0.496374 0.545706
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.285714, recall: 0.428571, error: 0.714286
382. 
patient tongue id: 04272311526137_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 苦杏仁 姜半夏 炙甘草 龙脷叶
0.328836 0.312309 0.432264 0.31146 0.327892 0.419957 0.392635 0.317007 0.398824 0.500117
predicted yaofang:
甘草 柴胡 白芍 枳壳 党参 白术 海螵蛸 浙贝母 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.333333, error: 0.600000
383. 
patient tongue id: 01101804013477_1_4
label yaofang:
陈皮 法半夏 前胡 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.462258 0.709939 0.950758 0.537998 0.719849 0.304065 0.496066 0.331471 0.322728 0.42309 0.840348 0.880066 0.844374 0.879983 0.325726 0.926641 0.501786 0.617642 0.536337 0.621719
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
384. 
patient tongue id: 05241944573562_1_4
label yaofang:
甘草 茯苓 前胡 党参 黄芪 熟附子 细辛 天麻 鳖甲 白前 诃子 蜈蚣 天山雪莲 半枝莲
0.96949 0.311604 0.464629 0.562443 0.379616 0.318923 0.507925 0.44596 0.451563 0.361726 0.364101 0.342117
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
385. 
patient tongue id: 01090003183397_1_4
label yaofang:
桂枝 白芍 茯苓 薏苡仁 桃仁 牡丹皮
0.347523 0.380537 0.306738 0.460383 0.761313 0.348825
predicted yaofang:
细辛 干姜 白芷 紫菀 炙甘草 广藿香

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
386. 
patient tongue id: 04142221442064_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桃仁 党参 黄芪 白术 浙贝母 山药 桑白皮 地骨皮 紫菀 百部 丝瓜络
0.971752 0.300625 0.459723 0.574956 0.381648 0.307152 0.503988 0.425379 0.415937 0.329877 0.332226 0.318328
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
387. 
patient tongue id: 03291342120022_2
label yaofang:
甘草 茯苓 党参 生地黄 黄柏 知母 山药 山茱萸 地骨皮 糯稻根 秦艽 淫羊藿 龟甲
0.981532 0.461643 0.60749 0.387603 0.329848 0.595414 0.503696 0.487131 0.398813 0.420387 0.410635
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
388. 
patient tongue id: 06071946473887_5_7_3
label yaofang:
甘草 羌活 连翘 薏苡仁 蒲公英 党参 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 半枝莲 红豆杉 制天南星
0.937082 0.451368 0.537207 0.365553 0.300664 0.467553 0.381728 0.378884 0.302052 0.305598
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.600000, recall: 0.428571, error: 0.400000
389. 
patient tongue id: 02271852313817_4
label yaofang:
陈皮 法半夏 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 炒紫苏子 蜜麻黄
0.371278 0.446299 0.363075 0.639802 0.382062 0.317941 0.480894 0.313785 0.31611 0.509807 0.531488 0.559227 0.594812 0.394842 0.660752 0.335182 0.410657 0.366055 0.419011
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 半夏 防风 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
390. 
patient tongue id: 03222003292779_6_7
label yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 黄连 郁金 石菖蒲 桑螵蛸 益智 浮小麦 首乌藤 百合
0.980123 0.313128 0.470433 0.575596 0.372576 0.314324 0.543047 0.48059 0.465178 0.389758 0.394543 0.378404
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
391. 
patient tongue id: 04142225288206_6_1
label yaofang:
甘草 白芍 党参 酸枣仁 生地黄 天麻 鳖甲 佛手 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.961922 0.456951 0.563874 0.39953 0.323732 0.50775 0.425288 0.429981 0.331787 0.346429 0.329901
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
392. 
patient tongue id: 04260635535885_6_1
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 远志 党参 酸枣仁 黄连 桑螵蛸 益智 佛手 首乌藤
0.957776 0.460451 0.559738 0.389755 0.315302 0.477369 0.415114 0.409866 0.328393 0.331586 0.30779
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
393. 
patient tongue id: 05182054080989_6_4
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗 广金钱草
0.345878 0.360512 0.486552 0.300258 0.33552 0.300361 0.3043 0.334371 0.514496 0.593709
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 浙贝母 干姜 姜半夏 炙甘草

------Score: precision: 0.600000, recall: 0.500000, error: 0.400000
394. 
patient tongue id: 03232315273562_4_7
label yaofang:
甘草 茯苓 独活 党参 白术 山药 细辛 菟丝子 桑寄生 益母草 补骨脂 扁豆花 威灵仙
0.623491 0.398518 0.323231 0.427733 0.346461
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
395. 
patient tongue id: 04121908213877_4
label yaofang:
甘草 桃仁 党参 白术 玄参 海螵蛸 郁金 生半夏 莪术 枇杷叶 北沙参 辛夷 木蝴蝶 土鳖虫 猫爪草 冬凌草
0.453922 0.353109 0.322873 0.413357 0.313194 0.439118 0.337803 0.344554
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
396. 
patient tongue id: 02151923362184_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.492699 0.841917 0.993529 0.640977 0.850702 0.550686 0.453142 0.948785 0.969984 0.943976 0.965219 0.986864 0.583111 0.734343 0.578431 0.712825
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.857143, error: 0.250000
397. 
patient tongue id: 05182102403420_4
label yaofang:
陈皮 桔梗 牛蒡子 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 天山雪莲
0.381698 0.382779 0.364378 0.358146 0.324781 0.446073
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
398. 
patient tongue id: 04062136327627_1
label yaofang:
甘草 陈皮 茯苓 桔梗 白术 大腹皮 厚朴 藿香 白芷 麦芽 六神曲 紫苏叶
0.462098 0.3389 0.353093 0.458886 0.338638
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
399. 
patient tongue id: 01182059117737_6_5
label yaofang:
甘草 法半夏 茯苓 桔梗 桃仁 党参 赤芍 浙贝母 山药 鳖甲 虎杖 麦芽 土鳖虫
0.986584 0.46299 0.601093 0.38767 0.327172 0.573332 0.483006 0.475456 0.373336 0.390196 0.370515
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
400. 
patient tongue id: 04141245475060_4
label yaofang:
白芍 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄
0.376001 0.528393 0.312876 0.787927 0.446983 0.593414 0.310459 0.364399 0.321833 0.628228 0.671636 0.689614 0.713058 0.345823 0.781041 0.386464 0.492373 0.4753 0.513259
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
401. 
patient tongue id: 03231049194042_2_6
label yaofang:
甘草 薏苡仁 党参 酸枣仁 生地黄 杜仲 天麻 桑寄生 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 合欢花
0.966052 0.313977 0.454027 0.571462 0.373476 0.308387 0.529132 0.440144 0.437597 0.345575 0.361603 0.361851
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
402. 
patient tongue id: 01140816310922_1_2_6
label yaofang:
甘草 茯苓 龙骨 党参 酸枣仁 黄柏 牛膝 山药 山茱萸 地黄 青蒿 浮小麦 醋龟甲 合欢花
0.98638 0.447113 0.633261 0.393138 0.33998 0.35581 0.682384 0.562056 0.568451 0.44075 0.490959 0.513671
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
403. 
patient tongue id: 06111013056390_1_6
label yaofang:
甘草 党参 玄参 柏子仁 厚朴 天麻 鳖甲 火麻仁 苦杏仁 郁李仁 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 龟甲
0.99137 0.47752 0.630434 0.372575 0.308768 0.348915 0.657033 0.576405 0.54178 0.468667 0.490444 0.473252
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
404. 
patient tongue id: 01062343023572_1_4_7
label yaofang:
柴胡 黄芩 法半夏 桔梗 防风 金银花 薏苡仁 党参 鸡内金 紫苏梗 蜜百部 干鱼腥草
0.918381 0.420711 0.541289 0.32677 0.45918
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
405. 
patient tongue id: 03151941497802_4_7_6
label yaofang:
甘草 陈皮 茯苓 半夏 黄芪 白术 昆布 海藻 当归尾 珍珠母 威灵仙 蜈蚣 合欢皮
0.429524 0.329413 0.389845 0.480836 0.420329 0.30721 0.38779
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 北沙参

------Score: precision: 0.714286, recall: 0.384615, error: 0.285714
406. 
patient tongue id: 02170749540550_1_6
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子
0.355815 0.348132 0.330685 0.3386 0.339165
predicted yaofang:
甘草 茯苓 党参 黄芪 钩藤

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
407. 
patient tongue id: 04101915294867_4
label yaofang:
川芎 独活 党参 黄芪 细辛 防己 木瓜 豆蔻 川牛膝 炙甘草 续断 首乌藤 威灵仙 盐菟丝子
0.448188 0.668676 0.312889 0.910118 0.513639 0.660351 0.338015 0.455672 0.325533 0.30983 0.391585 0.772684 0.818605 0.787726 0.818982 0.373599 0.893908 0.443978 0.569139 0.53202 0.594464
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.095238, recall: 0.142857, error: 0.904762
408. 
patient tongue id: 02191635271463_6_5_7
label yaofang:
桂枝 甘草 柴胡 法半夏 茯苓 龙骨 牡蛎 党参 白术 酸枣仁 竹茹 牡丹皮 珍珠母 麦芽
0.929723 0.421188 0.523685 0.353868 0.415912
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
409. 
patient tongue id: 06031629434247_1_4
label yaofang:
法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.341341 0.354179 0.41354 0.398985 0.509517 0.351411 0.325502 0.420678 0.302192 0.317973 0.41459 0.389079 0.451613 0.472863 0.400416 0.535908 0.345837 0.324204
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 半夏 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.611111, recall: 0.733333, error: 0.388889
410. 
patient tongue id: 03240614548861_6_2
label yaofang:
茯苓 龙骨 党参 丹参 生地黄 山茱萸 天麻 鳖甲 火麻仁 炙甘草 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.990946 0.479349 0.624287 0.375812 0.311227 0.351342 0.653541 0.573955 0.542605 0.468895 0.491288 0.479553
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
411. 
patient tongue id: 03171358422777_4
label yaofang:
法半夏 茯苓 前胡 防风 钩藤 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 威灵仙 炒紫苏子 蜜麻黄
0.454834 0.674502 0.313626 0.922907 0.527374 0.678171 0.333092 0.491632 0.348022 0.341089 0.437423 0.798526 0.842162 0.805122 0.838394 0.358504 0.904997 0.488961 0.593348 0.528174 0.605983
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.875000, error: 0.333333
412. 
patient tongue id: 05191944211282_5_1_6
label yaofang:
甘草 茯苓 木香 薏苡仁 党参 黄连 山药 砂仁 天麻 鳖甲 鸡内金 麦芽 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲
0.962692 0.447704 0.580824 0.416883 0.329045 0.506534 0.458087 0.464622 0.358116 0.374977 0.357189
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.529412, error: 0.181818
413. 
patient tongue id: 05231925462449_1_2
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.417575 0.603796 0.327703 0.861801 0.483911 0.628281 0.31628 0.433266 0.323126 0.310313 0.392415 0.727234 0.759483 0.73972 0.774805 0.350985 0.843412 0.427985 0.546064 0.484669 0.561137
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 1.000000, error: 0.333333
414. 
patient tongue id: 01061557292574_1_4
label yaofang:
桂枝 甘草 白芍 黄芪 白术 赤芍 山药 山茱萸 车前子 菟丝子 益母草 猪苓 桑螵蛸 益智 泽兰 广升麻
0.975711 0.458247 0.577825 0.393304 0.324796 0.521126 0.450927 0.461334 0.347488 0.362436 0.361899
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
415. 
patient tongue id: 01182133515805_6_4
label yaofang:
甘草 香附 党参 丹参 生地黄 郁金 薤白 天麻 瓜蒌皮 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲
0.995556 0.489147 0.654824 0.394524 0.329706 0.39698 0.701359 0.661805 0.654522 0.550994 0.584789 0.594127
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
416. 
patient tongue id: 03171354538015_2
label yaofang:
白芍 茯苓 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 炙甘草 制远志 酒女贞子 煅龙骨 炒酸枣仁
0.463623 0.760672 0.976802 0.589712 0.77815 0.524984 0.319865 0.316853 0.448818 0.893434 0.927661 0.890889 0.918922 0.308126 0.963433 0.547468 0.672623 0.54429 0.665481
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.105263, recall: 0.142857, error: 0.894737
417. 
patient tongue id: 02151808350975_1_4_7
label yaofang:
桂枝 葛根 桃仁 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草 炒山楂
0.379631 0.330331 0.322421 0.323451
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
418. 
patient tongue id: 05232034462395_1_6
label yaofang:
甘草 枳壳 桔梗 半夏 薏苡仁 黄芪 白术 厚朴 淡豆豉 砂仁 僵蚕 莪术 麦芽 紫苏叶 蛇舌草
0.542515 0.308771 0.500788 0.313315 0.593261 0.685424 0.321236 0.356925 0.526012 0.407029 0.309413 0.336426 0.393343 0.34095 0.321286
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 鸡内金 北沙参 合欢皮 蛇舌草

------Score: precision: 0.533333, recall: 0.533333, error: 0.466667
419. 
patient tongue id: 02261213511690_1
label yaofang:
甘草 茯苓 党参 白术 丹参 山楂 砂仁 茵陈 虎杖 白花蛇舌草 麦芽 白扁豆 女贞子 天山雪莲
0.978073 0.300644 0.457838 0.592992 0.390329 0.315814 0.552546 0.488105 0.480445 0.388334 0.400609 0.402971
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
420. 
patient tongue id: 03081815010155_3
label yaofang:
黄芪 白术 附子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.419491 0.314054 0.423819 0.318502 0.338696
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.250000, error: 0.600000
421. 
patient tongue id: 05092010330173_4
label yaofang:
甘草 柴胡 白芍 当归 茯苓 白术 栀子 牡丹皮 牛膝 苏木 败酱草 车前草 墨旱莲 鹿衔草
0.541507 0.436455 0.477011 0.345023 0.519236 0.468858 0.472072 0.432172 0.494136 0.469492 0.559434 0.478785 0.508296 0.539583 0.502856
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.133333, recall: 0.142857, error: 0.866667
422. 
patient tongue id: 01052134176852_1_6
label yaofang:
甘草 白芍 香附 茯苓 党参 白术 酸枣仁 丹参 生地黄 山茱萸 天麻 菟丝子 益母草 合欢花
0.983582 0.469728 0.588048 0.365043 0.320995 0.562628 0.467439 0.465657 0.367691 0.3781 0.379207
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
423. 
patient tongue id: 04111954257717_4_6
label yaofang:
甘草 法半夏 茯苓 党参 白术 五味子 细辛 天麻 鳖甲 款冬花 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.957689 0.313311 0.453448 0.556639 0.375699 0.469885 0.390022 0.380522 0.303065 0.302836
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.900000, recall: 0.600000, error: 0.100000
424. 
patient tongue id: 03141556479906_1_4_7
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 厚朴
0.43818 0.332077 0.400444 0.499995 0.409165 0.364347 0.344975 0.345601
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝 莱菔子 夏枯草

------Score: precision: 0.625000, recall: 0.384615, error: 0.375000
425. 
patient tongue id: 05191930092323_1_6_4
label yaofang:
甘草 白芍 木香 薏苡仁 党参 黄芪 白术 熟附子 天麻 巴戟天 鳖甲 莪术 蜈蚣 天山雪莲 半枝莲
0.996105 0.489072 0.653288 0.372603 0.32516 0.301593 0.364519 0.702816 0.635378 0.604731 0.528643 0.549521 0.545155
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.615385, recall: 0.533333, error: 0.384615
426. 
patient tongue id: 05182218098243_1_2
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 钩藤 款冬花 紫菀 白前 百部 北沙参 蝉蜕 炙甘草 炒紫苏子 蜜麻黄
0.358819 0.418 0.352383 0.598204 0.366112 0.473029 0.312627 0.301821 0.467589 0.490652 0.540705 0.572245 0.406979 0.648842 0.313448 0.399151 0.37411 0.410152
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 0.875000, error: 0.222222
427. 
patient tongue id: 03221623129249_1_2
label yaofang:
甘草 茯苓 桔梗 太子参 白术 黄连 浙贝母 砂仁 鳖甲 枇杷叶 麦芽 紫苏梗 白花蛇舌 蜂房 有瓜石斛
0.927476 0.427433 0.527445 0.382758 0.39885
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
428. 
patient tongue id: 05191017063065_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.405377 0.578148 0.42665 0.362285 0.700658 0.603454 0.607241 0.621466 0.661574 0.648905 0.778174 0.524752 0.708608 0.753744 0.732486
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 0.923077, error: 0.200000
429. 
patient tongue id: 02181606257339_6_4_7
label yaofang:
柴胡 白芍 茯苓 党参 酸枣仁 五味子 牡丹皮 山药 地黄 菟丝子 益母草 麦芽 首乌藤 酒黄精
0.996834 0.485505 0.676303 0.376054 0.352262 0.306309 0.376095 0.748736 0.689809 0.695021 0.577765 0.618883 0.665705
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.285714, error: 0.692308
430. 
patient tongue id: 04062156032847_1_4_7
label yaofang:
甘草 法半夏 橘红 防风 金银花 太子参 藿香 白前 鸡内金 辛夷 蜜百部 干鱼腥草
0.349364 0.365466 0.344487 0.33911 0.436946
predicted yaofang:
甘草 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
431. 
patient tongue id: 04112206192412_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 木香 蒲公英 党参 白术 延胡索 山药 五灵脂 麦芽 佛手 建曲 姜黄
0.982961 0.30294 0.471901 0.591067 0.371913 0.321803 0.570626 0.490222 0.465729 0.395709 0.404349 0.385785
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
432. 
patient tongue id: 05131709465111_6_2
label yaofang:
桂枝 甘草 白芍 茯苓 薏苡仁 桃仁 党参 黄芪 青皮 牡丹皮 山药 车前子 菟丝子 益母草 王不留行 白扁豆
0.98781 0.45644 0.642913 0.377503 0.322571 0.352726 0.668754 0.563811 0.54161 0.438319 0.483607 0.48745
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
433. 
patient tongue id: 05250457504045_4_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 芦根 桃仁 麦冬 浙贝母 细辛 射干 诃子 蝉蜕
0.473716 0.374131 0.36699 0.423354 0.397343 0.31406
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
434. 
patient tongue id: 03231217024315_4
label yaofang:
陈皮 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 广藿香
0.441642 0.691917 0.956911 0.535266 0.737019 0.482039 0.318846 0.301933 0.401347 0.856161 0.890602 0.861564 0.897565 0.930285 0.490665 0.61292 0.513426 0.613107
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.923077, error: 0.333333
435. 
patient tongue id: 01192123268404_4_6
label yaofang:
甘草 茯苓 桔梗 远志 党参 白术 酸枣仁 浙贝母 山药 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.985439 0.453788 0.637106 0.400848 0.342909 0.370917 0.66068 0.597028 0.583625 0.477369 0.521919 0.554215
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.750000, error: 0.000000
436. 
patient tongue id: 05171936528913_5
label yaofang:
甘草 桔梗 荆芥 防风 紫菀 白前 百部 蝉蜕 蒸陈皮
0.714512 0.30085 0.386815 0.412431 0.397366
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.111111, error: 0.800000
437. 
patient tongue id: 02142343086820_4_1
label yaofang:
甘草 白芍 薏苡仁 白术 赤芍 附子 天麻 僵蚕 鳖甲 木瓜 败酱草 蜈蚣 半枝莲 宽筋藤
0.948723 0.438317 0.569502 0.449191 0.33605 0.471713 0.408094 0.475477 0.327606 0.334198
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.428571, error: 0.400000
438. 
patient tongue id: 02212243253194_6_4
label yaofang:
桂枝 甘草 柴胡 白芍 茯苓 桃仁 白术 栀子 牡丹皮 郁金 地黄 益母草 火麻仁 麦芽
0.994038 0.479844 0.628241 0.39134 0.357318 0.633363 0.594013 0.573891 0.488089 0.503866 0.488193
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
439. 
patient tongue id: 05232033267763_1
label yaofang:
甘草 当归 半夏 薏苡仁 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 厚朴 肉苁蓉 巴戟天 桑寄生 补骨脂 紫苏叶 骨碎补
0.506132 0.308061 0.434996 0.321954 0.560093 0.655586 0.351702 0.332941 0.489899 0.388363 0.314927 0.32695 0.343068
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.538462, recall: 0.411765, error: 0.461538
440. 
patient tongue id: 06130821015785_1_3_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.505244 0.53309 0.453729 0.363801 0.641853 0.564384 0.562437 0.556546 0.601874 0.575282 0.706983 0.540187 0.640721 0.685752 0.653523
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
441. 
patient tongue id: 05182214120526_1_4
label yaofang:
法半夏 茯苓 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.409648 0.631574 0.928501 0.508191 0.696916 0.451805 0.309594 0.398433 0.803021 0.83732 0.81237 0.855122 0.309164 0.89443 0.462448 0.575424 0.451292 0.56458
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
442. 
patient tongue id: 05312145463004_4_6
label yaofang:
甘草 枳壳 法半夏 茯苓 木香 党参 白术 丹参 薤白 砂仁 天麻 瓜蒌皮 紫苏梗
0.996981 0.489067 0.677661 0.372169 0.366546 0.321528 0.384126 0.758087 0.695073 0.676836 0.581999 0.623582 0.642112
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.384615, recall: 0.384615, error: 0.615385
443. 
patient tongue id: 01061912211386_5_7_6
label yaofang:
甘草 柴胡 黄芩 法半夏 茯苓 白术 浙贝母 郁金 天麻 鳖甲 皂角刺 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.955307 0.306427 0.446512 0.549479 0.37172 0.481373 0.359242 0.393243
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.375000, error: 0.250000
444. 
patient tongue id: 05111932256193_1_4
label yaofang:
甘草 枳壳 茯苓 半夏 薏苡仁 黄芪 枸杞子 牡丹皮 杜仲 厚朴 桑寄生 莪术 续断 蜈蚣 预知子 蛇舌草
0.607909 0.351883 0.430235 0.420314 0.422315
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
445. 
patient tongue id: 02120935206767_1_2
label yaofang:
甘草 白芍 茯苓 党参 鸡血藤 生地黄 山药 天麻 菟丝子 益母草 鳖甲 蜈蚣 天山雪莲 半枝莲
0.947419 0.451209 0.540357 0.384699 0.438593 0.362198 0.378751
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.857143, recall: 0.428571, error: 0.142857
446. 
patient tongue id: 02110731073939_1_6_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.641329 0.333138 0.318037 0.491906 0.370094 0.406842 0.326162 0.347695 0.316239 0.351693 0.411753 0.305742
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 莱菔子 天麻 夏枯草

------Score: precision: 0.666667, recall: 0.666667, error: 0.333333
447. 
patient tongue id: 04062006567525_6_4
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.33489 0.42282 0.363302 0.423336 0.51605
predicted yaofang:
甘草 白芍 党参 姜半夏 炙甘草

------Score: precision: 0.600000, recall: 0.272727, error: 0.400000
448. 
patient tongue id: 05140704079259_5_6
label yaofang:
甘草 薏苡仁 党参 白术 牡丹皮 郁金 山药 天麻 鳖甲 莪术 豆蔻 浮小麦 蜈蚣 天山雪莲 半枝莲
0.99654 0.492391 0.658671 0.379873 0.333601 0.304215 0.377863 0.708935 0.641704 0.610346 0.535196 0.555062 0.54452
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
449. 
patient tongue id: 03151911128003_7_6
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 丹参 石菖蒲 泽泻 蝉蜕 炙甘草
0.367975 0.501424 0.350793 0.320898 0.344091 0.346074 0.319504 0.601641 0.586448
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.272727, error: 0.666667
450. 
patient tongue id: 03151821347662_1_8
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.396598 0.494442 0.426655 0.3929 0.581639 0.503859 0.521367 0.519204 0.562052 0.551444 0.646864 0.422231 0.583666 0.621428 0.609782
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
451. 
patient tongue id: 06070650144825_4_1
label yaofang:
甘草 黄芩 桔梗 芦根 牛蒡子 紫花地丁 浙贝母 鳖甲 紫菀 苦杏仁 浮小麦 白花蛇舌 蜂房 岗梅根 四季青
0.977829 0.308656 0.465121 0.577257 0.380631 0.321302 0.548449 0.482287 0.467653 0.391109 0.397357 0.379741
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
452. 
patient tongue id: 01050655588497_4_7_1
label yaofang:
甘草 法半夏 桃仁 白术 郁金 山药 石菖蒲 车前子 大腹皮 天麻 地龙 首乌藤 泽兰
0.912694 0.443157 0.47724 0.321015 0.373242
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
453. 
patient tongue id: 02190501013285_4_6
label yaofang:
甘草 川芎 法半夏 茯苓 薏苡仁 白术 钩藤 厚朴 天麻 僵蚕 麦芽 地龙 蒺藜 首乌藤 谷精草
0.980103 0.312349 0.473011 0.582464 0.367576 0.311465 0.532652 0.441915 0.415988 0.350282 0.347029 0.318983
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
454. 
patient tongue id: 03101856141892_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 海螵蛸 砂仁 炙甘草 百合 紫苏叶
0.323019 0.334649 0.335033 0.464913
predicted yaofang:
白芍 党参 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.153846, error: 0.500000
455. 
patient tongue id: 02151916068464_2_1
label yaofang:
法半夏 前胡 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.428742 0.647554 0.333785 0.880952 0.491896 0.630204 0.340538 0.438991 0.315929 0.305448 0.366841 0.737656 0.777515 0.755203 0.781922 0.370956 0.852948 0.425642 0.540343 0.505732 0.565951
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.933333, error: 0.333333
456. 
patient tongue id: 02241844306873_4
label yaofang:
陈皮 法半夏 前胡 防风 海螵蛸 白芷 百部 豆蔻 炙甘草 辛夷 紫苏梗 广藿香 麸炒白术 甘松
0.420416 0.617826 0.357475 0.854538 0.479786 0.607392 0.333281 0.440345 0.315765 0.320864 0.382094 0.71301 0.746157 0.719429 0.751196 0.360248 0.816397 0.418162 0.524302 0.467161 0.534755
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.428571, recall: 0.642857, error: 0.571429
457. 
patient tongue id: 02021017140721_1_4
label yaofang:
甘草 茯苓 黄芪 白术 胆南星 杜仲 白茅根 石菖蒲 大黄 厚朴 生半夏 火麻仁 鸡内金 稻芽
0.500419 0.363048
predicted yaofang:
甘草 茯苓

------Score: precision: 1.000000, recall: 0.142857, error: 0.000000
458. 
patient tongue id: 04131904379916_5_7
label yaofang:
甘草 薏苡仁 蒲公英 白术 赤芍 海螵蛸 牡丹皮 黄柏 厚朴 僵蚕 莪术 白鲜皮 土茯苓 车前草 姜黄 蛇舌草 龙胆 鸭脚艾
0.467121 0.329113 0.377924 0.412378 0.448945
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.111111, error: 0.600000
459. 
patient tongue id: 03020740287195_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.499309 0.444563 0.457445 0.340088 0.587282 0.499447 0.489549 0.471224 0.534787 0.504774 0.629138 0.493033 0.541033 0.587634 0.563808
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
460. 
patient tongue id: 04121331423736_4
label yaofang:
麻黄 前胡 桔梗 半夏 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 紫苏子 炙甘草
0.401565 0.580835 0.888724 0.466455 0.651094 0.304798 0.382507 0.308232 0.742245 0.7867 0.790541 0.820166 0.37096 0.851455 0.403227 0.526845 0.512016 0.571046
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.555556, recall: 0.666667, error: 0.444444
461. 
patient tongue id: 04291624182539_1_2_6
label yaofang:
甘草 生地黄 红花 牡丹皮 山茱萸 天麻 地骨皮 鳖甲 火麻仁 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲
0.987127 0.459128 0.641966 0.391052 0.343557 0.364711 0.679171 0.60973 0.595992 0.490355 0.536851 0.569646
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
462. 
patient tongue id: 01041307169732_5
label yaofang:
桂枝 白芍 茯苓 桃仁 阿胶 海螵蛸 牡丹皮 茜草
0.350735 0.391653 0.309636 0.382681 0.417067
predicted yaofang:
白芍 党参 车前子 姜半夏 炙甘草

------Score: precision: 0.200000, recall: 0.125000, error: 0.800000
463. 
patient tongue id: 05251917109192_3
label yaofang:
麻黄 桂枝 黄芩 党参 黄芪 白芷 辛夷 苍耳子 路路通
0.406943 0.415363
predicted yaofang:
甘草 党参

------Score: precision: 0.500000, recall: 0.111111, error: 0.500000
464. 
patient tongue id: 03131248131953_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.406109 0.567909 0.301638 0.852989 0.437971 0.608295 0.317774 0.371187 0.323255 0.691489 0.740501 0.746158 0.781794 0.398643 0.829294 0.379312 0.4949 0.499185 0.547143
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
465. 
patient tongue id: 04261349477632_5_1_7
label yaofang:
当归 牡蛎 党参 黄芪 白术 丹参 延胡索 赤芍 山药 仙鹤草 砂仁 补骨脂 红豆杉 三七粉
0.317463 0.347303 0.34518
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.666667, recall: 0.142857, error: 0.333333
466. 
patient tongue id: 04102040402642_4_6
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 蝉蜕 姜半夏 紫苏叶 广藿香 鹿衔草
0.417314 0.553316 0.404757 0.331665 0.388198 0.336222 0.377316 0.704673 0.729675 0.300545
predicted yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 干姜 姜半夏 炙甘草 紫苏梗

------Score: precision: 0.200000, recall: 0.166667, error: 0.800000
467. 
patient tongue id: 05192003512103_2_6
label yaofang:
甘草 法半夏 茯苓 龙骨 远志 党参 酸枣仁 知母 菟丝子 益母草 女贞子 浮小麦 首乌藤
0.980648 0.463861 0.583674 0.3713 0.317246 0.56116 0.460149 0.45284 0.363155 0.373014 0.359707
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
468. 
patient tongue id: 01042338301780_6_4
label yaofang:
甘草 桔梗 酸枣仁 生地黄 浙贝母 天麻 菟丝子 益母草 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97763 0.460928 0.596217 0.393996 0.316251 0.344798 0.590198 0.527824 0.52242 0.423268 0.448447 0.458266
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
469. 
patient tongue id: 03302123058100_4_6
label yaofang:
甘草 法半夏 芦根 薏苡仁 党参 白术 浙贝母 郁金 细辛 天麻 鳖甲 莪术 威灵仙 蜈蚣 白花蛇舌 天山雪莲
0.955849 0.450049 0.564494 0.405415 0.340491 0.523962 0.431578 0.448782 0.328684 0.355703 0.352535
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
470. 
patient tongue id: 03291353005293_1_4
label yaofang:
甘草 法半夏 薏苡仁 党参 白术 厚朴 天麻 鳖甲 豆蔻 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.977749 0.300384 0.462909 0.603187 0.379485 0.331973 0.57327 0.50177 0.470978 0.407074 0.41552 0.385124
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
471. 
patient tongue id: 06191215484649_7_2_4
label yaofang:
甘草 远志 党参 酸枣仁 杜仲 山药 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 牛大力
0.868672 0.427424 0.498668 0.424762 0.313558
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
472. 
patient tongue id: 05131439581912_1_2
label yaofang:
甘草 黄芩 桔梗 党参 白术 浙贝母 乌梅 山药 鳖甲 鹿角霜 白花蛇舌 蜂房 岗梅根 四季青
0.994295 0.477695 0.656414 0.382508 0.327144 0.365141 0.692798 0.595795 0.566378 0.474188 0.50621 0.499013
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
473. 
patient tongue id: 01092324346108_2_4_1
label yaofang:
甘草 茯苓 五味子 细辛 干姜 苦杏仁 姜半夏
0.503916 0.326505 0.427605
predicted yaofang:
甘草 茯苓 党参

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
474. 
patient tongue id: 03312024487699_1_2_7
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 党参 白术 郁金 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.987372 0.478539 0.624646 0.363388 0.331681 0.617961 0.536864 0.507562 0.427538 0.447991 0.441694
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.625000, error: 0.090909
475. 
patient tongue id: 03291902228451_1_6
label yaofang:
甘草 香附 茯苓 党参 白术 延胡索 海螵蛸 车前子 干姜 紫苏梗 瓦楞子 猫爪草
0.614881 0.412857 0.307882 0.443952 0.365488
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
476. 
patient tongue id: 03101900089120_6
label yaofang:
麻黄 桂枝 柴胡 白芍 香附 枳壳 牛蒡子 五味子 海螵蛸 浙贝母 细辛 干姜 射干 紫菀 豆蔻 苦杏仁 姜半夏 炙甘草 紫苏梗 龙脷叶
0.461686 0.314754 0.448368 0.569363 0.33318
predicted yaofang:
甘草 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
477. 
patient tongue id: 05102206155763_1_2
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.373555 0.498721 0.367892 0.656698 0.39567 0.501794 0.352984 0.323449 0.528561 0.552075 0.594887 0.604121 0.409991 0.659344 0.338372 0.427569 0.462552 0.473139
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 0.933333, error: 0.222222
478. 
patient tongue id: 04071923454830_4
label yaofang:
桂枝 陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.358864 0.360492 0.307954 0.490609
predicted yaofang:
甘草 茯苓 黄芪 炙甘草

------Score: precision: 0.250000, recall: 0.058824, error: 0.750000
479. 
patient tongue id: 04071412414750_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.538298 0.330724 0.300476 0.445386 0.402471 0.369703 0.334402 0.311541
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
480. 
patient tongue id: 03171155068628_1_3_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.459082 0.369074 0.435179 0.396157 0.442291 0.355945 0.405308 0.337662 0.376259 0.342182 0.41959 0.327187 0.366735 0.427184 0.373129
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
481. 
patient tongue id: 05311940552021_1
label yaofang:
甘草 桔梗 半夏 橘红 芦根 薏苡仁 桑叶 菊花 苦杏仁 蝉蜕 野马追 东风桔
0.813484 0.349101 0.551847 0.324257 0.304344 0.330877 0.492005
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 天麻

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
482. 
patient tongue id: 05092114255831_2_7
label yaofang:
甘草 薏苡仁 桃仁 酸枣仁 生地黄 山药 天麻 鳖甲 款冬花 莪术 紫菀 桑螵蛸 百合 蜈蚣 白花蛇舌 红豆杉
0.959362 0.324969 0.457487 0.561107 0.389149 0.300144 0.467795 0.412749 0.410901 0.325134 0.327413 0.308745
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
483. 
patient tongue id: 05261921468148_5
label yaofang:
甘草 金银花 薏苡仁 赤小豆 野菊花 茵陈 扁豆花 木棉花 鸡蛋花
0.786966 0.376359 0.488061 0.300907 0.449469
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.111111, error: 0.800000
484. 
patient tongue id: 05232110096111_1_4_6
label yaofang:
柴胡 荆芥 薄荷 浙贝母 僵蚕 百部 苦杏仁 紫苏子 辛夷 紫苏叶 木蝴蝶 紫苑
0.506916 0.44178 0.345796 0.632072 0.657456 0.34335 0.360786 0.545482 0.400579 0.397159 0.366909 0.364968 0.306383
predicted yaofang:
甘草 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮 蛇舌草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
485. 
patient tongue id: 05092124050849_6_4
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 黄芪 酸枣仁 天麻 鳖甲 白扁豆 佛手 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.988825 0.304632 0.483221 0.616427 0.380754 0.31917 0.354664 0.636285 0.566005 0.527876 0.470991 0.484141 0.468354
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.625000, error: 0.230769
486. 
patient tongue id: 04200634514551_5_1_6
label yaofang:
甘草 薏苡仁 党参 山药 天麻 鳖甲 茵陈 扁豆花 莪术 虎杖 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.949143 0.441294 0.541193 0.391971 0.436386 0.352809 0.376483
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
487. 
patient tongue id: 03062146371053_3_1_4
label yaofang:
桂枝 甘草 枳壳 当归 茯苓 黄芪 白术 干姜 厚朴 僵蚕 磁石 肉苁蓉 鸡内金 辛夷
0.608158 0.35105 0.445691 0.438512 0.411293 0.312115
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
488. 
patient tongue id: 03032027453727_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 广藿香
0.439851 0.657625 0.320908 0.896943 0.494926 0.641905 0.340887 0.448071 0.324229 0.374527 0.75137 0.799324 0.77052 0.805398 0.374359 0.882575 0.429811 0.558147 0.536813 0.584817
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
489. 
patient tongue id: 03061451369138_2_7
label yaofang:
甘草 当归 茯苓 龙骨 牛蒡子 柏子仁 熟地黄 乌梅 紫菀 紫苏子 姜半夏 百合 蜜枇杷叶 化橘红
0.43106 0.364911 0.355557 0.300905 0.438792
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.142857, error: 0.600000
490. 
patient tongue id: 04120125056619_2_5_7
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 生地黄 黄柏 胡黄连 淡竹叶 麦芽 佛手 广藿香
0.874594 0.435344 0.448177 0.409295
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 1.000000, recall: 0.285714, error: 0.000000
491. 
patient tongue id: 06072126078339_4_1
label yaofang:
桂枝 甘草 柴胡 枳壳 法半夏 党参 丹参 赤芍 川楝子 郁金 薤白 瓜蒌皮 补骨脂 麦芽 田七末
0.994339 0.47891 0.649913 0.368144 0.338151 0.309024 0.368469 0.70068 0.632904 0.606682 0.52425 0.555231 0.562748
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.153846, recall: 0.133333, error: 0.846154
492. 
patient tongue id: 01041301307309_6_1
label yaofang:
茯苓 麦冬 党参 酸枣仁 柏子仁 附子 干姜 磁石 炙甘草
0.60372 0.304619 0.379033 0.433186 0.346766
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.222222, error: 0.600000
493. 
patient tongue id: 03081855589569_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 豆蔻 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.448506 0.711574 0.963043 0.552402 0.746105 0.501843 0.317014 0.313576 0.439797 0.865891 0.901758 0.867118 0.903142 0.301651 0.941368 0.514296 0.623803 0.499606 0.619648
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
494. 
patient tongue id: 02182217015039_2_6
label yaofang:
甘草 白芍 麦冬 太子参 浙贝母 山药 白茅根 鳖甲 北沙参 辛夷 苍耳子 白花蛇舌 天山雪莲 蜂房 四季青
0.998449 0.500561 0.672098 0.359831 0.310035 0.365214 0.739903 0.677106 0.641885 0.565713 0.583523 0.572517
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
495. 
patient tongue id: 05222124534209_1_4_7
label yaofang:
当归 黄芪 鸡血藤 白术 丹参 厚朴 砂仁 肉苁蓉 火麻仁 鸡内金 北沙参 稻芽 冬凌草 红参
0.479303 0.323946 0.39917 0.349765 0.554688 0.559778 0.310783 0.300226 0.463588 0.351435 0.354234 0.381034
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
496. 
patient tongue id: 05042121273771_1_4
label yaofang:
甘草 当归 茯苓 牛蒡子 党参 白术 海螵蛸 干姜 补骨脂 浮小麦 瓦楞子
0.376795 0.32622 0.387111 0.348976 0.388715
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.600000, recall: 0.272727, error: 0.400000
497. 
patient tongue id: 03090802565431_6
label yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 天麻 鳖甲 浮小麦 百合 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.975296 0.32506 0.448055 0.587484 0.374776 0.304942 0.554598 0.460688 0.474288 0.362774 0.384308 0.388002
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
498. 
patient tongue id: 01182058059521_4_6_7
label yaofang:
甘草 川芎 法半夏 茯苓 白术 红花 栀子 牛膝 天麻 鳖甲 粉葛 首乌藤 白花蛇舌 半枝莲
0.965877 0.444536 0.57049 0.45456 0.351725 0.507594 0.455261 0.52007 0.350919 0.381856 0.39268
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
499. 
patient tongue id: 03221308433062_1_6_7
label yaofang:
甘草 麦冬 党参 太子参 五味子 牛膝 郁金 天麻 鳖甲 淫羊藿 蒺藜 鹿角霜 蜈蚣 天山雪莲 半枝莲 鹿衔草
0.98585 0.476178 0.610685 0.383988 0.317663 0.354761 0.625985 0.550246 0.527263 0.452253 0.4714 0.462832
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
------Average Score: average precision: 0.464897, average recall: 0.362272, error: 0.535103