20544/20571 [============================>.] - ETA: 0s - loss: 0.1229Epoch 00000: val_loss improved from inf to 0.08338, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 116s - loss: 0.1229 - val_loss: 0.0834
Epoch 2/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0885Epoch 00001: val_loss improved from 0.08338 to 0.08159, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0885 - val_loss: 0.0816
Epoch 3/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0848Epoch 00002: val_loss improved from 0.08159 to 0.07683, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0848 - val_loss: 0.0768
Epoch 4/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0829Epoch 00003: val_loss improved from 0.07683 to 0.07659, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0829 - val_loss: 0.0766
Epoch 5/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0816Epoch 00004: val_loss improved from 0.07659 to 0.07531, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0816 - val_loss: 0.0753
Epoch 6/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0806Epoch 00005: val_loss improved from 0.07531 to 0.07521, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0806 - val_loss: 0.0752
Epoch 7/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0796Epoch 00006: val_loss improved from 0.07521 to 0.07499, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0795 - val_loss: 0.0750
Epoch 8/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0788Epoch 00007: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0788 - val_loss: 0.0789
Epoch 9/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0784Epoch 00008: val_loss improved from 0.07499 to 0.07379, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0784 - val_loss: 0.0738
Epoch 10/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0777Epoch 00009: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0777 - val_loss: 0.0740
Epoch 11/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0771Epoch 00010: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0771 - val_loss: 0.0742
Epoch 12/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0767Epoch 00011: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0767 - val_loss: 0.0745
Epoch 13/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0763Epoch 00012: val_loss improved from 0.07379 to 0.07350, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0763 - val_loss: 0.0735
Epoch 14/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0759Epoch 00013: val_loss improved from 0.07350 to 0.07298, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0759 - val_loss: 0.0730
Epoch 15/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0754Epoch 00014: val_loss improved from 0.07298 to 0.07280, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0754 - val_loss: 0.0728
Epoch 16/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0750Epoch 00015: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0750 - val_loss: 0.0735
Epoch 17/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0748Epoch 00016: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0748 - val_loss: 0.0729
Epoch 18/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0744Epoch 00017: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0744 - val_loss: 0.0729
Epoch 19/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0741Epoch 00018: val_loss improved from 0.07280 to 0.07263, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0741 - val_loss: 0.0726
Epoch 20/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0737Epoch 00019: val_loss improved from 0.07263 to 0.07257, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 111s - loss: 0.0737 - val_loss: 0.0726
Epoch 21/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0735Epoch 00020: val_loss improved from 0.07257 to 0.07231, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnnmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 112s - loss: 0.0735 - val_loss: 0.0723
Epoch 22/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0731Epoch 00021: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0731 - val_loss: 0.0728
Epoch 23/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0728Epoch 00022: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0729 - val_loss: 0.0726
Epoch 24/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0726Epoch 00023: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0726 - val_loss: 0.0731
Epoch 25/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0721Epoch 00024: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0721 - val_loss: 0.0738
Epoch 26/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0718Epoch 00025: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0718 - val_loss: 0.0728
Epoch 27/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0715Epoch 00026: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0715 - val_loss: 0.0727
Epoch 28/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0712Epoch 00027: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0712 - val_loss: 0.0728
Epoch 29/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0708Epoch 00028: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0708 - val_loss: 0.0729
Epoch 30/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0706Epoch 00029: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0706 - val_loss: 0.0731
Epoch 31/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0702Epoch 00030: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0702 - val_loss: 0.0726
Epoch 32/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0697Epoch 00031: val_loss did not improve
20571/20571 [==============================] - 112s - loss: 0.0698 - val_loss: 0.0731
Epoch 33/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0694Epoch 00032: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0694 - val_loss: 0.0725
Epoch 34/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0692Epoch 00033: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0692 - val_loss: 0.0742
Epoch 35/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0689Epoch 00034: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0689 - val_loss: 0.0729
Epoch 36/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0686Epoch 00035: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0686 - val_loss: 0.0733
Epoch 37/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0681Epoch 00036: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0681 - val_loss: 0.0733
Epoch 38/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0679Epoch 00037: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0679 - val_loss: 0.0731
Epoch 39/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0675Epoch 00038: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0675 - val_loss: 0.0730
Epoch 40/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0672Epoch 00039: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0672 - val_loss: 0.0738
Epoch 41/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0668Epoch 00040: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0668 - val_loss: 0.0731
Epoch 42/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0664Epoch 00041: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0664 - val_loss: 0.0736
Epoch 43/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0661Epoch 00042: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0661 - val_loss: 0.0741
Epoch 44/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0659Epoch 00043: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0659 - val_loss: 0.0739
Epoch 45/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0655Epoch 00044: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0655 - val_loss: 0.0737
Epoch 46/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0651Epoch 00045: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0651 - val_loss: 0.0749
Epoch 47/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0648Epoch 00046: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0648 - val_loss: 0.0737
Epoch 48/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0644Epoch 00047: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0644 - val_loss: 0.0739
Epoch 49/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0641Epoch 00048: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0641 - val_loss: 0.0750
Epoch 50/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0636Epoch 00049: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0636 - val_loss: 0.0743
Epoch 51/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0633Epoch 00050: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0633 - val_loss: 0.0751
Epoch 52/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0629Epoch 00051: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0629 - val_loss: 0.0747
Epoch 53/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0627Epoch 00052: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0627 - val_loss: 0.0739
Epoch 54/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0625Epoch 00053: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0625 - val_loss: 0.0746
Epoch 55/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0620Epoch 00054: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0620 - val_loss: 0.0751
Epoch 56/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0618Epoch 00055: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0618 - val_loss: 0.0750
Epoch 57/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0615Epoch 00056: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0615 - val_loss: 0.0759
Epoch 58/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0613Epoch 00057: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0613 - val_loss: 0.0754
Epoch 59/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0609Epoch 00058: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0609 - val_loss: 0.0754
Epoch 60/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0607Epoch 00059: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0607 - val_loss: 0.0759
Epoch 61/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0603Epoch 00060: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0603 - val_loss: 0.0756
Epoch 62/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0601Epoch 00061: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0600 - val_loss: 0.0755
Epoch 63/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0599Epoch 00062: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0599 - val_loss: 0.0760
Epoch 64/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0594Epoch 00063: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0594 - val_loss: 0.0758
Epoch 65/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0593Epoch 00064: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0593 - val_loss: 0.0757
Epoch 66/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0591Epoch 00065: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0590 - val_loss: 0.0752
Epoch 67/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0588Epoch 00066: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0588 - val_loss: 0.0758
Epoch 68/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0585Epoch 00067: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0585 - val_loss: 0.0765
Epoch 69/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0582Epoch 00068: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0582 - val_loss: 0.0761
Epoch 70/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0580Epoch 00069: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0580 - val_loss: 0.0756
Epoch 71/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0577Epoch 00070: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0577 - val_loss: 0.0761
Epoch 72/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0575Epoch 00071: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0575 - val_loss: 0.0767
Epoch 73/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0574Epoch 00072: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0574 - val_loss: 0.0761
Epoch 74/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0571Epoch 00073: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0570 - val_loss: 0.0772
Epoch 75/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0568Epoch 00074: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0568 - val_loss: 0.0766
Epoch 76/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0566Epoch 00075: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0566 - val_loss: 0.0770
Epoch 77/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0564Epoch 00076: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0564 - val_loss: 0.0781
Epoch 78/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0562Epoch 00077: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0562 - val_loss: 0.0767
Epoch 79/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0559Epoch 00078: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0559 - val_loss: 0.0769
Epoch 80/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0557Epoch 00079: val_loss did not improve
20571/20571 [==============================] - 111s - loss: 0.0557 - val_loss: 0.0772
history: [(0.12286123158990146, None, 0.083378463303117448, None), (0.088459971919673905, None, 0.081588355022024703, None), (0.084801124440442077, None, 0.076831005921919049, None), (0.082910651144865025, None, 0.076592522895862339, None), (0.081550103292839099, None, 0.075311179126824057, None), (0.080555846481380963, None, 0.075208773873349483, None), (0.07954713259860971, None, 0.074987434723968738, None), (0.078846469244086101, None, 0.078926131622568119, None), (0.078393235092398705, None, 0.0737913790381481, None), (0.077719076603012152, None, 0.073984233960169093, None), (0.077143241735791429, None, 0.074175845083172459, None), (0.076726138416467096, None, 0.074461279167613664, None), (0.076296526474894405, None, 0.073497572678454567, None), (0.075910780180625387, None, 0.072980600694134895, None), (0.07541302621515264, None, 0.072797208275969166, None), (0.074982463578988703, None, 0.073452935620711451, None), (0.07480122476372858, None, 0.072945849558897033, None), (0.074390392036084718, None, 0.072929188404997736, None), (0.074068981468689107, None, 0.07262969014193732, None), (0.073689641396656638, None, 0.072571806723033636, None), (0.073485589606616705, None, 0.072312024834493518, None), (0.073074555163856705, None, 0.07284908949240157, None), (0.072855716573294399, None, 0.072633390863464306, None), (0.072563748436196132, None, 0.073084556246729201, None), (0.072087501519101635, None, 0.073750360059456926, None), (0.071770951852682674, None, 0.072763267093688203, None), (0.071453224006841246, None, 0.072741327946225981, None), (0.071206152308729551, None, 0.072828351855958429, None), (0.070803705714257273, None, 0.072911523605726627, None), (0.070594418276892557, None, 0.073125197530881453, None), (0.070159876890160705, None, 0.072584874684181025, None), (0.06975491323487179, None, 0.073052025616985483, None), (0.069440442903041494, None, 0.07249787982831081, None), (0.06917764008940526, None, 0.074208094547056166, None), (0.068895768563810342, None, 0.072940931393221997, None), (0.0685867604525075, None, 0.073302406812004478, None), (0.068097279980292635, None, 0.073277308862185739, None), (0.067870396083225093, None, 0.073063593981518224, None), (0.067474502107599976, None, 0.072991706776791329, None), (0.067206644792705342, None, 0.073771180423427396, None), (0.066820231023698703, None, 0.073123516512062267, None), (0.066435832039313511, None, 0.073601089508656861, None), (0.066090076718107973, None, 0.07414358777179747, None), (0.06588923958648156, None, 0.073936976180546538, None), (0.065524729500885032, None, 0.073685453385341479, None), (0.065085580184129257, None, 0.074875740031038432, None), (0.064833677516664606, None, 0.073731962375943885, None), (0.06441701558348352, None, 0.073862274975446437, None), (0.06408206111337289, None, 0.075016433426960058, None), (0.06360598737039376, None, 0.07425502021449705, None), (0.063331736549702478, None, 0.075096091842406412, None), (0.062891454863493804, None, 0.074738692962869294, None), (0.062719889082585731, None, 0.073944919990713009, None), (0.062476846125753951, None, 0.074612394128351994, None), (0.062005618905952735, None, 0.075108394616452162, None), (0.06177490934092849, None, 0.074969372781535079, None), (0.061484899732783295, None, 0.075901447252414364, None), (0.061262658200453589, None, 0.075382735591546221, None), (0.06089689761471212, None, 0.075394991320335336, None), (0.060740182449050863, None, 0.075944100836890113, None), (0.060280329995080061, None, 0.075555173955188681, None), (0.060046399086728278, None, 0.075545243913225563, None), (0.059860825714658887, None, 0.075976001283031988, None), (0.059439549930395505, None, 0.075814811509992794, None), (0.059335185698670481, None, 0.075681468015437445, None), (0.059046186684944962, None, 0.075217285566315434, None), (0.058758337627099415, None, 0.075753560405978693, None), (0.058502747568021478, None, 0.076487088799930242, None), (0.058204685016806638, None, 0.076057539887079903, None), (0.058047848362241118, None, 0.075576978419514731, None), (0.057695353842931639, None, 0.076126873833403746, None), (0.057501599744232482, None, 0.076727767808070835, None), (0.057370121099439092, None, 0.076107381016605705, None), (0.057043219877723053, None, 0.077216900817063297, None), (0.05680660022194764, None, 0.076628688082121643, None), (0.056611754159187691, None, 0.076981265783944999, None), (0.056379629111883676, None, 0.078124353466512947, None), (0.056217164431039121, None, 0.076658294092483897, None), (0.055911441471631046, None, 0.076909899138923474, None), (0.055654105096207912, None, 0.077167730744434823, None)]
0. 
patient tongue id: 02231905596969_2_4
label yaofang:
甘草 白芍 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 炒僵蚕
0.363418 0.843614 0.363154 0.942261 0.585783 0.659896 0.390923 0.403961 0.311582 0.384117 0.877462 0.879726 0.871729 0.904206 0.394534 0.971325 0.472446 0.410266 0.595551 0.788454
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.050000, recall: 0.071429, error: 0.950000
1. 
patient tongue id: 02142145154899_1_2
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.971156 0.521557 0.631464 0.380203 0.32835 0.357999 0.651808 0.54717 0.545837 0.435622 0.477938 0.510639
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
2. 
patient tongue id: 04291510105716_1_6
label yaofang:
甘草 薏苡仁 党参 黄芪 熟附子 泽泻 天麻 赤石脂 鳖甲 补骨脂 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.930112 0.480212 0.604916 0.321203 0.315458 0.335077 0.619613
predicted yaofang:
甘草 茯苓 党参 酸枣仁 丹参 山药 天麻

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
3. 
patient tongue id: 04061943587990_2_1
label yaofang:
枳壳 太子参 白术 神曲 山楂 砂仁 麦芽 百合 紫苏叶
0.785214 0.366737 0.416382 0.52231 0.366525 0.328877
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.111111, error: 0.833333
4. 
patient tongue id: 04232016402822_4
label yaofang:
麻黄 桂枝 荆芥 防风 独活 延胡索 乳香 没药 炙甘草 豨莶草 海风藤 海桐皮 鹿衔草 走马胎
0.415035 0.347599 0.33056 0.523615 0.339969
predicted yaofang:
甘草 茯苓 党参 黄芪 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
5. 
patient tongue id: 04181901234673_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 紫菀 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.340302 0.721712 0.390794 0.833769 0.47197 0.562112 0.368968 0.360459 0.307311 0.354208 0.735169 0.749984 0.752053 0.785484 0.387559 0.903596 0.408684 0.37757 0.520312 0.676126
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
6. 
patient tongue id: 03290659148378_1_4_6
label yaofang:
甘草 茯苓 桔梗 远志 酸枣仁 浙贝母 天麻 鳖甲 苦杏仁 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.934902 0.495022 0.598682 0.39877 0.331591 0.557247 0.464732 0.469659 0.363851 0.396685 0.402462
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
7. 
patient tongue id: 01180059182288_2
label yaofang:
橘红 黄芪 熟地黄 牡丹皮 山茱萸 石菖蒲 水蛭 大黄 厚朴 火麻仁 鸡内金 枇杷叶 北沙参 稻芽
0.680491 0.312299 0.427289 0.448296
predicted yaofang:
甘草 白芍 茯苓 党参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
8. 
patient tongue id: 04251959267487_2
label yaofang:
柴胡 陈皮 当归 党参 黄芪 白术 车前子 升麻 炙甘草
0.378988 0.365605 0.511684 0.370824 0.433269 0.351329 0.429996 0.510388
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.444444, error: 0.500000
9. 
patient tongue id: 04201928295211_5
label yaofang:
甘草 川芎 法半夏 茯苓 羌活 金银花 蒲公英 白芷 蔓荆子 益母草 鳖甲 辛夷 苍耳子 土鳖虫
0.927415 0.325423 0.458831 0.611659 0.382351 0.507028 0.411849 0.42386 0.335646 0.347376
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
10. 
patient tongue id: 02212226574723_1_2
label yaofang:
甘草 党参 酸枣仁 生地黄 郁金 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.955042 0.503067 0.6117 0.368049 0.307153 0.578368 0.44752 0.458697 0.331103 0.371123 0.379764
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
11. 
patient tongue id: 01051914475464_5
label yaofang:
甘草 法半夏 桔梗 防风 薄荷 荆芥穗 香薷 辛夷 紫苏梗 广藿香 炒苍耳子
0.300671 0.544092 0.359198 0.706448 0.425433 0.483491 0.340285 0.615969 0.60132 0.618379 0.64568 0.369892 0.785483 0.393367 0.350218 0.347014 0.512222
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.294118, recall: 0.454545, error: 0.705882
12. 
patient tongue id: 04131822166239_6_2_1
label yaofang:
甘草 桔梗 薏苡仁 白及 太子参 仙鹤草 茜草 天麻 鳖甲 补骨脂 蜈蚣 白花蛇舌 天山雪莲 红豆杉 龙葵果
0.865952 0.458122 0.559218 0.423264 0.44038 0.33338 0.392376
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
13. 
patient tongue id: 05251935084325_1_5
label yaofang:
甘草 白芍 枳壳 黄芪 白术 杜仲 乌药 厚朴 桑寄生 北沙参 蜈蚣 合欢皮 冬凌草 荔枝核 鸭脚艾
0.767175 0.389647 0.464475 0.381501 0.508945 0.333825
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.266667, error: 0.333333
14. 
patient tongue id: 04282259083000_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 鱼腥草 浙贝母 桑白皮 蔓荆子 瓜蒌皮 款冬花 苦杏仁 紫苏子 苍耳子
0.980841 0.532708 0.651459 0.357817 0.317548 0.652232 0.528071 0.526497 0.401789 0.446056 0.465037
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
15. 
patient tongue id: 01082358468371_7_2_1
label yaofang:
麻黄 桂枝 甘草 白芍 香附 防风 薏苡仁 延胡索 牛膝 知母 附子 苍术 全蝎 防己 木瓜 丝瓜络 蜈蚣
0.465792 0.322729 0.361101 0.443092 0.513805 0.329038
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.166667, recall: 0.058824, error: 0.833333
16. 
patient tongue id: 01101817489925_1_4
label yaofang:
法半夏 茯苓 前胡 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.412416 0.384643 0.407006 0.325295 0.303823 0.315411 0.30419 0.431431 0.393621 0.376541 0.546838 0.33197
predicted yaofang:
法半夏 茯苓 前胡 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 蜜麻黄

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
17. 
patient tongue id: 02142000290219_6
label yaofang:
麻黄 桂枝 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.749059 0.392127 0.386492 0.531799 0.344239
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
18. 
patient tongue id: 03200652590400_5_1
label yaofang:
甘草 茯苓 桔梗 牛蒡子 白术 酸枣仁 丹参 生地黄 浙贝母 山药 天花粉 鳖甲 板蓝根 贯众
0.965752 0.509684 0.626937 0.382921 0.328829 0.610176 0.51184 0.510836 0.393491 0.434763 0.443626
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
19. 
patient tongue id: 03111712589485_6_2_7
label yaofang:
甘草 柴胡 白芍 香附 延胡索 砂仁 天麻 五灵脂 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲 红豆杉
0.915658 0.484154 0.583989 0.380815 0.50982 0.396392 0.411018 0.325286 0.330238
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.428571, error: 0.333333
20. 
patient tongue id: 02272226177792_4_1
label yaofang:
白芍 当归 木香 党参 白术 肉桂 补骨脂 肉豆蔻 诃子 炙甘草
0.340252 0.372006 0.514057 0.383384 0.400516 0.336861 0.468709 0.552362
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
21. 
patient tongue id: 03111508488463_2_1
label yaofang:
甘草 川芎 茯苓 麦冬 太子参 白术 五味子 牛膝 郁金 山药 补骨脂 莪术 浮小麦
0.955913 0.501771 0.611148 0.372614 0.570357 0.455118 0.464816 0.34189 0.377393 0.390595
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.230769, error: 0.700000
22. 
patient tongue id: 02191440325559_6_4
label yaofang:
甘草 川芎 茯苓 党参 白术 酸枣仁 栀子 杜仲 钩藤 天麻 桑寄生 补骨脂 麦芽 红景天
0.976622 0.530287 0.645824 0.371805 0.304467 0.337249 0.655268 0.53063 0.530531 0.402787 0.456492 0.470914
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
23. 
patient tongue id: 03091826486290_4
label yaofang:
麻黄 茯苓 前胡 半夏 防风 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 苍耳子
0.513811 0.368211 0.54744 0.312865 0.444463 0.313884 0.302241 0.424841 0.462088 0.5783 0.548772 0.409932 0.725684 0.312948 0.346507 0.429419
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄

------Score: precision: 0.625000, recall: 0.625000, error: 0.375000
24. 
patient tongue id: 02141938275915_4
label yaofang:
枳壳 桔梗 牛蒡子 党参 白术 旋覆花 紫菀 百部 北沙参 紫苏子 炙甘草 化橘红 芥子
0.664207 0.373155 0.362486 0.489241 0.38165
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
25. 
patient tongue id: 04051840590844_3_4
label yaofang:
桂枝 茯苓 半夏 木香 黄芪 白术 附子 山药 泽泻 茯苓皮 猪苓 白扁豆 紫苏叶 玉米须 蜈蚣
0.380159 0.307041 0.310866 0.43912 0.319643 0.308466
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 炙甘草

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
26. 
patient tongue id: 02161920352266_5_7
label yaofang:
桃仁 党参 白术 赤芍 浙贝母 厚朴 地榆 槐花 火麻仁 鸡内金 北沙参 土鳖虫 红豆杉 合欢皮 山慈菇
0.461909 0.375562 0.376853 0.455489
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.066667, error: 0.750000
27. 
patient tongue id: 05172139304286_6_2_1
label yaofang:
甘草 枳壳 茯苓 远志 党参 白术 酸枣仁 天麻 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.886059 0.330005 0.463162 0.580868 0.385356 0.461754 0.359093 0.385136
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.875000, recall: 0.500000, error: 0.125000
28. 
patient tongue id: 06131957108961_6_5_7
label yaofang:
甘草 桃仁 蒲公英 枸杞子 黄连 生地黄 红花 牡丹皮 郁金 山茱萸 厚朴 麦芽 北沙参 百合 合欢皮 素馨花 稻芽
0.528807 0.330724 0.398393 0.572982 0.421452 0.388126 0.325496
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.176471, error: 0.571429
29. 
patient tongue id: 04130619276007_3_2
label yaofang:
甘草 桃仁 党参 丹参 生地黄 红花 黄柏 乌药 肉桂 山茱萸 菟丝子 淫羊藿 补骨脂 仙茅 艾叶
0.901441 0.330443 0.461317 0.599957 0.385257 0.45771 0.378792 0.393325 0.306606 0.321576
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.133333, error: 0.800000
30. 
patient tongue id: 06132114096266_1_4
label yaofang:
甘草 香附 茯苓 党参 白术 延胡索 海螵蛸 莪术 紫苏梗 半枝莲 瓦楞子 猫爪草 山慈菇
0.303179 0.356668 0.500157 0.353437 0.302646 0.394099 0.356634 0.438888 0.562319
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.307692, error: 0.555556
31. 
patient tongue id: 06041020424503_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.35407 0.707645 0.403871 0.824086 0.525802 0.560958 0.386785 0.394465 0.308183 0.302646 0.38515 0.750325 0.737912 0.745308 0.778507 0.395859 0.856559 0.445724 0.395008 0.531031 0.686527
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.523810, recall: 0.785714, error: 0.476190
32. 
patient tongue id: 04112208324499_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 浮小麦 白花蛇舌 天山雪莲 半枝莲
0.622305 0.394736 0.463695 0.377401 0.425541
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
33. 
patient tongue id: 03081847078615_4
label yaofang:
麻黄 陈皮 前胡 半夏 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香
0.373216 0.710041 0.372713 0.853295 0.51199 0.605021 0.377378 0.380441 0.327136 0.308422 0.401544 0.763603 0.77864 0.775472 0.81565 0.398031 0.909844 0.46857 0.431611 0.550189 0.691633
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.866667, error: 0.380952
34. 
patient tongue id: 05262214284827_5_6
label yaofang:
甘草 柴胡 白芍 陈皮 茯苓 防风 党参 白术 延胡索 川楝子 乌药 山药 桑寄生 鸡内金 广金钱草
0.965271 0.5117 0.631268 0.3964 0.334406 0.603998 0.50629 0.505542 0.389938 0.432812 0.442999
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
35. 
patient tongue id: 05181041350539_5_7
label yaofang:
甘草 独活 薏苡仁 党参 白术 红花 延胡索 杜仲 苍术 桑寄生 补骨脂 鹿角霜 续断 牛大力 千斤拔
0.945957 0.492601 0.61276 0.423937 0.330587 0.559872 0.493097 0.518292 0.362225 0.426936 0.446892
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
36. 
patient tongue id: 02142127346160_2_6
label yaofang:
甘草 茯苓 薏苡仁 党参 酸枣仁 生地黄 熟附子 天麻 鳖甲 败酱草 蜈蚣 天山雪莲 半枝莲 红豆杉
0.983804 0.534614 0.652489 0.34383 0.309845 0.666893 0.520673 0.528426 0.388419 0.437684 0.45156
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
37. 
patient tongue id: 03012039582436_6_1_2
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 延胡索 赤芍 川楝子 天麻 五灵脂 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲
0.924835 0.487755 0.591447 0.389715 0.300706 0.52582 0.434715 0.444472 0.324899 0.35842 0.367781
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
38. 
patient tongue id: 01041812514567_2_1
label yaofang:
陈皮 法半夏 前胡 桔梗 麦冬 太子参 款冬花 紫菀 百部 炙甘草 人参叶 北海参
0.343571 0.618555 0.384863 0.744761 0.435346 0.521449 0.363295 0.338991 0.301546 0.353683 0.648529 0.662393 0.690333 0.712436 0.404445 0.820954 0.414341 0.375652 0.498563 0.618771
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.750000, error: 0.550000
39. 
patient tongue id: 04020820414180_5
label yaofang:
甘草 金银花 连翘 紫花地丁 党参 白术 浙贝母 郁金 莱菔子 白芷 鸡内金 夏枯草 麦芽 皂角刺 猫爪草
0.947291 0.499162 0.600866 0.379249 0.301738 0.555558 0.45213 0.457561 0.346857 0.378776 0.390644
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
40. 
patient tongue id: 04191714094914_1_7_4
label yaofang:
枳壳 党参 黄芪 白术 延胡索 海螵蛸 浙贝母 厚朴 山楂 瓜蒌皮 火麻仁 鸡内金 桑螵蛸 益智 蜈蚣 鲜龙葵果
0.433677 0.35382 0.362097 0.438247 0.491229 0.397476 0.346411
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.285714, recall: 0.125000, error: 0.714286
41. 
patient tongue id: 06190759034003_6_4
label yaofang:
甘草 茯苓 酸枣仁 红花 栀子 牡丹皮 杜仲 钩藤 地黄 天麻 桑寄生 淡竹叶 浮小麦 川木通
0.965233 0.504955 0.629342 0.391902 0.313152 0.350152 0.626829 0.525059 0.530288 0.412213 0.458374 0.483757
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
42. 
patient tongue id: 05222054167649_1_4
label yaofang:
甘草 陈皮 茯苓 党参 白术 五味子 厚朴 生半夏 僵蚕 诃子 枇杷叶 地龙 北沙参
0.664495 0.412274 0.464149 0.370589 0.454589
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
43. 
patient tongue id: 01062347071030_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.394415 0.373843 0.394673 0.342629 0.404011 0.441464 0.438236 0.318553 0.329794 0.412727 0.336106 0.324293 0.372574 0.310778 0.329232 0.375207 0.364406
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.705882, recall: 1.000000, error: 0.294118
44. 
patient tongue id: 03232032274593_7_6_4
label yaofang:
甘草 茯苓 白术 酸枣仁 生地黄 赤芍 杜仲 天麻 全蝎 菟丝子 麦芽 皂角刺 女贞子 首乌藤 合欢花
0.943466 0.49821 0.614351 0.396377 0.311477 0.540514 0.450975 0.455579 0.339188 0.379341 0.394125
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
45. 
patient tongue id: 03020839159215_6
label yaofang:
甘草 香附 桔梗 芦根 酸枣仁 浙贝母 天麻 益母草 鳖甲 紫苏梗 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.965144 0.49904 0.640994 0.378215 0.311691 0.334201 0.613582 0.492511 0.49328 0.37669 0.424863 0.454277
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
46. 
patient tongue id: 05261929075147_4
label yaofang:
薏苡仁 酸枣仁 丹参 黄连 黄柏 苍术 神曲 厚朴 山楂 砂仁 瓜蒌皮 鸡内金 麦芽 木棉花
0.602401 0.302685 0.383796 0.480571 0.335377
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
47. 
patient tongue id: 03061450474361_4_6
label yaofang:
桂枝 甘草 柴胡 白芍 香附 当归 茯苓 薄荷 白术 白花蛇舌草 麦芽 广藿香 田基黄
0.637126 0.386131 0.495523 0.330193 0.317978
predicted yaofang:
甘草 茯苓 党参 黄芪 天麻

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
48. 
patient tongue id: 06010437439763_2_1_6
label yaofang:
甘草 党参 熟地黄 牡丹皮 山茱萸 地黄 泽泻 天麻 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲
0.984798 0.518363 0.679745 0.363412 0.312498 0.331268 0.667755 0.544008 0.543263 0.41146 0.466382 0.50399
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.384615, error: 0.583333
49. 
patient tongue id: 01070841443443_1_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 赤芍 牛膝 郁金 六神曲
0.434231 0.357417 0.401709 0.378957
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.076923, error: 0.750000
50. 
patient tongue id: 03012152059904_6_2
label yaofang:
甘草 茯苓 白术 酸枣仁 生地黄 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.882872 0.472112 0.563231 0.421961 0.464401 0.38145 0.41769 0.316616 0.318803
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.888889, recall: 0.571429, error: 0.111111
51. 
patient tongue id: 02260659592562_5
label yaofang:
甘草 玄参 栀子 牡丹皮 山药 厚朴 火麻仁 茵陈 扁豆花 虎杖 麦芽 醋鳖甲 土鳖虫 鹿衔草
0.946392 0.492029 0.607928 0.377493 0.310627 0.571759 0.432612 0.449608 0.319763 0.364883 0.374139
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
52. 
patient tongue id: 03311827135004_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄
0.348431 0.791218 0.336555 0.930044 0.575352 0.669156 0.354238 0.373171 0.3978 0.85893 0.870946 0.865568 0.901794 0.393085 0.96296 0.488051 0.435564 0.59246 0.772116
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
53. 
patient tongue id: 04271527541073_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.466309 0.32521 0.438968 0.310457 0.479613 0.547486 0.484535 0.349943 0.398356 0.310709 0.354928 0.350575 0.390645 0.319124 0.351981 0.389273 0.358502
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.705882, recall: 1.000000, error: 0.294118
54. 
patient tongue id: 04121315221338_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.361257 0.679686 0.395447 0.798089 0.4458 0.519395 0.42641 0.387446 0.336257 0.359381 0.696917 0.715637 0.73019 0.762498 0.459783 0.897117 0.39967 0.384742 0.562086 0.676012
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
55. 
patient tongue id: 01062345001684_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.454267 0.346144 0.423513 0.437446 0.347872
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
56. 
patient tongue id: 05222107503767_5_6
label yaofang:
甘草 白芍 牡蛎 麦冬 黄芪 白术 五味子 厚朴 全蝎 女贞子 首乌藤 合欢皮 墨旱莲
0.560485 0.359006 0.310904 0.36555 0.50457 0.539311 0.301009 0.402238 0.314885 0.345278
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.400000, recall: 0.307692, error: 0.600000
57. 
patient tongue id: 02190502579320_6_5
label yaofang:
甘草 白芍 川芎 羌活 党参 白术 牛膝 细辛 天麻 全蝎 白芷 蔓荆子 麦芽 蒺藜 谷精子
0.87193 0.445439 0.515156 0.330322 0.441149 0.392593 0.326091
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参 天麻 款冬花

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
58. 
patient tongue id: 03291716395055_4_7_1
label yaofang:
甘草 连翘 党参 黄芪 丹参 浙贝母 郁金 天麻 瓜蒌皮 鳖甲 王不留行 皂角刺 蜈蚣 白花蛇舌 半枝莲 红豆杉 猫爪草
0.600406 0.386917 0.518927 0.342297 0.347182 0.358082
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 天麻

------Score: precision: 0.833333, recall: 0.294118, error: 0.166667
59. 
patient tongue id: 04241857222519_1
label yaofang:
枳壳 牛蒡子 太子参 白术 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶 独脚金
0.30892 0.397473 0.396406 0.324357 0.345976 0.456433
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
60. 
patient tongue id: 04112357492654_6
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.413587 0.346901 0.354514 0.465031 0.490985 0.357431 0.302527
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
61. 
patient tongue id: 03021404368281_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.431635 0.33716 0.458599 0.300884 0.458412 0.448143 0.480704 0.38551 0.419008 0.364215 0.391275 0.416156 0.423271 0.331149 0.380815 0.413761 0.394662
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.705882, recall: 1.000000, error: 0.294118
62. 
patient tongue id: 05221851055511_7
label yaofang:
甘草 金银花 蒲公英 栀子 泽泻 车前子 大黄 瞿麦 萹蓄 黑枣 广金钱草 车前草 路路通
0.637095 0.402838 0.466498 0.356813 0.462232 0.306435
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
63. 
patient tongue id: 03290719094144_3_7_4
label yaofang:
黄芪 白术 熟地黄 浙贝母 牡丹皮 附子 山茱萸 砂仁 瓜蒌皮 益智 两头尖 桑枝 骨碎补 土鳖虫 红豆杉
0.606333 0.396264 0.410485 0.441944 0.511265 0.316631 0.358589 0.319848 0.320949 0.320508
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参 蜈蚣

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
64. 
patient tongue id: 05092239303884_1_2_6
label yaofang:
茯苓 龙齿 党参 白术 海螵蛸 砂仁 柿蒂 金樱子 鸡内金 北沙参 紫苏梗 红豆杉 合欢皮 墨旱莲
0.528457 0.392669 0.626451 0.382974 0.437181 0.318095 0.537763 0.538855 0.548526 0.581642 0.382337 0.711208 0.336027 0.360985 0.471311
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄

------Score: precision: 0.133333, recall: 0.142857, error: 0.866667
65. 
patient tongue id: 05221852115440_1
label yaofang:
川芎 陈皮 半夏 薏苡仁 丹参 槟榔 乌药 大腹皮 山楂 莱菔子 菟丝子 三七 火麻仁 鸡内金 麦芽 佛手 紫苏梗
0.547097 0.377356 0.409408 0.462426 0.456253 0.33615
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
66. 
patient tongue id: 01312125396810_1_6_4
label yaofang:
甘草 陈皮 法半夏 大枣 茯苓 远志 党参 酸枣仁 天麻 桑寄生 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲 姜黄
0.95456 0.505376 0.629111 0.389596 0.305917 0.330844 0.576842 0.489904 0.478994 0.381908 0.416867 0.428582
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.588235, error: 0.166667
67. 
patient tongue id: 03111737223806_6_4
label yaofang:
甘草 白芍 陈皮 法半夏 防风 羌活 独活 桃仁 白术 红花 钩藤 天麻 蒺藜
0.955808 0.303761 0.505369 0.620812 0.367692 0.302588 0.317654 0.591915 0.48157 0.482815 0.37516 0.408209 0.422
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.307692, error: 0.692308
68. 
patient tongue id: 04151237196063_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.309402 0.843617 0.347468 0.943347 0.624825 0.682515 0.313535 0.356689 0.397055 0.885368 0.881186 0.881153 0.916559 0.330365 0.971359 0.485226 0.39992 0.548262 0.784498
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.687500, error: 0.421053
69. 
patient tongue id: 03012314378396_6_1
label yaofang:
甘草 薏苡仁 太子参 五味子 延胡索 细辛 厚朴 天麻 鳖甲 补骨脂 莪术 苦杏仁 蜈蚣 白花蛇舌 天山雪莲
0.756337 0.434687 0.511805 0.32655 0.380294
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
70. 
patient tongue id: 03180103486846_2_1_7
label yaofang:
龙骨 黄芪 白术 丹参 厚朴 三七 桑寄生 淫羊藿 柿蒂 鸡内金 仙茅 首乌藤 紫苏梗 合欢皮
0.342385 0.310656 0.364301 0.601188 0.463386 0.454219 0.309134 0.30494 0.449513
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 砂仁 鸡内金 北沙参

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
71. 
patient tongue id: 06190143179084_1_3
label yaofang:
甘草 茯苓 党参 黄芪 枸杞子 白术 山楂 砂仁 麦芽 谷芽 紫苏梗 广藿香 麸炒枳壳
0.96589 0.519826 0.623609 0.385234 0.303861 0.338307 0.622195 0.518924 0.521992 0.405966 0.447171 0.457834
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
72. 
patient tongue id: 06071207423721_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.443189 0.3225 0.518476 0.345972 0.489769 0.494377 0.544235 0.443449 0.467877 0.432629 0.454169 0.481162 0.511893 0.366376 0.470666 0.505292 0.500397
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.647059, recall: 0.916667, error: 0.352941
73. 
patient tongue id: 05140630081675_7_6
label yaofang:
甘草 柴胡 白芍 川芎 枳壳 当归 桃仁 党参 生地黄 红花 川楝子 菟丝子 五灵脂 益母草
0.957556 0.499577 0.614573 0.369151 0.302141 0.324067 0.593853 0.465955 0.475172 0.351709 0.390697 0.404563
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.142857, error: 0.833333
74. 
patient tongue id: 04131857403040_2
label yaofang:
甘草 白芍 枳壳 茯苓 薏苡仁 白术 海螵蛸 川楝子 郁金 白茅根 泽泻 车前子 厚朴 北沙参 土鳖虫 姜黄 预知子 蛇舌草
0.573861 0.381288 0.436552 0.408062 0.464192
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.166667, error: 0.400000
75. 
patient tongue id: 05290741555504_6_2_4
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 远志 枸杞子 白术 杜仲 牛膝 天麻 桑寄生 补骨脂 首乌藤 天山雪莲 广金钱草
0.942028 0.48267 0.602162 0.424915 0.312582 0.539421 0.451401 0.477944 0.32605 0.373192 0.378398
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
76. 
patient tongue id: 02231829161766_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.344365 0.68837 0.382856 0.805387 0.462091 0.555275 0.371538 0.343995 0.302847 0.341208 0.709243 0.720696 0.747803 0.77014 0.407918 0.879492 0.420134 0.373006 0.522063 0.665825
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
77. 
patient tongue id: 04121847345684_6
label yaofang:
柴胡 白芍 黄芩 当归 茯苓 薄荷 枸杞子 白术 淡豆豉 炙甘草 百合 合欢皮
0.635372 0.381685 0.456846 0.365503 0.47002
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
78. 
patient tongue id: 05251934206841_2_6
label yaofang:
茯苓 桔梗 薏苡仁 黄芪 白术 黄连 山药 砂仁 白扁豆 炙甘草 紫苏叶 合欢皮 蛇舌草
0.480623 0.370513 0.36224 0.473257 0.395968 0.321194 0.341543
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
79. 
patient tongue id: 02260652202101_5
label yaofang:
甘草 陈皮 枳壳 黄芩 法半夏 茯苓 桔梗 党参 浙贝母 桑白皮 款冬花 苦杏仁 广藿香
0.827052 0.425184 0.403542 0.574347 0.34993 0.354434
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
80. 
patient tongue id: 05172114290997_6_4
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 天麻 菟丝子 鳖甲 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲
0.937175 0.501448 0.612519 0.406888 0.328119 0.359118 0.597768 0.515107 0.507709 0.413114 0.452729 0.470856
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
81. 
patient tongue id: 02281216141083_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.763833 0.420566 0.538512 0.304268 0.426832
predicted yaofang:
甘草 茯苓 党参 丹参 天麻

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
82. 
patient tongue id: 01121856118080_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.351938 0.731359 0.383915 0.843419 0.477161 0.580855 0.387082 0.354915 0.348594 0.749418 0.758303 0.769096 0.803799 0.407219 0.919254 0.414164 0.388832 0.545905 0.69449
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 0.937500, error: 0.210526
83. 
patient tongue id: 02142200252756_6_4
label yaofang:
甘草 川芎 党参 丹参 栀子 苍术 天麻 全蝎 磁石 白芷 蔓荆子 麦芽 首乌藤 谷精子
0.984614 0.530914 0.652147 0.381335 0.346076 0.680361 0.562599 0.566126 0.432831 0.486296 0.497624
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
84. 
patient tongue id: 04291458220299_6_7_1
label yaofang:
甘草 川芎 防风 羌活 党参 黄芪 牛膝 细辛 天麻 全蝎 白芷 鳖甲 粉葛 白花蛇舌 天山雪莲 半枝莲
0.918458 0.492475 0.574329 0.406449 0.329221 0.545534 0.445957 0.473784 0.349493 0.383056 0.393912
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
85. 
patient tongue id: 02271254434362_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.417249 0.309021 0.445681 0.409947 0.353635
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
86. 
patient tongue id: 04151230343744_1_3
label yaofang:
茯苓 防风 钩藤 荆芥穗 白芷 香薷 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.366108 0.70356 0.395791 0.819547 0.493142 0.549794 0.397117 0.39617 0.343974 0.387478 0.729798 0.746968 0.74509 0.779696 0.41288 0.898589 0.42595 0.401577 0.539626 0.677825
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.416667, error: 0.750000
87. 
patient tongue id: 01182139361636_2_6
label yaofang:
甘草 酸枣仁 浙贝母 杜仲 山药 白茅根 地黄 天麻 桑寄生 白花蛇舌草 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.977838 0.535382 0.645941 0.351935 0.324641 0.637791 0.519428 0.508791 0.40269 0.441064 0.444129
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
88. 
patient tongue id: 01050634009190_5_7
label yaofang:
甘草 羌活 独活 党参 白术 红花 延胡索 泽泻 补骨脂 忍冬藤 续断 威灵仙 狗脊 牛大力
0.941312 0.497441 0.602101 0.385779 0.321518 0.573203 0.473624 0.480991 0.371419 0.406964 0.419435
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
89. 
patient tongue id: 01070835398907_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.590409 0.379656 0.464311 0.389744 0.349698
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
90. 
patient tongue id: 01101804468373_1
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 款冬花 紫菀 百部 炙甘草 辛夷 广藿香 炒白扁豆 炒苍耳子 炒六神曲
0.329903 0.600152 0.428332 0.668124 0.449701 0.470341 0.37508 0.368202 0.310569 0.351278 0.609222 0.59567 0.578894 0.604549 0.348419 0.714446 0.377257 0.353451 0.40506 0.536177
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
91. 
patient tongue id: 05182201004368_2
label yaofang:
甘草 茯苓 葛根 麦冬 玉竹 玄参 生地黄 赤芍 牡丹皮 北沙参 百合 炒六神曲 布渣叶 干石斛
0.345124 0.766244 0.347786 0.89983 0.500809 0.602856 0.396006 0.358042 0.364671 0.814616 0.834448 0.843279 0.87866 0.443489 0.962187 0.429276 0.400941 0.624712 0.763515
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.105263, recall: 0.142857, error: 0.894737
92. 
patient tongue id: 04202032314874_1_7_4
label yaofang:
柴胡 白芍 陈皮 当归 党参 黄芪 白术 牛膝 车前子 升麻 炙甘草
0.536531 0.350298 0.49263 0.339569 0.306722
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
93. 
patient tongue id: 02182209018216_4_7_6
label yaofang:
甘草 枳壳 牛蒡子 党参 白术 浙贝母 郁金 天麻 天花粉 鳖甲 莪术 夏枯草 蜈蚣 白花蛇舌 红豆杉 有瓜石斛
0.626527 0.417172 0.466646 0.324715 0.315096 0.337818 0.324223
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 党参 款冬花

------Score: precision: 0.285714, recall: 0.125000, error: 0.714286
94. 
patient tongue id: 05251929477886_4_7
label yaofang:
枳壳 茯苓 薏苡仁 黄芪 白术 生地黄 胆南星 浙贝母 牡丹皮 杜仲 郁金 厚朴 生半夏 僵蚕 天竺黄 蜈蚣
0.547814 0.382204 0.406786 0.485241 0.446196 0.348626 0.331503
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.250000, error: 0.428571
95. 
patient tongue id: 04182145431436_2
label yaofang:
甘草 黄芩 桔梗 芦根 太子参 浙贝母 乌梅 天花粉 鳖甲 麦芽 白花蛇舌 蜂房 岗梅根 四季青
0.953974 0.509612 0.610714 0.369638 0.312157 0.579459 0.459333 0.462746 0.345553 0.382679 0.381721
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
96. 
patient tongue id: 06190814404475_7_6
label yaofang:
甘草 白芍 川芎 茯苓 羌活 酸枣仁 赤芍 牛膝 天麻 全蝎 白芷 蔓荆子 麦芽 合欢花
0.428793 0.317219 0.425135 0.31003 0.428241 0.38555 0.416316
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
97. 
patient tongue id: 02211901277018_6
label yaofang:
甘草 黄芩 砂仁 百合 紫苏叶
0.544689 0.420703 0.329566 0.479342 0.391216 0.302053
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.166667, recall: 0.200000, error: 0.833333
98. 
patient tongue id: 02251232411241_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 广藿香
0.309942 0.501858 0.410224 0.557109 0.332543 0.396553 0.357068 0.320106 0.466123 0.466028 0.529929 0.538828 0.460075 0.680459 0.317698 0.403194 0.470736
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄

------Score: precision: 0.529412, recall: 0.692308, error: 0.470588
99. 
patient tongue id: 03292022251262_1_7
label yaofang:
甘草 枳壳 半夏 黄芪 丹参 牡丹皮 钩藤 白茅根 泽泻 厚朴 砂仁 茯苓皮 苏木 北沙参 赭石
0.4754 0.338306 0.431172 0.342664 0.303484
predicted yaofang:
甘草 法半夏 茯苓 党参 黄芪

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
100. 
patient tongue id: 02171810004872_1_6
label yaofang:
川芎 大枣 当归 党参 太子参 黄芪 枸杞子 熟地黄 郁金 干姜 北柴胡 炙甘草 续断 盐菟丝子 墨旱莲 干益母草 红参
0.498337 0.394882 0.506208 0.382157 0.331989 0.302633 0.405424 0.409947 0.539954 0.503492 0.425379 0.673045 0.370555 0.443955
predicted yaofang:
法半夏 茯苓 前胡 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

------Score: precision: 0.214286, recall: 0.176471, error: 0.785714
101. 
patient tongue id: 05182022500326_1_4_6
label yaofang:
牡蛎 黄芪 白术 牛膝 厚朴 砂仁 火麻仁 莪术 北沙参 红豆杉 土茯苓 合欢皮 墨旱莲 山慈菇
0.487525 0.325953 0.36697 0.496354 0.538928 0.380447 0.305272
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
102. 
patient tongue id: 04102047028892_1_6
label yaofang:
当归 木香 牛蒡子 党参 黄芪 鸡血藤 白术 柏子仁 炙甘草 百合 紫苏叶 覆盆子 山慈菇
0.483172 0.327353 0.469115 0.318995 0.466571 0.336762 0.421552
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
103. 
patient tongue id: 06190648385281_6_7_4
label yaofang:
甘草 茯苓 木香 党参 白术 酸枣仁 牡丹皮 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红曲
0.968502 0.520663 0.647948 0.378389 0.325061 0.342687 0.638953 0.537917 0.527301 0.422526 0.467435 0.488916
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.733333, error: 0.083333
104. 
patient tongue id: 02222334070377_6_5
label yaofang:
茯苓 薏苡仁 玉竹 党参 黄芪 枸杞子 白术 赤芍 海螵蛸 杜仲 山药 当归尾 砂仁 菟丝子 巴戟天 桑寄生 芡实 鸡内金 莲子 北沙参 百合 红豆杉 合欢皮 山慈菇
0.436849 0.308258 0.375051
predicted yaofang:
黄芪 北沙参 炙甘草

------Score: precision: 0.666667, recall: 0.083333, error: 0.333333
105. 
patient tongue id: 05042105441117_4
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.538863 0.392015 0.361208 0.463819 0.409824 0.324468
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
106. 
patient tongue id: 03242119036671_1
label yaofang:
桂枝 白芍 当归 茯苓 龙骨 牡蛎 牛蒡子 党参 黄芪 白术 炙甘草 浮小麦
0.343986 0.384211 0.537082 0.407134 0.306805 0.418042 0.341186 0.483034 0.555171
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 姜半夏 炙甘草

------Score: precision: 0.444444, recall: 0.333333, error: 0.555556
107. 
patient tongue id: 03222007285542_4
label yaofang:
大枣 党参 海藻 苍术 泽泻 荷叶 决明子 紫苏叶 焦山楂 广藿香
0.304416 0.415288 0.300175 0.371376 0.313806 0.302621 0.381771 0.502185
predicted yaofang:
柴胡 白芍 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.100000, error: 0.875000
108. 
patient tongue id: 06182229164094_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 白术 砂仁 白扁豆 紫苏梗 广藿香 稻芽 火炭母 手参
0.779864 0.412585 0.510792 0.449698 0.322904 0.333319
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
109. 
patient tongue id: 03192246526398_6_1
label yaofang:
甘草 枳壳 法半夏 薏苡仁 牛膝 郁金 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986369 0.537535 0.655057 0.364149 0.332573 0.677071 0.550429 0.55322 0.420824 0.464543 0.489961
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
110. 
patient tongue id: 03231253299190_1_6
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 党参 山药 砂仁 天麻 鳖甲 麦芽 建曲 蜈蚣 白花蛇舌 天山雪莲
0.883497 0.313582 0.451801 0.591452 0.407839 0.47573 0.385968 0.413536 0.320816 0.334198
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
111. 
patient tongue id: 04210650146115_6
label yaofang:
甘草 龙骨 白术 酸枣仁 生地黄 知母 山茱萸 天麻 地骨皮 糯稻根 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.979679 0.533013 0.656675 0.37383 0.353732 0.375821 0.68266 0.567014 0.561294 0.454858 0.500761 0.537315
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
112. 
patient tongue id: 03231130264975_2_7_6
label yaofang:
甘草 党参 白术 酸枣仁 生地黄 红花 赤芍 天麻 鳖甲 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.75711 0.447304 0.521499 0.329477 0.369167 0.419277
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
113. 
patient tongue id: 01031824153244_5
label yaofang:
防风 钩藤 荆芥穗 白芷 炙甘草 首乌藤 广藿香 威灵仙 香薰 炒六神曲 炒蔓荆子 棉萆薢 醋香附
0.360966 0.779119 0.358495 0.903267 0.513236 0.601678 0.40597 0.387504 0.320137 0.377088 0.817187 0.835316 0.834866 0.870896 0.441009 0.958688 0.431576 0.402265 0.586825 0.757266
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.307692, error: 0.800000
114. 
patient tongue id: 04142235021638_1_2_6
label yaofang:
甘草 白芍 陈皮 茯苓 党参 白术 黄连 延胡索 熟地黄 槟榔 乌梅 山药 茜草 砂仁 鸡内金 麦芽
0.97324 0.514119 0.648941 0.365501 0.313367 0.612432 0.492732 0.492595 0.371226 0.40947 0.427098
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
115. 
patient tongue id: 06190941028380_1_6
label yaofang:
甘草 远志 党参 白术 熟附子 杜仲 天麻 桑寄生 鳖甲 淫羊藿 仙茅 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.944803 0.484217 0.609969 0.408643 0.332958 0.568915 0.468124 0.483082 0.349476 0.398805 0.406316
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
116. 
patient tongue id: 04071922199692_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.485832 0.319538 0.427044 0.352783 0.326547 0.303625 0.329103
predicted yaofang:
甘草 法半夏 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
117. 
patient tongue id: 05172106598638_1_2_6
label yaofang:
甘草 龙骨 远志 党参 酸枣仁 生地黄 知母 山药 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.918207 0.477785 0.582722 0.388418 0.301614 0.512795 0.384373 0.408348 0.312484 0.315949
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.500000, error: 0.200000
118. 
patient tongue id: 05270627363363_1_6
label yaofang:
甘草 白芍 枳壳 薏苡仁 白术 肉苁蓉 瓜蒌皮 鳖甲 火麻仁 莪术 苦杏仁 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.975547 0.523935 0.646435 0.365578 0.325263 0.626401 0.517266 0.512763 0.401466 0.437087 0.457219
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
119. 
patient tongue id: 03021128578741_1_2
label yaofang:
桂枝 葛根 桃仁 延胡索 杜仲 牛膝 桑寄生 桑枝 盐山萸肉 蚕沙 威灵仙 豨莶草
0.44373 0.325558 0.489322 0.319017 0.502046 0.463201 0.540012 0.429245 0.437651 0.393041 0.430695 0.464462 0.466572 0.37221 0.417399 0.446405 0.438737
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.117647, recall: 0.166667, error: 0.882353
120. 
patient tongue id: 02120806384943_1_4
label yaofang:
甘草 白芍 木香 党参 鸡血藤 山药 车前子 天麻 赤石脂 鳖甲 补骨脂 建曲 蜈蚣 天山雪莲 半枝莲
0.954461 0.509737 0.607066 0.375008 0.314638 0.595243 0.463389 0.47364 0.350949 0.393113 0.400549
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
121. 
patient tongue id: 04062139041956_1_3_4
label yaofang:
柴胡 黄芩 生地黄 红花 牛膝 茵陈 淡竹叶 补骨脂 夏枯草 地龙 蜈蚣 红豆杉 炒莱菔子 鹰不泊
0.571154 0.37742 0.448697 0.4458 0.421325
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
122. 
patient tongue id: 01180614395208_1_6
label yaofang:
甘草 法半夏 茯苓 党参 白术 黄连 赤芍 川楝子 郁金 砂仁 麦芽 佛手 合欢花 鱼古 瓦楞子
0.963511 0.509097 0.604741 0.37343 0.307208 0.59418 0.47607 0.503118 0.360309 0.401194 0.409637
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
123. 
patient tongue id: 03282208032654_6_4
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 厚朴 款冬花 苦杏仁 紫苏子 炙麻黄
0.808858 0.303548 0.451543 0.526441 0.423518 0.401814 0.308427 0.368551
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
124. 
patient tongue id: 05102150507876_1
label yaofang:
法半夏 前胡 防风 白芷 款冬花 紫菀 白前 百部 豆蔻 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.330291 0.362307 0.476762 0.35312 0.484571
predicted yaofang:
茯苓 半夏 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
125. 
patient tongue id: 02242340085717_5_6_7
label yaofang:
甘草 陈皮 茯苓 半夏 党参 何首乌 白术 赤芍 浙贝母 僵蚕 苍耳子 猫爪草
0.471285 0.354492 0.388311 0.496191 0.399206 0.322216
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
126. 
patient tongue id: 02271836001035_2_1
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄 炒苍耳子
0.333988 0.588619 0.375394 0.711323 0.396236 0.474288 0.377767 0.302874 0.313144 0.60559 0.630071 0.665032 0.695292 0.45527 0.838482 0.364119 0.34524 0.514286 0.605121
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
127. 
patient tongue id: 06091947529847_5
label yaofang:
甘草 前胡 桔梗 连翘 薄荷 芦根 牛蒡子 浙贝母 桑叶 菊花 桑白皮 白前 苦杏仁 辛夷 龙脷叶 紫苑 东风桔
0.485544 0.382728 0.438629 0.311249 0.325353
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.058824, error: 0.800000
128. 
patient tongue id: 03211948506700_1
label yaofang:
陈皮 桔梗 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.433002 0.354473 0.482898 0.346042 0.442454 0.367648 0.369088 0.451306
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.100000, error: 0.875000
129. 
patient tongue id: 01040319436005_6_2
label yaofang:
甘草 白芍 陈皮 法半夏 茯苓 薏苡仁 远志 党参 赤芍 山药 豆蔻 川木瓜 宽筋藤
0.902297 0.492531 0.572697 0.335368 0.545252 0.357645 0.366611
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
130. 
patient tongue id: 04221908136790_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.380734 0.781557 0.373884 0.907319 0.541583 0.634079 0.401888 0.395082 0.32859 0.40092 0.825607 0.832109 0.835344 0.871139 0.424167 0.95306 0.472196 0.431683 0.595634 0.757607
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
131. 
patient tongue id: 02181558053229_5
label yaofang:
甘草 川芎 黄芩 桔梗 金银花 浙贝母 细辛 白芷 蔓荆子 辛夷 广藿香 苍耳子
0.905418 0.479948 0.57213 0.396042 0.303546 0.51052 0.419391 0.440958 0.325324 0.352585 0.361603
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.083333, error: 0.909091
132. 
patient tongue id: 04282030496500_5
label yaofang:
甘草 白芍 茯苓 党参 生地黄 延胡索 杜仲 菟丝子 桑寄生 金樱子 蛇床子 忍冬藤 威灵仙 覆盆子
0.928029 0.319078 0.468361 0.603751 0.375281 0.485651 0.373265 0.376014 0.304415
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
133. 
patient tongue id: 04282226353920_5
label yaofang:
甘草 黄芩 桔梗 芦根 牛蒡子 黄连 浙贝母 天花粉 鳖甲 诃子 板蓝根 白花蛇舌 蜂房 四季青 广升麻
0.982445 0.546248 0.649783 0.359596 0.320579 0.344301 0.67893 0.5567 0.552997 0.438699 0.48288 0.496506
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
134. 
patient tongue id: 02231903278259_4
label yaofang:
陈皮 法半夏 茯苓 党参 海螵蛸 干姜 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 炙黄芪 甘松
0.330765 0.5593 0.446204 0.583178 0.393665 0.420281 0.383669 0.354176 0.320884 0.325823 0.525389 0.526324 0.521797 0.537789 0.371696 0.701424 0.337952 0.328023 0.380462 0.49613
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.461538, error: 0.700000
135. 
patient tongue id: 02211430590842_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.354951 0.332096 0.326734 0.405796 0.431332 0.333226
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
136. 
patient tongue id: 02150738158983_1_4_7
label yaofang:
甘草 薏苡仁 麦冬 太子参 枸杞子 丹参 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 黄精 三七粉
0.43562 0.370347 0.376081 0.416029 0.320415
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
137. 
patient tongue id: 03012031030916_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.30957 0.551142 0.409365 0.565791 0.386922 0.397236 0.339518 0.336798 0.332849 0.316646 0.479414 0.553513 0.490979 0.518516 0.768878 0.316809 0.432367
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄

------Score: precision: 0.705882, recall: 0.857143, error: 0.294118
138. 
patient tongue id: 01041841399491_1_2
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香
0.352888 0.748745 0.392627 0.857428 0.50111 0.5732 0.392226 0.382091 0.311406 0.358416 0.768217 0.769099 0.766687 0.805137 0.390329 0.920002 0.424683 0.376534 0.528954 0.697005
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
139. 
patient tongue id: 03231413372451_1_2
label yaofang:
甘草 白芍 当归 茯苓 党参 黄芪 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲 红豆杉
0.87446 0.33585 0.438223 0.578484 0.386908 0.432706 0.312887 0.360521
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 1.000000, recall: 0.571429, error: 0.000000
140. 
patient tongue id: 03040901036714_2_1
label yaofang:
甘草 白芍 茯苓 玉竹 党参 太子参 丹参 山药 砂仁 扁豆花 北沙参 女贞子 黄精
0.84359 0.324192 0.442937 0.553966 0.384746 0.373025 0.303282
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
141. 
patient tongue id: 04122203019282_2_6
label yaofang:
甘草 白芍 茯苓 龙骨 党参 酸枣仁 生地黄 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.819268 0.436818 0.533004 0.417651 0.377036 0.343858
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
142. 
patient tongue id: 04150843040441
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.433825 0.311288 0.387897 0.467256 0.504118 0.441033 0.365103 0.301199 0.313065
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻 车前子

------Score: precision: 0.555556, recall: 0.416667, error: 0.444444
143. 
patient tongue id: 04111954484446_1_4_7
label yaofang:
甘草 枳壳 半夏 牛蒡子 薏苡仁 黄芪 枸杞子 赤芍 海螵蛸 杜仲 黄柏 牛膝 山药 厚朴 鳖甲 北沙参 紫苏梗 黑枣 骨碎补 红豆杉 蛇舌草 稻芽
0.532829 0.343841 0.408908 0.545327 0.429365 0.369715 0.315726
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.181818, error: 0.428571
144. 
patient tongue id: 04101902372169_4
label yaofang:
法半夏 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.354129 0.767317 0.355064 0.902115 0.547456 0.62398 0.378542 0.384813 0.3146 0.39422 0.823869 0.837802 0.831931 0.870993 0.405676 0.948002 0.460799 0.419607 0.572745 0.745099
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 1.000000, error: 0.400000
145. 
patient tongue id: 05081759003586_1
label yaofang:
柴胡 白芍 川芎 陈皮 枳壳 麦冬 郁金 瓜蒌皮 炙甘草 醋香附 合欢皮
0.413717 0.410832 0.307684 0.437813 0.361074 0.385708
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
146. 
patient tongue id: 01172231285116_3_6
label yaofang:
桂枝 甘草 法半夏 茯苓 前胡 党参 酸枣仁 五味子 郁金 细辛 鳖甲 麦芽 紫苏子 白花蛇舌 天山雪莲
0.942457 0.307807 0.491868 0.614925 0.381963 0.545331 0.454506 0.446913 0.34459 0.380653 0.388651
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
147. 
patient tongue id: 01211310480827_4
label yaofang:
柴胡 白芍 当归 茯苓 薄荷 白术 栀子 淡豆豉 秦艽 炙甘草 嫩桑枝 丝瓜络 首乌藤 威灵仙
0.684139 0.393683 0.518369 0.349116 0.413933
predicted yaofang:
甘草 茯苓 党参 丹参 天麻

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
148. 
patient tongue id: 04122201154543_6_4
label yaofang:
甘草 柴胡 白芍 党参 延胡索 牡丹皮 山药 车前子 荆芥穗 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.953882 0.513129 0.624057 0.39557 0.325396 0.349296 0.611872 0.527542 0.525746 0.419082 0.465286 0.491457
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.529412, error: 0.250000
149. 
patient tongue id: 06181835371604_6_2
label yaofang:
甘草 茯苓 龙骨 党参 白术 酸枣仁 栀子 黄柏 山药 山茱萸 女贞子 粉葛 浮小麦 百合 墨旱莲
0.966449 0.50849 0.626764 0.391262 0.337636 0.61095 0.516342 0.520315 0.398874 0.439908 0.456269
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
150. 
patient tongue id: 04012004092485_2_5
label yaofang:
桔梗 荆芥 防风 牛蒡子 薏苡仁 酸枣仁 乳香 没药 苦杏仁 炙甘草 浮小麦 木棉花 东风桔 咸竹蜂
0.340106 0.558046 0.427862 0.61453 0.404188 0.442398 0.381621 0.35766 0.315951 0.334547 0.546594 0.557677 0.573809 0.595217 0.401606 0.7174 0.355899 0.349573 0.451272 0.53713
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.214286, error: 0.850000
151. 
patient tongue id: 05102010299083_1_2
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草
0.365088 0.78106 0.402308 0.885158 0.528234 0.577229 0.412324 0.406063 0.342006 0.373286 0.799463 0.803039 0.802277 0.834257 0.406877 0.935245 0.432871 0.398577 0.565578 0.733189
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 1.000000, error: 0.400000
152. 
patient tongue id: 03291630117153_1_2
label yaofang:
甘草 陈皮 法半夏 当归 茯苓 桃仁 远志 党参 黄连 厚朴 天花粉 款冬花 苦杏仁 丝瓜络 紫苏梗
0.976221 0.520939 0.651327 0.361505 0.308873 0.616551 0.49892 0.49503 0.374875 0.413481 0.429328
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
153. 
patient tongue id: 05231939082258_1_2
label yaofang:
甘草 葛根 防风 麦冬 玉竹 黄芪 玄参 细辛 荷叶 白芷 北沙参 辛夷 广藿香 炒苍耳子
0.307018 0.530686 0.379046 0.644394 0.357527 0.429385 0.339089 0.536287 0.545672 0.579402 0.626939 0.46518 0.778788 0.32421 0.435002 0.513277
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄

------Score: precision: 0.187500, recall: 0.214286, error: 0.812500
154. 
patient tongue id: 06070043282206_4_7_1
label yaofang:
甘草 法半夏 茯苓 薏苡仁 远志 白术 酸枣仁 黄连 红花 天麻 僵蚕 紫草 忍冬藤 蒺藜 首乌藤
0.970313 0.521533 0.637625 0.375423 0.315828 0.337701 0.627502 0.526037 0.522423 0.416746 0.451841 0.47286
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
155. 
patient tongue id: 02142340280552_1_2_7
label yaofang:
甘草 川芎 葛根 黄芪 枸杞子 天麻 白花蛇舌草 地龙 蒺藜 首乌藤 蜈蚣 半枝莲 醋鳖甲 酒女贞子 墨旱莲
0.935907 0.473775 0.58495 0.438582 0.32869 0.547027 0.466656 0.516349 0.341727 0.399101 0.417361
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
156. 
patient tongue id: 03012131157992_2_5_1
label yaofang:
甘草 茯苓 薏苡仁 白术 酸枣仁 熟附子 天麻 鳖甲 莪术 败酱草 蒺藜 浮小麦 蜈蚣 天山雪莲 半枝莲 红豆杉
0.911683 0.476888 0.588279 0.396163 0.323676 0.538699 0.446048 0.456223 0.341774 0.379878 0.369108
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
157. 
patient tongue id: 04201449199635_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.374519 0.359768 0.439977 0.355872 0.400039 0.503506 0.457183 0.3385 0.382523 0.420257 0.37797 0.359737 0.411917 0.382093 0.421998 0.408502
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.687500, recall: 0.916667, error: 0.312500
158. 
patient tongue id: 05022023535253_6_4
label yaofang:
甘草 柴胡 白芍 茯苓 党参 延胡索 川楝子 天麻 五灵脂 鳖甲 麦芽 蜈蚣 天山雪莲 半枝莲 红豆杉
0.958682 0.508355 0.61235 0.375451 0.30869 0.584242 0.464029 0.474101 0.347242 0.385189 0.388665
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
159. 
patient tongue id: 03020730260303_6
label yaofang:
桂枝 甘草 黄芩 茯苓 桔梗 桃仁 青皮 浙贝母 牡丹皮 郁金 蔓荆子 益母草 辛夷 炒苍耳子
0.877896 0.452843 0.569009 0.424748 0.465265 0.391605 0.431618 0.332089 0.345899
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.222222, recall: 0.142857, error: 0.777778
160. 
patient tongue id: 05092051183077_6_4
label yaofang:
柴胡 大枣 茯苓 防风 连翘 太子参 昆布 海藻 乌梅 石斛 白花蛇舌草 猫爪草 山慈菇
0.366496 0.365504 0.49291 0.354051 0.410931 0.350802 0.427025 0.515334
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.076923, error: 0.875000
161. 
patient tongue id: 05032258200734_2_6
label yaofang:
甘草 白术 玄参 生地黄 钩藤 厚朴 天麻 地骨皮 肉苁蓉 火麻仁 决明子 瓜蒌子 浮小麦
0.914557 0.485227 0.588889 0.412887 0.31465 0.350105 0.560862 0.488075 0.492793 0.388292 0.427728 0.446763
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.230769, error: 0.750000
162. 
patient tongue id: 01012048352078_1_5
label yaofang:
甘草 当归 茯苓 木香 党参 黄芪 酸枣仁 丹参 郁金 浮小麦 首乌藤 制远志
0.74876 0.435464 0.506941 0.304946 0.332071 0.376508
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
163. 
patient tongue id: 03032011488364_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 细辛 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷 广藿香
0.361624 0.811503 0.385249 0.91318 0.547073 0.622693 0.397943 0.395916 0.310641 0.376805 0.840114 0.839267 0.837836 0.869372 0.406076 0.956179 0.451488 0.401134 0.589675 0.759576
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
164. 
patient tongue id: 02130442450613_2_1_6
label yaofang:
甘草 枳壳 茯苓 远志 党参 酸枣仁 生地黄 天麻 地榆 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.974688 0.518112 0.639898 0.351124 0.31006 0.618382 0.495201 0.491333 0.378706 0.412255 0.433773
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
165. 
patient tongue id: 02211419567915_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.343545 0.33882 0.38802 0.338602 0.3824 0.309706 0.36147
predicted yaofang:
甘草 白芍 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
166. 
patient tongue id: 02212223393659_4_7
label yaofang:
独活 薏苡仁 党参 白术 红花 延胡索 黄柏 苍术 桑寄生 锁阳 续断 威灵仙 牛大力
0.954705 0.504253 0.616233 0.374235 0.307393 0.586607 0.459881 0.461125 0.343489 0.385714 0.383826
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
167. 
patient tongue id: 01250628409091_1_6
label yaofang:
甘草 柴胡 白芍 法半夏 龙骨 远志 党参 酸枣仁 天麻 白花蛇舌草 麦芽 首乌藤 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.980941 0.52683 0.641814 0.382876 0.342099 0.669696 0.550747 0.55716 0.412152 0.474748 0.488252
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
168. 
patient tongue id: 03021846577205_5_7_1
label yaofang:
甘草 薏苡仁 桃仁 黄芪 白术 浙贝母 杜仲 生半夏 砂仁 地榆 槐花 鸡内金 土鳖虫 红豆杉 蛇舌草
0.363875 0.339337 0.395843 0.323598 0.403472 0.478755 0.430181 0.306249 0.360248 0.351608 0.340062 0.355237 0.34656 0.322019 0.357002 0.350106
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌

------Score: precision: 0.187500, recall: 0.200000, error: 0.812500
169. 
patient tongue id: 04250817536434_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.510439 0.36979 0.447523 0.477488 0.32008
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
170. 
patient tongue id: 05312146451705_7_2_1
label yaofang:
甘草 薏苡仁 党参 白术 熟附子 红花 天麻 鳖甲 补骨脂 败酱草 续断 蜈蚣 天山雪莲 半枝莲
0.964585 0.509219 0.625355 0.370284 0.312667 0.599228 0.465214 0.475096 0.347212 0.39085 0.39655
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
171. 
patient tongue id: 05182111457598_4
label yaofang:
玉竹 牛膝 大黄 萆薢 天山雪莲 土茯苓
0.368188 0.502241 0.388964 0.328726 0.368272 0.333507 0.476538 0.561013
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
172. 
patient tongue id: 03090754552358_6_4
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 杜仲 山药 桑寄生 鳖甲 麦芽 首乌藤 合欢花 土鳖虫 鹿衔草
0.830657 0.430809 0.527026 0.303633 0.470834 0.30522 0.402301 0.312525 0.414287
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
173. 
patient tongue id: 03231846164081_2_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 威灵仙 蜜麻黄
0.34911 0.699991 0.367524 0.820962 0.456791 0.574034 0.378805 0.336857 0.309206 0.353565 0.712781 0.734358 0.767138 0.789864 0.423567 0.902029 0.423321 0.38602 0.53271 0.677924
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
174. 
patient tongue id: 03161311579397_4
label yaofang:
法半夏 前胡 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 广藿香 蜜麻黄 炒苍耳子
0.363408 0.631046 0.397196 0.746633 0.444156 0.510421 0.399049 0.362209 0.316016 0.361871 0.660314 0.667762 0.685337 0.712186 0.439625 0.82375 0.410262 0.38959 0.527125 0.628583
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
175. 
patient tongue id: 01132319507389_6_7
label yaofang:
桂枝 柴胡 白芍 黄芩 大枣 党参 杜仲 苍术 秦艽 姜半夏 炙甘草 续断 首乌藤
0.77804 0.414197 0.537652 0.374708 0.329252
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
176. 
patient tongue id: 05131451395188_2_6
label yaofang:
甘草 白芍 太子参 生地黄 浙贝母 乌梅 山药 山茱萸 鳖甲 北沙参 百合 白花蛇舌 蜂房 岗梅根 四季青
0.956489 0.513701 0.618531 0.382712 0.30698 0.333209 0.597142 0.503814 0.497579 0.3966 0.431291 0.439865
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
177. 
patient tongue id: 01312129035283_6_4
label yaofang:
甘草 陈皮 法半夏 茯苓 薏苡仁 白术 厚朴 豆蔻 麦芽 丝瓜络 紫苏梗 广藿香 麸炒枳壳
0.914996 0.478517 0.570168 0.374332 0.507856 0.381667 0.398428 0.310429 0.317172
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
178. 
patient tongue id: 05261945508635_1_4_7
label yaofang:
甘草 陈皮 半夏 黄芪 白术 海螵蛸 杜仲 牛膝 山药 厚朴 僵蚕 桑寄生 鸡内金 紫苏梗 蜈蚣 红豆杉
0.585033 0.378247 0.446791 0.390597 0.445653
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
179. 
patient tongue id: 03242140505960_4
label yaofang:
柴胡 白芍 香附 枳壳 丹参 海螵蛸 浙贝母 豆蔻 姜半夏 紫苏梗
0.332275 0.300228 0.381673 0.385542 0.378805 0.308551 0.432432
predicted yaofang:
甘草 柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.300000, error: 0.571429
180. 
patient tongue id: 03181805202709_2_6
label yaofang:
甘草 茯苓 太子参 白术 五味子 浙贝母 郁金 山药 山茱萸 天麻 鳖甲 淫羊藿 补骨脂 蜈蚣 白花蛇舌 天山雪莲 川加皮
0.737242 0.414946 0.480213 0.358554 0.470703 0.314941
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.235294, error: 0.333333
181. 
patient tongue id: 04052109590585_5_1
label yaofang:
茯苓 半夏 薏苡仁 白术 车前子 厚朴 僵蚕 赤小豆 火麻仁 豆蔻 决明子 地龙 广藿香 木棉花
0.353744 0.451857 0.315365 0.32176 0.371247 0.387048 0.339523 0.413291 0.55073
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.111111, recall: 0.071429, error: 0.888889
182. 
patient tongue id: 04112215261003_6_2
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 天麻 鳖甲 佛手 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.902132 0.300166 0.477846 0.604155 0.388198 0.304784 0.511187 0.411192 0.409804 0.306923 0.342671 0.348664
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
183. 
patient tongue id: 04112351041774_7_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 白芷 蔓荆子 炙甘草 百合 紫苏叶
0.333974 0.350037 0.474293 0.342147 0.408849 0.354003 0.402038 0.497453
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
184. 
patient tongue id: 06132200268113_6_4
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 白花蛇舌草 炙甘草 百合 紫苏叶 山慈菇
0.392224 0.524684 0.406381 0.327423 0.368809 0.351001 0.327483 0.540306 0.63526
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
185. 
patient tongue id: 04182149490929_6
label yaofang:
甘草 茯苓 党参 白术 延胡索 牡丹皮 杜仲 山药 桑寄生 补骨脂 王不留行 麦芽 威灵仙 合欢花
0.970096 0.51882 0.631434 0.368746 0.318266 0.61509 0.49357 0.496205 0.371102 0.412946 0.417601
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
186. 
patient tongue id: 05232159081194_1_6
label yaofang:
白芍 川芎 法半夏 当归 茯苓 木香 丹参 川楝子 郁金 北柴胡 炙甘草 麸炒白术 醋香附 麸炒枳壳
0.341762 0.364801 0.349212 0.373371 0.306712 0.344542 0.440568 0.543339
predicted yaofang:
法半夏 茯苓 前胡 黄芪 紫菀 百部 北沙参 炙甘草

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
187. 
patient tongue id: 04200629521828_1
label yaofang:
甘草 白芍 独活 党参 白术 生地黄 红花 延胡索 桑寄生 补骨脂 锁阳 续断 牛大力 千斤拔
0.69986 0.335931 0.373677 0.518032 0.397221
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
188. 
patient tongue id: 04122149059520_1_4
label yaofang:
甘草 白芍 赤芍 杜仲 天麻 桑寄生 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜 宽筋藤 田七末
0.922869 0.476219 0.575623 0.443991 0.322631 0.513558 0.435053 0.483085 0.31185 0.370423 0.388364
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
189. 
patient tongue id: 06181844151612_4_6_1
label yaofang:
甘草 茯苓 薏苡仁 党参 黄芪 延胡索 浙贝母 郁金 山药 细辛 天麻 鳖甲 莪术 粉葛 蜈蚣 白花蛇舌 天山雪莲
0.879604 0.364808 0.450472 0.589615 0.383432 0.445713 0.350793 0.357403
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.352941, error: 0.250000
190. 
patient tongue id: 03012212494887_2_5_6
label yaofang:
甘草 香附 黄芩 茯苓 连翘 党参 白术 酸枣仁 丹参 生地黄 山药 地骨皮 白芷 菟丝子 益母草 皂角刺
0.961571 0.506511 0.629476 0.370588 0.319314 0.608284 0.492169 0.491898 0.368135 0.414068 0.424522
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
191. 
patient tongue id: 04141827283444_5_1
label yaofang:
荆芥 薄荷 浙贝母 僵蚕 苦杏仁 紫苏子 蝉蜕 紫苏叶 木蝴蝶 龙脷叶 紫苑
0.504712 0.356236 0.403381 0.415793 0.479053
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
192. 
patient tongue id: 01050649249746_7_4
label yaofang:
甘草 川芎 法半夏 茯苓 枸杞子 白术 牛膝 石菖蒲 天麻 僵蚕 蒺藜 粉葛 首乌藤
0.929911 0.313691 0.492419 0.596444 0.386694 0.307128 0.335167 0.56815 0.481823 0.480104 0.386489 0.41617 0.434533
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.307692, error: 0.692308
193. 
patient tongue id: 05232002187688_1
label yaofang:
桂枝 甘草 白芍 陈皮 茯苓 半夏 薏苡仁 黄芪 白术 杜仲 厚朴 僵蚕 肉苁蓉 巴戟天 补骨脂 续断 粉葛 紫苏叶 五指毛桃
0.500289 0.356998 0.395332 0.522684 0.403737 0.351202 0.324709
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.714286, recall: 0.263158, error: 0.285714
194. 
patient tongue id: 04210038371795_2_1_7
label yaofang:
甘草 龙骨 党参 酸枣仁 牡丹皮 地黄 青蒿 天麻 地骨皮 胡黄连 白花蛇舌草 浮小麦 醋龟甲 蜈蚣 半枝莲 醋鳖甲
0.943051 0.306371 0.499976 0.606449 0.375322 0.3096 0.325356 0.574563 0.468432 0.466561 0.368109 0.398031 0.414264
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.461538, recall: 0.375000, error: 0.538462
195. 
patient tongue id: 05131629477984_6_1
label yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 麦芽 粉葛 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.935394 0.481766 0.611061 0.377094 0.309598 0.329038 0.571712 0.434034 0.44281 0.328279 0.373223 0.392075
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
196. 
patient tongue id: 05251954568370_4_7
label yaofang:
甘草 牡蛎 薏苡仁 黄芪 白术 浙贝母 莪术 鸡内金 北沙参 橘络 合欢皮 墨旱莲
0.577851 0.388898 0.471581 0.41279 0.336693 0.307335 0.320246
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 丹参 天麻

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
197. 
patient tongue id: 03151339340493_4
label yaofang:
甘草 前胡 桔梗 防风 薄荷 荆芥穗 白芷 紫菀 百部 辛夷 紫苏梗 广藿香
0.360597 0.67034 0.396194 0.779416 0.448282 0.531467 0.417609 0.363124 0.325676 0.359527 0.681973 0.692935 0.719689 0.748824 0.427321 0.875637 0.394773 0.389401 0.532707 0.666426
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.666667, error: 0.600000
198. 
patient tongue id: 04222055319770_9
label yaofang:
陈皮 防风 党参 钩藤 砂仁 天麻 白芷 石决明 炙甘草 首乌藤 广藿香 麸炒白术 炙黄芪 甘松 炒蔓荆子 棉萆薢
0.364163 0.787921 0.360311 0.916197 0.575922 0.655428 0.365263 0.387028 0.310994 0.410674 0.843772 0.84868 0.84381 0.880101 0.389082 0.949501 0.496777 0.436605 0.582091 0.756255
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.312500, error: 0.750000
199. 
patient tongue id: 04122337368778_6_4
label yaofang:
甘草 茯苓 薏苡仁 白术 郁金 山药 厚朴 鳖甲 扁豆花 莪术 粉葛 白花蛇舌 天山雪莲
0.97205 0.507562 0.640145 0.390139 0.300741 0.341288 0.635045 0.538155 0.53885 0.413473 0.463633 0.480908
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.538462, error: 0.416667
200. 
patient tongue id: 05311938383347_1_6
label yaofang:
柴胡 香附 麦冬 黄芪 白术 酸枣仁 五味子 决明子 珍珠母 北沙参 合欢皮
0.558708 0.355633 0.301712 0.372416 0.488578 0.53836 0.30527 0.4003 0.316984 0.339972
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.300000, recall: 0.272727, error: 0.700000
201. 
patient tongue id: 02182148324994_2_6
label yaofang:
甘草 党参 生地黄 郁金 山药 山茱萸 泽泻 车前子 海金沙 鸡内金 王不留行 川木瓜 广金钱草 土茯苓 石苇
0.973644 0.523205 0.638304 0.362319 0.318591 0.628969 0.502092 0.501205 0.376105 0.421206 0.42678
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
202. 
patient tongue id: 01250641411603_6_1_7
label yaofang:
甘草 柴胡 白芍 党参 酸枣仁 丹参 砂仁 天麻 鳖甲 柿蒂 佛手 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.977794 0.533537 0.635272 0.386893 0.344598 0.657556 0.543353 0.545297 0.420181 0.469539 0.484168
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
203. 
patient tongue id: 05290752497715_5_6
label yaofang:
甘草 法半夏 前胡 桔梗 桃仁 远志 浙贝母 天麻 鳖甲 炙甘草 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.96247 0.509253 0.62712 0.380267 0.314224 0.587333 0.476305 0.476639 0.353752 0.396267 0.402535
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
204. 
patient tongue id: 05252014335896_4_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 豆蔻 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.462982 0.343919 0.462468 0.300881 0.46019 0.386694 0.308975 0.402865
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.142857, error: 0.750000
205. 
patient tongue id: 02141843293517_4
label yaofang:
陈皮 法半夏 前胡 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄 炒六神曲
0.352115 0.653044 0.41027 0.750583 0.447692 0.514256 0.399636 0.368415 0.318005 0.357882 0.665642 0.673718 0.690889 0.716117 0.419713 0.840347 0.405975 0.376316 0.519212 0.634769
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
206. 
patient tongue id: 04142212255112_5_6_7
label yaofang:
薏苡仁 黄芪 白术 赤芍 浙贝母 山药 生半夏 砂仁 补骨脂 土鳖虫 红豆杉 山慈菇 预知子 蛇舌草 石榴皮
0.300977 0.373338 0.387652 0.344876 0.341511 0.487507
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
207. 
patient tongue id: 03271333097677_4
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 防风 细辛 款冬花 紫菀 白前 百部 蜜麻黄
0.323254 0.570474 0.389508 0.658379 0.378671 0.464106 0.363637 0.552441 0.567238 0.633351 0.637061 0.444676 0.768667 0.363673 0.315952 0.447238 0.558875
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.588235, recall: 0.833333, error: 0.411765
208. 
patient tongue id: 02212032021886_1
label yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 红花 延胡索 山茱萸 桑寄生 补骨脂 沙苑子 姜黄 牛大力 千斤拔
0.837521 0.325341 0.448772 0.546151 0.38688 0.428197 0.314971 0.359557
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.333333, error: 0.375000
209. 
patient tongue id: 02141955547297_1
label yaofang:
麻黄 桂枝 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 龙脷叶
0.53234 0.321589 0.34787 0.476694 0.30355
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
210. 
patient tongue id: 04051856191728_4
label yaofang:
法半夏 前胡 防风 薄荷 荆芥穗 白芷 北柴胡 款冬花 紫菀 白前 百部 炙甘草 广藿香 蜜麻黄
0.365918 0.687606 0.396622 0.802042 0.475108 0.531141 0.413114 0.390945 0.350857 0.380996 0.707233 0.727768 0.736633 0.768698 0.434128 0.885884 0.419588 0.393921 0.553312 0.678662
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
211. 
patient tongue id: 03211950166651_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗
0.705593 0.334564 0.414763 0.522284 0.353849 0.337492
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
212. 
patient tongue id: 04112353136101_5
label yaofang:
柴胡 白芍 香附 枳壳 蒲公英 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.361268 0.50315 0.37175 0.324581 0.355736 0.343157 0.323181 0.483093 0.586834
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.777778, recall: 0.583333, error: 0.222222
213. 
patient tongue id: 02151816080847_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.396876 0.30289 0.395546 0.573548 0.348016 0.30302
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
214. 
patient tongue id: 03291356426592_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 桃仁 丹参 赤芍 青皮 栀子 牡丹皮 郁金 天花粉 瓜蒌皮 王不留行
0.941536 0.495331 0.601935 0.369496 0.526242 0.410993 0.420657 0.333573 0.345674
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.111111, recall: 0.071429, error: 0.888889
215. 
patient tongue id: 06070022342291_1_6
label yaofang:
甘草 柴胡 白芍 茯苓 木香 党参 酸枣仁 槟榔 山药 桑叶 厚朴 砂仁 五灵脂 浮小麦 合欢花
0.952265 0.493781 0.624833 0.392191 0.329067 0.58386 0.498026 0.495882 0.38559 0.426567 0.441889
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
216. 
patient tongue id: 05160621245319_5
label yaofang:
陈皮 茯苓 半夏 薏苡仁 延胡索 浙贝母 牛膝 白茅根 厚朴 砂仁 土茯苓 山慈菇 蛇舌草 鲜龙葵果
0.40871 0.38272 0.337716 0.306863 0.493949 0.428165 0.355961 0.42493
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
217. 
patient tongue id: 03081839403859_4
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.452113 0.3789 0.412323 0.353752 0.484407 0.41775 0.347051 0.589149
predicted yaofang:
法半夏 茯苓 前胡 防风 白前 百部 北沙参 炙甘草

------Score: precision: 0.875000, recall: 0.466667, error: 0.125000
218. 
patient tongue id: 03171112566406_1_3
label yaofang:
黄芩 桃仁 丹参 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.3614 0.317587 0.465228 0.342147 0.452541 0.450237 0.506666 0.391566 0.419287 0.421617 0.43073 0.483459 0.450151 0.301484 0.413252 0.446319 0.460245
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.647059, recall: 0.916667, error: 0.352941
219. 
patient tongue id: 02260421436767_6_1_5
label yaofang:
甘草 白芍 酸枣仁 牡丹皮 山药 地黄 天麻 紫菀 白花蛇舌草 浮小麦 蜈蚣 半枝莲 醋鳖甲 化橘红
0.922135 0.310273 0.48499 0.584727 0.383297 0.317956 0.542239 0.44292 0.453747 0.345185 0.373385 0.388055
predicted yaofang:
甘草 白芍 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
220. 
patient tongue id: 02211902445582_6_4
label yaofang:
柴胡 白芍 香附 枳壳 牛蒡子 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.368658 0.507154 0.364019 0.344857 0.349142 0.373929 0.530699 0.681719 0.306814
predicted yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.777778, recall: 0.636364, error: 0.222222
221. 
patient tongue id: 04241931050225_1
label yaofang:
白芍 木香 桃仁 麦冬 玉竹 太子参 丹参 玄参 赤芍 枳实 地黄 车前子 厚朴 莱菔子 火麻仁 北沙参 苦杏仁
0.693533 0.366338 0.389478 0.503291 0.402998
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.058824, error: 0.800000
222. 
patient tongue id: 05140736422531_6_5
label yaofang:
甘草 白芍 茯苓 党参 白术 黄连 延胡索 乌梅 山药 蒲黄 砂仁 五灵脂 建曲 醋香附 合欢花
0.939063 0.493349 0.600506 0.386095 0.535177 0.425982 0.437074 0.312847 0.349664 0.353849
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
223. 
patient tongue id: 01120050012119_5
label yaofang:
陈皮 黄芩 竹茹 砂仁 冬瓜皮 辛夷 广藿香 苍耳子
0.792494 0.424824 0.541575 0.334936 0.345127 0.485422
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
224. 
patient tongue id: 06071941569092_1_4
label yaofang:
甘草 薏苡仁 党参 鸡血藤 白术 生地黄 赤芍 杜仲 天麻 鳖甲 桑枝 蜈蚣 天山雪莲 半枝莲 红豆杉
0.960809 0.514474 0.627131 0.379675 0.320757 0.592374 0.479492 0.480875 0.362021 0.404555 0.413343
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
225. 
patient tongue id: 05092142560025_6
label yaofang:
甘草 川芎 党参 白术 丹参 牡丹皮 牛膝 决明子 地龙 蒺藜 女贞子 首乌藤 合欢花 墨旱莲
0.962487 0.515461 0.61853 0.363554 0.308434 0.601394 0.477196 0.483995 0.362459 0.401238 0.408472
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
226. 
patient tongue id: 01092331195871_1_2
label yaofang:
当归 茯苓 党参 枸杞子 白术 生地黄 黄柏 牛膝 知母 炙甘草 续断 玉米须 狗脊 龟甲
0.541141 0.357634 0.414175 0.432157 0.475068
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
227. 
patient tongue id: 02141954379112_1
label yaofang:
乌药 金樱子 益智 覆盆子
0.824792 0.342576 0.435871 0.563291 0.384282 0.395082
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
228. 
patient tongue id: 01070832228124_1_4_7
label yaofang:
人参 当归 黄芪 乌药 山药 肉苁蓉 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.38964 0.303259 0.606535 0.370244 0.467278 0.53127 0.623251 0.503501 0.509364 0.529231 0.51925 0.513453 0.629117 0.385573 0.573413 0.61405 0.599924
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.058824, recall: 0.076923, error: 0.941176
229. 
patient tongue id: 03151853495905_2_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香 蜜麻黄
0.378954 0.732123 0.399685 0.840991 0.489709 0.552508 0.431202 0.411835 0.347877 0.386714 0.755888 0.761186 0.771187 0.799122 0.444955 0.910227 0.4288 0.402727 0.581118 0.710489
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
230. 
patient tongue id: 03041422455844_3_5_6
label yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 酸枣仁 丹参 熟附子 山茱萸 桑白皮 大黄 荆芥穗 菟丝子 益母草 款冬花
0.97456 0.523121 0.645385 0.379375 0.335364 0.639714 0.52472 0.523454 0.401384 0.450482 0.453993
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
231. 
patient tongue id: 03301244159472_4
label yaofang:
法半夏 前胡 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 炒苍耳子
0.36619 0.814541 0.357593 0.932281 0.565376 0.670114 0.366603 0.388523 0.303092 0.396707 0.863691 0.864996 0.861878 0.896045 0.38328 0.961563 0.490457 0.431827 0.584304 0.773673
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
232. 
patient tongue id: 04061349068885_5_6
label yaofang:
甘草 枳壳 黄芩 牡蛎 薏苡仁 杜仲 牛膝 钩藤 泽泻 天麻 桑寄生 豆蔻 麦芽
0.961201 0.508777 0.618571 0.380962 0.310746 0.580076 0.473128 0.478708 0.358417 0.395764 0.40873
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
233. 
patient tongue id: 03301924065599_2
label yaofang:
陈皮 法半夏 前胡 防风 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.507923 0.383485 0.596909 0.378163 0.3905 0.509434 0.499904 0.489915 0.545928 0.39402 0.691645 0.30929 0.301358 0.397231
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄

------Score: precision: 0.785714, recall: 0.733333, error: 0.214286
234. 
patient tongue id: 05262204569733_1_2_7
label yaofang:
甘草 太子参 黄芪 鸡血藤 枸杞子 白术 酸枣仁 生地黄 山药 天麻 地龙 女贞子 沙苑子 威灵仙 灯盏细辛
0.941365 0.491475 0.597238 0.40976 0.32655 0.551052 0.470812 0.478783 0.364666 0.398494 0.406782
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
235. 
patient tongue id: 03081813185383_6
label yaofang:
白芍 香附 枳壳 法半夏 党参 延胡索 海螵蛸 北柴胡 麦芽 炙甘草 紫苏梗
0.402653 0.325514 0.414025 0.363338 0.316413
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
236. 
patient tongue id: 05171921103234_5_1
label yaofang:
甘草 法半夏 茯苓 前胡 防风 鱼腥草 党参 黄芪 白术 五味子 浙贝母 桑白皮 地骨皮 补骨脂 紫菀 丝瓜络
0.917196 0.301153 0.485201 0.591503 0.391579 0.508322 0.421315 0.422981 0.315417 0.346422 0.352723
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
237. 
patient tongue id: 01032113495681_6_7_2
label yaofang:
甘草 白芍 当归 茯苓 鱼腥草 党参 黄芪 鸡血藤 丹参 黄连 生地黄 白茅根 补骨脂 麦芽
0.978275 0.522677 0.638944 0.374073 0.327613 0.649302 0.524664 0.530354 0.392196 0.445287 0.460026
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
238. 
patient tongue id: 06091958062357_1_4_7
label yaofang:
陈皮 当归 茯苓 半夏 远志 党参 黄芪 白术 杜仲 牛膝 郁金 厚朴 桑寄生 莪术 紫苏叶 蜈蚣 姜黄 素馨花
0.481204 0.342835 0.389526 0.475194 0.462877 0.323639
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.833333, recall: 0.277778, error: 0.166667
239. 
patient tongue id: 04210705088673_2_4
label yaofang:
甘草 半夏 薏苡仁 麦冬 玄参 僵蚕 瓜蒌皮 射干 百部 苦杏仁 瓜蒌子 百合 青果
0.611044 0.401675 0.441073 0.422657 0.424423
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
240. 
patient tongue id: 03062143384824_1_7_3
label yaofang:
荆芥 防风 金银花 连翘 厚朴 火麻仁 枇杷叶 北沙参 辛夷 紫苏叶
0.518721 0.364694 0.386452 0.469047 0.497721 0.348355
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.166667, recall: 0.100000, error: 0.833333
241. 
patient tongue id: 04131917035559_2_1_7
label yaofang:
枳壳 薏苡仁 蒲公英 黄芪 黄连 赤芍 牡丹皮 小蓟 厚朴 槐花 莪术 北沙参 赭石 紫苏叶 姜黄 鸭脚艾
0.471677 0.340312 0.327745 0.369311 0.564119 0.478003 0.425847 0.307114 0.384538
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.333333, recall: 0.187500, error: 0.666667
242. 
patient tongue id: 02182254352178_6_2
label yaofang:
甘草 独活 红花 延胡索 山药 山茱萸 地黄 天麻 巴戟天 桑寄生 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲 乌梢蛇 宽筋藤
0.97625 0.529982 0.634169 0.383512 0.303806 0.345893 0.655221 0.545212 0.547314 0.423807 0.471076 0.483686
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
243. 
patient tongue id: 01051851221081_1_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 细辛 荆芥穗 白芷 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.369342 0.780818 0.38031 0.890153 0.496576 0.585544 0.416784 0.39361 0.325785 0.365951 0.80274 0.811869 0.816266 0.849359 0.437416 0.949395 0.426612 0.394626 0.589822 0.747638
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.714286, error: 0.500000
244. 
patient tongue id: 05231936055821_1_2
label yaofang:
法半夏 茯苓 葛根 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.339277 0.702537 0.368985 0.840901 0.484201 0.568224 0.368407 0.344581 0.366663 0.743833 0.762861 0.76539 0.810179 0.416326 0.916155 0.42595 0.38489 0.556053 0.696605
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
245. 
patient tongue id: 05181048192694_1_2_4
label yaofang:
甘草 茯苓 党参 白术 赤芍 山药 天麻 鳖甲 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 川木瓜 土茯苓
0.976444 0.513827 0.651738 0.375199 0.301215 0.336484 0.642112 0.527336 0.530822 0.39959 0.451091 0.471931
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.733333, error: 0.083333
246. 
patient tongue id: 04112042173492_6_5
label yaofang:
甘草 柴胡 白芍 木香 薏苡仁 白及 党参 白术 黄连 山药 益智仁 桑螵蛸 佛手 麸炒枳壳
0.969961 0.522876 0.628389 0.364991 0.321534 0.62139 0.488769 0.493917 0.365451 0.410243 0.416289
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
247. 
patient tongue id: 02122216213472_5
label yaofang:
甘草 法半夏 当归 茯苓 前胡 黄连 黄柏 牛膝 石膏 细辛 砂仁 白芷 款冬花 麦芽 苦杏仁 广升麻
0.976729 0.525368 0.647334 0.368915 0.318791 0.63164 0.518695 0.515176 0.395733 0.439651 0.449857
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
248. 
patient tongue id: 02272236348704_6_1
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.36416 0.503581 0.376241 0.314268 0.345761 0.336316 0.31252 0.509262 0.647027
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.142857, error: 0.777778
249. 
patient tongue id: 02120759266715_2
label yaofang:
甘草 茯苓 生地黄 牡丹皮 山药 山茱萸 泽泻 菟丝子 益母草 猪苓 泽兰
0.975923 0.515314 0.629457 0.377997 0.320266 0.625472 0.504843 0.515969 0.380228 0.420059 0.438595
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.272727, error: 0.727273
250. 
patient tongue id: 03021405472602_1_2
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.47216 0.349567 0.423088 0.496811 0.340754
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
251. 
patient tongue id: 04121325248611_4
label yaofang:
法半夏 前胡 桔梗 麦冬 玉竹 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.360775 0.693641 0.36569 0.838819 0.496805 0.578324 0.380988 0.379685 0.322305 0.386447 0.746409 0.767635 0.768524 0.805273 0.407922 0.90232 0.437695 0.419178 0.551397 0.686408
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
252. 
patient tongue id: 04291619273312_5
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 桑白皮 款冬花 紫菀 苦杏仁 紫苏梗
0.925983 0.496852 0.601034 0.388398 0.318319 0.347636 0.577656 0.472967 0.466606 0.371254 0.410185 0.426343
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.153846, error: 0.833333
253. 
patient tongue id: 04282018217183_4_6
label yaofang:
甘草 法半夏 大枣 茯苓 党参 白术 丹参 黄连 赤芍 胆南星 砂仁 天麻 粉葛 建曲
0.960386 0.51051 0.616581 0.385045 0.32033 0.590158 0.487316 0.49093 0.371823 0.410917 0.423924
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
254. 
patient tongue id: 05131430279805_1_2_4
label yaofang:
甘草 党参 酸枣仁 山药 砂仁 天麻 鳖甲 茵陈 麦芽 白扁豆 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.947175 0.498725 0.605298 0.384144 0.306282 0.332446 0.57993 0.47323 0.480916 0.370278 0.402535 0.412092
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.625000, error: 0.166667
255. 
patient tongue id: 01090005503064_4_7
label yaofang:
白芍 三七 鳖甲 北沙参 广金钱草 猫爪草 风栗壳
0.434939 0.324219 0.355426 0.483286 0.442932 0.319141
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
256. 
patient tongue id: 05172118379077_6_7
label yaofang:
甘草 川芎 茯苓 枸杞子 白术 生地黄 牡丹皮 杜仲 山药 山茱萸 天麻 桑寄生 麦芽 地龙
0.788524 0.333057 0.440562 0.537578 0.397195 0.397622 0.333764
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.285714, error: 0.428571
257. 
patient tongue id: 03022122048853_5_1
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 丹参 赤芍 厚朴 鸡内金 北沙参 冬凌草 两面针
0.384439 0.332168 0.377923 0.542745 0.330339
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.800000, recall: 0.333333, error: 0.200000
258. 
patient tongue id: 03291336094351_6_2
label yaofang:
甘草 柴胡 白芍 枳壳 党参 白术 酸枣仁 延胡索 杜仲 砂仁 五灵脂 桑寄生 淫羊藿 麦芽 续断 合欢花
0.936159 0.301351 0.478272 0.619512 0.353961 0.525117 0.367996 0.370057 0.30577
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.444444, recall: 0.250000, error: 0.555556
259. 
patient tongue id: 03282228490063_7_4
label yaofang:
柴胡 黄芩 桃仁 党参 白术 泽泻 天麻 姜半夏 炙甘草 续断
0.385851 0.360622 0.476917 0.360003 0.30722 0.438829 0.37114 0.406995 0.47213
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 姜半夏 炙甘草

------Score: precision: 0.555556, recall: 0.500000, error: 0.444444
260. 
patient tongue id: 04122115432454_4_6
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 桃仁 远志 浙贝母 细辛 款冬花 苦杏仁 蜜麻黄
0.731945 0.407915 0.495384 0.393646 0.46921 0.340185 0.34631
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻 蜈蚣

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
261. 
patient tongue id: 01312120493005_1_5_2
label yaofang:
甘草 当归 连翘 党参 黄芪 丹参 生地黄 天麻 鳖甲 皂角刺 蜈蚣 白花蛇舌 龙葵果 广升麻
0.938557 0.49925 0.592119 0.402113 0.312329 0.555901 0.443991 0.467077 0.330157 0.375009 0.38249
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
262. 
patient tongue id: 01132122138549_6_7_1
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 丹参 赤芍 山药 益母草 鳖甲 麦芽 首乌藤 黄精 土鳖虫
0.905814 0.472296 0.31114 0.567142 0.453549 0.303425 0.366357 0.545111 0.491634 0.523107 0.389914 0.439742 0.4613
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.538462, recall: 0.466667, error: 0.461538
263. 
patient tongue id: 01100740200901_1_7
label yaofang:
甘草 玉竹 赤芍 胆南星 牡丹皮 地龙 嫩桑枝 土鳖虫 乌梢蛇 宽筋藤 三七粉 络石藤
0.379512 0.321222 0.301047 0.441332 0.395131 0.353491 0.300001 0.330538
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 车前子

------Score: precision: 0.125000, recall: 0.083333, error: 0.875000
264. 
patient tongue id: 04052143472082_1_4_6
label yaofang:
甘草 前胡 牛蒡子 厚朴 淡豆豉 扁豆花 紫菀 枇杷叶 蝉蜕 木蝴蝶 木棉花 岗梅 东风桔
0.359565 0.338266 0.305369 0.387112 0.356107 0.387574 0.38318
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
265. 
patient tongue id: 03012144084205_5_2
label yaofang:
甘草 黄芩 黄连 生地黄 延胡索 牛膝 钩藤 细辛 天麻 白芷 桑寄生 决明子 女贞子 广升麻
0.94385 0.499718 0.60956 0.355775 0.307302 0.563186 0.424367 0.422612 0.313259 0.351388 0.352862
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
266. 
patient tongue id: 03242126139426_6_4
label yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 枳实 豆蔻 姜半夏 炙甘草 紫苏梗
0.419799 0.367448 0.474357 0.33186 0.446669 0.369331 0.391657 0.483905
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.750000, recall: 0.545455, error: 0.250000
267. 
patient tongue id: 02120827111167_6_4
label yaofang:
甘草 茯苓 桔梗 酸枣仁 丹参 浙贝母 栀子 郁金 天麻 鳖甲 皂角刺 蜈蚣 白花蛇舌 天山雪莲 红豆杉 猫爪草
0.975952 0.521773 0.639217 0.369879 0.301726 0.331016 0.647423 0.531496 0.533489 0.407085 0.455978 0.467415
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
268. 
patient tongue id: 05162053411112_2_6
label yaofang:
甘草 茯苓 芦根 玄参 生地黄 浙贝母 厚朴 天麻 鳖甲 火麻仁 北沙参 苦杏仁 蜈蚣 白花蛇舌 蜂房 四季青
0.977695 0.521554 0.643932 0.372777 0.32328 0.628691 0.514986 0.520001 0.387532 0.432876 0.449396
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
269. 
patient tongue id: 04241829425144_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 海螵蛸 炙甘草 百合 紫苏叶
0.662161 0.354477 0.377393 0.498635 0.360208
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
270. 
patient tongue id: 04262001503857_4
label yaofang:
麻黄 桂枝 白芍 前胡 半夏 太子参 五味子 细辛 干姜 紫菀 白前 北沙参 紫苏子 炙甘草
0.339509 0.804185 0.370836 0.917138 0.556786 0.622365 0.381214 0.372196 0.373782 0.845934 0.85171 0.851286 0.883023 0.41546 0.958856 0.446877 0.404164 0.61184 0.778754
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.368421, recall: 0.500000, error: 0.631579
271. 
patient tongue id: 03302310576239_5
label yaofang:
甘草 枳壳 茯苓 半夏 薏苡仁 黄芪 白术 黄连 赤芍 浙贝母 郁金 厚朴 莪术 麦芽 合欢皮 预知子 冬凌草
0.455724 0.359221 0.373959 0.513107 0.385369 0.333811 0.326692
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.714286, recall: 0.294118, error: 0.285714
272. 
patient tongue id: 02271846411124_2_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 麦冬 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.404695 0.411877 0.3612 0.323355 0.32511 0.313971 0.309659 0.318079 0.390908 0.332239 0.339682 0.309476 0.601121
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草

------Score: precision: 0.846154, recall: 0.785714, error: 0.153846
273. 
patient tongue id: 01192231472924_1_4_7
label yaofang:
甘草 川芎 薏苡仁 党参 白术 天麻 僵蚕 鳖甲 补骨脂 蜈蚣 白花蛇舌 天山雪莲 半枝莲 乌梢蛇
0.910058 0.30428 0.459605 0.58345 0.367908 0.501761 0.382405 0.390854 0.31286 0.316883
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.571429, error: 0.200000
274. 
patient tongue id: 02201755030112_1_4
label yaofang:
陈皮 法半夏 茯苓 党参 海螵蛸 干姜 豆蔻 炙甘草 广藿香 麸炒白术 麸炒苍术 炙黄芪 炒六神曲 甘松
0.352507 0.663374 0.407151 0.760959 0.441017 0.514141 0.399295 0.362751 0.323469 0.349335 0.666331 0.674932 0.696857 0.720001 0.419998 0.849308 0.394101 0.374072 0.511019 0.636711
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.300000, recall: 0.428571, error: 0.700000
275. 
patient tongue id: 04291451206044_1_7
label yaofang:
甘草 川芎 法半夏 葛根 羌活 白术 牛膝 细辛 荷叶 天麻 僵蚕 磁石 白芷 地龙
0.897134 0.414494 0.547719 0.490602 0.303669 0.428029 0.353583 0.463393 0.31299
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 半枝莲

------Score: precision: 0.333333, recall: 0.214286, error: 0.666667
276. 
patient tongue id: 03011855154941_4_1
label yaofang:
法半夏 前胡 防风 钩藤 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子
0.364797 0.700263 0.384296 0.825878 0.468491 0.544757 0.41559 0.372584 0.303475 0.361432 0.738844 0.746364 0.761437 0.791815 0.460489 0.902387 0.416494 0.395869 0.581137 0.698252
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.857143, error: 0.400000
277. 
patient tongue id: 02020947100958_6_1
label yaofang:
甘草 柴胡 法半夏 茯苓 木香 蒲公英 白及 党参 白术 黄连 延胡索 五灵脂 旋覆花 鱼古 煅瓦楞子
0.848344 0.455328 0.556773 0.392658 0.479246 0.359011 0.386088
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.266667, error: 0.428571
278. 
patient tongue id: 03091835522321_2_1
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.345389 0.888461 0.355596 0.968541 0.607824 0.693497 0.385571 0.397617 0.37483 0.920107 0.91992 0.918356 0.941366 0.403013 0.986186 0.474184 0.405774 0.647005 0.848082
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
279. 
patient tongue id: 04200622388500_6_2
label yaofang:
甘草 川芎 枸杞子 白术 酸枣仁 杜仲 牛膝 泽泻 天麻 桑寄生 麦芽 女贞子 墨旱莲
0.956655 0.505435 0.619951 0.385002 0.32392 0.575535 0.475783 0.475919 0.365174 0.399832 0.407431
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
280. 
patient tongue id: 04171746097637_6_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.333673 0.357731 0.496547 0.361477 0.302096 0.400279 0.359834 0.436315 0.542106
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 姜半夏 炙甘草

------Score: precision: 0.666667, recall: 0.545455, error: 0.333333
281. 
patient tongue id: 05242105405556_2_5
label yaofang:
甘草 龙骨 党参 白术 酸枣仁 生地黄 知母 菟丝子 糯稻根 益母草 淫羊藿 仙茅 女贞子 龟甲
0.989507 0.544352 0.67014 0.355139 0.305624 0.340262 0.693504 0.563082 0.564475 0.43168 0.480667 0.502415
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
282. 
patient tongue id: 04131623210544_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.429067 0.372243 0.344502 0.433927 0.432731 0.387329 0.305593
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
283. 
patient tongue id: 03011100254762_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.410771 0.382864 0.437291 0.349155 0.356516
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
284. 
patient tongue id: 01070833432642_1_2_7
label yaofang:
桂枝 茯苓 党参 黄芪 丹参 山药 高良姜 肉苁蓉 淫羊藿 仙茅 花椒
0.480353 0.375432 0.411052 0.432735 0.331587
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.272727, error: 0.400000
285. 
patient tongue id: 05080850451593_3_1_4
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 五味子 熟地黄 火麻仁 苦参 炙甘草 黑枣
0.479005 0.36651 0.491697 0.326954 0.495909 0.4624 0.513651 0.423864 0.43046 0.414685 0.422075 0.427103 0.488088 0.396952 0.444479 0.478317 0.459268
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.117647, recall: 0.181818, error: 0.882353
286. 
patient tongue id: 03311615410420_5
label yaofang:
荆芥 防风 金银花 连翘 党参 枇杷叶 北沙参 蝉蜕 辛夷 东风桔 咸竹蜂
0.496065 0.363213 0.408723 0.450345 0.456981 0.322551
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
287. 
patient tongue id: 05102210148233_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 炒紫苏子
0.360568 0.840582 0.344807 0.944954 0.561088 0.655263 0.409253 0.38877 0.315129 0.376772 0.879279 0.888858 0.887904 0.918693 0.436783 0.980705 0.45522 0.416388 0.642439 0.815436
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
288. 
patient tongue id: 03092055230617_5_6
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 芦根 牛蒡子 浙贝母 细辛 瓜蒌皮 款冬花 板蓝根 紫苏梗
0.939299 0.489485 0.617048 0.39655 0.317111 0.333986 0.584544 0.492157 0.489783 0.384909 0.42576 0.444607
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.133333, error: 0.833333
289. 
patient tongue id: 01100102320913_7_4
label yaofang:
甘草 白芍 胆南星 牛膝 钩藤 苏木 地龙 嫩桑枝 丝瓜络 豨莶草 宽筋藤 海风藤 徐长卿 三七粉
0.536792 0.373057 0.308199 0.485999 0.354717 0.370102 0.340802
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 天麻

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
290. 
patient tongue id: 03312044594120_4_7
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 独活 浙贝母 杜仲 细辛 桑寄生 款冬花 白前 牛大力
0.982116 0.526464 0.656534 0.359833 0.329685 0.656997 0.53289 0.532375 0.402313 0.448805 0.463457
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
291. 
patient tongue id: 01180616588908_2
label yaofang:
甘草 桔梗 芦根 麦冬 太子参 浙贝母 泽泻 鳖甲 北沙参 苍耳子 白花蛇舌 蜂房 四季青 龙胆
0.975832 0.523646 0.64202 0.366074 0.303162 0.327852 0.644871 0.523051 0.520913 0.397957 0.445133 0.45916
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
292. 
patient tongue id: 06091833266197_2
label yaofang:
柴胡 川芎 黄芩 法半夏 麦冬 党参 郁金 灯心草 石菖蒲 天麻 琥珀 磁石 白芷 炙甘草
0.689877 0.378937 0.377408 0.523175 0.347866
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
293. 
patient tongue id: 03081822513459_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.308968 0.436849 0.387591 0.472505 0.319299 0.360044 0.328799 0.365211 0.399617 0.418188 0.427876 0.466429 0.448133 0.648237 0.300811 0.352373
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.800000, error: 0.250000
294. 
patient tongue id: 03231605061969_1_4
label yaofang:
法半夏 前胡 桔梗 防风 黄芪 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 麸炒白术
0.527275 0.405894 0.631212 0.411751 0.404738 0.552857 0.504194 0.453251 0.493445 0.572088 0.315068 0.345112
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
295. 
patient tongue id: 03041050001243_4
label yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.332964 0.935082 0.314027 0.986663 0.646131 0.740083 0.385038 0.393733 0.376654 0.956114 0.956725 0.952804 0.969053 0.397325 0.994934 0.485385 0.414476 0.663276 0.886587
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 1.000000, error: 0.263158
296. 
patient tongue id: 06031047394681_1_2_7
label yaofang:
甘草 白芍 木香 薏苡仁 党参 牡丹皮 郁金 山药 鳖甲 莪术 虎杖 蜈蚣 白花蛇舌 天山雪莲 龙葵果
0.955282 0.50255 0.619969 0.393365 0.327147 0.581605 0.487083 0.488046 0.37368 0.411809 0.424822
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
297. 
patient tongue id: 01172254417525_2_1
label yaofang:
甘草 大枣 茯苓 木香 党参 鸡血藤 白术 丹参 生地黄 红花 赤芍 熟地黄 山茱萸 补骨脂
0.971974 0.522304 0.628783 0.3779 0.325465 0.624284 0.51581 0.518292 0.394452 0.436433 0.451457
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
298. 
patient tongue id: 02202228066799_1_6
label yaofang:
甘草 茯苓 远志 党参 白术 五味子 杜仲 山茱萸 车前子 菟丝子 巴戟天 金樱子 蛇床子 覆盆子
0.980389 0.530605 0.645285 0.377422 0.302006 0.338474 0.662833 0.55003 0.551628 0.42041 0.474454 0.485202
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
299. 
patient tongue id: 04141254070450_4_2
label yaofang:
白芍 川芎 茯苓 防风 丹参 钩藤 菊花 天麻 白芷 石决明 炙甘草 首乌藤 炒蔓荆子 棉萆薢
0.346366 0.684657 0.372243 0.824753 0.485453 0.566067 0.367653 0.353462 0.372581 0.733146 0.753696 0.754481 0.798654 0.417739 0.90631 0.426966 0.396756 0.547354 0.678328
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.210526, recall: 0.285714, error: 0.789474
300. 
patient tongue id: 05260629544638_4
label yaofang:
甘草 柴胡 连翘 薏苡仁 黄连 红花 赤芍 牡丹皮 石膏 苍术 荆芥穗 白芷 火麻仁 麦芽 苦参 白鲜皮 地肤子 龙胆
0.650984 0.403601 0.497021 0.322215 0.379813 0.342332
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.166667, recall: 0.055556, error: 0.833333
301. 
patient tongue id: 03230837233667_3_6
label yaofang:
甘草 龙骨 牡蛎 远志 党参 酸枣仁 熟地黄 天麻 淫羊藿 仙茅 白花蛇舌草 麦芽 蜈蚣 合欢花 半枝莲 醋鳖甲
0.873824 0.461355 0.561419 0.413575 0.458669 0.371482 0.406641 0.304215
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
302. 
patient tongue id: 02231816526293_4
label yaofang:
麻黄 前胡 半夏 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 紫苏子 炙甘草 辛夷
0.375031 0.631954 0.40585 0.752728 0.474536 0.540972 0.383778 0.383896 0.337653 0.319632 0.391143 0.672151 0.676214 0.683192 0.718057 0.410074 0.812959 0.444922 0.408 0.518236 0.624096
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.523810, recall: 0.785714, error: 0.476190
303. 
patient tongue id: 03282220338637_1_4
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 牛膝 天麻 磁石 麦芽 浮小麦 龟甲
0.362583 0.351533 0.492509 0.336427 0.416633 0.356442 0.411681 0.522954
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
304. 
patient tongue id: 03292049293244_4_1
label yaofang:
白芍 川芎 茯苓 防风 钩藤 天麻 白芷 石决明 炙甘草 首乌藤 广藿香 炒六神曲 炒蔓荆子 棉萆薢
0.376425 0.696846 0.389719 0.818045 0.465454 0.547853 0.421078 0.39367 0.342503 0.385823 0.725592 0.741825 0.756344 0.789674 0.453573 0.899193 0.426196 0.402604 0.575676 0.700423
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.250000, recall: 0.357143, error: 0.750000
305. 
patient tongue id: 02231827583142_4_2
label yaofang:
麻黄 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 香薷 紫菀 辛夷 紫苏梗 广藿香 炒苍耳子
0.358357 0.586758 0.401317 0.706701 0.450789 0.505994 0.377191 0.354903 0.359182 0.628342 0.626403 0.634083 0.668833 0.408108 0.769748 0.412517 0.385637 0.472959 0.576684
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.421053, recall: 0.533333, error: 0.578947
306. 
patient tongue id: 05181055194141_6_1
label yaofang:
甘草 麦冬 酸枣仁 杜仲 牛膝 地黄 天麻 菟丝子 益母草 淡竹叶 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.944268 0.495899 0.627843 0.400664 0.310682 0.324759 0.573814 0.48288 0.489977 0.363242 0.420476 0.454723
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
307. 
patient tongue id: 01130624285005_1_6
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 牛蒡子 浙贝母 天麻 白花蛇舌草 麦芽 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.933548 0.496934 0.605454 0.40582 0.32722 0.547448 0.45171 0.453394 0.34996 0.386365 0.394155
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
308. 
patient tongue id: 04102112264740_5
label yaofang:
甘草 桔梗 连翘 薄荷 芦根 牛蒡子 浙贝母 桑叶 菊花 射干 百部 苦杏仁 木蝴蝶 青果
0.62075 0.339974 0.545752 0.348066
predicted yaofang:
甘草 白芍 党参 白术

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
309. 
patient tongue id: 05162126216181_7_2_6
label yaofang:
甘草 党参 生地黄 延胡索 天麻 五灵脂 桑寄生 鳖甲 麦芽 威灵仙 蜈蚣 天山雪莲 半枝莲 骨碎补 红豆杉
0.941988 0.496943 0.60499 0.395461 0.331063 0.564384 0.476667 0.475835 0.369239 0.404161 0.408681
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
310. 
patient tongue id: 03111519137493_6_4
label yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 郁金 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.970354 0.522689 0.62537 0.357877 0.312882 0.610267 0.491213 0.493006 0.375447 0.410664 0.426503
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
311. 
patient tongue id: 02281930294808_6
label yaofang:
柴胡 白芍 香附 枳壳 丹参 海螵蛸 浙贝母 砂仁 豆蔻 姜半夏 炙甘草 紫苏梗
0.378789 0.38071 0.427692 0.345019 0.362641
predicted yaofang:
甘草 白芍 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
312. 
patient tongue id: 05251930261857_2
label yaofang:
甘草 蒲公英 浙贝母 郁金 生半夏 僵蚕 莪术 柿蒂 北沙参 赭石 蜈蚣 红豆杉 预知子 冬凌草
0.392392 0.362514 0.36546 0.302079 0.387842 0.49194 0.390902 0.326821 0.315006
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 牛膝 钩藤

------Score: precision: 0.111111, recall: 0.071429, error: 0.888889
313. 
patient tongue id: 02010317519707_2_5_6
label yaofang:
甘草 连翘 丹参 生地黄 牡丹皮 黄柏 山茱萸 泽泻 天麻 白芷 鳖甲 皂角刺 白鲜皮 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.961955 0.50828 0.62715 0.351822 0.597685 0.442303 0.441872 0.316005 0.363194 0.366979
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.700000, recall: 0.411765, error: 0.300000
314. 
patient tongue id: 03021414223639_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.506423 0.349086 0.345412 0.474864 0.445043 0.405795 0.325868 0.306409
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 天麻

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
315. 
patient tongue id: 02020949142167_5_6
label yaofang:
甘草 紫花地丁 党参 生地黄 延胡索 浙贝母 天麻 白芷 鳖甲 麦芽 皂角刺 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.941568 0.487791 0.603484 0.360375 0.316128 0.573766 0.437323 0.439238 0.329336 0.365807 0.368191
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
316. 
patient tongue id: 03261602182967_2
label yaofang:
甘草 白芍 龙骨 牡蛎 芦根 麦冬 玉竹 太子参 枸杞子 酸枣仁 黄连 肉桂 山药 山茱萸 菊花 菟丝子 珍珠母 北沙参 女贞子
0.477398 0.333489 0.327163 0.453948 0.303046 0.382361
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.333333, recall: 0.105263, error: 0.666667
317. 
patient tongue id: 02231839524609_4
label yaofang:
法半夏 茯苓 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.339022 0.609105 0.367151 0.759937 0.424686 0.536457 0.356495 0.341144 0.649251 0.668063 0.705635 0.738739 0.434614 0.840372 0.409175 0.378801 0.517877 0.618099
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.777778, recall: 0.933333, error: 0.222222
318. 
patient tongue id: 01190646126717_3_5_6
label yaofang:
甘草 白芍 茯苓 薏苡仁 党参 熟附子 郁金 山药 天麻 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲 红豆杉
0.966531 0.520773 0.616135 0.37287 0.321907 0.617838 0.499705 0.512683 0.386102 0.428649 0.443723
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
319. 
patient tongue id: 03021140296916_1_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 泽泻 干姜
0.462563 0.348562 0.449688 0.481802 0.423066 0.490896 0.381528 0.387988 0.359697 0.385235 0.400975 0.404646 0.350693 0.354697 0.387912 0.360879
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.312500, recall: 0.416667, error: 0.687500
320. 
patient tongue id: 03290230492353_2
label yaofang:
甘草 桔梗 芦根 白及 麦冬 太子参 生地黄 浙贝母 乌梅 郁金 山药 北沙参 白花蛇舌 四季青
0.92768 0.487672 0.585974 0.399935 0.319176 0.531061 0.432451 0.458723 0.326703 0.36259 0.366885
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
321. 
patient tongue id: 02272152545725_1_6
label yaofang:
甘草 白芍 川芎 独活 丹参 牛膝 细辛 干姜 天麻 蜈蚣 姜黄 海桐皮 鹿衔草
0.302892 0.403888 0.350341 0.344276 0.368279 0.50477
predicted yaofang:
柴胡 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.076923, error: 0.833333
322. 
patient tongue id: 04072023027706_1_4
label yaofang:
牡蛎 黄芪 白术 延胡索 海螵蛸 浙贝母 砂仁 瓜蒌皮 莪术 鸡内金 枇杷叶 北沙参 蜈蚣 山慈菇 蛇舌草 鲜龙葵果
0.397092 0.321069 0.38876 0.347172 0.467073 0.30123 0.312253
predicted yaofang:
甘草 白芍 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.428571, recall: 0.187500, error: 0.571429
323. 
patient tongue id: 03111444342291_6
label yaofang:
甘草 柴胡 白芍 龙骨 牡蛎 延胡索 薤白 砂仁 瓜蒌皮 佛手 浮小麦 合欢花 麸炒枳壳
0.780975 0.450707 0.518049 0.360672 0.414797
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
324. 
patient tongue id: 04252326004989_2_6
label yaofang:
甘草 黄芩 桔梗 芦根 麦冬 太子参 五味子 浙贝母 乌梅 天花粉 白花蛇舌草 蜂房 醋鳖甲 岗梅
0.924811 0.487768 0.580552 0.378977 0.519181 0.409893 0.42652 0.304421 0.33801 0.336932
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.071429, error: 0.900000
325. 
patient tongue id: 05092105052300_6_4
label yaofang:
枳壳 牛蒡子 太子参 白术 海螵蛸 神曲 山楂 麦芽 百合 紫苏叶
0.30502 0.339085 0.462385 0.300568 0.393404 0.37695 0.40126 0.562411
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.100000, error: 0.875000
326. 
patient tongue id: 03091858558729_6_4_7
label yaofang:
甘草 黄芩 桔梗 牛蒡子 桃仁 远志 浙贝母 细辛 天麻 款冬花 枇杷叶 白花蛇舌草 苦杏仁 蜈蚣 半枝莲 醋鳖甲
0.939329 0.310419 0.491295 0.629083 0.388521 0.319043 0.323635 0.581208 0.482925 0.474215 0.37209 0.417987 0.440975
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.307692, recall: 0.250000, error: 0.692308
327. 
patient tongue id: 03062141268431_6_4
label yaofang:
甘草 茯苓 半夏 龙骨 白术 黄连 肉桂 砂仁 磁石 枇杷叶 首乌藤 合欢皮
0.426011 0.371936 0.363032 0.316425 0.516113 0.46489 0.393008 0.309046 0.429073
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.555556, recall: 0.416667, error: 0.444444
328. 
patient tongue id: 01192225448529_4_7
label yaofang:
桂枝 甘草 川芎 防风 羌活 白术 红花 赤芍 牛膝 知母 细辛 白芷 桑枝 威灵仙 乌梢蛇
0.963183 0.50461 0.619474 0.389528 0.329669 0.611959 0.498816 0.509317 0.37905 0.424061 0.432958
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
329. 
patient tongue id: 03311626104365_1_2_3
label yaofang:
牡蛎 玉竹 黄芪 白术 海螵蛸 乌梅 杜仲 附子 山茱萸 厚朴 砂仁 肉苁蓉 火麻仁 北沙参 猫爪草 冬凌草
0.354559 0.302677 0.318281 0.591126
predicted yaofang:
白芍 茯苓 白术 炙甘草

------Score: precision: 0.250000, recall: 0.062500, error: 0.750000
330. 
patient tongue id: 05191953551582_2_5
label yaofang:
甘草 黄芩 芦根 牛蒡子 浙贝母 栀子 乌梅 黄柏 天花粉 白花蛇舌草 北沙参 蜂房 醋鳖甲 岗梅
0.953397 0.506253 0.612187 0.384061 0.318537 0.577189 0.478995 0.482332 0.369977 0.405285 0.41353
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.071429, error: 0.909091
331. 
patient tongue id: 02151907478188_2
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 北柴胡 紫菀 白前 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.356254 0.692514 0.398403 0.809365 0.46757 0.547359 0.394032 0.370626 0.307216 0.36761 0.724722 0.725249 0.736817 0.770824 0.417039 0.876348 0.425615 0.391431 0.554081 0.679028
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
332. 
patient tongue id: 04201506500775_1_2_7
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 延胡索 枳实 竹茹 胆南星 厚朴
0.488205 0.358834 0.323144 0.43556 0.512768 0.365113 0.30828
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.857143, recall: 0.461538, error: 0.142857
333. 
patient tongue id: 06031119493858_2_6
label yaofang:
甘草 白芍 木香 党参 白术 黄连 延胡索 薤白 厚朴 砂仁 五灵脂 瓜蒌皮 麦芽 降香 鱼古
0.936156 0.497277 0.586469 0.399008 0.31223 0.540328 0.441583 0.455352 0.336201 0.371961 0.373174
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
334. 
patient tongue id: 05131620525084_1_2_7
label yaofang:
甘草 桃仁 党参 白术 酸枣仁 柏子仁 天麻 肉苁蓉 鳖甲 火麻仁 补骨脂 蜈蚣 天山雪莲 半枝莲 红豆杉
0.944481 0.309206 0.49148 0.615236 0.399828 0.331821 0.35686 0.593667 0.508731 0.503944 0.408551 0.446335 0.471166
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.692308, recall: 0.600000, error: 0.307692
335. 
patient tongue id: 05222126049930_1_4_6
label yaofang:
甘草 茯苓 半夏 橘红 黄芪 白术 厚朴 磁石 芡实 金樱子 枇杷叶 北沙参 木蝴蝶
0.566342 0.35954 0.420239 0.474333 0.470425 0.332678
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.833333, recall: 0.384615, error: 0.166667
336. 
patient tongue id: 04282203431596_5
label yaofang:
甘草 川芎 党参 黄连 栀子 牛膝 石膏 苍术 山药 细辛 白芷 天花粉 广升麻
0.967566 0.517428 0.62214 0.387667 0.326914 0.601901 0.498064 0.498718 0.380307 0.418867 0.429939
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
337. 
patient tongue id: 01101810569556_1
label yaofang:
麻黄 前胡 半夏 防风 细辛 干姜 款冬花 紫菀 百部 紫苏子 炙甘草 辛夷 紫苏梗 苍耳子
0.362839 0.676015 0.405359 0.770198 0.470054 0.534365 0.402345 0.378528 0.334967 0.369534 0.6832 0.692728 0.700415 0.729292 0.411573 0.860342 0.412226 0.387756 0.514839 0.637662
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.642857, error: 0.550000
338. 
patient tongue id: 03151843219295_1_2
label yaofang:
甘草 白芍 龙骨 牡蛎 玄参 天冬 川楝子 牛膝 茵陈 麦芽 赭石 龟甲
0.38295 0.309116 0.312008 0.405922 0.332762 0.358405 0.319481
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
339. 
patient tongue id: 03091432407273_1_2_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.547709 0.372865 0.471249 0.357222
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 1.000000, recall: 0.307692, error: 0.000000
340. 
patient tongue id: 05032319152610_1_2_5
label yaofang:
甘草 白芍 枳壳 防风 薏苡仁 蒲公英 白术 天麻 地榆 槐花 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.975267 0.515826 0.638224 0.381753 0.337105 0.636219 0.533163 0.537033 0.407971 0.456398 0.468643
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
341. 
patient tongue id: 03020818016684_6_1
label yaofang:
甘草 柴胡 白芍 大枣 党参 酸枣仁 延胡索 川楝子 郁金 山药 补骨脂 鸡内金 浮小麦 合欢花
0.847015 0.380874 0.431752 0.568838 0.362867 0.402213 0.31636
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
342. 
patient tongue id: 04282225230864_6_5_1
label yaofang:
甘草 白芍 陈皮 木香 防风 党参 白术 黄连 延胡索 乌梅 山药 干姜 巴戟天 五灵脂 佛手 建曲
0.934292 0.478512 0.607404 0.391717 0.300834 0.534156 0.438532 0.444319 0.329615 0.3658 0.37756
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
343. 
patient tongue id: 03151903550326_6_4
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 白花蛇舌草 白扁豆
0.423029 0.587284 0.488615 0.354544 0.333634 0.308062 0.309104 0.335333 0.303871 0.628804 0.702044
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.181818, recall: 0.200000, error: 0.818182
344. 
patient tongue id: 02211857272771_1_7
label yaofang:
当归 党参 黄芪 白术 丹参 生地黄 泽泻 车前子 猪苓 鳖甲 白花蛇舌草 瓦楞子
0.767898 0.440242 0.526431 0.400005
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
345. 
patient tongue id: 01182100105017_6_2_5
label yaofang:
甘草 川芎 枳壳 茯苓 党参 牛膝 山药 厚朴 天麻 鳖甲 火麻仁 茵陈 苦杏仁 蜈蚣 白花蛇舌 天山雪莲
0.952375 0.493425 0.610608 0.405757 0.328938 0.58348 0.499754 0.513552 0.376261 0.427724 0.436666
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
346. 
patient tongue id: 02231923340976_4_1
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.369891 0.70384 0.391964 0.819345 0.473173 0.554856 0.404199 0.377272 0.321861 0.367694 0.729882 0.742005 0.760194 0.791791 0.444773 0.902726 0.419283 0.398767 0.582036 0.701773
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
347. 
patient tongue id: 04111850211540_4
label yaofang:
麻黄 甘草 前胡 桔梗 半夏 防风 细辛 干姜 白芷 紫菀 白前 百部 辛夷 紫苏梗 广藿香 苍耳子
0.32799 0.921007 0.986705 0.683488 0.775748 0.354843 0.366978 0.40575 0.957516 0.963252 0.957889 0.975211 0.389196 0.996818 0.524152 0.445314 0.690061 0.887302
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.555556, recall: 0.625000, error: 0.444444
348. 
patient tongue id: 01130654133756_2_1_6
label yaofang:
甘草 桔梗 龙骨 桃仁 党参 酸枣仁 浙贝母 山茱萸 天麻 糯稻根 鳖甲 白花蛇舌 天山雪莲 半枝莲
0.986076 0.5436 0.660972 0.355765 0.31857 0.340583 0.684792 0.555643 0.557017 0.437157 0.4797 0.50557
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.571429, error: 0.333333
349. 
patient tongue id: 06062238057646_1_2
label yaofang:
甘草 川芎 茯苓 党参 白术 生地黄 赤芍 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.96022 0.518009 0.610838 0.372271 0.315066 0.591559 0.484844 0.491702 0.374829 0.412243 0.42079
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
350. 
patient tongue id: 02211830317758_6_7
label yaofang:
白芍 香附 枳壳 柏子仁 海螵蛸 白芷 茵陈 豆蔻 姜半夏 炙甘草 紫苏梗
0.809972 0.435668 0.348532 0.56156 0.344606 0.398515 0.328768 0.319619 0.52602
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
351. 
patient tongue id: 01040102132409_1_4_7
label yaofang:
甘草 白芍 茯苓 党参 白术 生地黄 红花 延胡索 赤芍 牛膝 桑寄生 补骨脂 续断 威灵仙
0.963777 0.513988 0.632631 0.37576 0.304621 0.32782 0.615391 0.501195 0.500023 0.383642 0.428311 0.43674
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
352. 
patient tongue id: 03151846551731_6_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.351387 0.470129 0.342048 0.32271 0.338588 0.370444 0.334721 0.444887 0.613829
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.777778, recall: 0.636364, error: 0.222222
353. 
patient tongue id: 06132020191763_1_4_6
label yaofang:
甘草 陈皮 半夏 黄芪 白术 杜仲 郁金 厚朴 菟丝子 莪术 北沙参 苦杏仁 紫苏子 紫苏叶 半枝莲 蛇舌草
0.787736 0.418347 0.505472 0.308871 0.392287 0.371286
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 天麻

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
354. 
patient tongue id: 02142134047254_1_2
label yaofang:
麻黄 陈皮 茯苓 前胡 半夏 防风 钩藤 款冬花 紫菀 白前 百部 紫苏子 蝉蜕 炙甘草
0.352402 0.604826 0.406534 0.707047 0.437809 0.506464 0.374159 0.343637 0.342024 0.624573 0.623521 0.644157 0.673967 0.418521 0.781307 0.395211 0.369751 0.489357 0.589567
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.473684, recall: 0.642857, error: 0.526316
355. 
patient tongue id: 04272328115879_3
label yaofang:
牛蒡子 党参 黄芪 白术 附子 车前子 干姜 砂仁 桑寄生 炙甘草 紫苏叶
0.318207 0.425085 0.31452 0.378407 0.348881 0.396737 0.627241
predicted yaofang:
柴胡 白芍 枳壳 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
356. 
patient tongue id: 02182143560802_5
label yaofang:
甘草 陈皮 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 桑白皮 款冬花 白前 苦杏仁 蜜麻黄
0.949792 0.507329 0.611315 0.382088 0.325913 0.587803 0.487232 0.48505 0.37687 0.416611 0.428309
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
357. 
patient tongue id: 03171006116646_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.432216 0.33511 0.394169 0.511571 0.313455
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
358. 
patient tongue id: 04081600238870_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.587504 0.404449 0.437408 0.419927 0.476187 0.307683
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
359. 
patient tongue id: 06190801496976_4_6
label yaofang:
甘草 薏苡仁 党参 鸡血藤 白术 苍术 厚朴 天麻 火麻仁 决明子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.843675 0.311742 0.425181 0.557723 0.416522 0.388392 0.300216 0.368693
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.357143, error: 0.375000
360. 
patient tongue id: 02190543097042_5_7_6
label yaofang:
甘草 薏苡仁 党参 枸杞子 白术 山药 天麻 鳖甲 扁豆花 麦芽 蒺藜 蜈蚣 白花蛇舌 天山雪莲 半枝莲 龙葵果
0.979781 0.530254 0.647149 0.347061 0.317139 0.649371 0.499185 0.503639 0.375063 0.420341 0.432873
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.625000, error: 0.090909
361. 
patient tongue id: 04121847359621_4_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄 木贼
0.571034 0.371845 0.709612 0.42987 0.47479 0.304714 0.618143 0.608355 0.625566 0.677197 0.393781 0.764034 0.370384 0.320026 0.406275 0.539947
predicted yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.812500, recall: 0.866667, error: 0.187500
362. 
patient tongue id: 05100801390725_1_3
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.385941 0.357327 0.376261 0.481445 0.316333
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
363. 
patient tongue id: 06022244281710_1_4_7
label yaofang:
甘草 茯苓 党参 枸杞子 白术 杜仲 桑白皮 僵蚕 菟丝子 补骨脂 百部 苦杏仁 紫苏子 紫苏叶 蜈蚣 骨碎补 紫苑
0.423122 0.33874 0.32835 0.324153 0.509773 0.544002 0.415329 0.334901 0.354464 0.313747
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.400000, recall: 0.235294, error: 0.600000
364. 
patient tongue id: 03081842263801_4
label yaofang:
法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.364507 0.840671 0.361629 0.94034 0.564076 0.649863 0.40878 0.403324 0.307785 0.382058 0.876179 0.878627 0.876948 0.905707 0.425709 0.974014 0.461154 0.414288 0.619808 0.796943
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.875000, error: 0.300000
365. 
patient tongue id: 03312103237908_1_6
label yaofang:
甘草 法半夏 茯苓 桔梗 桃仁 远志 党参 酸枣仁 丹参 黄连 竹茹 浙贝母 厚朴 紫苏梗 合欢花
0.939811 0.499223 0.594833 0.396212 0.326079 0.561062 0.448835 0.456195 0.338599 0.378629 0.377233
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
366. 
patient tongue id: 04300854066741_4_3
label yaofang:
甘草 枳壳 法半夏 党参 郁金 山药 薤白 石菖蒲 水蛭 补骨脂 莪术 益智 鹿角霜 瓜蒌子 土萆薢
0.897822 0.478954 0.308205 0.571569 0.444752 0.310363 0.360208 0.546041 0.4847 0.508378 0.390411 0.432033 0.450173
predicted yaofang:
甘草 茯苓 薏苡仁 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.230769, recall: 0.200000, error: 0.769231
367. 
patient tongue id: 02120932548764_5_6
label yaofang:
甘草 白芍 陈皮 葛根 党参 白术 黄连 苍术 山药 车前子 厚朴 莱菔子 豆蔻 建曲
0.978144 0.529757 0.639417 0.365323 0.328198 0.653647 0.527282 0.532516 0.397368 0.450503 0.459476
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
368. 
patient tongue id: 02191638388173_6_4_7
label yaofang:
甘草 陈皮 黄芩 法半夏 大枣 薏苡仁 桃仁 葶苈子 郁金 桑白皮 天麻 鳖甲 苦杏仁 蜈蚣 白花蛇舌 红豆杉
0.94658 0.315741 0.499643 0.613419 0.371538 0.56552 0.455824 0.449919 0.352527 0.383834 0.394395
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.312500, error: 0.545455
369. 
patient tongue id: 02190455537238_2_6
label yaofang:
甘草 酸枣仁 生地黄 牡丹皮 黄柏 山药 山茱萸 泽泻 砂仁 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 白花蛇舌 半枝莲
0.966727 0.520281 0.622902 0.395682 0.31572 0.357004 0.633719 0.535799 0.531576 0.417189 0.470808 0.494436
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
370. 
patient tongue id: 05140445268646_6_4
label yaofang:
甘草 法半夏 茯苓 党参 酸枣仁 栀子 牡丹皮 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.950933 0.302719 0.489185 0.629146 0.387283 0.310453 0.32452 0.590579 0.49187 0.494473 0.381921 0.424826 0.450593
predicted yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.714286, error: 0.230769
371. 
patient tongue id: 01192124343401_2_1
label yaofang:
甘草 黄芩 芦根 麦冬 太子参 浙贝母 乌梅 鳖甲 诃子 北沙参 苍耳子 白花蛇舌 蜂房 四季青
0.980535 0.521638 0.65386 0.370976 0.319527 0.347653 0.669743 0.555886 0.557132 0.435195 0.484132 0.516252
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
372. 
patient tongue id: 05242237165905_5_1_6
label yaofang:
甘草 法半夏 茯苓 桔梗 薏苡仁 桃仁 远志 浙贝母 车前子 天麻 射干 白花蛇舌草 苦杏仁 蜈蚣 醋鳖甲
0.90459 0.476357 0.574013 0.378297 0.506116 0.37763 0.396663 0.311638 0.314363
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.444444, recall: 0.266667, error: 0.555556
373. 
patient tongue id: 03022214309911_7_6_4
label yaofang:
甘草 川芎 薏苡仁 太子参 酸枣仁 生地黄 知母 天麻 鳖甲 莪术 浮小麦 首乌藤 蜈蚣 白花蛇舌 龙葵果
0.764316 0.421411 0.533765 0.37005 0.39283
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
374. 
patient tongue id: 03101912393386_1
label yaofang:
柴胡 白芍 香附 枳壳 丹参 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗
0.531121 0.345789 0.441289 0.427845 0.377342
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
375. 
patient tongue id: 01052108101213_2_6_7
label yaofang:
柴胡 白芍 黄芩 茯苓 龙骨 牡蛎 丹参 玄参 枳实 石膏 干姜 大黄 生地 法夏
0.486665 0.331722 0.369109 0.428784 0.31958 0.431754
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
376. 
patient tongue id: 02141941523676_6
label yaofang:
海螵蛸 肉桂 干姜 附片
0.320994 0.324526 0.37607 0.308009 0.346989 0.372
predicted yaofang:
甘草 白芍 党参 黄芪 白术 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
377. 
patient tongue id: 03301944353853_5
label yaofang:
桂枝 柴胡 葛根 麦冬 玉竹 党参 黄芪 蒺藜
0.413843 0.331066 0.458232 0.309937 0.423536 0.340551 0.33215 0.445834
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.250000, recall: 0.250000, error: 0.750000
378. 
patient tongue id: 06062238593233_1_4
label yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 党参 白术 浙贝母 鳖甲 麦芽 苦杏仁 白花蛇舌 天山雪莲
0.946552 0.50006 0.613626 0.393197 0.319812 0.569739 0.471587 0.476823 0.361371 0.398805 0.408688
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
379. 
patient tongue id: 01070840338288_1_4
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.479468 0.379438 0.387071 0.471098 0.419943 0.417159 0.320916 0.348403 0.308315 0.308408 0.318048 0.327345 0.346041 0.308193
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 夏枯草

------Score: precision: 0.214286, recall: 0.250000, error: 0.785714
380. 
patient tongue id: 01040651054435_6_7_2
label yaofang:
甘草 白芍 川芎 羌活 酸枣仁 柏子仁 赤芍 牛膝 细辛 天麻 全蝎 白芷 蔓荆子
0.875153 0.309255 0.471724 0.5641 0.378061 0.469179 0.341522 0.359034
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.230769, error: 0.625000
381. 
patient tongue id: 05191923074655_1_6_7
label yaofang:
甘草 木香 薏苡仁 党参 浙贝母 郁金 山药 天麻 鳖甲 首乌藤 黄精 蜈蚣 白花蛇舌 天山雪莲 土鳖虫 红豆杉
0.939251 0.497312 0.587619 0.411841 0.32528 0.548073 0.451728 0.476676 0.344609 0.383874 0.385475
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
382. 
patient tongue id: 06080019530821_1_5
label yaofang:
甘草 防风 蒲公英 党参 玄参 红花 黄柏 水牛角 天麻 白花蛇舌草 麦芽 忍冬藤 地肤子 蜈蚣 半枝莲 醋鳖甲
0.973479 0.522023 0.644337 0.386901 0.346936 0.369305 0.66662 0.558097 0.557619 0.441779 0.49472 0.528486
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
383. 
patient tongue id: 02241416153591_5_6
label yaofang:
甘草 香附 茯苓 蒲公英 党参 白术 延胡索 海螵蛸 紫苏梗 瓦楞子 猫爪草
0.37367 0.497584 0.375596 0.33082 0.317341 0.338047 0.350149 0.340091 0.512794 0.682297
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.363636, error: 0.600000
384. 
patient tongue id: 05171925157265_5_6
label yaofang:
甘草 茯苓 薏苡仁 党参 鸡血藤 白术 山药 天麻 白花蛇舌草 白扁豆 蜈蚣 半枝莲 醋鳖甲 麸炒枳壳
0.932193 0.488996 0.595311 0.392902 0.309096 0.539444 0.444485 0.454192 0.337436 0.373697 0.376337
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
385. 
patient tongue id: 02122217192544_2_1
label yaofang:
甘草 柴胡 黄芩 法半夏 桔梗 薏苡仁 浙贝母 牡丹皮 青蒿 天麻 鳖甲 莪术 建曲 蜈蚣 白花蛇舌 天山雪莲
0.946401 0.503312 0.604314 0.373005 0.561521 0.410522 0.419616 0.335406 0.334769
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.555556, recall: 0.312500, error: 0.444444
386. 
patient tongue id: 06031124393072_5_1
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 莱菔子 天麻 滑石 鳖甲 豆蔻 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.971919 0.521445 0.644157 0.367215 0.307674 0.325425 0.618882 0.51275 0.506127 0.400729 0.435752 0.452614
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.687500, error: 0.083333
387. 
patient tongue id: 04291504543648_7_2_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 桔梗 防风 玉竹 党参 浙贝母 款冬花 麦芽 北沙参 百合 大青叶
0.96785 0.50599 0.644158 0.376354 0.314348 0.336715 0.623081 0.527687 0.519345 0.409067 0.452563 0.484025
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
388. 
patient tongue id: 05042013167688_3_1_5
label yaofang:
黄芪 白术 浙贝母 当归尾 小茴香 地龙 丝瓜络 玉米须 半枝莲 土茯苓 山慈菇 鲜龙葵果 土萆薢 毛冬青
0.411202 0.357231 0.376745 0.318534 0.509208 0.495058 0.404583 0.326371 0.409581 0.316568
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
389. 
patient tongue id: 02231814092958_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子
0.368637 0.710289 0.390375 0.824166 0.46097 0.549156 0.407925 0.386593 0.332175 0.364836 0.733847 0.746428 0.757376 0.789466 0.430041 0.905802 0.415568 0.394643 0.565164 0.697581
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
390. 
patient tongue id: 04211804461324_5
label yaofang:
黄芩 连翘 薄荷 薏苡仁 玄参 浙贝母 石菖蒲 茵陈 射干 豆蔻 马勃 广藿香 木蝴蝶
0.903182 0.485614 0.562334 0.419068 0.32666 0.5289 0.427303 0.45261 0.332326 0.36656 0.370834
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
391. 
patient tongue id: 02161844419121_1
label yaofang:
甘草 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 紫菀 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.3772 0.827807 0.370959 0.93463 0.552035 0.660298 0.387765 0.397199 0.313767 0.390364 0.864095 0.865683 0.861037 0.894459 0.400728 0.966983 0.474632 0.432141 0.594314 0.782334
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.642857, error: 0.550000
392. 
patient tongue id: 02141932024839_6
label yaofang:
柴胡 香附 枳壳 柏子仁 海螵蛸 浙贝母 鸡内金 豆蔻 姜半夏 炙甘草 紫苏梗
0.883841 0.346791 0.442345 0.57571 0.383556 0.434304 0.33844 0.370157
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
393. 
patient tongue id: 03041248185883_1_5_6
label yaofang:
甘草 薏苡仁 党参 白术 酸枣仁 砂仁 天麻 鳖甲 柿蒂 豆蔻 麦芽 蜈蚣 半枝莲 红豆杉 瓦楞子 稻芽
0.435778 0.362128 0.42401 0.38832
predicted yaofang:
甘草 法半夏 茯苓 炙甘草

------Score: precision: 0.250000, recall: 0.062500, error: 0.750000
394. 
patient tongue id: 05160612230021_1_6_4
label yaofang:
桂枝 白芍 枳壳 龙齿 砂仁 桑寄生 鸡内金 炙甘草 续断 赭石 辛夷 首乌藤 黑枣 合欢皮
0.479664 0.351218 0.365483 0.360262 0.546426 0.514214 0.320817 0.447504 0.345796 0.310964 0.396721 0.328128
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
395. 
patient tongue id: 03301922299848_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.381608 0.749916 0.371136 0.879692 0.535067 0.611499 0.397654 0.402375 0.345667 0.401291 0.796186 0.812047 0.809875 0.846863 0.418922 0.936449 0.463181 0.432992 0.570733 0.72743
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
396. 
patient tongue id: 05091907553770_1_2
label yaofang:
白芍 川芎 当归 茯苓 太子参 黄芪 枸杞子 熟地黄 郁金 北柴胡 炙甘草 续断 盐菟丝子 酒女贞子 墨旱莲 干益母草
0.364271 0.797374 0.351392 0.927861 0.571349 0.663816 0.374424 0.391823 0.308442 0.405361 0.85702 0.864093 0.860667 0.896104 0.401748 0.960684 0.488487 0.441576 0.594522 0.773914
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.150000, recall: 0.187500, error: 0.850000
397. 
patient tongue id: 05261948353491_1_4_6
label yaofang:
陈皮 半夏 木香 远志 黄芪 白术 海螵蛸 杜仲 牛膝 郁金 山药 桑寄生 莪术 鸡内金 紫苏梗 蜈蚣 红豆杉 素馨花
0.590225 0.364493 0.423467 0.412723 0.50343
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.111111, error: 0.600000
398. 
patient tongue id: 05232016078681_5_2
label yaofang:
甘草 半夏 黄芪 白术 赤芍 海螵蛸 牡丹皮 杜仲 厚朴 水牛角 僵蚕 莪术 紫苏叶 蜈蚣 预知子 蛇舌草
0.651101 0.396404 0.444866 0.415501 0.495329 0.300578 0.312437
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 蜈蚣

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
399. 
patient tongue id: 05140852520557_6_4
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 赤芍 山药 天麻 鳖甲 补骨脂 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.977425 0.527126 0.647081 0.369293 0.330417 0.636042 0.517762 0.515322 0.390871 0.436974 0.449756
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
400. 
patient tongue id: 05111917526207_5_6
label yaofang:
甘草 半夏 蒲公英 黄芪 白术 赤芍 海螵蛸 郁金 莪术 佛手 合欢皮 姜黄 山慈菇 预知子 蛇舌草 稻芽 鸡骨草
0.367616 0.362521 0.467463 0.351547 0.475696 0.343361
predicted yaofang:
茯苓 半夏 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.500000, recall: 0.176471, error: 0.500000
401. 
patient tongue id: 03011832383913_1_4
label yaofang:
甘草 茯苓 葛根 桔梗 防风 麦冬 玄参 赤芍 白芷 北沙参 辛夷 广藿香 人参叶 炒六神曲 醋香附
0.359749 0.696458 0.380876 0.809697 0.443473 0.532343 0.42382 0.363141 0.317153 0.355152 0.709356 0.730331 0.754015 0.78157 0.456057 0.90464 0.395859 0.383353 0.558884 0.685893
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.350000, recall: 0.466667, error: 0.650000
402. 
patient tongue id: 06190658291704_1
label yaofang:
甘草 白芍 川芎 茯苓 龙骨 远志 党参 酸枣仁 生地黄 栀子 知母 地骨皮 女贞子 合欢花 墨旱莲
0.956041 0.505365 0.600366 0.405678 0.307937 0.357173 0.600671 0.512309 0.525258 0.407749 0.446919 0.462853
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
403. 
patient tongue id: 02202324079714_5_2
label yaofang:
甘草 黄芩 鱼腥草 海螵蛸 僵蚕 川贝母 紫菀 鸡内金 枇杷叶 地龙 北沙参 苦杏仁 炙麻黄 紫苏梗
0.443527 0.364296 0.379024 0.478317 0.361877 0.301619 0.317568
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.142857, error: 0.714286
404. 
patient tongue id: 01032111288998_6_4
label yaofang:
甘草 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 天麻 鳖甲 款冬花 苦杏仁 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.981877 0.532264 0.650602 0.376476 0.300894 0.344607 0.670181 0.562048 0.558833 0.435314 0.483435 0.50305
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
405. 
patient tongue id: 03091422535613_1_2_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.387112 0.303028 0.558625 0.334327 0.475854 0.448579 0.587688 0.478339 0.484854 0.487337 0.508336 0.537689 0.572429 0.358468 0.505022 0.561916 0.567515
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.235294, recall: 0.333333, error: 0.764706
406. 
patient tongue id: 03192249074227_6_4
label yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 黄连 竹茹 胆南星 栀子 淡豆豉 浮小麦 麸炒枳壳
0.970992 0.519188 0.638569 0.363983 0.30932 0.323464 0.623566 0.510369 0.506665 0.397774 0.433218 0.447631
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
407. 
patient tongue id: 03041414524833_6_4
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 党参 黄连 砂仁 瓜蒌皮 柿蒂 麦芽 佛手 紫苏梗 合欢花
0.935438 0.312805 0.490008 0.606548 0.369346 0.537159 0.421774 0.426407 0.313483 0.346144 0.354597
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
408. 
patient tongue id: 05221932388752_1
label yaofang:
甘草 当归 茯苓 党参 白术 海螵蛸 枳实 干姜 仙鹤草 补骨脂 浮小麦 瓦楞子
0.303094 0.381528 0.508882 0.400366 0.335911 0.392249 0.356594 0.330373 0.501415 0.563053
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.333333, error: 0.600000
409. 
patient tongue id: 06162156301016_1_2
label yaofang:
甘草 陈皮 茯苓 葛根 麦冬 菊花 佩兰 北沙参 广藿香 炒白扁豆 麸炒白术 麸炒苍术 炒六神曲 布渣叶
0.352093 0.554478 0.424342 0.596863 0.420543 0.442828 0.378056 0.368811 0.336 0.35442 0.535207 0.560267 0.540219 0.565499 0.359228 0.720484 0.347411 0.366729 0.417611 0.518835
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.200000, recall: 0.285714, error: 0.800000
410. 
patient tongue id: 02181952033834_7_4
label yaofang:
甘草 桔梗 金银花 桃仁 党参 生地黄 浙贝母 干姜 菟丝子 桑寄生 益母草 诃子 板蓝根 蝉蜕 紫苏梗 威灵仙
0.965343 0.516105 0.625998 0.372298 0.323572 0.609297 0.493346 0.49702 0.382636 0.420301 0.4331
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
411. 
patient tongue id: 06191335260928_1_5
label yaofang:
甘草 白芍 陈皮 茯苓 木香 防风 党参 白术 黄连 天麻 鳖甲 粉葛 建曲 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.937209 0.48777 0.605306 0.398086 0.318027 0.545073 0.459831 0.467247 0.354449 0.386611 0.404197
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.555556, error: 0.090909
412. 
patient tongue id: 05032259231494_5
label yaofang:
甘草 黄芩 法半夏 桔梗 牛蒡子 桃仁 鱼腥草 浙贝母 桑白皮 款冬花 紫菀 苇茎 苦杏仁 瓜蒌子 炙麻黄
0.80751 0.426622 0.557054 0.351704 0.46161
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.066667, error: 0.800000
413. 
patient tongue id: 03101952083939_1_3
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.344926 0.666728 0.359369 0.805572 0.466318 0.540278 0.361885 0.35486 0.333664 0.383687 0.704046 0.73438 0.729562 0.773681 0.375294 0.904176 0.398035 0.40288 0.488176 0.656361
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
414. 
patient tongue id: 06131959589605_3
label yaofang:
桂枝 茯苓 半夏 黄芪 白术 熟地黄 海螵蛸 牡丹皮 杜仲 附子 山药 山茱萸 泽泻 砂仁 麦芽 紫苏叶 预知子
0.575633 0.380988 0.425443 0.467675 0.431997 0.32582
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.176471, error: 0.500000
415. 
patient tongue id: 06181837424625_4_6_1
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桃仁 远志 浙贝母 细辛 款冬花 紫菀 苦杏仁 紫苏子 女贞子 炙麻黄 墨旱莲
0.960153 0.50467 0.631514 0.373959 0.317318 0.590215 0.473601 0.473455 0.358061 0.399732 0.4049
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.125000, error: 0.818182
416. 
patient tongue id: 03230717337546_1_6_4
label yaofang:
甘草 香附 薏苡仁 丹参 生地黄 延胡索 郁金 青蒿 天麻 地骨皮 鳖甲 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲
0.899499 0.453608 0.56269 0.453628 0.477365 0.372012 0.455714 0.306908
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.625000, recall: 0.312500, error: 0.375000
417. 
patient tongue id: 02260658219119_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 浙贝母 细辛 桑白皮 款冬花 苦杏仁 炙麻黄
0.963821 0.500977 0.629989 0.373147 0.305754 0.593893 0.492545 0.490214 0.374041 0.415415 0.432267
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.181818, error: 0.818182
418. 
patient tongue id: 02212003017639_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 豆蔻 姜半夏 炙甘草 紫苏梗
0.503364 0.323848 0.35526 0.44975 0.329957 0.397866
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.166667, recall: 0.111111, error: 0.833333
419. 
patient tongue id: 05311932090801_1
label yaofang:
陈皮 茯苓 党参 黄芪 白术 乌药 山药 砂仁 虎杖 紫苏子
0.495612 0.351089 0.393754 0.424094 0.454702
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.400000, error: 0.200000
420. 
patient tongue id: 03231038150851_1_2_7
label yaofang:
甘草 白芍 茯苓 党参 白术 丹参 菟丝子 益母草 醋香附 醋鳖甲 酒女贞子 墨旱莲 酒黄精 鹿衔草
0.948093 0.499361 0.600985 0.382937 0.308062 0.555208 0.455262 0.46347 0.348927 0.380785 0.391563
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
421. 
patient tongue id: 06031121379310_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 酸枣仁 丹参 黄连 生地黄 延胡索 川楝子 粉葛
0.938741 0.487951 0.621276 0.386664 0.306089 0.327977 0.559704 0.451132 0.450325 0.343166 0.379994 0.387531
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.307692, error: 0.666667
422. 
patient tongue id: 01180600520674_1_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 白术 栀子 牡丹皮 山药 山茱萸 补骨脂 麦芽 百合
0.956753 0.512734 0.609111 0.379353 0.310981 0.342218 0.615134 0.487525 0.492987 0.371663 0.420518 0.424079
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.357143, error: 0.583333
423. 
patient tongue id: 03171206353723_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.435478 0.352804 0.464554 0.338971 0.465065 0.491184 0.494037 0.389363 0.410167 0.396526 0.390879 0.398065 0.434335 0.354935 0.389526 0.424757 0.40503
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.294118, recall: 0.384615, error: 0.705882
424. 
patient tongue id: 05310822302530_1_3
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.412697 0.353581 0.336192 0.429959 0.442005 0.385711 0.307484 0.30035
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 车前子

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
425. 
patient tongue id: 04171811296364_1
label yaofang:
陈皮 桔梗 海螵蛸 车前子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.309047 0.348147 0.476454 0.346255 0.395384 0.333345 0.436265 0.535645
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.090909, error: 0.875000
426. 
patient tongue id: 03222027457809_1_2
label yaofang:
当归 木香 党参 黄芪 鸡血藤 白术 柏子仁 枳实 炙甘草 百合 紫苏叶
0.49852 0.328881 0.304744 0.467089 0.302411 0.390974
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术

------Score: precision: 0.500000, recall: 0.272727, error: 0.500000
427. 
patient tongue id: 04291614491486_1_2_6
label yaofang:
茯苓 党参 白术 酸枣仁 生地黄 天麻 菟丝子 益母草 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.819534 0.442102 0.54917 0.397005 0.3062 0.446222 0.311781 0.360344
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.400000, error: 0.250000
428. 
patient tongue id: 03271541493500_6
label yaofang:
麻黄 桂枝 柴胡 白芍 黄芩 法半夏 当归 葛根 桃仁 熟地黄 栀子 白茅根 水蛭 三七 旋覆花 炙甘草 赭石 红参
0.892325 0.485584 0.574027 0.365209 0.489764 0.325824 0.339073
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
429. 
patient tongue id: 05242229206751_2_1_6
label yaofang:
甘草 党参 白术 生地黄 杜仲 天麻 鳖甲 续断 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.965505 0.51757 0.624197 0.387583 0.334435 0.606313 0.512619 0.510249 0.401357 0.438548 0.447418
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
430. 
patient tongue id: 03211938048953_6_4
label yaofang:
甘草 川芎 陈皮 枳壳 茯苓 龙骨 牡蛎 牛蒡子 远志 酸枣仁 柏子仁 竹茹 姜半夏
0.300475 0.389804 0.527357 0.420992 0.333697 0.393709 0.342222 0.311473 0.515858 0.591085
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.300000, recall: 0.230769, error: 0.700000
431. 
patient tongue id: 04150831489518_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.410778 0.493077 0.323954 0.456947 0.549053 0.540657 0.388385 0.438945 0.369445 0.415566 0.412044 0.470123 0.305419 0.422653 0.472405 0.442182
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
432. 
patient tongue id: 04062239225694_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 牡荆子
0.70737 0.406883 0.463086 0.365588 0.481851 0.343472
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
433. 
patient tongue id: 04200637018914_2_6
label yaofang:
甘草 白芍 茯苓 龙骨 党参 白术 酸枣仁 生地黄 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.965207 0.505175 0.628655 0.365624 0.581256 0.466079 0.46878 0.343399 0.382958 0.397846
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.714286, error: 0.000000
434. 
patient tongue id: 02170748338173_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.490573 0.338553 0.413733 0.509078 0.370728 0.308781
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
435. 
patient tongue id: 04142215390079_1_2
label yaofang:
甘草 法半夏 茯苓 橘红 木香 太子参 五味子 生地黄 乌梅 山药 山茱萸 山楂 款冬花 紫菀 苦杏仁
0.945883 0.498352 0.602202 0.384314 0.312764 0.558631 0.455414 0.462214 0.346039 0.377234 0.385569
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
436. 
patient tongue id: 01172353579679_1_3
label yaofang:
桂枝 甘草 茯苓 半夏 黄芪 白术 附子 干姜 厚朴 砂仁 磁石 淫羊藿 款冬花 枇杷叶
0.694862 0.399604 0.480259 0.316748 0.443643
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
437. 
patient tongue id: 06070635311245_2_5
label yaofang:
甘草 白芍 枳壳 连翘 冬瓜仁 党参 太子参 丹参 赤芍 槟榔 山药 莱菔子 僵蚕 麦芽 黄精 白花蛇舌
0.839962 0.409 0.581943 0.418673
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.500000, recall: 0.125000, error: 0.500000
438. 
patient tongue id: 03062151385994_1_4
label yaofang:
当归 半夏 太子参 黄芪 鸡血藤 白术 海螵蛸 厚朴 砂仁 石斛 火麻仁 莪术 柿蒂 鸡内金 北沙参 紫苏梗 红豆杉 蛇舌草 稻芽
0.416478 0.35185 0.369311 0.512629 0.310953
predicted yaofang:
甘草 茯苓 党参 黄芪 北沙参

------Score: precision: 0.400000, recall: 0.105263, error: 0.600000
439. 
patient tongue id: 04192353596075_1
label yaofang:
甘草 枳壳 茯苓 木香 党参 白术 酸枣仁 郁金 天麻 桑寄生 虎杖 麦芽 合欢花
0.809355 0.361782 0.440533 0.551047 0.40447 0.380001 0.302826 0.331803
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.625000, recall: 0.384615, error: 0.375000
440. 
patient tongue id: 04221856495412_9
label yaofang:
茯苓 防风 钩藤 荆芥穗 白芷 香薷 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.352156 0.596524 0.386801 0.729414 0.465556 0.513225 0.377835 0.353916 0.369629 0.646018 0.655225 0.654659 0.691678 0.426271 0.791103 0.415385 0.388091 0.492226 0.590631
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.263158, recall: 0.416667, error: 0.736842
441. 
patient tongue id: 04260652227646_4_7
label yaofang:
甘草 川芎 法半夏 桃仁 白术 红花 细辛 天麻 全蝎 僵蚕 麦芽 蒺藜
0.984126 0.540792 0.651891 0.369322 0.337709 0.670203 0.536259 0.541198 0.404465 0.455461 0.465396
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
442. 
patient tongue id: 01032107079482_6_4
label yaofang:
甘草 茯苓 酸枣仁 车前子 天麻 猪苓 鳖甲 麦芽 鹿角霜 蜈蚣 天山雪莲 半枝莲 骨碎补 土鳖虫 泽兰
0.969409 0.514386 0.622262 0.377887 0.314574 0.601886 0.48632 0.493906 0.363478 0.406917 0.417748
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
443. 
patient tongue id: 01312252100004_1_5_6
label yaofang:
甘草 茯苓 薏苡仁 党参 鸡血藤 丹参 赤芍 山药 砂仁 天麻 鳖甲 茵陈 扁豆花 虎杖 蜈蚣 天山雪莲 半枝莲
0.969876 0.516645 0.631761 0.365721 0.610394 0.451199 0.46434 0.322111 0.371749 0.37516
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.470588, error: 0.200000
444. 
patient tongue id: 01061614245637_7_6_5
label yaofang:
甘草 白芍 川芎 黄芩 羌活 桃仁 白术 酸枣仁 红花 赤芍 牛膝 细辛 天麻 全蝎 僵蚕 白芷
0.963641 0.515369 0.623205 0.385678 0.301439 0.334464 0.615912 0.518906 0.516382 0.40214 0.444398 0.460223
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
445. 
patient tongue id: 02190942068008_6_7_2
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 菟丝子 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.966016 0.513011 0.624837 0.364726 0.319392 0.609403 0.485601 0.487386 0.367719 0.40999 0.421344
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.785714, error: 0.000000
446. 
patient tongue id: 03311653023131_4_6
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 海螵蛸 浙贝母 柿蒂 豆蔻 姜半夏 炙甘草 紫苏梗
0.515618 0.377771 0.322005 0.459084 0.411971
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
447. 
patient tongue id: 06190657284873_5_6
label yaofang:
甘草 薏苡仁 远志 党参 白术 厚朴 天麻 鳖甲 豆蔻 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.974807 0.513977 0.63406 0.411855 0.317853 0.367022 0.651518 0.552674 0.56568 0.42729 0.486927 0.514937
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
448. 
patient tongue id: 02272233112543_3
label yaofang:
党参 枸杞子 白术 熟地黄 杜仲 砂仁 菟丝子 巴戟天 桑寄生 鹿角霜 续断 制何首乌 艾叶
0.38588 0.381928 0.306242 0.404133 0.337378 0.413425
predicted yaofang:
甘草 白芍 茯苓 党参 白术 炙甘草

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
449. 
patient tongue id: 05260640396904_6_2
label yaofang:
甘草 茯苓 党参 山药 砂仁 天麻 鳖甲 麦芽 白扁豆 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉 牛大力
0.994009 0.546239 0.693779 0.369925 0.322772 0.363651 0.74461 0.605219 0.618868 0.459814 0.531533 0.57502
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
450. 
patient tongue id: 01190638119164_6_4_2
label yaofang:
甘草 黄芩 桔梗 浙贝母 乌梅 白芷 蔓荆子 鳖甲 辛夷 白花蛇舌 天山雪莲 蜂房 岗梅根 四季青
0.897821 0.481773 0.568105 0.396611 0.306124 0.498779 0.407745 0.425625 0.312946 0.340069 0.347486
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
451. 
patient tongue id: 05221922303189_6_4
label yaofang:
白芍 川芎 当归 茯苓 党参 白术 熟地黄 萆薢 炙甘草
0.314075 0.328682 0.443766 0.300133 0.301771 0.387045 0.36828 0.310504 0.368263 0.478323
predicted yaofang:
甘草 柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.400000, recall: 0.444444, error: 0.600000
452. 
patient tongue id: 03231040313074_6_2
label yaofang:
甘草 白芍 党参 五味子 山药 山茱萸 天麻 赤石脂 鳖甲 补骨脂 豆蔻 五倍子 建曲 蜈蚣 天山雪莲 半枝莲 广升麻
0.955032 0.50839 0.611503 0.378647 0.32057 0.583259 0.476733 0.478068 0.365658 0.402079 0.411629
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.470588, error: 0.272727
453. 
patient tongue id: 04142015568840_4_7_1
label yaofang:
甘草 川芎 法半夏 茯苓 党参 黄芪 白术 红花 天麻 僵蚕 麦芽 地龙 制白附子
0.964157 0.514363 0.629206 0.362222 0.309916 0.594902 0.475416 0.472245 0.363644 0.397434 0.411332
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.384615, error: 0.545455
454. 
patient tongue id: 05191839384617_6
label yaofang:
桂枝 白芍 法半夏 大枣 茯苓 葛根 羌活 鸡血藤 白术 竹茹 苍术 泽泻 三七 炙甘草 威灵仙
0.918986 0.492417 0.580744 0.400739 0.312316 0.526595 0.44405 0.455406 0.340782 0.374221 0.378624
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
455. 
patient tongue id: 02191633221377_1_2_6
label yaofang:
甘草 法半夏 茯苓 桔梗 浙贝母 天麻 蔓荆子 鳖甲 苦杏仁 紫苏子 辛夷 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.933801 0.491327 0.603921 0.384025 0.537001 0.431667 0.438543 0.320456 0.360241 0.359578
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.800000, recall: 0.533333, error: 0.200000
456. 
patient tongue id: 05290814157274_5_6_1
label yaofang:
甘草 柴胡 白芍 法半夏 木香 白及 浙贝母 郁金 白茅根 茜草 天麻 菟丝子 白花蛇舌草 蜈蚣 醋鳖甲 麸炒枳壳
0.969274 0.518122 0.624311 0.380674 0.334314 0.626521 0.516521 0.52435 0.398134 0.440499 0.443803
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
457. 
patient tongue id: 02111316314212_1_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.496147 0.338459 0.419529 0.401721 0.412101
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
458. 
patient tongue id: 03012157371345_2_7_6
label yaofang:
桂枝 甘草 茯苓 桃仁 玄参 生地黄 牡丹皮 乌药 郁金 山药 山茱萸 泽泻 莪术 浮小麦
0.889315 0.476294 0.575535 0.420433 0.330239 0.509632 0.450742 0.457056 0.354774 0.388646 0.395083
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
459. 
patient tongue id: 03012140128412_6_1_2
label yaofang:
甘草 白芍 木香 薏苡仁 党参 黄连 山茱萸 天麻 赤石脂 鳖甲 补骨脂 莪术 豆蔻 建曲 蜈蚣 白花蛇舌 天山雪莲
0.934547 0.485674 0.593676 0.392363 0.30808 0.543996 0.442797 0.452162 0.332802 0.367976 0.377246
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.411765, error: 0.363636
460. 
patient tongue id: 04300855364928_1_6
label yaofang:
桂枝 甘草 陈皮 茯苓 党参 白术 车前子 天麻 鳖甲 鹿角霜 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.978059 0.526935 0.660904 0.368015 0.325312 0.340957 0.663222 0.547604 0.540874 0.4277 0.474605 0.504129
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
461. 
patient tongue id: 04252008249604_1_6
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 麦芽 炙甘草 百合 紫苏叶 覆盆子
0.348134 0.458386 0.317264 0.318878 0.36573 0.388942 0.335493 0.404614 0.537259
predicted yaofang:
柴胡 白芍 香附 枳壳 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
462. 
patient tongue id: 01120058437211_2_1
label yaofang:
柴胡 白芍 大枣 当归 茯苓 薄荷 白术 炙甘草 嫩桑枝 丝瓜络 浮小麦 首乌藤 海风藤
0.687715 0.395559 0.362326 0.504777 0.385314
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
463. 
patient tongue id: 05251951592413_2_5
label yaofang:
甘草 枳壳 蒲公英 麦冬 枸杞子 玄参 黄连 赤芍 牡丹皮 厚朴 水牛角 僵蚕 补骨脂 北沙参 百合 木蝴蝶 冬凌草 山豆根
0.411536 0.316539 0.39045 0.440646 0.440117 0.305172
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.111111, error: 0.666667
464. 
patient tongue id: 04210737102446_1_4_7
label yaofang:
甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 鸡血藤 丹参 延胡索 枳实 竹茹 胆南星 厚朴
0.725835 0.41922 0.507134 0.307664 0.323612 0.410333
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 天麻

------Score: precision: 0.833333, recall: 0.357143, error: 0.166667
465. 
patient tongue id: 02150703267307_1_7
label yaofang:
甘草 丹参 生地黄 延胡索 牡丹皮 天麻 鳖甲 续断 蜈蚣 白花蛇舌 天山雪莲 半枝莲 骨碎补 宽筋藤
0.954119 0.505092 0.609085 0.393633 0.310949 0.351395 0.609802 0.517505 0.521858 0.405001 0.448125 0.46833
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.500000, error: 0.416667
466. 
patient tongue id: 03032100258435_1_7_4
label yaofang:
甘草 桃仁 黄芪 何首乌 白术 杜仲 砂仁 磁石 桑寄生 土鳖虫 红豆杉 姜黄 墨旱莲
0.409239 0.312379 0.342413 0.405719 0.566907 0.38673 0.340406
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
467. 
patient tongue id: 05252158078901_1_4
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 紫菀 白前 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.379822 0.717678 0.404361 0.824576 0.471368 0.540328 0.432881 0.401363 0.34697 0.374876 0.73097 0.745726 0.75652 0.787606 0.45621 0.910061 0.411412 0.398005 0.569466 0.696537
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.550000, recall: 0.785714, error: 0.450000
468. 
patient tongue id: 01140827116311_6_2
label yaofang:
甘草 独活 党参 鸡血藤 白术 酸枣仁 红花 苍术 地黄 天麻 白花蛇舌草 威灵仙 蜈蚣 半枝莲 醋鳖甲
0.967225 0.515575 0.630888 0.361435 0.319073 0.333142 0.632709 0.509036 0.505745 0.399074 0.436452 0.45629
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.466667, error: 0.416667
469. 
patient tongue id: 04271414465637_2_1_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 郁金 浮小麦 首乌藤 百合 制远志
0.480078 0.335913 0.462383 0.303815 0.494573 0.462385 0.507257 0.400642 0.418889 0.35665 0.390187 0.415773 0.429766 0.366676 0.380841 0.412273 0.39279
predicted yaofang:
甘草 茯苓 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.294118, recall: 0.416667, error: 0.705882
470. 
patient tongue id: 01100623133085_4_5
label yaofang:
麻黄 黄芩 桑白皮 款冬花 苦杏仁 姜半夏 炙甘草 紫苏梗
0.383778 0.345538 0.326979 0.391141 0.361737 0.407044 0.304523 0.390541
predicted yaofang:
甘草 白芍 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.125000, recall: 0.125000, error: 0.875000
471. 
patient tongue id: 03021154022283_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.489929 0.332885 0.461236 0.362344 0.345465
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
472. 
patient tongue id: 02260703487425_1_6
label yaofang:
甘草 薏苡仁 桃仁 党参 牡丹皮 青蒿 天麻 地骨皮 鳖甲 莪术 浮小麦 首乌藤 蜈蚣 天山雪莲 半枝莲
0.978497 0.519953 0.642199 0.371445 0.332934 0.647023 0.528127 0.533621 0.402166 0.452423 0.464765
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
473. 
patient tongue id: 03101751257177_2
label yaofang:
甘草 法半夏 葛根 前胡 桔梗 麦冬 玉竹 太子参 款冬花 紫菀 北沙参 人参叶
0.454129 0.390442 0.399527 0.444249 0.302358
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
474. 
patient tongue id: 04182008173944_6_1
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 龙骨 桃仁 柏子仁 生地黄 红花 赤芍 牛膝 姜半夏 合欢皮
0.363306 0.351364 0.505219 0.344224 0.427475 0.322883 0.39834 0.471687
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.200000, error: 0.625000
475. 
patient tongue id: 05182014464275_1_2
label yaofang:
麦冬 枸杞子 生地黄 赤芍 当归尾 砂仁 珍珠母 北沙参 土鳖虫 红豆杉 合欢皮 山慈菇 预知子 蛇舌草
0.38082 0.338692 0.301914 0.319099 0.523296
predicted yaofang:
白芍 党参 黄芪 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
476. 
patient tongue id: 01172348352426_1
label yaofang:
当归 黄芪 白术 延胡索 海螵蛸 砂仁 桑寄生 鸡内金 麦芽 首乌藤 桑枝 狗脊
0.354485 0.717424 0.364209 0.869903 0.492341 0.588287 0.37807 0.351679 0.370422 0.776075 0.783127 0.790633 0.832067 0.423516 0.918384 0.444736 0.405751 0.568925 0.712528
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
477. 
patient tongue id: 02211430188255_1_4_7
label yaofang:
川芎 陈皮 法半夏 当归 防风 乳香 胆南星 藿香 荆芥穗 白芷 辛夷 苍耳子 芥子 醋没药
0.339389 0.403292 0.365114
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
478. 
patient tongue id: 03311620517282_1_4_6
label yaofang:
蒲公英 太子参 黄芪 白术 当归尾 砂仁 磁石 菟丝子 桑寄生 鸡内金 首乌藤 红豆杉 合欢皮
0.471313 0.317027 0.319855 0.355589 0.599693 0.478753 0.44331 0.302145 0.380068
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 鸡内金 北沙参

------Score: precision: 0.333333, recall: 0.230769, error: 0.666667
479. 
patient tongue id: 04020817477376_6_4
label yaofang:
甘草 柴胡 茯苓 党参 丹参 青皮 浙贝母 郁金 山药 瓜蒌皮 王不留行 麦芽 鹿角霜 合欢花
0.919039 0.485789 0.585488 0.390054 0.513507 0.408589 0.423768 0.303312 0.337104 0.336762
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
480. 
patient tongue id: 04211323581650_2_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄
0.340907 0.558587 0.397648 0.650262 0.41253 0.45791 0.372048 0.321503 0.335856 0.563648 0.594339 0.593202 0.63461 0.425064 0.783095 0.370905 0.347819 0.458755 0.549728
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
481. 
patient tongue id: 02170810266165_1_6
label yaofang:
甘草 柴胡 白芍 当归 茯苓 薄荷 薏苡仁 白术 黄连 栀子 牡丹皮 肉桂 菊花 淡竹叶
0.361146 0.412544 0.430765
predicted yaofang:
甘草 党参 黄芪

------Score: precision: 0.333333, recall: 0.071429, error: 0.666667
482. 
patient tongue id: 02221235069382_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.525261 0.362723 0.320824 0.484782 0.354864
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
483. 
patient tongue id: 02120746203658_6_5
label yaofang:
甘草 柴胡 黄芩 半夏 党参 郁金 巴戟天 瓜蒌皮 鸡内金 珍珠母 麦芽 首乌藤 黑枣
0.58827 0.38013 0.417829 0.460004 0.445375 0.321117
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
484. 
patient tongue id: 03141255185738_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.412993 0.305466 0.450564 0.339756
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
485. 
patient tongue id: 03020653574126_6_2_7
label yaofang:
甘草 黄连 生地黄 延胡索 细辛 天麻 白芷 鳖甲 女贞子 浮小麦 蜈蚣 白花蛇舌 半枝莲
0.97932 0.532056 0.630527 0.375011 0.32659 0.640899 0.52501 0.530503 0.396842 0.444794 0.453188
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
486. 
patient tongue id: 04121903312842_6_2
label yaofang:
当归 木香 远志 党参 黄芪 枸杞子 白术 酸枣仁 龙眼肉 炙甘草 百合 合欢花 素馨花
0.364173 0.352614 0.35248 0.458834
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.500000, recall: 0.153846, error: 0.500000
487. 
patient tongue id: 01122349239866_1_4_7
label yaofang:
甘草 白芍 枳壳 茯苓 木香 白术 槟榔 山药 大腹皮 天麻 桑寄生 火麻仁 决明子 续断 天山雪莲
0.951197 0.496512 0.602576 0.376446 0.557243 0.443275 0.451055 0.326621 0.362656 0.377277
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
488. 
patient tongue id: 04130620382864_2_7
label yaofang:
桂枝 甘草 白芍 木香 白术 生地黄 延胡索 赤芍 砂仁 五灵脂 桑枝 川木瓜 宽筋藤 田七末
0.970121 0.512642 0.628349 0.387018 0.322385 0.600568 0.492347 0.500599 0.368677 0.412939 0.420899
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
489. 
patient tongue id: 04182209416725_1_4
label yaofang:
甘草 茯苓 太子参 黄芪 白术 延胡索 海螵蛸 当归尾 砂仁 僵蚕 枇杷叶 北沙参 山慈菇 蛇舌草
0.538229 0.384056 0.402413 0.45784 0.503416 0.357202 0.31801 0.327962
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.750000, recall: 0.428571, error: 0.250000
490. 
patient tongue id: 05232030150711_6_4
label yaofang:
大枣 当归 茯苓 木香 远志 党参 白术 柏子仁 海螵蛸 仙鹤草 炙甘草
0.409967 0.39883 0.454958 0.354649
predicted yaofang:
甘草 白芍 党参 炙甘草

------Score: precision: 0.500000, recall: 0.181818, error: 0.500000
491. 
patient tongue id: 03020750593522_1_6
label yaofang:
甘草 白芍 党参 白术 酸枣仁 生地黄 郁金 天麻 益母草 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.909267 0.48561 0.593304 0.410534 0.302607 0.326741 0.53542 0.452729 0.457731 0.337924 0.387312 0.40532
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
492. 
patient tongue id: 04121322469100_4
label yaofang:
麻黄 茯苓 前胡 半夏 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 苍耳子
0.35498 0.861603 0.317156 0.965312 0.61776 0.728346 0.35774 0.381604 0.410116 0.914121 0.921249 0.917619 0.94456 0.397732 0.986092 0.517758 0.442631 0.630016 0.830481
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
493. 
patient tongue id: 02171818015881_4
label yaofang:
白芍 法半夏 茯苓 前胡 桔梗 太子参 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.359255 0.733243 0.385247 0.849084 0.458866 0.557722 0.406085 0.370692 0.304711 0.353166 0.755695 0.767808 0.783843 0.817135 0.4412 0.926462 0.409886 0.38651 0.595852 0.728876
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
494. 
patient tongue id: 04131823197680_5
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 薏苡仁 桃仁 浙贝母 细辛 款冬花 苇茎 苦杏仁 蜜麻黄
0.970811 0.520861 0.625067 0.369911 0.321889 0.624813 0.508567 0.516196 0.391307 0.432038 0.442969
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
495. 
patient tongue id: 04260656467623_2_6
label yaofang:
甘草 杜仲 乌药 肉桂 山茱萸 地黄 天麻 白花蛇舌草 续断 蜈蚣 醋香附 半枝莲 醋鳖甲 艾叶
0.969724 0.516755 0.628216 0.370907 0.311342 0.609133 0.485841 0.493237 0.365834 0.407589 0.412128
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
496. 
patient tongue id: 06070645125326_1_2_7
label yaofang:
甘草 党参 白术 红花 赤芍 杜仲 天麻 菟丝子 益母草 鳖甲 续断 蜈蚣 天山雪莲 半枝莲
0.95717 0.504401 0.602979 0.408958 0.340375 0.591843 0.50819 0.514501 0.391698 0.432571 0.443067
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
497. 
patient tongue id: 02271247302107_1_3
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.398761 0.341347 0.36606 0.400427 0.345664
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
498. 
patient tongue id: 06191202211024_2_5
label yaofang:
甘草 茯苓 薏苡仁 远志 党参 白术 生地黄 山药 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 龙葵果
0.909577 0.470631 0.590322 0.396015 0.308111 0.508945 0.418177 0.421538 0.316026 0.347579 0.351499
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
499. 
patient tongue id: 03081821162172_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.30797 0.600062 0.41889 0.685749 0.443763 0.493818 0.350272 0.338907 0.33633 0.630605 0.606402 0.571933 0.599363 0.32099 0.712156 0.389624 0.352702 0.357574 0.527136
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
------Average Score: average precision: 0.446355, average recall: 0.350524, error: 0.553645