5568/20571 [=======>......................] - ETA: 124s - loss: 0.17372017-11-12 14:31:54.132118: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:247] PoolAllocator: After 34693 get requests, put_count=34690 evicted_count=1000 eviction_rate=0.0288268 and unsatisfied allocation rate=0.0317932
2017-11-12 14:31:54.132187: I tensorflow/core/common_runtime/gpu/pool_allocator.cc:259] Raising pool_size_limit_ from 100 to 110
20544/20571 [============================>.] - ETA: 0s - loss: 0.1179Epoch 00000: val_loss improved from inf to 0.08440, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 167s - loss: 0.1179 - val_loss: 0.0844
Epoch 2/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0881Epoch 00001: val_loss improved from 0.08440 to 0.07925, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0881 - val_loss: 0.0793
Epoch 3/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0847Epoch 00002: val_loss improved from 0.07925 to 0.07805, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0847 - val_loss: 0.0781
Epoch 4/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0826Epoch 00003: val_loss improved from 0.07805 to 0.07734, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0826 - val_loss: 0.0773
Epoch 5/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0810Epoch 00004: val_loss improved from 0.07734 to 0.07581, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0810 - val_loss: 0.0758
Epoch 6/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0801Epoch 00005: val_loss improved from 0.07581 to 0.07514, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0801 - val_loss: 0.0751
Epoch 7/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0793Epoch 00006: val_loss improved from 0.07514 to 0.07504, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0793 - val_loss: 0.0750
Epoch 8/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0786Epoch 00007: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0786 - val_loss: 0.0764
Epoch 9/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0780Epoch 00008: val_loss improved from 0.07504 to 0.07439, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0780 - val_loss: 0.0744
Epoch 10/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0773Epoch 00009: val_loss improved from 0.07439 to 0.07355, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0773 - val_loss: 0.0736
Epoch 11/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0768Epoch 00010: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0768 - val_loss: 0.0738
Epoch 12/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0765Epoch 00011: val_loss improved from 0.07355 to 0.07322, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0765 - val_loss: 0.0732
Epoch 13/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0759Epoch 00012: val_loss improved from 0.07322 to 0.07311, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0759 - val_loss: 0.0731
Epoch 14/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0755Epoch 00013: val_loss improved from 0.07311 to 0.07286, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0755 - val_loss: 0.0729
Epoch 15/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0751Epoch 00014: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0751 - val_loss: 0.0733
Epoch 16/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0746Epoch 00015: val_loss improved from 0.07286 to 0.07284, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0746 - val_loss: 0.0728
Epoch 17/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0743Epoch 00016: val_loss improved from 0.07284 to 0.07246, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0743 - val_loss: 0.0725
Epoch 18/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0739Epoch 00017: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0739 - val_loss: 0.0734
Epoch 19/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0737Epoch 00018: val_loss improved from 0.07246 to 0.07222, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0737 - val_loss: 0.0722
Epoch 20/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0734Epoch 00019: val_loss improved from 0.07222 to 0.07208, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0735 - val_loss: 0.0721
Epoch 21/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0729Epoch 00020: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0729 - val_loss: 0.0729
Epoch 22/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0727Epoch 00021: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0727 - val_loss: 0.0729
Epoch 23/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0723Epoch 00022: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0722 - val_loss: 0.0725
Epoch 24/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0720Epoch 00023: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0719 - val_loss: 0.0724
Epoch 25/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0716Epoch 00024: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0716 - val_loss: 0.0726
Epoch 26/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0713Epoch 00025: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0713 - val_loss: 0.0726
Epoch 27/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0710Epoch 00026: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0710 - val_loss: 0.0724
Epoch 28/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0706Epoch 00027: val_loss improved from 0.07208 to 0.07207, saving model to /home/b3432/Code/experiment/huiqiang/prescription-gen-file/cache/keras/tongue2text_cnn2passmlp_9585_act(bi)_t3_100it.h5
20571/20571 [==============================] - 163s - loss: 0.0706 - val_loss: 0.0721
Epoch 29/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0703Epoch 00028: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0703 - val_loss: 0.0721
Epoch 30/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0701Epoch 00029: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0701 - val_loss: 0.0729
Epoch 31/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0697Epoch 00030: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0697 - val_loss: 0.0730
Epoch 32/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0695Epoch 00031: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0695 - val_loss: 0.0727
Epoch 33/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0691Epoch 00032: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0691 - val_loss: 0.0728
Epoch 34/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0687Epoch 00033: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0687 - val_loss: 0.0727
Epoch 35/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0683Epoch 00034: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0683 - val_loss: 0.0723
Epoch 36/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0681Epoch 00035: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0681 - val_loss: 0.0729
Epoch 37/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0677Epoch 00036: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0677 - val_loss: 0.0730
Epoch 38/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0673Epoch 00037: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0673 - val_loss: 0.0731
Epoch 39/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0671Epoch 00038: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0671 - val_loss: 0.0731
Epoch 40/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0667Epoch 00039: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0667 - val_loss: 0.0724
Epoch 41/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0665Epoch 00040: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0665 - val_loss: 0.0731
Epoch 42/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0660Epoch 00041: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0660 - val_loss: 0.0732
Epoch 43/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0659Epoch 00042: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0659 - val_loss: 0.0730
Epoch 44/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0656Epoch 00043: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0656 - val_loss: 0.0731
Epoch 45/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0652Epoch 00044: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0652 - val_loss: 0.0728
Epoch 46/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0649Epoch 00045: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0649 - val_loss: 0.0741
Epoch 47/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0645Epoch 00046: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0645 - val_loss: 0.0733
Epoch 48/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0643Epoch 00047: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0643 - val_loss: 0.0735
Epoch 49/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0638Epoch 00048: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0638 - val_loss: 0.0733
Epoch 50/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0636Epoch 00049: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0636 - val_loss: 0.0731
Epoch 51/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0633Epoch 00050: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0634 - val_loss: 0.0740
Epoch 52/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0631Epoch 00051: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0631 - val_loss: 0.0747
Epoch 53/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0628Epoch 00052: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0628 - val_loss: 0.0742
Epoch 54/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0625Epoch 00053: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0625 - val_loss: 0.0738
Epoch 55/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0622Epoch 00054: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0622 - val_loss: 0.0738
Epoch 56/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0620Epoch 00055: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0620 - val_loss: 0.0742
Epoch 57/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0619Epoch 00056: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0619 - val_loss: 0.0744
Epoch 58/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0614Epoch 00057: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0614 - val_loss: 0.0749
Epoch 59/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0612Epoch 00058: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0612 - val_loss: 0.0741
Epoch 60/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0610Epoch 00059: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0610 - val_loss: 0.0741
Epoch 61/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0608Epoch 00060: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0608 - val_loss: 0.0750
Epoch 62/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0605Epoch 00061: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0605 - val_loss: 0.0747
Epoch 63/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0605Epoch 00062: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0604 - val_loss: 0.0751
Epoch 64/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0601Epoch 00063: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0601 - val_loss: 0.0748
Epoch 65/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0600Epoch 00064: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0600 - val_loss: 0.0749
Epoch 66/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0597Epoch 00065: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0597 - val_loss: 0.0745
Epoch 67/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0594Epoch 00066: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0594 - val_loss: 0.0748
Epoch 68/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0592Epoch 00067: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0592 - val_loss: 0.0746
Epoch 69/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0590Epoch 00068: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0590 - val_loss: 0.0750
Epoch 70/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0589Epoch 00069: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0589 - val_loss: 0.0751
Epoch 71/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0587Epoch 00070: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0587 - val_loss: 0.0754
Epoch 72/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0584Epoch 00071: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0584 - val_loss: 0.0751
Epoch 73/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0583Epoch 00072: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0583 - val_loss: 0.0754
Epoch 74/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0580Epoch 00073: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0580 - val_loss: 0.0754
Epoch 75/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0577Epoch 00074: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0577 - val_loss: 0.0755
Epoch 76/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0576Epoch 00075: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0576 - val_loss: 0.0756
Epoch 77/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0574Epoch 00076: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0574 - val_loss: 0.0764
Epoch 78/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0572Epoch 00077: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0572 - val_loss: 0.0762
Epoch 79/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0572Epoch 00078: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0572 - val_loss: 0.0761
Epoch 80/80
20544/20571 [============================>.] - ETA: 0s - loss: 0.0569Epoch 00079: val_loss did not improve
20571/20571 [==============================] - 163s - loss: 0.0569 - val_loss: 0.0761
history: [(0.11786058249132129, None, 0.084402303762813324, None), (0.088118769322989621, None, 0.079254712075947628, None), (0.084660320449443924, None, 0.078054927368868071, None), (0.082602153382940052, None, 0.077339590661783378, None), (0.081028523746933867, None, 0.075805014818679975, None), (0.080086546385707225, None, 0.075138480106263769, None), (0.079297201996714001, None, 0.075041685621941648, None), (0.078642591158948852, None, 0.076375878065869873, None), (0.077987719587443854, None, 0.074394653172797809, None), (0.077268134974076155, None, 0.073552908089516547, None), (0.076843318271594074, None, 0.073794035459308682, None), (0.076510328540702444, None, 0.073220667546924023, None), (0.075915721198432984, None, 0.073109233839780408, None), (0.075457374944469455, None, 0.072864469883558047, None), (0.075112944563296521, None, 0.073269977848097981, None), (0.074642693553545289, None, 0.072843690509121165, None), (0.074286496722265324, None, 0.072461003276038938, None), (0.073932405406010926, None, 0.073367396412102603, None), (0.073658572473756526, None, 0.072217411385732885, None), (0.073451595681247137, None, 0.072076450608092354, None), (0.072937189163249427, None, 0.072933866122179017, None), (0.072713278254649724, None, 0.072883532086282385, None), (0.072246526904408873, None, 0.072451838200041516, None), (0.071941611803294822, None, 0.072355721639171588, None), (0.071593900014532308, None, 0.07259184653945891, None), (0.071275193202386053, None, 0.072612757665563035, None), (0.071043007414795065, None, 0.072427033448146716, None), (0.07062215063088742, None, 0.072074577983474442, None), (0.070288654492678043, None, 0.072132726601088243, None), (0.070130451109127578, None, 0.072881236763123872, None), (0.069725559126605829, None, 0.072986104308742361, None), (0.069484286137031337, None, 0.072651464055480841, None), (0.069088359471716737, None, 0.072786785197221704, None), (0.068695875669677747, None, 0.072694663837257228, None), (0.068348391603342176, None, 0.072252589024183772, None), (0.068098423347600745, None, 0.072869693885927331, None), (0.067740263108144697, None, 0.073015623792575007, None), (0.067312646094568565, None, 0.073093761886998759, None), (0.067147076622489754, None, 0.073067200340364624, None), (0.066718338164153873, None, 0.072371686691109272, None), (0.066500328283442406, None, 0.073075171837886532, None), (0.065989293606443775, None, 0.07316730735055206, None), (0.065895301937494835, None, 0.072993987703432225, None), (0.065599308083934299, None, 0.073145872931728986, None), (0.065235038229670556, None, 0.07283278849525901, None), (0.064877105988991296, None, 0.074071456444317896, None), (0.064544597325620096, None, 0.07327656298195391, None), (0.06427736463131424, None, 0.073478523828939754, None), (0.063839851507475995, None, 0.073327577129981655, None), (0.063614525217466023, None, 0.073093837430442662, None), (0.063354208918750959, None, 0.073977850819831575, None), (0.06308310290080596, None, 0.074721129092315555, None), (0.062815805133894842, None, 0.074217507902028176, None), (0.062501183716923175, None, 0.073805854563662274, None), (0.062179455209193303, None, 0.073829232217514348, None), (0.061974734695951814, None, 0.074192614327191944, None), (0.061854877814003666, None, 0.074436107432098331, None), (0.061429281376987138, None, 0.0748749204274817, None), (0.061231751588004479, None, 0.074120283846940443, None), (0.061011162625309631, None, 0.074081751020395589, None), (0.060783325383879448, None, 0.07497970224606211, None), (0.060546124360252612, None, 0.074653161465668055, None), (0.060449984769432093, None, 0.075132990400540778, None), (0.060126442855361555, None, 0.074754683122242968, None), (0.059962286149329504, None, 0.074881294404852514, None), (0.059723767037734091, None, 0.074456344932725987, None), (0.059392027520315166, None, 0.074779505417590084, None), (0.059223601617656815, None, 0.074621441911571468, None), (0.058988062144854241, None, 0.074960395807182043, None), (0.058920685569504694, None, 0.075093830046860599, None), (0.058683273766812233, None, 0.07544994365588352, None), (0.058390473664693555, None, 0.075121250406157122, None), (0.058282342667372998, None, 0.075372906387578043, None), (0.058040197243459733, None, 0.075419125962248312, None), (0.057713224980090079, None, 0.075498810120187762, None), (0.057610468724983842, None, 0.075622900056013409, None), (0.057436319539915355, None, 0.07636664525422876, None), (0.057245584856822906, None, 0.076174746716857145, None), (0.057156511164876057, None, 0.076082372626848235, None), (0.056927178803691712, None, 0.076071136436868844, None)]
0. 
patient tongue id: 04061401153382_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.387446 0.740716 0.369678 0.879142 0.486728 0.583458 0.345225 0.392591 0.301674 0.306922 0.42197 0.781705 0.790986 0.711338 0.804041 0.33905 0.855224 0.436563 0.565822 0.389454 0.605599
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
1. 
patient tongue id: 05201454420097_4_6
label yaofang:
甘草 川芎 法半夏 远志 枸杞子 白术 红花 牛膝 石菖蒲 泽泻 天麻 地龙 粉葛 首乌藤 沙苑子
0.987636 0.508145 0.601458 0.318949 0.506781 0.521139 0.458721 0.384783 0.392573 0.362151
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
2. 
patient tongue id: 03231851332564_4
label yaofang:
陈皮 法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.405722 0.89727 0.981264 0.570687 0.710275 0.30546 0.395884 0.466903 0.938059 0.94716 0.881407 0.954956 0.303909 0.969636 0.517644 0.69377 0.423517 0.754132
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.833333, recall: 0.937500, error: 0.166667
3. 
patient tongue id: 02241401190370_1_4
label yaofang:
当归 茯苓 薏苡仁 黄芪 白术 浙贝母 厚朴 生半夏 砂仁 鸡内金 山慈菇 蛇舌草 稻芽 红曲
0.519882 0.521023 0.428046 0.488144 0.363003 0.336683 0.405044 0.335068 0.338141 0.302884
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 炙甘草

------Score: precision: 0.100000, recall: 0.071429, error: 0.900000
4. 
patient tongue id: 05260658381721_1_7
label yaofang:
甘草 柴胡 党参 赤芍 杜仲 山药 菟丝子 益母草 鳖甲 茵陈 虎杖 麦芽 广金钱草 土鳖虫 鹿衔草
0.984426 0.501375 0.612371 0.375635 0.33068 0.561864 0.572148 0.541678 0.420571 0.464843 0.463777
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
5. 
patient tongue id: 03291852082375_4_7
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.416336 0.402725 0.313901 0.409963 0.350627 0.324671
predicted yaofang:
甘草 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
6. 
patient tongue id: 03151334468792_4
label yaofang:
陈皮 法半夏 前胡 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄 炒苍耳子
0.355188 0.74921 0.349929 0.883353 0.506239 0.610468 0.318596 0.374431 0.317644 0.40933 0.798784 0.787228 0.726185 0.823266 0.325013 0.810237 0.445385 0.585219 0.402636 0.62346
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
7. 
patient tongue id: 04271431013097_1_2_7
label yaofang:
甘草 柴胡 川芎 枳壳 当归 桔梗 桃仁 生地黄 红花 赤芍 牛膝 郁金 六神曲
0.493825 0.340499 0.358152 0.391567 0.333014
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
8. 
patient tongue id: 02120742076074_1_4
label yaofang:
枳壳 太子参 黄芪 白术 海螵蛸 浙贝母 杜仲 山药 生半夏 菟丝子 鸡内金 紫苏梗 五指毛桃 稻芽
0.44373 0.400763 0.325309 0.467384 0.368354 0.439508
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参

------Score: precision: 0.333333, recall: 0.142857, error: 0.666667
9. 
patient tongue id: 03290232393996_2
label yaofang:
甘草 柴胡 白芍 茯苓 党参 山药 天麻 鳖甲 扁豆花 佛手 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.970297 0.487121 0.610586 0.368482 0.306909 0.331403 0.592638 0.571822 0.503199 0.428221 0.476534 0.465474
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
10. 
patient tongue id: 05232103420527_6_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 枳实 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.351444 0.407215 0.395605 0.406778 0.345238 0.317613 0.40176 0.304065 0.539446 0.65596 0.31433
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.545455, recall: 0.500000, error: 0.454545
11. 
patient tongue id: 04052201208638_5_2
label yaofang:
甘草 茯苓 太子参 黄芪 枸杞子 白术 黄连 赤芍 牡丹皮 杜仲 茜草 水牛角 北沙参 板蓝根 赭石 蜈蚣
0.682639 0.396253 0.448318 0.390719 0.452006
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.250000, error: 0.200000
12. 
patient tongue id: 04130627481246_1_6
label yaofang:
甘草 茯苓 天冬 生地黄 浙贝母 乌梅 天麻 鳖甲 火麻仁 北沙参 蜈蚣 白花蛇舌 蜂房 四季青
0.978868 0.494929 0.594347 0.337732 0.491035 0.480837 0.427924 0.344932 0.358744 0.341715
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.428571, error: 0.400000
13. 
patient tongue id: 06080206336466_1_2_6
label yaofang:
甘草 茯苓 蒲公英 党参 酸枣仁 丹参 生地黄 红花 山药 山茱萸 荆芥穗 麦芽 鹿角霜 首乌藤 地肤子 川加皮
0.994828 0.539443 0.652544 0.320824 0.319709 0.349417 0.688564 0.685816 0.622368 0.546474 0.587021 0.584917
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
14. 
patient tongue id: 06072246202358_4_2_6
label yaofang:
甘草 川芎 红花 赤芍 浙贝母 郁金 地黄 菟丝子 益母草 瓜蒌皮 王不留行 桑椹 紫苏梗 制何首乌 醋鳖甲 猫爪草
0.984826 0.500891 0.629306 0.362027 0.58591 0.615089 0.549415 0.48056 0.512572 0.513064
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.100000, recall: 0.062500, error: 0.900000
15. 
patient tongue id: 04142241088618_1_5
label yaofang:
甘草 防风 金银花 黄芪 何首乌 白术 五味子 生地黄 红花 牡丹皮 荆芥穗 麦芽 白鲜皮 地肤子 红条紫草
0.970039 0.488533 0.57817 0.362047 0.315795 0.512518 0.467423 0.446263 0.332085 0.359086 0.351253
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
16. 
patient tongue id: 05262203011744_1_2
label yaofang:
甘草 茯苓 桔梗 芦根 牛蒡子 太子参 浙贝母 山药 鳖甲 射干 皂角刺 苍耳子 白花蛇舌 蜂房 四季青
0.968731 0.499464 0.580143 0.345896 0.31797 0.513571 0.496167 0.433065 0.374659 0.384501 0.36012
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
17. 
patient tongue id: 04151216301567_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.384122 0.648734 0.346377 0.815579 0.449457 0.573908 0.3371 0.320418 0.381504 0.710288 0.709679 0.666065 0.772028 0.376587 0.78844 0.450592 0.542358 0.397555 0.560093
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 0.937500, error: 0.210526
18. 
patient tongue id: 06091948466459_6
label yaofang:
甘草 柴胡 白芍 川芎 香附 远志 枳实 泽泻 磁石 首乌藤 黑枣 合欢皮
0.871774 0.446647 0.512264 0.372014 0.326888 0.303582
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.083333, error: 0.833333
19. 
patient tongue id: 04271522448958_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.416616 0.595475 0.301391 0.392738 0.386758 0.639239 0.59721 0.543959 0.583172 0.602431 0.568392 0.650993 0.484042 0.649418 0.630817 0.652422
predicted yaofang:
甘草 桃仁 麦冬 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
20. 
patient tongue id: 04131852433615_1
label yaofang:
甘草 薏苡仁 桃仁 党参 赤芍 牡丹皮 白茅根 泽泻 水蛭 僵蚕 柿蒂 北沙参 赭石 半边莲 守宫
0.60288 0.360749 0.359166 0.600157 0.547756 0.433792 0.383905
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
21. 
patient tongue id: 05092208485915_4_1
label yaofang:
法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.370245 0.754636 0.366247 0.894451 0.498321 0.593491 0.316107 0.370495 0.403825 0.801661 0.798816 0.72717 0.827137 0.334683 0.848591 0.415933 0.558279 0.383063 0.611947
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
22. 
patient tongue id: 02110733330242_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.570955 0.386116 0.421318 0.442478 0.317293
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
23. 
patient tongue id: 01101812592766_1
label yaofang:
桂枝 白芍 法半夏 前胡 太子参 细辛 干姜 白芷 紫菀 白前 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄 醋五味子
0.404673 0.669063 0.376167 0.810608 0.47338 0.544619 0.353553 0.404246 0.337574 0.326776 0.429107 0.723958 0.727021 0.668803 0.759587 0.358457 0.774034 0.445688 0.308348 0.533715 0.443758 0.585995
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.590909, recall: 0.812500, error: 0.409091
24. 
patient tongue id: 06162212564758_1_2
label yaofang:
茯苓 防风 党参 太子参 黄芪 枸杞子 柏子仁 山药 芡实 煅牡蛎 北沙参 制远志 麸炒白术 煅龙骨
0.389114 0.365362 0.33463 0.501886 0.3927 0.463481
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
25. 
patient tongue id: 03170957243964_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.357801 0.363313 0.404813
predicted yaofang:
甘草 茯苓 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
26. 
patient tongue id: 03151943481008_4_7
label yaofang:
甘草 茯苓 半夏 薏苡仁 桃仁 白术 浙贝母 厚朴 莪术 北沙参 土鳖虫 猫爪草 合欢皮 山慈菇 蛇舌草
0.538051 0.363051 0.373595 0.545889 0.430579 0.351727 0.329218
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.714286, recall: 0.333333, error: 0.285714
27. 
patient tongue id: 04271848044926_6
label yaofang:
甘草 茯苓 半夏 蒲公英 黄连 海螵蛸 郁金 砂仁 柿蒂 赭石 紫苏叶 蜈蚣 合欢皮 预知子 蛇舌草 素馨花
0.839878 0.429522 0.444489 0.346916 0.496584 0.307597
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.500000, recall: 0.187500, error: 0.500000
28. 
patient tongue id: 01110256462326_5_7
label yaofang:
桂枝 柴胡 白芍 黄芩 茯苓 牡蛎 薏苡仁 桃仁 鸡血藤 牡丹皮 干姜 全蝎 天花粉 炙甘草 蜈蚣 土鳖虫 狗脊
0.649662 0.379765 0.441006 0.332021
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.058824, error: 0.750000
29. 
patient tongue id: 04241932291250_1
label yaofang:
茯苓 木香 党参 白术 赤芍 砂仁 炙甘草 醋香附 蒸陈皮 制枳壳
0.391068 0.334833 0.309673 0.397898 0.404869 0.333467 0.466281
predicted yaofang:
甘草 白芍 茯苓 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.571429, recall: 0.400000, error: 0.428571
30. 
patient tongue id: 05270629295847_2
label yaofang:
柴胡 白芍 陈皮 茯苓 党参 黄芪 枸杞子 白术 熟地黄 山药 山茱萸 炙甘草 女贞子 粉葛 沙苑子 广升麻 墨旱莲
0.953631 0.469177 0.560166 0.358956 0.402429 0.404261 0.380978
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.176471, error: 0.571429
31. 
patient tongue id: 06190146232816_2_7_4
label yaofang:
甘草 党参 生地黄 槟榔 山药 山茱萸 车前子 天麻 益母草 鳖甲 莪术 蜈蚣 白花蛇舌 天山雪莲 半枝莲 泽兰 红豆杉
0.98655 0.50892 0.617367 0.334188 0.331076 0.594 0.562811 0.495583 0.421402 0.450726 0.42846
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.529412, error: 0.181818
32. 
patient tongue id: 04182142477272_6
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 杜仲 郁金 地黄 天麻 桑寄生 续断 浮小麦 玉米须 蜈蚣 醋鳖甲
0.985122 0.51129 0.61591 0.3202 0.33173 0.612424 0.541054 0.469361 0.39257 0.431091 0.418518
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
33. 
patient tongue id: 06022222548736_1_4_7
label yaofang:
甘草 当归 茯苓 半夏 党参 黄芪 枸杞子 白术 海螵蛸 杜仲 牛膝 郁金 山药 厚朴 鸡内金 紫苏叶 黄精 红豆杉
0.646262 0.362669 0.338824 0.352321 0.588391 0.657275 0.324279 0.345099 0.462935 0.372237 0.325916 0.392698 0.318139
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 莪术 北沙参 合欢皮

------Score: precision: 0.692308, recall: 0.500000, error: 0.307692
34. 
patient tongue id: 06132018267438_1_4_7
label yaofang:
甘草 陈皮 当归 茯苓 半夏 远志 麦冬 党参 黄芪 白术 海螵蛸 杜仲 厚朴 莪术 鸡内金 合欢花 红豆杉 预知子
0.599547 0.327886 0.423204 0.681802 0.745015 0.418312 0.370328 0.551354 0.423178 0.354574 0.331491 0.451317 0.415528 0.300092
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 莪术 鸡内金 北沙参 合欢皮 蛇舌草

------Score: precision: 0.714286, recall: 0.555556, error: 0.285714
35. 
patient tongue id: 01062034216746_2_7_5
label yaofang:
甘草 白芍 黄芩 玄参 生地黄 赤芍 牛膝 钩藤 天麻 补骨脂 决明子 麦芽 首乌藤 川木瓜
0.997588 0.530514 0.67517 0.325737 0.334515 0.71745 0.710514 0.64585 0.524652 0.595754 0.577652
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
36. 
patient tongue id: 01180620443032_1_6
label yaofang:
甘草 川芎 法半夏 茯苓 羌活 生地黄 牛膝 山药 细辛 天麻 全蝎 白芷 蔓荆子 补骨脂
0.994316 0.520568 0.652613 0.331723 0.35547 0.666139 0.641163 0.579865 0.469544 0.533368 0.513538
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
37. 
patient tongue id: 03261558212237_5
label yaofang:
甘草 桔梗 连翘 薄荷 芦根 桃仁 酸枣仁 桑叶 菊花 莱菔子 白前 鸡内金 苦杏仁 野马追
0.723426 0.404775 0.479839 0.307241 0.309762
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
38. 
patient tongue id: 01050702588982_1_2
label yaofang:
甘草 当归 茯苓 党参 黄芪 鸡血藤 生地黄 赤芍 山药 天麻 鳖甲 补骨脂 蜈蚣 天山雪莲 半枝莲
0.983741 0.501471 0.603092 0.397851 0.323156 0.522021 0.549118 0.576667 0.376066 0.419997 0.421031
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
39. 
patient tongue id: 04062001420669_4
label yaofang:
陈皮 桔梗 牛蒡子 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香
0.419485 0.328031 0.377807 0.321567 0.460533 0.38194 0.315946 0.378015 0.440895
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.111111, recall: 0.100000, error: 0.888889
40. 
patient tongue id: 04112258168299_3
label yaofang:
桂枝 党参 白术 附子 干姜 桑寄生 淫羊藿 炙甘草 紫苏叶 鹿衔草
0.427206 0.335675 0.397003 0.347864 0.473465 0.380297 0.364775 0.478675
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.300000, error: 0.625000
41. 
patient tongue id: 02211402073496_1_4_7
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 淡竹叶 北沙参
0.556859 0.343674 0.317698 0.329845 0.615235 0.610603 0.335731 0.449885 0.331569 0.40477
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 北沙参

------Score: precision: 0.400000, recall: 0.333333, error: 0.600000
42. 
patient tongue id: 05092032105143_1_6
label yaofang:
桂枝 甘草 白芍 大枣 桃仁 党参 郁金 北柴胡 淫羊藿 虎杖 白花蛇舌草 土茯苓
0.37877 0.347664 0.420773 0.385187 0.349439 0.348529 0.439898
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
43. 
patient tongue id: 01172334379834_1_2
label yaofang:
甘草 白芍 薏苡仁 太子参 浙贝母 郁金 天麻 鳖甲 莪术 佛手 黄精 蜈蚣 白花蛇舌 天山雪莲
0.973541 0.48494 0.581857 0.342141 0.48844 0.449407 0.411836 0.31629 0.336295 0.31357
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.428571, error: 0.400000
44. 
patient tongue id: 06031129285832_2
label yaofang:
甘草 黄芩 桔梗 金银花 党参 生地黄 浙贝母 杜仲 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.832504 0.303642 0.426412 0.531798 0.39744 0.335656
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻

------Score: precision: 0.500000, recall: 0.200000, error: 0.500000
45. 
patient tongue id: 02241402106682_1_7_4
label yaofang:
黄芪 白术 厚朴 当归尾 砂仁 桑寄生 火麻仁 莪术 鸡内金 北沙参 女贞子 红豆杉 墨旱莲 稻芽
0.557329 0.358974 0.396674 0.521948 0.422922 0.32707
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
46. 
patient tongue id: 05262157348249_1_2_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 芦根 牛蒡子 党参 黄连 熟附子 天花粉 鳖甲 白花蛇舌 蜂房 四季青 广升麻
0.878518 0.451423 0.499778 0.373216 0.301729
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.187500, error: 0.400000
47. 
patient tongue id: 03301946158645_4
label yaofang:
麻黄 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗
0.414887 0.756384 0.330196 0.898026 0.506255 0.617577 0.366525 0.42036 0.337729 0.351938 0.468309 0.816227 0.827109 0.745589 0.84544 0.355831 0.878535 0.506866 0.320304 0.601948 0.440485 0.645145
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.733333, error: 0.500000
48. 
patient tongue id: 04181955087196_6_2
label yaofang:
甘草 川芎 茯苓 桃仁 酸枣仁 浙贝母 牛膝 天麻 全蝎 诃子 紫苏梗 合欢花 猫爪草
0.989671 0.511167 0.625154 0.326447 0.309028 0.584212 0.563733 0.488091 0.410024 0.437642 0.409765
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
49. 
patient tongue id: 03161325592714_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.384927 0.636933 0.397266 0.762204 0.460688 0.541001 0.343259 0.382264 0.318802 0.336991 0.413476 0.668164 0.665039 0.618767 0.696237 0.352066 0.742599 0.416182 0.308583 0.525997 0.400393 0.547585
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.636364, recall: 1.000000, error: 0.363636
50. 
patient tongue id: 02170953502522_1_3
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.507622 0.349843 0.377713 0.313819 0.624268 0.586123 0.381811 0.470848 0.335373 0.331707 0.444459 0.332624
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.333333, recall: 0.333333, error: 0.666667
51. 
patient tongue id: 01052200569275_6_1
label yaofang:
牡蛎 黄芪 白术 赤芍 浙贝母 砂仁 菟丝子 桑寄生 莪术 北沙参 首乌藤 土鳖虫 红豆杉 合欢皮
0.643687 0.370025 0.347026 0.587785 0.579928 0.30462 0.431204 0.308588 0.380154
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
52. 
patient tongue id: 05022011050090_4
label yaofang:
麻黄 柴胡 前胡 桔梗 半夏 防风 薄荷 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗
0.398422 0.946338 0.993762 0.616459 0.79959 0.415702 0.513961 0.972378 0.977337 0.929465 0.980767 0.987338 0.583896 0.76494 0.422393 0.814968
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.571429, error: 0.500000
53. 
patient tongue id: 01182101099533_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 天麻 鳖甲 佛手 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.974857 0.491044 0.588452 0.357908 0.305374 0.496798 0.495945 0.465389 0.364948 0.385474 0.374053
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
54. 
patient tongue id: 03311828582555_4_1
label yaofang:
桂枝 白芍 法半夏 茯苓 前胡 太子参 黄芪 细辛 干姜 紫菀 北沙参 炙甘草 炒紫苏子 蜜麻黄 醋五味子
0.398935 0.807233 0.327977 0.941562 0.525116 0.649013 0.3216 0.388599 0.442404 0.866744 0.876687 0.801656 0.896937 0.337407 0.911218 0.484273 0.62549 0.42335 0.680582
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.666667, error: 0.473684
55. 
patient tongue id: 03231632217563_4
label yaofang:
茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香
0.381256 0.627047 0.391418 0.748607 0.465778 0.529496 0.352551 0.378477 0.321918 0.338523 0.409431 0.661077 0.661691 0.618496 0.689661 0.357398 0.734249 0.417885 0.313682 0.515372 0.399086 0.553205
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.590909, recall: 1.000000, error: 0.409091
56. 
patient tongue id: 02191636266781_5_6
label yaofang:
甘草 枳壳 法半夏 木香 连翘 党参 白术 槟榔 砂仁 莱菔子 款冬花 莪术 麦芽 建曲 独脚金
0.995437 0.529009 0.64475 0.33289 0.341021 0.664647 0.656009 0.601936 0.489435 0.539521 0.525566
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
57. 
patient tongue id: 04241844023475_6_4
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗
0.316208 0.325683 0.378892 0.351882 0.43001 0.365591 0.367242 0.473311 0.561981
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.666667, recall: 0.545455, error: 0.333333
58. 
patient tongue id: 04020758504249_1_2_7
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 远志 仙鹤草 天麻 磁石 鳖甲 麦芽 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.995145 0.526459 0.635421 0.340998 0.305092 0.347226 0.665796 0.677062 0.618875 0.526067 0.567205 0.555245
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.666667, recall: 0.500000, error: 0.333333
59. 
patient tongue id: 04261352455223_1_2_4
label yaofang:
茯苓 半夏 黄芪 白术 杜仲 山药 砂仁 鸡内金 佛手 骨碎补 田基黄
0.40092 0.349437 0.497095 0.485249 0.404116
predicted yaofang:
甘草 党参 黄芪 白术 海螵蛸

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
60. 
patient tongue id: 05131312072449_2_1_6
label yaofang:
甘草 木香 黄连 浙贝母 天麻 赤石脂 糯稻根 鳖甲 补骨脂 豆蔻 粉葛 建曲 蜈蚣 天山雪莲 半枝莲 龟甲
0.955825 0.48776 0.550915 0.339589 0.431952 0.439177 0.388948 0.341214 0.332102 0.310273
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.375000, error: 0.400000
61. 
patient tongue id: 05232119406283_1_4_7
label yaofang:
陈皮 茯苓 半夏 党参 黄芪 枸杞子 白术 海螵蛸 杜仲 牛膝 郁金 山药 厚朴 菟丝子 炙甘草 紫苏叶 红豆杉
0.791618 0.409673 0.426603 0.371875 0.540355
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.235294, error: 0.200000
62. 
patient tongue id: 02182144582851_4_6
label yaofang:
桂枝 甘草 陈皮 法半夏 茯苓 前胡 桔梗 党参 浙贝母 细辛 白前 苦杏仁 粉葛 炙麻黄 贯众
0.484607 0.314611 0.571921 0.421008 0.643888 0.428397 0.420401 0.324669 0.314442 0.566132 0.512621 0.462248 0.508531 0.31593 0.442367 0.322351 0.399083 0.364327
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.444444, recall: 0.533333, error: 0.555556
63. 
patient tongue id: 01190633162554_1_2_5
label yaofang:
甘草 薏苡仁 党参 五味子 山药 白茅根 细辛 茜草 天麻 鳖甲 款冬花 紫菀 百部 炙麻黄 蜈蚣 白花蛇舌 天山雪莲
0.983513 0.507507 0.601005 0.341567 0.313883 0.530637 0.507776 0.461071 0.368996 0.394945 0.374961
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.470588, error: 0.272727
64. 
patient tongue id: 03180120024623_7_1
label yaofang:
甘草 柴胡 川芎 香附 防风 赤芍 青蒿 荆芥穗 白芷 郁李仁 芥子
0.420451 0.326364 0.375208 0.314372 0.431931 0.395466 0.31561 0.34391 0.450567
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.181818, error: 0.777778
65. 
patient tongue id: 04130019502437_1_6
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 山药 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.974408 0.48799 0.581945 0.37512 0.48588 0.530986 0.49003 0.412281 0.417428 0.408917
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.692308, error: 0.100000
66. 
patient tongue id: 05032229113666_2_6
label yaofang:
甘草 茯苓 党参 黄芪 白术 酸枣仁 天麻 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.991794 0.513036 0.641157 0.35174 0.314094 0.328598 0.650027 0.670533 0.621584 0.53356 0.574737 0.585344
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
67. 
patient tongue id: 04112157111411_4_2
label yaofang:
甘草 陈皮 法半夏 茯苓 生地黄 牡丹皮 山药 山茱萸 菟丝子 桑螵蛸 益智
0.972048 0.479148 0.592021 0.379262 0.477737 0.487439 0.459134 0.351937 0.373228 0.362941
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.181818, error: 0.800000
68. 
patient tongue id: 03062145390911_1_5
label yaofang:
甘草 陈皮 桃仁 蒲公英 黄芪 延胡索 海螵蛸 浙贝母 厚朴 砂仁 白芷 火麻仁 鸡内金 蛤壳 土鳖虫 冬凌草
0.624467 0.402849 0.398979 0.370934 0.425617
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.125000, error: 0.600000
69. 
patient tongue id: 03240556187035_1_4
label yaofang:
甘草 白芍 陈皮 防风 薏苡仁 党参 白术 山药 天麻 巴戟天 五灵脂 鳖甲 莪术 白扁豆 蜈蚣 天山雪莲 半枝莲
0.868293 0.446044 0.515388 0.425588 0.34057 0.307119 0.372333
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.857143, recall: 0.352941, error: 0.142857
70. 
patient tongue id: 04271845042168_2_1
label yaofang:
甘草 柴胡 枳壳 半夏 薏苡仁 白术 浙贝母 厚朴 淡豆豉 僵蚕 夏枯草 麦芽 合欢皮 预知子 蛇舌草
0.561581 0.382774 0.334031 0.31818 0.508969 0.566585 0.376843 0.314283 0.401246
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.444444, recall: 0.266667, error: 0.555556
71. 
patient tongue id: 04072013484283_1_4
label yaofang:
桂枝 枳壳 茯苓 薏苡仁 太子参 黄芪 枸杞子 白术 海螵蛸 杜仲 山药 厚朴 砂仁 猪苓 芡实 鸡内金 莲子 蜈蚣 红豆杉 五指毛桃 山慈菇
0.522091 0.348211 0.402934 0.641682 0.631271 0.382492 0.316057 0.495647 0.365919 0.331722 0.472335 0.355641
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.666667, recall: 0.380952, error: 0.333333
72. 
patient tongue id: 05312201115129_6_4
label yaofang:
甘草 川芎 法半夏 葛根 龙骨 牡蛎 白术 牛膝 荷叶 天麻 僵蚕 磁石 麦芽 地龙
0.989139 0.501806 0.618486 0.36346 0.315322 0.542845 0.560631 0.546602 0.408668 0.43772 0.436807
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
73. 
patient tongue id: 05252151193279_1_4
label yaofang:
陈皮 法半夏 前胡 太子参 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.370525 0.607945 0.39058 0.737701 0.441166 0.499386 0.330228 0.340929 0.372625 0.635234 0.624316 0.583925 0.664511 0.356898 0.721256 0.372256 0.489112 0.345817 0.504532
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.866667, error: 0.315789
74. 
patient tongue id: 05222048314097_1_4_7
label yaofang:
茯苓 黄芪 白术 熟地黄 牡丹皮 山药 山茱萸 石菖蒲 泽泻 全蝎 磁石 鸡内金 北沙参 紫苏梗
0.762567 0.403571 0.414547 0.452313 0.579139 0.325121 0.309491
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
75. 
patient tongue id: 03311618353367_1_6_5
label yaofang:
半夏 黄芪 何首乌 白术 赤芍 浙贝母 杜仲 砂仁 菟丝子 桑寄生 橘络 土鳖虫 红豆杉 山慈菇
0.603076 0.347137 0.347397 0.371696 0.663652 0.62716 0.376453 0.338611 0.499141 0.354106 0.343497 0.409267 0.350312
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 鸡内金 北沙参 合欢皮

------Score: precision: 0.384615, recall: 0.357143, error: 0.615385
76. 
patient tongue id: 03091957598829_4
label yaofang:
甘草 法半夏 前胡 太子参 黄芪 细辛 干姜 白芷 款冬花 紫菀 百部 北沙参 辛夷 炒紫苏子 蜜麻黄 炒苍耳子
0.335062 0.461583 0.332766 0.702892 0.366079 0.352891 0.342684 0.309093 0.4614 0.52317 0.409046 0.577788 0.431483 0.637613 0.335373 0.402625 0.310009
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.588235, recall: 0.625000, error: 0.411765
77. 
patient tongue id: 04141810307623_1_4_3
label yaofang:
甘草 茯苓 半夏 党参 白术 海螵蛸 杜仲 黄柏 郁金 山药 干姜 厚朴 砂仁 鸡内金 紫苏叶 黑枣
0.460442 0.346916 0.356978 0.4707 0.456922 0.316918
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.833333, recall: 0.312500, error: 0.166667
78. 
patient tongue id: 01202014305224_4_1
label yaofang:
甘草 茯苓 白术 海螵蛸 浙贝母 款冬花 诃子 枇杷叶 北沙参
0.828663 0.435544 0.46885 0.350149 0.4235
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.333333, error: 0.400000
79. 
patient tongue id: 01070838157796_1_4_7
label yaofang:
当归 党参 黄芪 熟附子 乌药 山药 干姜 淫羊藿 吴茱萸 仙茅 益智 鹿角霜 煨诃子
0.498445 0.386937 0.36257 0.355075 0.450041 0.306769
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 炙甘草

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
80. 
patient tongue id: 04062010470215_4
label yaofang:
甘草 白芍 川芎 独活 牛膝 细辛 干姜 仙鹤草 地榆 蜈蚣 姜黄 海桐皮 鹿衔草
0.63403 0.389731 0.422584 0.400104 0.479792
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
81. 
patient tongue id: 04142240095050_1
label yaofang:
柴胡 香附 龙骨 牡蛎 酸枣仁 合欢皮
0.694152 0.398278 0.498483 0.318288 0.363718
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
82. 
patient tongue id: 03261704535207_2
label yaofang:
川芎 陈皮 枳壳 麦冬 酸枣仁 丹参 天冬 柏子仁 乌药 三七 火麻仁 珍珠母 首乌藤
0.430287 0.366989 0.423275 0.337358 0.309468
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
83. 
patient tongue id: 06062306583042_2_4
label yaofang:
甘草 法半夏 茯苓 前胡 细辛 天麻 鳖甲 款冬花 白前 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.952525 0.47223 0.555822 0.402545 0.384298 0.396994 0.404215
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.357143, error: 0.285714
84. 
patient tongue id: 02182153524198_5
label yaofang:
甘草 茯苓 连翘 白及 党参 黄连 细辛 地黄 白芷 升麻 淡竹叶 麦芽 川木通 独脚金
0.995109 0.528012 0.632291 0.313781 0.325722 0.644922 0.639286 0.566238 0.489987 0.516431 0.494321
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
85. 
patient tongue id: 05102213347871_1
label yaofang:
法半夏 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.389752 0.780412 0.333184 0.927881 0.505125 0.615195 0.323825 0.360947 0.403226 0.843605 0.847655 0.784688 0.880587 0.362239 0.890536 0.449227 0.59454 0.415769 0.65827
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 1.000000, error: 0.368421
86. 
patient tongue id: 03022216261981_5_6
label yaofang:
甘草 白术 生地黄 延胡索 天麻 五灵脂 鳖甲 忍冬藤 桑枝 威灵仙 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986985 0.513025 0.620483 0.346415 0.322876 0.582085 0.592001 0.522536 0.454978 0.482544 0.474774
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
87. 
patient tongue id: 06050823498044_1_3_5
label yaofang:
当归 党参 黄芪 牛膝 山药 泽泻 车前子 淫羊藿 仙茅 鹿角霜
0.44491 0.369073 0.344575 0.365818 0.324098
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
88. 
patient tongue id: 03111430205613_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 天麻 鳖甲 莪术 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花
0.990724 0.526039 0.616323 0.332628 0.340458 0.612538 0.605832 0.549043 0.473868 0.497595 0.486763
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
89. 
patient tongue id: 02252106267683_6
label yaofang:
甘草 川芎 党参 枸杞子 酸枣仁 牛膝 天麻 麦芽 地龙 女贞子 辛夷 粉葛 首乌藤 沙苑子 墨旱莲
0.94882 0.477669 0.567661 0.362531 0.305487 0.461017 0.397077 0.391262 0.302554
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.333333, recall: 0.200000, error: 0.666667
90. 
patient tongue id: 01061612088942_6_5
label yaofang:
甘草 柴胡 白芍 法半夏 远志 白术 黄连 山药 车前子 荆芥穗 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.927955 0.317841 0.444166 0.559546 0.355597 0.356887 0.324727 0.309848
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.375000, error: 0.250000
91. 
patient tongue id: 03081806311097_4
label yaofang:
桂枝 甘草 白芍 大枣 桃仁 玉竹 党参 郁金 北柴胡 淫羊藿 川牛膝 土茯苓 粉萆薢
0.633456 0.347449 0.452469 0.361222
predicted yaofang:
甘草 法半夏 茯苓 党参

------Score: precision: 0.500000, recall: 0.153846, error: 0.500000
92. 
patient tongue id: 03302119258776_1_5
label yaofang:
甘草 白芍 木香 独活 桃仁 党参 鸡血藤 丹参 五味子 赤芍 山药 茵陈 补骨脂 虎杖
0.93008 0.463923 0.510251 0.425461 0.30238 0.322084 0.318565 0.383803
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
93. 
patient tongue id: 03231257059886_5
label yaofang:
甘草 法半夏 茯苓 前胡 芦根 细辛 桑白皮 款冬花 白前 苦杏仁 板蓝根 紫苏子 炙麻黄 贯众
0.945533 0.479585 0.565136 0.387549 0.301161 0.465169 0.453569 0.430979 0.337858 0.357353 0.347404
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
94. 
patient tongue id: 01012101437253_1_4_2
label yaofang:
当归 党参 黄芪 熟附子 乌药 肉桂 山药 干姜 淫羊藿 仙茅 益智 鹿角霜 醋龟甲
0.577514 0.384075 0.368329 0.57324 0.462257 0.398408 0.39917
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
95. 
patient tongue id: 05032310205188_2_5
label yaofang:
甘草 白芍 茯苓 党参 白术 酸枣仁 生地黄 牡丹皮 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.980326 0.505827 0.611155 0.347533 0.303365 0.327019 0.592587 0.599541 0.542721 0.476121 0.505803 0.508512
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.785714, error: 0.083333
96. 
patient tongue id: 02120938162483_6_2
label yaofang:
甘草 薏苡仁 党参 白术 酸枣仁 栀子 佩兰 淡豆豉 天麻 鳖甲 豆蔻 苦杏仁 蜈蚣 天山雪莲 半枝莲
0.943839 0.469054 0.540249 0.354995 0.387207 0.300354 0.33661
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.857143, recall: 0.400000, error: 0.142857
97. 
patient tongue id: 04291457028674_4_1
label yaofang:
甘草 党参 杜仲 郁金 地黄 天麻 桑寄生 莪术 白花蛇舌草 续断 蜈蚣 半枝莲 醋鳖甲 炒鸡内金
0.991276 0.506575 0.632817 0.327876 0.320105 0.605125 0.602209 0.537556 0.444856 0.482402 0.476869
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
98. 
patient tongue id: 02240823021724_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌
0.493736 0.415086 0.327255 0.327774
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
99. 
patient tongue id: 03062147483742_6_1
label yaofang:
甘草 陈皮 枳壳 茯苓 半夏 连翘 党参 白术 厚朴 山楂 鸡内金 紫苏梗 红曲
0.660285 0.361122 0.38641 0.338173 0.622388 0.707804 0.340942 0.380983 0.5016 0.401517 0.371427 0.432489 0.357885
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 莪术 北沙参 合欢皮

------Score: precision: 0.461538, recall: 0.461538, error: 0.538462
100. 
patient tongue id: 05242124534603_1_7
label yaofang:
甘草 柴胡 法半夏 茯苓 木香 党参 黄连 赤芍 郁金 砂仁 茵陈 海金沙 鸡内金 虎杖 王不留行 建曲
0.986585 0.509472 0.590153 0.338238 0.307168 0.529971 0.552699 0.49174 0.421972 0.431246 0.411156
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
101. 
patient tongue id: 02271238456277_1_3
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 厚朴
0.38547 0.333376 0.339295 0.370701 0.32328
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
102. 
patient tongue id: 03041130217807_1_4
label yaofang:
陈皮 前胡 桔梗 防风 白芷 款冬花 香薷 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.395052 0.75966 0.340963 0.900662 0.493122 0.603237 0.33296 0.380663 0.300104 0.426707 0.808865 0.819011 0.756207 0.847127 0.346543 0.874512 0.454263 0.582016 0.423631 0.645202
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
103. 
patient tongue id: 02191434505439_2_1_6
label yaofang:
甘草 茯苓 酸枣仁 浙贝母 钩藤 天麻 鳖甲 蒺藜 辛夷 浮小麦 蜈蚣 白花蛇舌 蜂房 岗梅根 四季青
0.978887 0.502162 0.58734 0.338888 0.309503 0.520979 0.52554 0.459478 0.400296 0.407055 0.396626
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.400000, error: 0.454545
104. 
patient tongue id: 04222219198280_4_1
label yaofang:
法半夏 前胡 防风 太子参 黄芪 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.405495 0.768847 0.334229 0.915019 0.505516 0.61001 0.336334 0.404508 0.312412 0.30121 0.449707 0.833218 0.843165 0.771676 0.863765 0.340687 0.885302 0.470589 0.590394 0.438883 0.656299
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.714286, recall: 0.937500, error: 0.285714
105. 
patient tongue id: 05131601339713_6_3
label yaofang:
甘草 当归 生地黄 红花 杜仲 山药 山茱萸 桑寄生 补骨脂 金樱子 蛇床子 锁阳 覆盆子 合欢花
0.975252 0.496183 0.5897 0.349046 0.31879 0.52943 0.49016 0.442494 0.350756 0.379244 0.360638
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
106. 
patient tongue id: 05091951513926_2_4
label yaofang:
甘草 茯苓 葛根 麦冬 玉竹 太子参 豆蔻 北沙参 麸炒白术 炒六神曲 干石斛
0.405105 0.909787 0.981848 0.580452 0.712855 0.327554 0.405539 0.483759 0.941683 0.951107 0.890859 0.954296 0.309427 0.976188 0.518873 0.698834 0.425756 0.773018
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.111111, recall: 0.181818, error: 0.888889
107. 
patient tongue id: 02142139552086_4_6
label yaofang:
甘草 陈皮 法半夏 茯苓 远志 党参 酸枣仁 黄连 竹茹 栀子 淡豆豉 扁豆花 麦芽 合欢花 木棉花
0.961035 0.470703 0.558257 0.380304 0.417803 0.429241 0.426479 0.313003 0.319747 0.317906
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
108. 
patient tongue id: 01201257235995_7
label yaofang:
桂枝 甘草 川芎 桃仁 党参 鸡血藤 白术 生地黄 红花 赤芍 天麻 首乌藤 桑枝 威灵仙 络石藤
0.979353 0.490984 0.61789 0.343243 0.328092 0.584459 0.537847 0.471882 0.392077 0.430925 0.426185
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
109. 
patient tongue id: 04272226537886_4
label yaofang:
法半夏 前胡 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.400451 0.852957 0.966981 0.542397 0.689381 0.375333 0.423347 0.917916 0.916337 0.85564 0.937778 0.303969 0.931135 0.496626 0.659506 0.426914 0.712661
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.764706, recall: 0.928571, error: 0.235294
110. 
patient tongue id: 04201909145958_1_2
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.388831 0.864065 0.966272 0.542112 0.679262 0.323759 0.381025 0.447729 0.908736 0.917714 0.850898 0.932578 0.331928 0.950537 0.489804 0.652992 0.418088 0.724216
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.555556, recall: 0.769231, error: 0.444444
111. 
patient tongue id: 04181948547886_4_6
label yaofang:
甘草 陈皮 法半夏 茯苓 羌活 独活 连翘 薏苡仁 远志 党参 苍术 厚朴 砂仁 莱菔子 麦芽
0.982193 0.498485 0.609967 0.34663 0.331849 0.589975 0.571236 0.511417 0.428571 0.464846 0.458437
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
112. 
patient tongue id: 05312318078421_6_4_2
label yaofang:
甘草 茯苓 远志 白术 酸枣仁 丹参 天麻 鳖甲 首乌藤 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.986993 0.507651 0.626766 0.352441 0.310699 0.341089 0.604544 0.624484 0.571035 0.489581 0.526187 0.526974
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
113. 
patient tongue id: 02151846385728_9
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.396396 0.803097 0.325541 0.929871 0.506792 0.634943 0.339783 0.402338 0.302242 0.443179 0.846515 0.85957 0.786915 0.878438 0.337075 0.90603 0.478286 0.618326 0.431946 0.67101
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 1.000000, error: 0.300000
114. 
patient tongue id: 01041633057269_1
label yaofang:
甘草 香附 茯苓 党参 白术 延胡索 海螵蛸 车前子 紫苏梗 瓦楞子 猫爪草
0.406666 0.332898 0.384054 0.32332 0.452874 0.387873 0.332044 0.373802 0.469316
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.555556, recall: 0.454545, error: 0.444444
115. 
patient tongue id: 03111506389668_6_2
label yaofang:
甘草 柴胡 白芍 茯苓 太子参 浙贝母 郁金 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.972992 0.496009 0.582198 0.372644 0.314557 0.48071 0.5049 0.465997 0.37961 0.391179 0.380187
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
116. 
patient tongue id: 04062006015367_1_4
label yaofang:
白芍 香附 枳壳 法半夏 党参 海螵蛸 车前子 北柴胡 麦芽 炙甘草 紫苏梗 威灵仙
0.375966 0.3157 0.370191 0.305919 0.435241 0.403428 0.340763 0.379739 0.48905
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.555556, recall: 0.416667, error: 0.444444
117. 
patient tongue id: 04221926339968_2_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.395589 0.780645 0.344156 0.914006 0.505362 0.618456 0.352443 0.396563 0.315084 0.43884 0.82374 0.833716 0.763184 0.857302 0.355809 0.892944 0.467535 0.598427 0.425028 0.653973
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.866667, error: 0.350000
118. 
patient tongue id: 01182108236412_5
label yaofang:
黄芪 白术 丹参 海螵蛸 浙贝母 厚朴 砂仁 莪术 鸡内金 北沙参 合欢皮 预知子
0.753675 0.418524 0.406267 0.327349 0.397941
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
119. 
patient tongue id: 04271911212480_1
label yaofang:
甘草 防风 金银花 薏苡仁 生地黄 牡丹皮 荆芥穗 皂角刺 蝉蜕 蒺藜 干鱼腥草 地肤子 麸炒苍术 炒僵蚕
0.379291 0.657523 0.382333 0.815578 0.4445 0.526798 0.332339 0.345689 0.366094 0.707655 0.701025 0.665971 0.747738 0.393633 0.765456 0.401404 0.508991 0.406364 0.569296
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.052632, recall: 0.071429, error: 0.947368
120. 
patient tongue id: 03012211288698_1_2
label yaofang:
甘草 白芍 川芎 茯苓 龙骨 党参 何首乌 生地黄 山药 女贞子 佛手 浮小麦 百合 合欢花
0.996332 0.51435 0.678735 0.346125 0.327194 0.6885 0.711728 0.632933 0.525817 0.596836 0.573567
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
121. 
patient tongue id: 01042326212585_5
label yaofang:
甘草 黄芩 桔梗 牛蒡子 浙贝母 天麻 蔓荆子 白花蛇舌草 苦杏仁 板蓝根 辛夷 蜈蚣 半枝莲 醋鳖甲
0.99259 0.522308 0.642111 0.322409 0.303472 0.332067 0.639136 0.636616 0.562376 0.498597 0.532586 0.528263
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.285714, error: 0.666667
122. 
patient tongue id: 04281837048971_5
label yaofang:
甘草 桔梗 荆芥 芦根 薏苡仁 鱼腥草 白茅根 桑白皮 莱菔子 白芷 瓜蒌皮 紫菀 白前 百部 苦杏仁 紫苏子 辛夷 蜜麻黄 炒苍耳子
0.681964 0.373451 0.350732 0.474993 0.375115
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.052632, error: 0.800000
123. 
patient tongue id: 03061822520635_1_4
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 栀子 淡豆豉 天麻 地骨皮 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.981532 0.510592 0.603701 0.34146 0.322053 0.556064 0.554166 0.481914 0.432903 0.444557 0.423741
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
124. 
patient tongue id: 03111520227143_5_6
label yaofang:
甘草 白芍 薏苡仁 党参 白术 熟附子 杜仲 牛膝 天麻 桑寄生 鳖甲 败酱草 蜈蚣 半枝莲 宽筋藤
0.993324 0.523867 0.629344 0.320131 0.314618 0.606428 0.59052 0.535742 0.439526 0.465206 0.439943
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
125. 
patient tongue id: 04221854155670_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.353496 0.666274 0.407948 0.781661 0.462761 0.535372 0.331287 0.368008 0.319098 0.389801 0.677106 0.669045 0.603977 0.686001 0.330648 0.746843 0.38656 0.510764 0.350175 0.52482
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.875000, error: 0.300000
126. 
patient tongue id: 03021407008448_1_3
label yaofang:
丹参 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌 燀桃仁
0.725513 0.406356 0.499397 0.397695
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
127. 
patient tongue id: 05242115541267_1_4_6
label yaofang:
甘草 法半夏 茯苓 前胡 五味子 细辛 天麻 鳖甲 款冬花 苦杏仁 炙麻黄 紫苏梗 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.977472 0.50519 0.597057 0.354691 0.328311 0.557364 0.532698 0.476615 0.398483 0.425674 0.402821
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.437500, error: 0.363636
128. 
patient tongue id: 03012330204884_6_2
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 丹参 青皮 郁金 山药 桑寄生 王不留行 女贞子 合欢花
0.981483 0.487705 0.608347 0.402404 0.328932 0.53248 0.546179 0.528823 0.385989 0.428822 0.416314
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
129. 
patient tongue id: 03151858231984_4_6
label yaofang:
桂枝 柴胡 白芍 黄芩 党参 五味子 郁金 虎杖 白花蛇舌草 麦芽 姜半夏 炙甘草 土茯苓
0.363762 0.315248 0.364817 0.316699 0.428157 0.376482 0.358022 0.402371 0.49321
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.555556, recall: 0.384615, error: 0.444444
130. 
patient tongue id: 03291629032904_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 木香 党参 郁金 莪术 鸡内金 虎杖 王不留行 麦芽 建曲 紫苏梗
0.975497 0.493047 0.591196 0.348609 0.304796 0.514114 0.517716 0.454914 0.388391 0.406481 0.376284
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
131. 
patient tongue id: 02202243329382_6_2_1
label yaofang:
甘草 茯苓 党参 酸枣仁 柏子仁 山药 天麻 鳖甲 火麻仁 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.972555 0.477317 0.604196 0.341307 0.51136 0.460044 0.409526 0.308861 0.344257 0.327365
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.642857, error: 0.100000
132. 
patient tongue id: 03062132360335_2
label yaofang:
甘草 白芍 川芎 香附 枳壳 黄芩 党参 白术 丹参 生地黄 菟丝子 桑寄生
0.864955 0.412596 0.506059 0.410405
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.250000, error: 0.250000
133. 
patient tongue id: 05042027328961_6_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 蝉蜕 炙甘草
0.487543 0.349594 0.422144 0.414182 0.302418
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
134. 
patient tongue id: 01250705332646_2_7_6
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 生地黄 知母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.914657 0.465987 0.547086 0.369037 0.304436 0.414246 0.343823 0.359289
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.400000, error: 0.250000
135. 
patient tongue id: 05102157522625_1_2
label yaofang:
法半夏 前胡 太子参 细辛 干姜 砂仁 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 麸炒白术
0.388074 0.850027 0.302988 0.955384 0.536607 0.664047 0.317992 0.390879 0.458186 0.88716 0.900443 0.827594 0.911082 0.302758 0.946317 0.474811 0.646668 0.408043 0.709695
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
136. 
patient tongue id: 03022137597482_6
label yaofang:
柴胡 陈皮 当归 龙骨 党参 黄芪 白术 车前子 砂仁 升麻 炙甘草
0.429841 0.35185 0.325599 0.430837 0.387581 0.313592 0.326271 0.442933
predicted yaofang:
甘草 白芍 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.272727, error: 0.625000
137. 
patient tongue id: 02182019245594_7_1
label yaofang:
甘草 党参 酸枣仁 杜仲 牛膝 乌药 山茱萸 天麻 桑寄生 金樱子 桑螵蛸 锁阳 益智 首乌藤
0.90246 0.463346 0.541259 0.37466 0.431304 0.362627 0.356598
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
138. 
patient tongue id: 01192135351045_2_6
label yaofang:
甘草 茯苓 酸枣仁 丹参 赤芍 杜仲 黄柏 知母 天麻 僵蚕 桑寄生 淫羊藿 仙茅 浮小麦
0.997789 0.523042 0.677277 0.368719 0.347513 0.694059 0.716208 0.686916 0.524901 0.597035 0.605515
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
139. 
patient tongue id: 06190128269523_1_4
label yaofang:
甘草 茯苓 前胡 桔梗 薄荷 鱼腥草 桑叶 瓜蒌皮 紫菀 麦芽 苦杏仁 炙麻黄
0.994965 0.522598 0.647821 0.340697 0.30631 0.350965 0.683374 0.689484 0.627133 0.535998 0.588006 0.573417
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.166667, recall: 0.166667, error: 0.833333
140. 
patient tongue id: 05172100312708_2_6_7
label yaofang:
甘草 白芍 党参 白术 丹参 生地黄 熟附子 山茱萸 大黄 菟丝子 桑寄生 益母草 火麻仁 补骨脂
0.975337 0.500353 0.586822 0.363077 0.31444 0.509518 0.512766 0.46018 0.384404 0.40086 0.372892
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
141. 
patient tongue id: 04122158242782_6_4
label yaofang:
甘草 独活 党参 白术 延胡索 川楝子 杜仲 砂仁 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.781511 0.450073 0.423654 0.394621
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.214286, error: 0.250000
142. 
patient tongue id: 01041817323239_4_1
label yaofang:
甘草 薏苡仁 黄芪 滑石 豆蔻 萹蓄 焦栀子 干鱼腥草 麸炒白术 川木通 车前草
0.402263 0.811298 0.944926 0.538708 0.70774 0.317814 0.406149 0.333529 0.468476 0.885717 0.888559 0.804534 0.908052 0.310321 0.90501 0.554108 0.302098 0.673005 0.439046 0.677904
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
143. 
patient tongue id: 04232023543639_4_2
label yaofang:
麻黄 桂枝 陈皮 茯苓 连翘 薏苡仁 白术 泽泻 车前子 莱菔子 防己 赤小豆 茯苓皮 猪苓 鸡内金 广藿香 土茯苓
0.603652 0.3628 0.398303 0.316458 0.62117 0.681037 0.353013 0.343753 0.48509 0.377455 0.319652 0.439674 0.348491
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 莪术 北沙参 合欢皮

------Score: precision: 0.153846, recall: 0.117647, error: 0.846154
144. 
patient tongue id: 03312025598943_1_4
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 郁金 砂仁 鳖甲 款冬花 扁豆花 莪术 紫菀 麦芽 苦杏仁 白花蛇舌 天山雪莲
0.991178 0.513989 0.631343 0.367827 0.313016 0.348651 0.653672 0.678611 0.624503 0.547436 0.585947 0.577126
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.375000, error: 0.500000
145. 
patient tongue id: 01092344547222_2_4
label yaofang:
白芍 葛根 钩藤 桑叶 石斛 秦皮 决明子 蒺藜 化橘红
0.368647 0.339958 0.404371 0.322394 0.350489 0.502839
predicted yaofang:
甘草 白芍 党参 白术 姜半夏 炙甘草

------Score: precision: 0.166667, recall: 0.111111, error: 0.833333
146. 
patient tongue id: 02281833026313_1
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.818679 0.414002 0.500948 0.417006
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
147. 
patient tongue id: 03261651213449_4
label yaofang:
甘草 前胡 荆芥 防风 牛蒡子 鱼腥草 浙贝母 桑白皮 紫菀 枇杷叶 紫苏叶 东风桔
0.56798 0.304689 0.362636 0.451661 0.398644
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
148. 
patient tongue id: 02211414567789_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.451951 0.390987 0.301192 0.357065
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
149. 
patient tongue id: 06082013159792_1_7
label yaofang:
甘草 半夏 桃仁 蒲公英 党参 黄芪 白术 厚朴 砂仁 僵蚕 莪术 柿蒂 北沙参 赭石 蛇舌草
0.56478 0.360947 0.403598 0.335178 0.599653 0.645762 0.367496 0.344441 0.46501 0.362139 0.311649 0.324268 0.425134 0.339876
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 北沙参 合欢皮

------Score: precision: 0.714286, recall: 0.666667, error: 0.285714
150. 
patient tongue id: 03041418156287_1_4
label yaofang:
甘草 茯苓 薏苡仁 党参 黄连 生地黄 牡丹皮 黄柏 知母 山药 浮小麦 土鳖虫
0.867932 0.425186 0.520768 0.405068 0.325968
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.250000, error: 0.400000
151. 
patient tongue id: 01201315373811_1_2_7
label yaofang:
甘草 法半夏 桔梗 黄芪 浙贝母 天麻 鳖甲 款冬花 紫菀 苦杏仁 黄精 蜈蚣 天山雪莲 半枝莲
0.997076 0.534712 0.680176 0.315416 0.338678 0.6952 0.706 0.629599 0.533953 0.593448 0.573145
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
152. 
patient tongue id: 02252105083929_6
label yaofang:
甘草 白术 酸枣仁 牡丹皮 山药 山茱萸 天麻 地骨皮 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.995053 0.530647 0.648868 0.327262 0.303048 0.333551 0.651803 0.657813 0.587306 0.51232 0.547825 0.541605
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
153. 
patient tongue id: 01041634080726_1_4
label yaofang:
甘草 浙贝母 牛膝 苍术 干姜 淡竹叶 生石膏 豆蔻 姜半夏 川木通 龙脷叶 苹果
0.401431 0.31189 0.381061 0.34175 0.448589 0.374757 0.327545
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
154. 
patient tongue id: 05261926040678_4
label yaofang:
龙骨 牡蛎 芦根 薏苡仁 酸枣仁 车前子 厚朴 荷叶 赤小豆 茵陈 香薷 布渣叶 木棉花
0.967548 0.499061 0.575148 0.34495 0.326482 0.536874 0.504638 0.457274 0.383761 0.402739 0.388585
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
155. 
patient tongue id: 05092123045090_1_2_6
label yaofang:
甘草 白芍 党参 生地黄 赤芍 山药 天麻 鳖甲 王不留行 女贞子 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.96143 0.500574 0.572798 0.346337 0.320702 0.502 0.449621 0.420539 0.331639 0.346911 0.329335
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
156. 
patient tongue id: 01012106412464_1_6_8
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.398432 0.412279 0.410615 0.30609 0.302185 0.317679 0.348661
predicted yaofang:
甘草 法半夏 茯苓 前胡 防风 北沙参 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
157. 
patient tongue id: 06071942591234_1_5
label yaofang:
甘草 法半夏 茯苓 桔梗 牛蒡子 党参 浙贝母 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986644 0.507046 0.625402 0.345183 0.307963 0.338326 0.636122 0.624137 0.552296 0.480833 0.527665 0.517216
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
158. 
patient tongue id: 01042354227001_4_6
label yaofang:
甘草 羌活 独活 桃仁 丹参 赤芍 郁金 苍术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.997521 0.535333 0.672766 0.31137 0.326029 0.686899 0.700051 0.629311 0.543771 0.587423 0.580129
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
159. 
patient tongue id: 04061833511919_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.37835 0.602695 0.397804 0.74314 0.42979 0.494846 0.33879 0.327177 0.346517 0.641574 0.623808 0.591408 0.6833 0.394662 0.693152 0.37893 0.487456 0.355184 0.515111
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.684211, recall: 0.928571, error: 0.315789
160. 
patient tongue id: 01172229586605_1_6
label yaofang:
甘草 茯苓 党参 酸枣仁 丹参 生地黄 天麻 鳖甲 补骨脂 浮小麦 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.991026 0.522488 0.630653 0.322554 0.330872 0.6152 0.629993 0.559774 0.491322 0.525372 0.520952
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
161. 
patient tongue id: 03281928289799_2
label yaofang:
甘草 白芍 陈皮 黄芩 当归 麦冬 黄连 熟地黄 郁金 茵陈 鸡内金 虎杖 黄精
0.991535 0.516868 0.637949 0.331093 0.338233 0.647608 0.617466 0.547063 0.456391 0.507606 0.48544
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.076923, error: 0.909091
162. 
patient tongue id: 01192234341547_1_6
label yaofang:
甘草 川芎 当归 桃仁 党参 酸枣仁 生地黄 红花 赤芍 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.993433 0.53079 0.640464 0.341623 0.328543 0.300972 0.356757 0.671017 0.663232 0.614357 0.515051 0.563814 0.567327
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.769231, recall: 0.666667, error: 0.230769
163. 
patient tongue id: 03161711331590_2_1
label yaofang:
法半夏 前胡 防风 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.376193 0.607317 0.397485 0.72377 0.434204 0.502129 0.357039 0.352283 0.307167 0.369628 0.621831 0.614227 0.604082 0.664524 0.381709 0.700316 0.398777 0.482318 0.39139 0.525561
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
164. 
patient tongue id: 02131324588140_1_2
label yaofang:
柴胡 茯苓 黄芪 茵陈 白花蛇舌草
0.579857 0.374727 0.407963 0.341067
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
165. 
patient tongue id: 02191214392604_4
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 浙贝母 细辛 桑白皮 款冬花 紫菀 苇茎 北沙参 苦杏仁
0.955028 0.480777 0.577972 0.360327 0.310997 0.491218 0.472757 0.433636 0.35357 0.376474 0.370477
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
166. 
patient tongue id: 06170910304570_1_7_4
label yaofang:
甘草 牡蛎 蒲公英 黄芪 白术 丹参 延胡索 浙贝母 郁金 桑寄生 王不留行 北沙参 续断 橘络
0.574066 0.404714 0.397203 0.385126 0.335176
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.214286, error: 0.400000
167. 
patient tongue id: 03022128075146_6_2
label yaofang:
黄芩 茯苓 栀子 杜仲 牛膝 钩藤 天麻 石决明 桑寄生 首乌藤 玉米须
0.39305 0.348077 0.437636 0.378044 0.325371 0.341319 0.448959
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
168. 
patient tongue id: 03231441188626_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.397893 0.80208 0.319422 0.932577 0.521956 0.626248 0.339327 0.402518 0.30424 0.303618 0.458231 0.854293 0.866152 0.792198 0.882707 0.336745 0.911966 0.486872 0.300832 0.607126 0.435034 0.67765
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.681818, recall: 1.000000, error: 0.318182
169. 
patient tongue id: 02272229304722_6
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.352035 0.348097 0.313878 0.322795 0.429789 0.656066
predicted yaofang:
白芍 党参 白术 干姜 姜半夏 炙甘草

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
170. 
patient tongue id: 03021119302300_1_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.560108 0.331724 0.48488 0.307875
predicted yaofang:
甘草 茯苓 党参 天麻

------Score: precision: 0.750000, recall: 0.230769, error: 0.250000
171. 
patient tongue id: 03311824371655_1_4
label yaofang:
茯苓 麦冬 太子参 枸杞子 柏子仁 郁金 北柴胡 煅牡蛎 北沙参 炙甘草 制远志 干石斛 煅龙骨 炒酸枣仁
0.387538 0.798536 0.341634 0.92111 0.509346 0.625127 0.333375 0.393832 0.301203 0.314949 0.445621 0.834126 0.847084 0.764441 0.857422 0.315587 0.91101 0.449704 0.604609 0.397822 0.653471
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.190476, recall: 0.285714, error: 0.809524
172. 
patient tongue id: 02271823498177_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 薄荷 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.397316 0.861338 0.963683 0.551457 0.674262 0.320257 0.404192 0.462588 0.903624 0.914093 0.842241 0.926507 0.303607 0.948136 0.493277 0.658753 0.429042 0.72599
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.857143, error: 0.333333
173. 
patient tongue id: 03312114024951_6_5
label yaofang:
甘草 柴胡 白芍 枳壳 法半夏 茯苓 蒲公英 党参 砂仁 五灵脂 麦芽 佛手 紫苏梗 广藿香 鱼古
0.99105 0.509554 0.626191 0.353631 0.346004 0.628199 0.632381 0.593561 0.487646 0.532572 0.530519
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
174. 
patient tongue id: 05222104225178_4_1
label yaofang:
陈皮 当归 黄芪 白术 杜仲 苍术 厚朴 生半夏 僵蚕 鸡内金 枇杷叶 红豆杉 山慈菇 稻芽
0.535883 0.336566 0.437418 0.687788 0.684482 0.431561 0.370043 0.555926 0.409477 0.300946 0.339003 0.381008 0.477856 0.431591 0.358978
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 鸡内金 北沙参 合欢皮 蛇舌草

------Score: precision: 0.400000, recall: 0.428571, error: 0.600000
175. 
patient tongue id: 05290804591784_1_2
label yaofang:
甘草 陈皮 大枣 薏苡仁 党参 黄芪 山药 砂仁 茵陈 扁豆花 麦芽 北沙参 白扁豆
0.988323 0.514949 0.612787 0.33381 0.316507 0.556508 0.552606 0.497293 0.414612 0.434969 0.419539
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
176. 
patient tongue id: 04182150498249_1_2
label yaofang:
甘草 法半夏 茯苓 桔梗 芦根 党参 黄连 浙贝母 砂仁 鳖甲 紫苏梗 广藿香 白花蛇舌 蜂房 四季青
0.975475 0.500023 0.595278 0.342714 0.318936 0.531123 0.502111 0.437463 0.37382 0.39018 0.373141
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
177. 
patient tongue id: 05172127236353_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 金银花 牛蒡子 浙贝母 款冬花 枇杷叶 白花蛇舌草 苦杏仁 紫苏子 蜜麻黄 醋鳖甲
0.956819 0.493174 0.5802 0.32301 0.329221 0.542668 0.477386 0.414457 0.37088 0.388203 0.373738
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
178. 
patient tongue id: 03211948021260_6_1
label yaofang:
甘草 川芎 香附 陈皮 枳壳 茯苓 葛根 龙骨 牡蛎 远志 党参 白术 酸枣仁 柏子仁 延胡索 海螵蛸 竹茹 车前子 姜半夏 紫苏梗 瓦楞子 猫爪草
0.326224 0.38034 0.349069 0.428614 0.369565 0.379652 0.478203 0.584318
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.227273, error: 0.375000
179. 
patient tongue id: 04282013247881_4_1_6
label yaofang:
甘草 陈皮 法半夏 茯苓 木香 党参 白术 黄连 厚朴 佩兰 砂仁 扁豆花 柿蒂 豆蔻 麦芽 紫苏梗 稻芽
0.951892 0.474312 0.5499 0.362538 0.403164 0.35146 0.364672
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.235294, error: 0.428571
180. 
patient tongue id: 05171900213570_1
label yaofang:
陈皮 茯苓 前胡 防风 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 麸炒白术
0.311246 0.328641 0.522469 0.408191 0.607416 0.388592 0.414982 0.321164 0.511768 0.473823 0.47978 0.535738 0.379509 0.580537 0.320473 0.390288 0.381048
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.705882, recall: 0.750000, error: 0.294118
181. 
patient tongue id: 01200707054893_6_2_1
label yaofang:
甘草 白芍 枳壳 当归 连翘 远志 党参 白术 莱菔子 天麻 巴戟天 鳖甲 蜈蚣 白花蛇舌 半枝莲 龙葵果
0.982907 0.489218 0.563641 0.394264 0.324699 0.453529 0.378741 0.495577
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.375000, error: 0.250000
182. 
patient tongue id: 03100519356133_1_2_5
label yaofang:
甘草 薏苡仁 远志 党参 酸枣仁 地黄 天麻 滑石 白花蛇舌草 板蓝根 浮小麦 蜈蚣 半枝莲 醋鳖甲 大青叶
0.795723 0.420808 0.4201 0.368849 0.518392
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
183. 
patient tongue id: 03101915299969_6_4
label yaofang:
甘草 柴胡 川芎 香附 防风 赤芍 荆芥穗 白芷 蔓荆子 郁李仁 芥子
0.876721 0.436001 0.527684 0.403433 0.311846 0.304348
predicted yaofang:
甘草 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.166667, recall: 0.090909, error: 0.833333
184. 
patient tongue id: 05032246351434_2_7_4
label yaofang:
甘草 黄芪 丹参 生地黄 山药 山茱萸 泽泻 车前子 天麻 鳖甲 皂角刺 鹿角霜 蜈蚣 天山雪莲 半枝莲
0.981814 0.495175 0.621777 0.367204 0.304993 0.56371 0.581355 0.529409 0.43703 0.474233 0.478548
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
185. 
patient tongue id: 01052157043253_3_1
label yaofang:
甘草 白芍 茯苓 黄芪 白术 海螵蛸 浙贝母 附子 水蛭 厚朴 砂仁 猪苓 五指毛桃
0.659622 0.403865 0.437458 0.449115 0.455633 0.302263
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.833333, recall: 0.384615, error: 0.166667
186. 
patient tongue id: 05242245403295_1_2_7
label yaofang:
甘草 党参 白术 生地黄 红花 天麻 鳖甲 续断 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.990957 0.516692 0.633982 0.329681 0.32827 0.63566 0.609979 0.531414 0.453605 0.496431 0.474862
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
187. 
patient tongue id: 01032110326471_6_7_5
label yaofang:
甘草 黄芩 茯苓 桔梗 党参 白术 赤芍 浙贝母 杜仲 天麻 桑寄生 款冬花 地龙 苦杏仁 紫苏子
0.941866 0.470753 0.535722 0.345614 0.385077 0.300165 0.330078
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.714286, recall: 0.333333, error: 0.285714
188. 
patient tongue id: 03021849266294_1_5
label yaofang:
桃仁 黄芪 白术 海螵蛸 厚朴 砂仁 桑寄生 火麻仁 鸡内金 夏枯草 土鳖虫 合欢皮 路路通
0.576677 0.378114 0.441649 0.441184 0.360031
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.153846, error: 0.600000
189. 
patient tongue id: 03132044584392_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.531024 0.373943 0.301948 0.407248 0.458462 0.319061
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
190. 
patient tongue id: 03020759122561_1_7
label yaofang:
甘草 白芍 茯苓 党参 生地黄 山药 山茱萸 厚朴 肉苁蓉 火麻仁 制川乌 天山雪莲 牛大力
0.778611 0.403119 0.487047 0.404054
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.230769, error: 0.250000
191. 
patient tongue id: 05242233148828_6_4_2
label yaofang:
白芍 陈皮 木香 防风 白术 黄连 天麻 赤石脂 糯稻根 鳖甲 补骨脂 豆蔻 建曲 蜈蚣 天山雪莲 半枝莲
0.990432 0.517914 0.622837 0.342543 0.328618 0.605143 0.612015 0.543094 0.468166 0.498699 0.473227
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.375000, error: 0.454545
192. 
patient tongue id: 01130631066067_1_2_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 木香 太子参 白术 延胡索 川楝子 郁金 麦芽 姜黄 有瓜石斛
0.973781 0.483405 0.594647 0.351996 0.526442 0.464623 0.432124 0.31333 0.348624 0.335034
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
193. 
patient tongue id: 03261704168767_5
label yaofang:
柴胡 香附 陈皮 半夏 玄参 黄连 枳实 川楝子 黄柏 莱菔子 火麻仁 扁豆花 鸡内金 虎杖
0.602707 0.390077 0.386359 0.520556 0.482159 0.365936 0.344976
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
194. 
patient tongue id: 04271840268152_4
label yaofang:
甘草 葶苈子 黄芪 枸杞子 赤芍 胆南星 浙贝母 附子 郁金 山茱萸 生半夏 全蝎 僵蚕 柿蒂 天竺黄 赭石 黑枣 土鳖虫 姜黄
0.56757 0.365039 0.383961 0.314485 0.577413 0.632668 0.345927 0.321642 0.459239 0.364945 0.305535 0.43496 0.332153
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 莪术 北沙参 合欢皮

------Score: precision: 0.153846, recall: 0.105263, error: 0.846154
195. 
patient tongue id: 04201504029437_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.414484 0.311974 0.359656 0.389724 0.412517 0.406304 0.305611 0.345264 0.320909 0.339551 0.346938 0.303168 0.302566
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 制何首乌

------Score: precision: 0.692308, recall: 0.750000, error: 0.307692
196. 
patient tongue id: 05172141586339_6_2_4
label yaofang:
甘草 茯苓 龙骨 党参 枸杞子 酸枣仁 牡丹皮 山药 天麻 菟丝子 益母草 女贞子 浮小麦 墨旱莲
0.99935 0.55945 0.716645 0.322275 0.354496 0.807703 0.802688 0.765929 0.641987 0.709356 0.723054
predicted yaofang:
甘草 茯苓 党参 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
197. 
patient tongue id: 04211334566729_4
label yaofang:
麻黄 前胡 桔梗 半夏 防风 黄芪 细辛 干姜 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 苍耳子
0.379534 0.715288 0.376199 0.85297 0.480347 0.564004 0.322346 0.353698 0.363851 0.756801 0.735675 0.686696 0.786475 0.370353 0.785283 0.426177 0.545393 0.381447 0.577982
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.687500, error: 0.421053
198. 
patient tongue id: 02251251184544_2_4
label yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.394947 0.610747 0.389663 0.735789 0.449151 0.513457 0.345334 0.373996 0.323244 0.311605 0.401384 0.644439 0.644941 0.598336 0.676512 0.360505 0.726278 0.406074 0.308529 0.508465 0.39058 0.525732
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.636364, recall: 1.000000, error: 0.363636
199. 
patient tongue id: 03290715081744_5
label yaofang:
甘草 黄芩 前胡 桔梗 薄荷 牛蒡子 桃仁 浙贝母 桑白皮 白前 枇杷叶 苦杏仁
0.694476 0.467734 0.450456 0.430427 0.375727 0.312176 0.387676 0.312677
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 党参 款冬花 紫菀

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
200. 
patient tongue id: 03240557245976_7_4_6
label yaofang:
桂枝 甘草 柴胡 白芍 黄芩 法半夏 大枣 茯苓 龙骨 牡蛎 远志 党参 丹参 干姜 浮小麦 首乌藤
0.968295 0.485623 0.553487 0.371244 0.310767 0.437862 0.400167 0.431089
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.375000, recall: 0.187500, error: 0.625000
201. 
patient tongue id: 03231036155787_6_7
label yaofang:
甘草 白芍 川芎 香附 白术 丹参 牛膝 郁金 薤白 厚朴 砂仁 天麻 全蝎 瓜蒌皮 降香
0.976056 0.490688 0.596923 0.35587 0.501832 0.49725 0.443725 0.362155 0.37763 0.355111
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
202. 
patient tongue id: 02141941567620_2
label yaofang:
法半夏 茯苓 前胡 党参 太子参 黄芪 枸杞子 白前 百部 豆蔻 北沙参 炙甘草 麸炒白术
0.463926 0.407894 0.390051 0.357332
predicted yaofang:
甘草 茯苓 黄芪 北沙参

------Score: precision: 0.750000, recall: 0.230769, error: 0.250000
203. 
patient tongue id: 03221300257418_2_4
label yaofang:
甘草 茯苓 薏苡仁 党参 五味子 浙贝母 厚朴 淫羊藿 补骨脂 莪术 紫菀 仙茅 地龙 苦杏仁 鹿角霜 紫苏叶
0.99417 0.514461 0.647734 0.338072 0.318031 0.648055 0.648446 0.575405 0.480132 0.529399 0.518712
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
204. 
patient tongue id: 01130644230738_6_4_1
label yaofang:
甘草 茯苓 木香 白术 黄连 山药 天麻 鳖甲 粉葛 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.961046 0.479671 0.557627 0.307685 0.447679
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
205. 
patient tongue id: 05232035293460_6
label yaofang:
柴胡 白芍 黄芩 茯苓 半夏 白术 丹参 赤芍 栀子 牡丹皮 郁金 淡豆豉 北沙参 炙甘草 百合 黑枣 预知子 素馨花
0.560147 0.305944 0.490895 0.741472 0.771008 0.428798 0.365939 0.570388 0.427129 0.345513 0.344939 0.517307 0.419962 0.356824
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 北沙参 合欢皮 蛇舌草

------Score: precision: 0.285714, recall: 0.222222, error: 0.714286
206. 
patient tongue id: 03180124022708_6_7
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 山药 砂仁 鳖甲 白扁豆
0.41788 0.325459 0.367362 0.369629 0.38107
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.800000, recall: 0.444444, error: 0.200000
207. 
patient tongue id: 02231804325623_4_1
label yaofang:
防风 党参 太子参 黄芪 枸杞子 山药 芡实 北沙参 麸炒白术
0.445367 0.395178 0.337238 0.344586 0.345992
predicted yaofang:
甘草 茯苓 党参 黄芪 钩藤

------Score: precision: 0.400000, recall: 0.222222, error: 0.600000
208. 
patient tongue id: 04120820391824_1_2
label yaofang:
甘草 麦冬 党参 黄芪 枸杞子 玄参 生地黄 牡丹皮 山药 天花粉 北沙参 玉米须
0.509567 0.357991 0.324912 0.403167 0.448628 0.370245 0.305772
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
209. 
patient tongue id: 04142208536688_4_1_7
label yaofang:
桔梗 薏苡仁 黄芪 白术 海螵蛸 浙贝母 砂仁 鸡内金 紫苏梗 土鳖虫 红豆杉 山慈菇 蛇舌草
0.61529 0.389356 0.403241 0.50642 0.383368 0.300029
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
210. 
patient tongue id: 04260618151219_3_2
label yaofang:
甘草 茯苓 党参 生地黄 熟地黄 杜仲 山药 山茱萸 菟丝子 桑寄生 淫羊藿 女贞子 艾叶
0.947334 0.470192 0.559611 0.345188 0.413618 0.356969 0.338036
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.230769, error: 0.571429
211. 
patient tongue id: 03291823106092_1_2
label yaofang:
甘草 白芍 川芎 荆芥 羌活 赤芍 牛膝 细辛 天麻 全蝎 白芷 白花蛇舌草 麦芽 醋鳖甲
0.980671 0.498971 0.599007 0.322809 0.311969 0.585852 0.503975 0.439456 0.355684 0.391782 0.355662
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
212. 
patient tongue id: 03282235551905_6_4
label yaofang:
柴胡 黄芩 葛根 羌活 党参 白术 泽泻 天麻 姜半夏 炙甘草 蒺藜 续断
0.349531 0.403508 0.403311 0.398135 0.405035 0.416658 0.300796 0.54191 0.646474 0.329276 0.30608
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶 紫苏梗

------Score: precision: 0.454545, recall: 0.416667, error: 0.545455
213. 
patient tongue id: 04182033523404_4_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 浮小麦 紫苏梗
0.357152 0.302658 0.350172 0.43129 0.385901 0.359639 0.381415 0.470494
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.625000, recall: 0.454545, error: 0.375000
214. 
patient tongue id: 03020742579548_1_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 干姜 鸡内金
0.43418 0.325466 0.395577 0.37459
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 1.000000, recall: 0.333333, error: 0.000000
215. 
patient tongue id: 06012008172050_1_6
label yaofang:
甘草 茯苓 桔梗 党参 白术 酸枣仁 浙贝母 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.981912 0.505408 0.621455 0.350403 0.323243 0.594632 0.610176 0.53979 0.481418 0.510776 0.506638
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
216. 
patient tongue id: 02182200263083_1
label yaofang:
甘草 川芎 茯苓 防风 党参 白术 五味子 荆芥穗 白芷 蔓荆子 皂角刺 辛夷 苍耳子 贯众
0.968202 0.493384 0.571832 0.358713 0.441689 0.423172 0.400108 0.302563 0.30758
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
217. 
patient tongue id: 04062012303238_6
label yaofang:
柴胡 白芍 香附 枳壳 柏子仁 延胡索 海螵蛸 郁金 大黄 豆蔻 姜半夏 炙甘草 紫苏梗
0.587126 0.317892 0.347534 0.461975 0.430156
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.076923, error: 0.800000
218. 
patient tongue id: 03231039319133_2_6
label yaofang:
甘草 枸杞子 酸枣仁 生地黄 杜仲 山药 山茱萸 天麻 桑寄生 鳖甲 浮小麦 蜈蚣 天山雪莲 半枝莲
0.980899 0.502991 0.581383 0.33214 0.475402 0.480239 0.431926 0.352453 0.356671 0.337628
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.428571, error: 0.400000
219. 
patient tongue id: 01101810268548_1_4
label yaofang:
法半夏 前胡 桔梗 防风 荆芥穗 款冬花 紫菀 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄 炒苍耳子
0.399605 0.78932 0.3341 0.920561 0.519749 0.648067 0.319999 0.389716 0.42468 0.850255 0.844267 0.777791 0.874177 0.318132 0.875433 0.481725 0.631189 0.439162 0.655656
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.857143, error: 0.368421
220. 
patient tongue id: 01190544545526_2_1
label yaofang:
甘草 茯苓 远志 党参 酸枣仁 丹参 生地黄 浙贝母 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.989584 0.50646 0.632303 0.341089 0.313724 0.596344 0.577227 0.510164 0.416589 0.457218 0.437911
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
221. 
patient tongue id: 02191256242879_6_2
label yaofang:
甘草 柴胡 白芍 枳壳 木香 延胡索 郁金 天麻 鳖甲 鸡内金 北沙参 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.993316 0.531424 0.637834 0.327699 0.331215 0.628924 0.647623 0.573559 0.506149 0.540139 0.532371
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
222. 
patient tongue id: 02171948475084_1_3
label yaofang:
甘草 柴胡 黄芩 半夏 党参 太子参 白芷 蔓荆子 北沙参 紫苏叶 黑枣
0.631253 0.39882 0.389373 0.42418 0.441498
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
223. 
patient tongue id: 03280636481037_4
label yaofang:
甘草 茯苓 蒲公英 山药 砂仁 黑枣
0.565588 0.36123 0.392002 0.485205 0.352256
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.333333, error: 0.600000
224. 
patient tongue id: 05191950495367_6_1
label yaofang:
甘草 柴胡 白芍 茯苓 远志 党参 丹参 胆南星 川楝子 山药 地黄 麦芽 合欢花
0.894858 0.320605 0.401599 0.562253 0.416802 0.335173 0.321458
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
225. 
patient tongue id: 01061611102009_5_6
label yaofang:
甘草 枳壳 茯苓 桔梗 党参 白术 丹参 黄连 浙贝母 郁金 山药 鳖甲 火麻仁 苦杏仁 白花蛇舌 天山雪莲
0.907 0.44643 0.537299 0.303935 0.304463 0.552159
predicted yaofang:
甘草 茯苓 党参 丹参 山药 天麻

------Score: precision: 0.833333, recall: 0.312500, error: 0.166667
226. 
patient tongue id: 02202316267078_1_4_5
label yaofang:
甘草 黄芩 茯苓 薏苡仁 太子参 白术 莱菔子 鸡内金 枇杷叶 北沙参 木蝴蝶 稻芽
0.661294 0.408653 0.447131 0.380373
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.250000, error: 0.250000
227. 
patient tongue id: 03091828004400_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 蜜麻黄
0.393802 0.769558 0.326358 0.912743 0.507742 0.636286 0.303719 0.383688 0.304395 0.426835 0.832852 0.833375 0.765608 0.868292 0.322916 0.860287 0.478132 0.605636 0.429014 0.652374
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.600000, recall: 0.800000, error: 0.400000
228. 
patient tongue id: 05191951153765_6_1
label yaofang:
甘草 柴胡 白芍 茯苓 远志 党参 丹参 胆南星 川楝子 山药 地黄 麦芽 合欢花
0.894858 0.320605 0.401599 0.562253 0.416802 0.335173 0.321458
predicted yaofang:
甘草 白芍 茯苓 党参 白术 天麻 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
229. 
patient tongue id: 01122226012738_6_7_1
label yaofang:
甘草 茯苓 木香 远志 党参 酸枣仁 丹参 生地黄 牡丹皮 山药 砂仁 鳖甲 鸡内金 麦芽
0.993771 0.520608 0.655572 0.340075 0.315054 0.35665 0.658664 0.655769 0.59289 0.500271 0.552662 0.538707
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
230. 
patient tongue id: 05022032291976_2_1
label yaofang:
甘草 桔梗 芦根 太子参 浙贝母 鳖甲 北沙参 辛夷 苍耳子 白花蛇舌 天山雪莲 蜂房 岗梅根 四季青
0.960176 0.488805 0.575905 0.351003 0.325027 0.51854 0.483727 0.433415 0.368592 0.388143 0.372271
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
231. 
patient tongue id: 05232124226417_1_3
label yaofang:
当归 茯苓 木香 远志 党参 黄芪 白术 龙眼肉 牛膝 山药 鸡内金 炙甘草 首乌藤 紫苏梗 合欢皮
0.921659 0.468467 0.543887 0.376803 0.41501 0.316261 0.350403
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
232. 
patient tongue id: 03311625244204_3
label yaofang:
牡蛎 黄芪 白术 熟地黄 杜仲 附子 山药 山茱萸 厚朴 当归尾 砂仁 磁石 火麻仁
0.427067 0.313218 0.340359 0.454744 0.522922 0.398038
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.333333, recall: 0.153846, error: 0.666667
233. 
patient tongue id: 03312122456833_1_4
label yaofang:
甘草 茯苓 木香 远志 党参 白术 酸枣仁 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.997173 0.526201 0.66599 0.338565 0.328473 0.693849 0.714541 0.650799 0.560699 0.610786 0.594305
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
234. 
patient tongue id: 02212105315037_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.405835 0.789898 0.348578 0.922738 0.504575 0.636425 0.325116 0.39612 0.317558 0.441433 0.841436 0.846119 0.780506 0.87023 0.343845 0.888155 0.475907 0.607912 0.439524 0.665526
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.700000, recall: 0.933333, error: 0.300000
235. 
patient tongue id: 04172224051765_2
label yaofang:
龙骨 牡蛎 芦根 枸杞子 酸枣仁 五味子 熟地黄 牛膝 山药 山茱萸 菟丝子 龟甲
0.652681 0.397985 0.427804 0.332327 0.436678
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
236. 
patient tongue id: 04211333417870_1_2_4
label yaofang:
陈皮 法半夏 前胡 防风 太子参 黄芪 款冬花 紫菀 白前 百部 芡实 北沙参 炙甘草 炒紫苏子 麸炒白术
0.397322 0.882582 0.973253 0.554572 0.681524 0.307692 0.390641 0.44971 0.923328 0.929672 0.865791 0.940695 0.315569 0.95969 0.489518 0.659394 0.423396 0.743108
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.666667, recall: 0.800000, error: 0.333333
237. 
patient tongue id: 03282250569541_1
label yaofang:
甘草 黄芪 海螵蛸 肉桂 干姜 砂仁 附片 辛夷
0.304603 0.335493 0.385557 0.34664 0.419202 0.391081 0.390038 0.458161 0.569577 0.301052
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
238. 
patient tongue id: 03020852287112_4_6
label yaofang:
甘草 法半夏 茯苓 桔梗 白术 浙贝母 牡丹皮 地黄 白花蛇舌草 首乌藤 合欢花 醋鳖甲
0.999977 0.599234 0.797718 0.338622 0.354042 0.909774 0.903816 0.886777 0.74337 0.833378 0.852973
predicted yaofang:
甘草 茯苓 党参 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.166667, error: 0.818182
239. 
patient tongue id: 06182034066055_1_4_6
label yaofang:
甘草 柴胡 茯苓 龙骨 牡蛎 党参 白术 丹参 砂仁 鸡内金 首乌藤 红豆杉 合欢皮
0.664678 0.386046 0.390131 0.489962 0.608011 0.301299 0.373702 0.315452 0.3154
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 杜仲 厚朴 砂仁 北沙参

------Score: precision: 0.555556, recall: 0.384615, error: 0.444444
240. 
patient tongue id: 04132031056516_2_5
label yaofang:
甘草 独活 党参 鸡血藤 白术 丹参 生地黄 延胡索 细辛 桑寄生 麦芽 忍冬藤 骨碎补 络石藤
0.902028 0.358907 0.469004 0.434094
predicted yaofang:
甘草 法半夏 茯苓 党参

------Score: precision: 0.500000, recall: 0.142857, error: 0.500000
241. 
patient tongue id: 04202018543058_5_7_6
label yaofang:
甘草 茯苓 太子参 黄芪 白术 赤芍 浙贝母 砂仁 北沙参 辛夷 合欢皮 蛇舌草 鲜龙葵果
0.800125 0.390268 0.448207 0.420112 0.585184 0.351851
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.307692, error: 0.333333
242. 
patient tongue id: 02231753141451_4
label yaofang:
防风 薄荷 钩藤 荆芥穗 白芷 北柴胡 香薷 炙甘草 辛夷 首乌藤 广藿香 炒苍耳子 炒蔓荆子
0.411926 0.924811 0.988854 0.610528 0.792548 0.41311 0.50846 0.961314 0.966109 0.904501 0.970689 0.979483 0.58968 0.767115 0.435368 0.780135
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.312500, recall: 0.384615, error: 0.687500
243. 
patient tongue id: 06091835387355_5
label yaofang:
甘草 白芍 当归 独活 党参 槟榔 乌药 钩藤 车前子 天麻 全蝎 肉苁蓉 火麻仁 姜半夏 瓜蒌子 制枳实
0.951376 0.464357 0.601724 0.366817 0.549206 0.482731 0.426191 0.33311 0.381081 0.374533
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.187500, error: 0.700000
244. 
patient tongue id: 04181146080517_1_4_7
label yaofang:
甘草 枳壳 法半夏 当归 茯苓 木香 党参 黄芪 丹参 厚朴 鸡内金 草豆蔻 麦芽
0.519691 0.371263 0.379085 0.485042 0.405447
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.307692, error: 0.200000
245. 
patient tongue id: 03180146151142_4
label yaofang:
柴胡 白芍 香附 枳壳 白术 海螵蛸 泽泻 豆蔻 姜半夏 炙甘草 紫苏梗
0.457616 0.308933 0.368473 0.450441 0.593956 0.454766 0.323382
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 紫苏叶

------Score: precision: 0.285714, recall: 0.181818, error: 0.714286
246. 
patient tongue id: 04202107116563_4_6_1
label yaofang:
当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 炙甘草 百合 紫苏叶 山慈菇
0.439636 0.321689 0.416778 0.31958
predicted yaofang:
甘草 茯苓 党参 炙甘草

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
247. 
patient tongue id: 06012053318692_1_2
label yaofang:
甘草 白芍 枳壳 半夏 太子参 黄芪 白术 厚朴 肉苁蓉 莪术 麦芽 蜈蚣 合欢皮 预知子 蛇舌草
0.513453 0.320142 0.46322 0.693251 0.711319 0.432048 0.335702 0.555811 0.398346 0.339945 0.316574 0.324372 0.511566 0.412155 0.340965
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 鸡内金 北沙参 合欢皮 蛇舌草

------Score: precision: 0.533333, recall: 0.533333, error: 0.466667
248. 
patient tongue id: 04291449031355_7_1
label yaofang:
甘草 柴胡 白芍 薏苡仁 桃仁 远志 天麻 白花蛇舌草 佛手 浮小麦 蜈蚣 合欢花 半枝莲 醋鳖甲
0.873649 0.433592 0.534529 0.418866 0.339747 0.303674 0.332376
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.214286, error: 0.571429
249. 
patient tongue id: 04221912060492_4
label yaofang:
法半夏 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 蝉蜕 炙甘草 辛夷 广藿香 地肤子 炒紫苏子 蜜麻黄
0.394077 0.821046 0.302025 0.947783 0.547741 0.658357 0.304125 0.373869 0.438392 0.884837 0.889395 0.811782 0.906985 0.306945 0.925966 0.484915 0.641276 0.412599 0.686153
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.875000, error: 0.263158
250. 
patient tongue id: 03141235168908_1_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.505406 0.341962 0.363722 0.451994 0.348807 0.415142 0.344194 0.333485 0.315793 0.335253 0.346412 0.315792 0.349551
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻

------Score: precision: 0.692308, recall: 0.750000, error: 0.307692
251. 
patient tongue id: 03311656518135_7_6
label yaofang:
白芍 当归 党参 枸杞子 丹参 熟地黄 砂仁 菟丝子 蛇床子 鹿角霜 酒萸肉
0.349688 0.344415 0.323338 0.333137 0.462091 0.666329
predicted yaofang:
白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
252. 
patient tongue id: 02181604218231_6_2_4
label yaofang:
甘草 法半夏 茯苓 桔梗 酸枣仁 浙贝母 杜仲 天麻 鳖甲 紫菀 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.993005 0.520223 0.629914 0.363464 0.342555 0.61187 0.64131 0.608134 0.498609 0.529534 0.535402
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
253. 
patient tongue id: 02261801151849_5_1
label yaofang:
甘草 黄芩 桔梗 乌梅 白茅根 细辛 白芷 蔓荆子 麦芽 皂角刺 辛夷 广藿香 苍耳子 蜂房
0.37782 0.769729 0.338747 0.898866 0.504513 0.58105 0.364801 0.42175 0.818173 0.820386 0.746941 0.833675 0.890147 0.41565 0.571816 0.37552 0.641499
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.294118, recall: 0.357143, error: 0.705882
254. 
patient tongue id: 05172102276630_2
label yaofang:
甘草 薏苡仁 天麻 鳖甲 款冬花 莪术 紫菀 苦杏仁 紫苏子 炙麻黄 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.957538 0.478345 0.58692 0.309185 0.312797 0.583651 0.417185 0.351211 0.318589
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.555556, recall: 0.357143, error: 0.444444
255. 
patient tongue id: 06182217271481_4
label yaofang:
甘草 茯苓 前胡 桔梗 薄荷 芦根 鱼腥草 桑叶 瓜蒌皮 紫菀 苦杏仁 白花龙胆
0.960997 0.471023 0.572887 0.366558 0.4482 0.451388 0.414794 0.327515 0.340182 0.315988
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.166667, error: 0.800000
256. 
patient tongue id: 03111503259649_1_5
label yaofang:
桂枝 甘草 白芍 大枣 茯苓 木香 党参 白术 山药 砂仁 扁豆花 麦芽 白扁豆 木棉花
0.889564 0.45351 0.513043 0.356856 0.3112
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
257. 
patient tongue id: 04150416542948_6_4
label yaofang:
甘草 香附 法半夏 茯苓 党参 白术 酸枣仁 丹参 赤芍 青皮 郁金 砂仁 天花粉 瓜蒌皮 王不留行
0.982286 0.497202 0.622036 0.328725 0.319813 0.615037 0.548444 0.475024 0.392114 0.441089 0.421285
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
258. 
patient tongue id: 03021828450615_4
label yaofang:
茯苓 防风 薄荷 钩藤 荆芥穗 白芷 北柴胡 香薷 炙甘草 首乌藤 广藿香 威灵仙 炒蔓荆子 棉萆薢
0.410089 0.762986 0.339187 0.895611 0.499213 0.597387 0.353113 0.399151 0.326599 0.310358 0.449815 0.810963 0.826611 0.755611 0.839454 0.344973 0.88745 0.462754 0.308163 0.586615 0.434024 0.653145
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.272727, recall: 0.428571, error: 0.727273
259. 
patient tongue id: 06010340354023_6_4
label yaofang:
甘草 茯苓 党参 赤芍 郁金 山药 天麻 鳖甲 虎杖 蜈蚣 白花蛇舌 天山雪莲 半枝莲 红豆杉
0.986984 0.502318 0.630009 0.349406 0.565854 0.571858 0.506494 0.428583 0.456118 0.445046
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.900000, recall: 0.642857, error: 0.100000
260. 
patient tongue id: 01211213086112_5
label yaofang:
白芍 当归 麦冬 党参 白术 五味子 熟地黄 杜仲 肉苁蓉 巴戟天 补骨脂
0.394669 0.320985 0.383993 0.352767 0.415884
predicted yaofang:
甘草 茯苓 党参 白术 炙甘草

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
261. 
patient tongue id: 03231223492261_4
label yaofang:
陈皮 法半夏 前胡 太子参 款冬花 紫菀 白前 百部 豆蔻 北沙参 炙甘草 炒紫苏子 麸炒白术 甘松
0.330583 0.306704 0.564451 0.416618 0.630245 0.400111 0.439605 0.311286 0.531736 0.478513 0.472247 0.512623 0.339085 0.569831 0.31879 0.406214 0.34596
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.529412, recall: 0.642857, error: 0.470588
262. 
patient tongue id: 05162103334972_6
label yaofang:
甘草 桃仁 党参 白术 酸枣仁 红花 延胡索 杜仲 牛膝 山茱萸 桑寄生 补骨脂 续断 牛大力
0.951227 0.478454 0.569272 0.359288 0.460184 0.432357 0.394098 0.314471 0.32865 0.306438
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
263. 
patient tongue id: 04121854263775_5_1
label yaofang:
甘草 茯苓 半夏 薏苡仁 蒲公英 白术 赤芍 浙贝母 郁金 砂仁 莪术 北沙参 半枝莲 姜黄 预知子 鸡骨草
0.52301 0.315762 0.473532 0.359501
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.750000, recall: 0.187500, error: 0.250000
264. 
patient tongue id: 02191235503344_4_1
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 炒紫苏子 蜜麻黄
0.391582 0.746783 0.347058 0.887355 0.495267 0.613103 0.33005 0.385779 0.31186 0.423899 0.799166 0.797927 0.736825 0.83357 0.343688 0.851789 0.45962 0.594185 0.422817 0.628842
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.800000, recall: 1.000000, error: 0.200000
265. 
patient tongue id: 04241838015858_4_6
label yaofang:
大枣 当归 木香 远志 党参 黄芪 白术 酸枣仁 柏子仁 覆盆子
0.364647 0.417343 0.41482 0.417461 0.382175 0.314956 0.414163 0.536927 0.642663 0.312036
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.300000, recall: 0.300000, error: 0.700000
266. 
patient tongue id: 04020815397570_1_2
label yaofang:
甘草 茯苓 桔梗 浙贝母 乌梅 郁金 山药 诃子 白花蛇舌草 紫苏梗 广藿香 蜈蚣 醋鳖甲
0.985378 0.511438 0.606844 0.342569 0.321427 0.551014 0.563553 0.500007 0.432875 0.450987 0.427848
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
267. 
patient tongue id: 03090805013513_7_1_6
label yaofang:
甘草 龙骨 党参 丹参 砂仁 天麻 白花蛇舌草 佛手 浮小麦 首乌藤 蜈蚣 醋香附 半枝莲 醋鳖甲
0.992272 0.507844 0.63338 0.382946 0.324166 0.625409 0.675614 0.644443 0.529957 0.567896 0.572804
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
268. 
patient tongue id: 06132001208316_1_7_4
label yaofang:
茯苓 薏苡仁 黄芪 枸杞子 白术 海螵蛸 浙贝母 杜仲 山茱萸 厚朴 生半夏 砂仁 桑寄生 莪术 柿蒂 炙甘草 蜈蚣 土鳖虫 守宫
0.693595 0.394323 0.386605 0.471214 0.587704 0.331979
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.666667, recall: 0.210526, error: 0.333333
269. 
patient tongue id: 04122151044517_6
label yaofang:
甘草 茯苓 连翘 党参 白术 酸枣仁 浙贝母 郁金 山药 天麻 扁豆花 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.914937 0.434078 0.50366 0.307189 0.523806 0.432231
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.833333, recall: 0.333333, error: 0.166667
270. 
patient tongue id: 06062300403636_2_6
label yaofang:
甘草 茯苓 木香 龙骨 党参 太子参 酸枣仁 丹参 黄连 生地黄 山茱萸 火麻仁 补骨脂 浮小麦
0.960529 0.48216 0.561084 0.376765 0.43484 0.431492 0.414269 0.310497 0.321283 0.301905
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
271. 
patient tongue id: 04291616571593_6_4
label yaofang:
甘草 玉竹 太子参 鸡血藤 生地黄 砂仁 天麻 鳖甲 麦芽 北沙参 紫苏梗 广藿香 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986978 0.506612 0.637734 0.35749 0.304576 0.336284 0.618201 0.626363 0.562194 0.47938 0.525346 0.524682
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.583333, recall: 0.437500, error: 0.416667
272. 
patient tongue id: 01312301217045_6_2
label yaofang:
甘草 法半夏 桔梗 党参 酸枣仁 丹参 浙贝母 牡丹皮 薤白 水蛭 瓜蒌皮 浮小麦 合欢花 麸炒枳壳
0.987737 0.514034 0.605199 0.356143 0.344171 0.605602 0.598576 0.548544 0.455655 0.490255 0.472385
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
273. 
patient tongue id: 04111902215273_1
label yaofang:
白芍 川芎 当归 防风 太子参 黄芪 丹参 钩藤 天麻 白芷 石决明 炙甘草 首乌藤 广藿香 炒蔓荆子 棉萆薢
0.3927 0.793038 0.339894 0.919212 0.496673 0.613919 0.339596 0.399269 0.306499 0.303836 0.436104 0.832477 0.844545 0.772948 0.860581 0.33429 0.902985 0.451193 0.588918 0.414578 0.657047
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.238095, recall: 0.312500, error: 0.761905
274. 
patient tongue id: 03012251266435_1_4_2
label yaofang:
甘草 法半夏 茯苓 薏苡仁 党参 延胡索 川楝子 天麻 鳖甲 豆蔻 浮小麦 威灵仙 蜈蚣 白花蛇舌 红豆杉
0.981827 0.509543 0.565606 0.333268 0.313996 0.499841 0.461494 0.446937 0.326331 0.343592 0.310437
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.466667, error: 0.363636
275. 
patient tongue id: 04291628432035_1_2_6
label yaofang:
甘草 枳壳 茯苓 党参 白术 浙贝母 槟榔 郁金 砂仁 鳖甲 火麻仁 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲 稻芽
0.944253 0.48101 0.549212 0.333507 0.416384 0.357388 0.346874
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.857143, recall: 0.352941, error: 0.142857
276. 
patient tongue id: 06092003461762_1_4_7
label yaofang:
甘草 陈皮 当归 茯苓 半夏 独活 党参 黄芪 阿胶 丹参 杜仲 牛膝 苍术 天麻 僵蚕 桑寄生 紫苏叶 姜黄
0.718893 0.373336 0.324269 0.393585 0.589933 0.65933 0.364109 0.448022 0.362129 0.346228 0.366267 0.333564
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 杜仲 厚朴 砂仁 莪术 北沙参 蜈蚣

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
277. 
patient tongue id: 02242034107233_6_4
label yaofang:
龙骨 柏子仁 栀子 干姜 淡豆豉 天麻 蝉蜕 姜半夏 炙甘草 浮小麦 百合 紫苏叶 蜈蚣 合欢皮
0.452189 0.316023 0.357977 0.445915 0.497592 0.364453
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
278. 
patient tongue id: 05022111397393_4_6
label yaofang:
甘草 白芍 川芎 香附 法半夏 茯苓 桔梗 白术 生地黄 浙贝母 菟丝子 续断
0.971495 0.491067 0.604909 0.3748 0.313827 0.536636 0.520607 0.461506 0.382274 0.41208 0.402767
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
279. 
patient tongue id: 04112300263972_1
label yaofang:
甘草 白芍 川芎 独活 柏子仁 牛膝 细辛 干姜 补骨脂 蜈蚣 姜黄 鹿衔草
0.348579 0.398496 0.40311 0.404969 0.344123 0.338602 0.423084 0.31166 0.55454 0.665119 0.324262
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
280. 
patient tongue id: 02182304131167_1_6
label yaofang:
甘草 白芍 党参 酸枣仁 柏子仁 山药 荆芥穗 鳖甲 王不留行 桑螵蛸 麦芽 益智 五倍子 首乌藤
0.969513 0.49287 0.556656 0.336435 0.304944 0.456373 0.406952 0.390772
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.285714, error: 0.500000
281. 
patient tongue id: 04272238542589_1_2
label yaofang:
陈皮 葛根 前胡 桔梗 防风 麦冬 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄 干石斛
0.36137 0.835717 0.342648 0.938488 0.524185 0.646145 0.316444 0.393871 0.301017 0.437794 0.858115 0.86973 0.778307 0.874425 0.918306 0.450394 0.622527 0.369703 0.66094
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.578947, recall: 0.733333, error: 0.421053
282. 
patient tongue id: 06080120119386_1_4_6
label yaofang:
桂枝 甘草 柴胡 白芍 茯苓 桃仁 党参 青皮 浙贝母 牡丹皮 山药 菟丝子 益母草 王不留行 紫苏梗
0.964932 0.486161 0.581691 0.36189 0.301972 0.48799 0.491541 0.461031 0.368432 0.38854 0.381893
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
283. 
patient tongue id: 06190937484121_1_2_5
label yaofang:
甘草 茯苓 独活 党参 黄芪 生地黄 熟附子 牡丹皮 山药 山茱萸 泽泻 大黄 菟丝子 补骨脂 白花蛇舌 鹿衔草
0.991893 0.507779 0.640574 0.39337 0.303371 0.347416 0.662432 0.689747 0.663016 0.532164 0.593825 0.608865
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
284. 
patient tongue id: 03012047207357_6_2
label yaofang:
甘草 白芍 茯苓 桔梗 浙贝母 山茱萸 桑叶 荷叶 磁石 天花粉 白花蛇舌草 沙苑子 蜂房 醋鳖甲
0.989919 0.507737 0.614568 0.349213 0.317795 0.58063 0.586201 0.538493 0.439407 0.470637 0.457066
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
285. 
patient tongue id: 04252307094175_1_6
label yaofang:
甘草 茯苓 桔梗 芦根 党参 浙贝母 山药 白茅根 鳖甲 诃子 麦芽 紫苏梗 木蝴蝶 白花蛇舌 天山雪莲
0.963532 0.488613 0.552549 0.407716 0.311606 0.434755 0.411626 0.453298 0.303097
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲

------Score: precision: 0.666667, recall: 0.400000, error: 0.333333
286. 
patient tongue id: 01132150349279_1_6_2
label yaofang:
甘草 川芎 法半夏 桃仁 党参 枸杞子 白术 红花 赤芍 钩藤 天麻 决明子 地龙 首乌藤 沙苑子
0.990975 0.509723 0.624452 0.349689 0.323132 0.59165 0.599723 0.555045 0.444785 0.484156 0.479382
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
287. 
patient tongue id: 03111431335452_1_4
label yaofang:
甘草 党参 白术 郁金 山药 天麻 鳖甲 茵陈 扁豆花 莪术 豆蔻 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.755475 0.431534 0.432507 0.375407 0.484159
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
288. 
patient tongue id: 02261000347820_6
label yaofang:
甘草 川芎 枳壳 茯苓 防风 白术 酸枣仁 生地黄 天麻 全蝎 槐花 火麻仁 浮小麦
0.900871 0.459288 0.549196 0.385432 0.411231 0.377025 0.379359
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.571429, recall: 0.307692, error: 0.428571
289. 
patient tongue id: 03311630316639_1_6
label yaofang:
当归 木香 龙骨 远志 党参 黄芪 鸡血藤 白术 柏子仁 栀子 淡豆豉 炙甘草 百合 紫苏叶
0.471458 0.324417 0.376006 0.310675 0.437459 0.411961 0.330737 0.42441
predicted yaofang:
甘草 柴胡 白芍 茯苓 党参 白术 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.214286, error: 0.625000
290. 
patient tongue id: 03161305353494_2
label yaofang:
麻黄 陈皮 法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 紫苏子 炙甘草
0.368208 0.660226 0.386706 0.785982 0.465508 0.528937 0.326415 0.369295 0.302322 0.312195 0.396987 0.691492 0.684795 0.637239 0.715271 0.330309 0.72828 0.409779 0.516325 0.388691 0.55183
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.571429, recall: 0.857143, error: 0.428571
291. 
patient tongue id: 02141949377929_6
label yaofang:
黄连 肉桂 车前子 干姜 附片
0.705753 0.373372 0.481587 0.300192
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
292. 
patient tongue id: 01112026095793_1_2
label yaofang:
法半夏 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.45653 0.346059 0.390646 0.571392 0.565998 0.336678 0.476619
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 北沙参

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
293. 
patient tongue id: 05232034150661_7
label yaofang:
甘草 茯苓 薏苡仁 黄芪 白术 丹参 胆南星 浙贝母 杜仲 牛膝 僵蚕 莪术 桑枝 姜黄 蛇舌草
0.551386 0.302332 0.485225 0.726533 0.75818 0.414772 0.364065 0.573711 0.420561 0.362728 0.350546 0.306955 0.517803 0.419432 0.301248 0.363026
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 鸡内金 北沙参 合欢皮 预知子 蛇舌草

------Score: precision: 0.500000, recall: 0.533333, error: 0.500000
294. 
patient tongue id: 03131955441685_1_4_7
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.438884 0.658825 0.413164 0.343647 0.698274 0.686203 0.601593 0.640141 0.667411 0.64316 0.72456 0.637596 0.723442 0.71203 0.722547
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
295. 
patient tongue id: 03291345193141_4
label yaofang:
甘草 黄芩 法半夏 茯苓 前胡 桔梗 浙贝母 细辛 干姜 鳖甲 款冬花 白前 苦杏仁 炙麻黄 白花蛇舌
0.997281 0.534985 0.675322 0.332304 0.300401 0.340163 0.702922 0.710739 0.638718 0.550972 0.602985 0.5869
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
296. 
patient tongue id: 05201514372587_6_7
label yaofang:
甘草 白芍 川芎 茯苓 远志 党参 黄芪 白术 酸枣仁 五味子 知母 山药 浮小麦 首乌藤 黄精
0.98868 0.518272 0.621512 0.319969 0.325136 0.596191 0.564265 0.490301 0.414943 0.446416 0.424215
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.333333, error: 0.545455
297. 
patient tongue id: 04222131519793_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 干姜 款冬花 紫菀 白前 百部 炙甘草 蜜麻黄
0.413653 0.924694 0.988469 0.586102 0.747424 0.420906 0.507865 0.956353 0.964126 0.904888 0.967931 0.982185 0.543426 0.728892 0.43658 0.784378
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.750000, recall: 0.923077, error: 0.250000
298. 
patient tongue id: 01122229280730_1_2
label yaofang:
甘草 葛根 黄芪 鸡血藤 天麻 菟丝子 益母草 白花蛇舌草 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲 酒黄精
0.981357 0.5033 0.584993 0.329098 0.499536 0.493297 0.447746 0.367363 0.378262 0.361075
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
299. 
patient tongue id: 02241411508990_7_4
label yaofang:
当归 木香 党参 黄芪 鸡血藤 白术 丹参 柏子仁 砂仁 炙甘草 百合 紫苏叶
0.393461 0.347847 0.436074 0.372075 0.329273 0.340751 0.433105
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
300. 
patient tongue id: 05181046180565_1_2_4
label yaofang:
桂枝 甘草 白芍 党参 白术 酸枣仁 生地黄 红花 天麻 鳖甲 桑枝 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.988888 0.505486 0.626605 0.339778 0.315835 0.592008 0.59191 0.525688 0.439258 0.47607 0.469669
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
301. 
patient tongue id: 04202038183361_9
label yaofang:
桂枝 甘草 牛蒡子 太子参 神曲 山楂 莪术 麦芽 甜杏仁 浮小麦
0.322694 0.380316 0.344941 0.399257 0.367605 0.428207 0.485768 0.600242 0.321003
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
302. 
patient tongue id: 03231301104795_4_6
label yaofang:
甘草 茯苓 党参 黄芪 鸡血藤 生地黄 天麻 鳖甲 补骨脂 虎杖 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.97948 0.491738 0.601958 0.389911 0.316008 0.510555 0.538486 0.523826 0.398763 0.430655 0.431188
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
303. 
patient tongue id: 04132033420666_1_2_6
label yaofang:
甘草 茯苓 桔梗 半夏 橘红 白术 枇杷叶 北沙参 苦杏仁 炙麻黄 首乌藤 合欢皮
0.37794 0.356006 0.452831 0.397841 0.406148 0.31968
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.666667, recall: 0.333333, error: 0.333333
304. 
patient tongue id: 03221635111112_1_2_7
label yaofang:
茯苓 黄芪 白术 砂仁 天麻 菟丝子 桑寄生 鸡内金 首乌藤 蜈蚣 稻芽 罗布麻
0.433527 0.383325 0.461199 0.372926
predicted yaofang:
甘草 茯苓 黄芪 北沙参

------Score: precision: 0.500000, recall: 0.166667, error: 0.500000
305. 
patient tongue id: 03232306582218_3_2_7
label yaofang:
甘草 茯苓 独活 党参 黄芪 丹参 赤芍 山药 山茱萸 水蛭 桑寄生 补骨脂 鹿角霜 川加皮 牛大力
0.989626 0.520421 0.624987 0.350975 0.318388 0.358024 0.646565 0.64279 0.578848 0.499308 0.543158 0.524561
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.266667, error: 0.666667
306. 
patient tongue id: 05130656261672_5_1_6
label yaofang:
甘草 法半夏 茯苓 龙骨 牡蛎 远志 党参 酸枣仁 丹参 黄连 郁金 山药 合欢花
0.987348 0.491756 0.631677 0.395162 0.330967 0.590267 0.614238 0.573351 0.451777 0.506233 0.506214
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
307. 
patient tongue id: 04142219398324_1_7
label yaofang:
甘草 白芍 黄芪 白术 丹参 杜仲 牛膝 厚朴 砂仁 火麻仁 土鳖虫 宽筋藤 合欢皮
0.48373 0.339114 0.347606 0.556135 0.58283 0.430854 0.391816 0.31575 0.316804
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁 合欢皮

------Score: precision: 0.666667, recall: 0.461538, error: 0.333333
308. 
patient tongue id: 01050637477034_1_6
label yaofang:
甘草 黄芩 白术 酸枣仁 生地黄 天麻 菟丝子 益母草 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.984534 0.505812 0.614314 0.337798 0.321361 0.576415 0.574873 0.516692 0.436597 0.468573 0.463799
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
309. 
patient tongue id: 03020756598060_1_6
label yaofang:
甘草 党参 酸枣仁 丹参 红花 浙贝母 天麻 鳖甲 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲 墨旱莲
0.996362 0.529014 0.672196 0.352511 0.324232 0.349149 0.710068 0.725793 0.678263 0.566065 0.629151 0.637609
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
310. 
patient tongue id: 05172101267196_7_4_2
label yaofang:
甘草 白芍 独活 党参 白术 生地黄 红花 延胡索 细辛 桑寄生 锁阳 忍冬藤 续断 牛大力 千斤拔
0.938106 0.464577 0.562285 0.388619 0.427221 0.39586 0.382901
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
311. 
patient tongue id: 04190039340890_1_2
label yaofang:
当归 薏苡仁 太子参 黄芪 鸡血藤 白术 山楂 砂仁 鳖甲 补骨脂 鸡内金 女贞子 稻芽
0.377137 0.372745 0.307106 0.440601 0.330785 0.421206 0.332234
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 北沙参 炙甘草

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
312. 
patient tongue id: 02191211041298_6_4
label yaofang:
甘草 白芍 党参 白术 丹参 玄参 厚朴 天麻 火麻仁 决明子 白花蛇舌草 蜈蚣 半枝莲 醋鳖甲
0.982481 0.498216 0.584632 0.352761 0.475611 0.445334 0.457801 0.307709 0.330449 0.321193
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.428571, error: 0.400000
313. 
patient tongue id: 02221318554290_1_4_7
label yaofang:
桂枝 甘草 白芍 茯苓 麦冬 党参 黄芪 白术 五味子 熟附子 车前子 干姜
0.515547 0.339286 0.440586 0.437878 0.382992 0.478071 0.422326 0.399827 0.389265 0.410754 0.390477 0.421889 0.421217 0.408958 0.388034 0.388443
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.312500, recall: 0.416667, error: 0.687500
314. 
patient tongue id: 01250645156391_6
label yaofang:
甘草 柴胡 白芍 茯苓 党参 酸枣仁 赤芍 五灵脂 益母草 麦芽 合欢花 广金钱草 姜黄 炒鸡内金 石苇
0.990051 0.517503 0.623308 0.339971 0.318905 0.570889 0.582194 0.525367 0.440935 0.46564 0.454529
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
315. 
patient tongue id: 04150319553994_6_2
label yaofang:
甘草 羌活 党参 白术 泽泻 砂仁 天麻 鳖甲 淫羊藿 女贞子 浮小麦 蜈蚣 天山雪莲 半枝莲 墨旱莲
0.985137 0.504677 0.611638 0.343265 0.315437 0.581404 0.573869 0.505958 0.438813 0.460665 0.448179
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.533333, error: 0.272727
316. 
patient tongue id: 05092050243059_2_7
label yaofang:
枳壳 太子参 白术 海螵蛸 神曲 山楂 砂仁 石斛 麦芽 百合 紫苏叶 瓦楞子
0.842394 0.434455 0.522609 0.378727 0.397881 0.36105 0.340373
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.142857, recall: 0.083333, error: 0.857143
317. 
patient tongue id: 05112018435829_6_7_2
label yaofang:
党参 浙贝母 当归尾 砂仁 菟丝子 莪术 王不留行 珍珠母 夏枯草 北沙参 续断 橘络 墨旱莲
0.594852 0.364669 0.405245 0.5418 0.583955 0.374182 0.383451 0.314312
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁

------Score: precision: 0.250000, recall: 0.153846, error: 0.750000
318. 
patient tongue id: 02211858489159_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.329944 0.334577 0.368473 0.363626 0.322965 0.350173 0.541991
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
319. 
patient tongue id: 01202000433843_5_6
label yaofang:
甘草 桔梗 牡蛎 延胡索 浙贝母 山药 瓜蒌皮 北沙参 橘核 木蝴蝶 广金钱草 土茯苓 猫爪草
0.680399 0.386112 0.441307 0.322989 0.317221 0.315082 0.307452
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 党参 白术

------Score: precision: 0.285714, recall: 0.153846, error: 0.714286
320. 
patient tongue id: 03311820527001_4
label yaofang:
陈皮 法半夏 前胡 桔梗 防风 薄荷 白芷 北柴胡 款冬花 紫菀 白前 百部 炙甘草 辛夷 蜜麻黄
0.335052 0.528873 0.380999 0.600033 0.372473 0.41848 0.320378 0.303105 0.487808 0.50137 0.48555 0.545617 0.371215 0.662328 0.328334 0.388805 0.361138
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 蜜麻黄

------Score: precision: 0.764706, recall: 0.866667, error: 0.235294
321. 
patient tongue id: 02240754470162_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.536191 0.367272 0.300046 0.409595 0.454597 0.329472
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
322. 
patient tongue id: 02181955128890_1_6_5
label yaofang:
白芍 陈皮 枳壳 当归 防风 连翘 党参 白术 黄连 乌梅 山药 干姜 仙鹤草 麦芽 皂角刺 炙甘草
0.991401 0.515085 0.622483 0.334912 0.310384 0.565256 0.55293 0.511169 0.39883 0.428597 0.419774
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
323. 
patient tongue id: 03081414219983_1_2
label yaofang:
甘草 川芎 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.448039 0.536963 0.420328 0.360259 0.580317 0.552167 0.49504 0.508991 0.54197 0.531218 0.573791 0.501283 0.583782 0.555808 0.573389
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.230769, error: 0.800000
324. 
patient tongue id: 03020739223735_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.547988 0.367024 0.345726 0.421616 0.445839 0.372627 0.326243
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝

------Score: precision: 0.428571, recall: 0.250000, error: 0.571429
325. 
patient tongue id: 03041057208346_1_4
label yaofang:
甘草 法半夏 前胡 桔梗 防风 薄荷 荆芥穗 白芷 香薷 百部 辛夷 紫苏梗 广藿香 炒苍耳子
0.382019 0.638476 0.38956 0.777375 0.45797 0.530952 0.355661 0.369891 0.30749 0.385396 0.679063 0.674322 0.642626 0.721741 0.392651 0.747365 0.408128 0.526014 0.410647 0.571201
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.450000, recall: 0.642857, error: 0.550000
326. 
patient tongue id: 06082040565305_2
label yaofang:
甘草 柴胡 龙骨 牡蛎 枸杞子 黄连 牡丹皮 杜仲 牛膝 知母 郁金 地骨皮 补骨脂 北沙参 续断 赭石 合欢皮
0.550733 0.316151 0.441958 0.663689 0.69807 0.357928 0.324244 0.500563 0.370841 0.303177 0.315825 0.472474 0.331697
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 北沙参 合欢皮

------Score: precision: 0.307692, recall: 0.235294, error: 0.692308
327. 
patient tongue id: 03032101574835_1_2
label yaofang:
当归 防风 黄芪 鸡血藤 白术 厚朴 火麻仁 鸡内金 女贞子 辛夷 紫苏叶 稻芽
0.36265 0.300181 0.385777 0.386693 0.392367 0.311401 0.330062 0.322138 0.306471 0.347849 0.364497 0.44575
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 黄芪 款冬花 紫菀 百部 北沙参 炙甘草

------Score: precision: 0.083333, recall: 0.083333, error: 0.916667
328. 
patient tongue id: 04111857316010_1_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 薄荷 荆芥穗 北柴胡 款冬花 紫菀 百部 炙甘草 广藿香 蜜麻黄
0.462787 0.402645 0.424778 0.361767
predicted yaofang:
甘草 茯苓 黄芪 北沙参

------Score: precision: 0.250000, recall: 0.071429, error: 0.750000
329. 
patient tongue id: 01012058558372_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.480379 0.356202 0.330266 0.379792 0.368106 0.373564 0.302575 0.351417
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 钩藤

------Score: precision: 0.500000, recall: 0.333333, error: 0.500000
330. 
patient tongue id: 05242000125657_5_2
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 茯苓 连翘 红花 牡丹皮 地黄 菟丝子 益母草 皂角刺 醋香附
0.9835 0.501591 0.612087 0.369897 0.328579 0.581845 0.581061 0.52639 0.434138 0.471495 0.458019
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
331. 
patient tongue id: 05251945535675_5_7_6
label yaofang:
甘草 半夏 薏苡仁 蒲公英 赤芍 牡丹皮 郁金 僵蚕 莪术 北沙参 蜈蚣 土鳖虫 合欢皮 姜黄 山慈菇 预知子
0.519155 0.344442 0.375261 0.31335 0.607606 0.655944 0.421594 0.466953 0.368685 0.412239 0.35986
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.363636, recall: 0.250000, error: 0.636364
332. 
patient tongue id: 03242125186020_6_1
label yaofang:
麻黄 桂枝 白芍 法半夏 牛蒡子 太子参 五味子 细辛 干姜 款冬花 苦杏仁 炙甘草
0.386017 0.327363 0.410337 0.445345 0.380679 0.419851
predicted yaofang:
甘草 白芍 党参 白术 海螵蛸 炙甘草

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
333. 
patient tongue id: 02181627186318_1_5
label yaofang:
甘草 防风 金银花 黄芪 红花 浙贝母 牡丹皮 水牛角 荆芥穗 麦芽 皂角刺 白鲜皮 地肤子
0.964783 0.467842 0.574621 0.317757 0.449998 0.399226 0.348616
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
334. 
patient tongue id: 03301212426910_6
label yaofang:
甘草 柴胡 白芍 黄芩 法半夏 大枣 当归 桃仁 熟地黄 胆南星 白茅根 石菖蒲 三七 鸡内金 红芪 红参 半边莲 金钗石斛
0.795164 0.428864 0.464426 0.437963
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.055556, error: 0.750000
335. 
patient tongue id: 05182023256401_1_5_7
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 厚朴 砂仁 火麻仁 鸡内金 稻芽 两面针
0.546382 0.424306 0.407035 0.36328
predicted yaofang:
甘草 茯苓 黄芪 北沙参

------Score: precision: 0.500000, recall: 0.181818, error: 0.500000
336. 
patient tongue id: 03081201070705_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.596578 0.372498 0.356303 0.458367 0.405712 0.399676 0.317188 0.32601 0.303113 0.354784
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 泽泻 天麻

------Score: precision: 0.600000, recall: 0.500000, error: 0.400000
337. 
patient tongue id: 05232030564949_1_4
label yaofang:
柴胡 白芍 香附 枳壳 蒲公英 海螵蛸 浙贝母 豆蔻 麦芽 姜半夏 炙甘草 紫苏梗
0.657464 0.361469 0.489639 0.423309
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
338. 
patient tongue id: 04271841031997_1_4_7
label yaofang:
甘草 柴胡 陈皮 枳壳 茯苓 党参 黄芪 白术 厚朴 莪术 柿蒂 蜈蚣 蛇舌草
0.526153 0.368205 0.35343 0.328799 0.540625 0.587544 0.353897 0.411748 0.333958 0.399421 0.304527
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 北沙参 合欢皮

------Score: precision: 0.545455, recall: 0.461538, error: 0.454545
339. 
patient tongue id: 04282021144599_6_4
label yaofang:
甘草 川芎 法半夏 茯苓 独活 桃仁 白术 生地黄 红花 延胡索 黄柏 泽泻 天麻 桑寄生 地龙
0.995677 0.52757 0.644529 0.357348 0.349573 0.674091 0.706267 0.639925 0.544953 0.591907 0.562474
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
340. 
patient tongue id: 04181952445996_5_1_6
label yaofang:
甘草 白芍 川芎 羌活 独活 金银花 薏苡仁 党参 白术 牛膝 桑寄生 补骨脂 忍冬藤 威灵仙 白花蛇舌 天山雪莲
0.985975 0.501676 0.634337 0.358327 0.301151 0.335083 0.626323 0.606212 0.536192 0.445297 0.50016 0.484289
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.312500, error: 0.583333
341. 
patient tongue id: 02142150069882_6_2
label yaofang:
甘草 法半夏 桔梗 远志 党参 浙贝母 桑白皮 天麻 地骨皮 糯稻根 鳖甲 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.982232 0.505153 0.600683 0.340708 0.323735 0.566816 0.568406 0.511058 0.440882 0.468565 0.4649
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
342. 
patient tongue id: 05260646327673_4_7
label yaofang:
甘草 陈皮 法半夏 茯苓 牛蒡子 桃仁 白术 红花 赤芍 浙贝母 细辛 紫苏梗 威灵仙 田七末
0.950244 0.467763 0.584273 0.383487 0.447417 0.423662 0.422273 0.324175 0.324811
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.214286, error: 0.666667
343. 
patient tongue id: 02170747116568_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.460582 0.381449 0.339492 0.362396
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
344. 
patient tongue id: 06132207194330_4_1_6
label yaofang:
柴胡 白芍 香附 枳壳 延胡索 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 紫苏梗
0.39887 0.37848 0.303222 0.469939 0.366105 0.346215
predicted yaofang:
甘草 党参 黄芪 白术 海螵蛸 炙甘草

------Score: precision: 0.333333, recall: 0.181818, error: 0.666667
345. 
patient tongue id: 02191433487714_1_2_5
label yaofang:
粉葛 建曲
0.996602 0.526082 0.657849 0.350118 0.300321 0.355689 0.700851 0.686451 0.647959 0.508339 0.572992 0.56414
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
346. 
patient tongue id: 05032254453295_2_7_6
label yaofang:
甘草 薏苡仁 党参 白术 赤芍 郁金 山药 天麻 白花蛇舌草 蜈蚣 合欢花 半枝莲 醋鳖甲 麸炒枳壳
0.988832 0.489769 0.654552 0.350004 0.303094 0.622461 0.64101 0.584154 0.482331 0.544616 0.561579
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
347. 
patient tongue id: 02170845383999_1_4_2
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.431627 0.38047 0.423484 0.348342
predicted yaofang:
甘草 茯苓 黄芪 北沙参

------Score: precision: 0.250000, recall: 0.083333, error: 0.750000
348. 
patient tongue id: 05222058310121_1_4_7
label yaofang:
陈皮 麦冬 鸡内金 莲子 布渣叶 莲房
0.578652 0.371021 0.369304 0.535025 0.479018 0.350735 0.327031
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
349. 
patient tongue id: 04121324147070_1_4
label yaofang:
麻黄 陈皮 前胡 桔梗 半夏 防风 荆芥穗 款冬花 紫菀 白前 百部 炙甘草 紫苏梗 广藿香
0.375477 0.662077 0.385751 0.815685 0.447707 0.512583 0.337035 0.324437 0.349857 0.710083 0.690305 0.65437 0.748696 0.39286 0.770322 0.382036 0.500798 0.366409 0.553632
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.526316, recall: 0.714286, error: 0.473684
350. 
patient tongue id: 03240610501182_2
label yaofang:
甘草 金银花 红花 浙贝母 地黄 火麻仁 白花蛇舌草 麦芽 白鲜皮 地肤子 蜈蚣 蜂房 岗梅根 醋鳖甲
0.988162 0.516916 0.609991 0.349266 0.334335 0.580527 0.591372 0.53111 0.457746 0.475985 0.459668
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.142857, error: 0.818182
351. 
patient tongue id: 04121812579452_1_4
label yaofang:
法半夏 茯苓 前胡 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.38415 0.795544 0.331179 0.933978 0.524785 0.631071 0.312301 0.377408 0.421751 0.858475 0.861729 0.794864 0.888487 0.338858 0.8955 0.458663 0.607109 0.415661 0.672461
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
352. 
patient tongue id: 02240825529730_1_2_7
label yaofang:
当归 党参 黄芪 枸杞子 熟附子 乌药 肉桂 干姜 巴戟天 吴茱萸 炙甘草 黄精
0.406056 0.420493 0.359738 0.347427 0.471749 0.382739 0.383054 0.47358 0.394394 0.378202 0.429038 0.320087 0.403928 0.385162 0.410312
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.133333, recall: 0.166667, error: 0.866667
353. 
patient tongue id: 03231050286863_2_6
label yaofang:
桂枝 甘草 茯苓 桃仁 生地黄 赤芍 牡丹皮 山药 山茱萸 泽泻 菟丝子 益母草 莪术
0.98603 0.507693 0.624786 0.338439 0.303032 0.585159 0.600489 0.517018 0.468416 0.492429 0.484905
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
354. 
patient tongue id: 04061407417923_4
label yaofang:
法半夏 茯苓 前胡 黄芪 细辛 干姜 款冬花 紫菀 白前 百部 芡实 豆蔻 炙甘草 广藿香 炒紫苏子 蜜麻黄
0.371773 0.93536 0.988607 0.575665 0.750571 0.302584 0.413178 0.494993 0.954413 0.963451 0.90759 0.966198 0.983359 0.515984 0.727876 0.403575 0.791665
predicted yaofang:
陈皮 法半夏 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.647059, recall: 0.687500, error: 0.352941
355. 
patient tongue id: 05232040382904_1_4_7
label yaofang:
陈皮 太子参 黄芪 枸杞子 白术 龙眼肉 杜仲 牛膝 乌药 厚朴 补骨脂 川贝母 莪术 麦芽 桑椹 紫苏叶 骨碎补 龟甲 预知子 荔枝核
0.552113 0.380558 0.302939 0.338577 0.505986 0.537208 0.354387 0.362306
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.375000, recall: 0.150000, error: 0.625000
356. 
patient tongue id: 02190525321680_1_7
label yaofang:
甘草 黄芪 酸枣仁 红花 赤芍 熟地黄 天麻 肉苁蓉 桑寄生 补骨脂 地龙 浮小麦 首乌藤 乌梢蛇
0.977252 0.494087 0.615685 0.37624 0.311942 0.337909 0.595332 0.588256 0.539406 0.444276 0.489948 0.49002
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.214286, error: 0.750000
357. 
patient tongue id: 04182036131258_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 姜半夏 炙甘草 龙脷叶
0.674119 0.415089 0.458581 0.338787
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
358. 
patient tongue id: 04062056213676_1_4_7
label yaofang:
甘草 枳壳 茯苓 桔梗 金银花 薏苡仁 桃仁 黄芪 酸枣仁 肉苁蓉 六神曲 黄精
0.577766 0.404947 0.300957 0.357898 0.487703 0.509368 0.341862 0.38397
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.375000, recall: 0.250000, error: 0.625000
359. 
patient tongue id: 03012210249115_1_2
label yaofang:
甘草 白芍 陈皮 防风 党参 白术 酸枣仁 生地黄 天麻 桑寄生 鳖甲 蜈蚣 天山雪莲 半枝莲
0.955441 0.485137 0.56897 0.383353 0.309654 0.466547 0.469219 0.440185 0.355428 0.364881 0.347338
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.571429, error: 0.272727
360. 
patient tongue id: 03282212389163_2
label yaofang:
甘草 黄芩 茯苓 枸杞子 浙贝母 荷叶 磁石 白花蛇舌草 北沙参 沙苑子 蜂房 醋鳖甲 岗梅
0.965727 0.489997 0.590865 0.378147 0.33986 0.545344 0.5425 0.497629 0.417944 0.448665 0.439595
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.153846, error: 0.818182
361. 
patient tongue id: 01140824407238_5_6_2
label yaofang:
甘草 木香 蒲公英 黄芪 黄连 延胡索 赤芍 牛膝 苍术 山药 砂仁 天麻 白芷 五灵脂
0.991261 0.514529 0.617231 0.350967 0.336828 0.607456 0.597287 0.562468 0.442193 0.487451 0.478026
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
362. 
patient tongue id: 05131559334628_2_6_7
label yaofang:
甘草 白芍 牡蛎 麦冬 党参 丹参 天冬 延胡索 栀子 牡丹皮 牛膝 天麻 女贞子 浮小麦 龟甲
0.891235 0.434606 0.479934 0.308972 0.521341 0.400359
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.333333, recall: 0.133333, error: 0.666667
363. 
patient tongue id: 05232107525084_4_1
label yaofang:
甘草 白芍 川芎 独活 牛膝 细辛 车前子 干姜 补骨脂 蜈蚣 姜黄 海桐皮 鹿衔草
0.375418 0.32159 0.372655 0.313046 0.452687 0.37683 0.361245 0.390353 0.47128
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.222222, recall: 0.153846, error: 0.777778
364. 
patient tongue id: 05131613052251_6_2
label yaofang:
甘草 茯苓 远志 党参 白术 酸枣仁 山药 菟丝子 益母草 白花蛇舌草 佛手 浮小麦 首乌藤 合欢花 醋鳖甲
0.98283 0.504134 0.620413 0.352675 0.311247 0.326087 0.604961 0.613082 0.563829 0.488046 0.52287 0.530937
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.400000, error: 0.500000
365. 
patient tongue id: 04202143512085_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 蜜麻黄 炒苍耳子
0.374446 0.743773 0.358391 0.88052 0.478583 0.57454 0.327626 0.378712 0.391198 0.791835 0.78634 0.731535 0.825838 0.363041 0.809756 0.436246 0.552996 0.39097 0.615933
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 0.937500, error: 0.210526
366. 
patient tongue id: 01312255123191_1_7
label yaofang:
甘草 羌活 独活 党参 白术 红花 地黄 天麻 白花蛇舌草 桑枝 威灵仙 蜈蚣 半枝莲 醋鳖甲
0.951182 0.477104 0.560733 0.368893 0.328587 0.48739 0.4104 0.414142 0.312598 0.308651
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.600000, recall: 0.428571, error: 0.400000
367. 
patient tongue id: 04061832077339_4_1
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 黄芪 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 广藿香 蜜麻黄
0.393721 0.830427 0.320929 0.947026 0.526006 0.643269 0.324293 0.387198 0.435774 0.873376 0.88324 0.81112 0.901518 0.328733 0.930474 0.467044 0.62611 0.417033 0.691214
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.875000, error: 0.263158
368. 
patient tongue id: 05232023248167_4
label yaofang:
甘草 柴胡 香附 枳壳 茯苓 半夏 薏苡仁 党参 白术 浙贝母 厚朴 砂仁 僵蚕 夏枯草 合欢皮 预知子
0.527555 0.378026 0.381427 0.496844 0.417168 0.310216 0.31352
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.714286, recall: 0.312500, error: 0.285714
369. 
patient tongue id: 04061910452020_1_4
label yaofang:
桂枝 甘草 法半夏 茯苓 橘红 桃仁 党参 黄芪 丹参 枳实 竹茹 胆南星 厚朴
0.894636 0.455822 0.529945 0.329037 0.394514
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
370. 
patient tongue id: 03101745004628_4
label yaofang:
法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.407347 0.864052 0.31327 0.963383 0.546442 0.683351 0.314452 0.3992 0.462635 0.904381 0.915239 0.840356 0.926103 0.952217 0.490784 0.666544 0.434218 0.720773
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.833333, recall: 1.000000, error: 0.166667
371. 
patient tongue id: 05080855488553_1_3
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.549731 0.349973 0.364642 0.598321 0.509833 0.384865 0.342664
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
372. 
patient tongue id: 01180605332418_6_1_5
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 党参 白术 酸枣仁 黄连 川楝子 乌梅 山药 细辛 合欢花
0.768124 0.398011 0.465 0.303968 0.417002
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
373. 
patient tongue id: 05242120007043_4_6
label yaofang:
甘草 法半夏 茯苓 牡蛎 远志 党参 酸枣仁 知母 淡豆豉 益智仁 桑螵蛸 天竺黄 首乌藤 紫苏梗 合欢花
0.963136 0.479359 0.594799 0.3487 0.317325 0.548129 0.474188 0.421356 0.337147 0.374314 0.369414
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
374. 
patient tongue id: 04130647210328_1_7_6
label yaofang:
甘草 茯苓 党参 酸枣仁 丹参 生地黄 牡丹皮 黄柏 山茱萸 泽泻 菟丝子 益母草 淫羊藿 女贞子 浮小麦 墨旱莲
0.984275 0.506265 0.616748 0.363403 0.322161 0.56945 0.572061 0.511776 0.436708 0.463716 0.451079
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
375. 
patient tongue id: 03021852314167_1_2_7
label yaofang:
甘草 茯苓 浙贝母 厚朴 生半夏 砂仁 鸡内金 北沙参 首乌藤 合欢皮 蛇舌草
0.575299 0.383229 0.423756 0.452743 0.373661
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.181818, error: 0.600000
376. 
patient tongue id: 06072311074481_1_2
label yaofang:
甘草 法半夏 茯苓 前胡 桃仁 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.987777 0.502634 0.636816 0.374963 0.300253 0.333314 0.608383 0.623103 0.58527 0.469088 0.519902 0.532226
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.800000, error: 0.000000
377. 
patient tongue id: 03311648289040_4
label yaofang:
陈皮 桔梗 大腹皮 干姜 厚朴 白芷 姜半夏 紫苏叶 广藿香 猫爪草 山慈菇
0.469466 0.324754 0.329173 0.469744 0.379373
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
378. 
patient tongue id: 06012035281709_2_5
label yaofang:
茯苓 薏苡仁 麦冬 鸡血藤 白术 生地黄 山药 紫草 鳖甲 扁豆花 蝉蜕 白鲜皮 土茯苓 龟甲 羚羊骨
0.535025 0.394542 0.407819 0.337465 0.345456
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.133333, error: 0.600000
379. 
patient tongue id: 03131256225311_4
label yaofang:
陈皮 法半夏 防风 佩兰 荆芥穗 豆蔻 炙甘草 辛夷 紫苏梗 广藿香 炒苍耳子 麸炒白术 炒六神曲 醋香附
0.390149 0.772667 0.332419 0.908932 0.499784 0.612098 0.318814 0.388577 0.436892 0.819398 0.827111 0.753988 0.853041 0.323122 0.88395 0.461692 0.59918 0.425394 0.644757
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.315789, recall: 0.428571, error: 0.684211
380. 
patient tongue id: 05191928023957_6_1
label yaofang:
甘草 法半夏 茯苓 红花 杜仲 山药 天麻 桑寄生 鳖甲 苦杏仁 瓜蒌子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.986097 0.509242 0.623492 0.325915 0.303276 0.334327 0.627561 0.570147 0.488945 0.41304 0.461647 0.44017
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
381. 
patient tongue id: 03311642562715_1_4
label yaofang:
柴胡 大枣 茯苓 防风 连翘 太子参 昆布 海藻 乌梅 石斛 白花蛇舌草 猫爪草 山慈菇
0.484697 0.322958 0.37634 0.309091 0.485247 0.383828 0.303108 0.331321 0.356937
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.111111, recall: 0.076923, error: 0.888889
382. 
patient tongue id: 01062335521171_1_4
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.958289 0.485012 0.568136 0.364593 0.349334 0.51484 0.445355 0.438246 0.31079 0.343528 0.323553
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.090909, recall: 0.083333, error: 0.909091
383. 
patient tongue id: 05022046307967_2_6
label yaofang:
甘草 茯苓 木香 党参 生地黄 山药 天麻 鳖甲 扁豆花 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.975463 0.501508 0.585947 0.330278 0.305172 0.50474 0.476847 0.426589 0.356655 0.36628 0.347131
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.714286, error: 0.090909
384. 
patient tongue id: 02120940343215_6_2
label yaofang:
甘草 酸枣仁 生地黄 牡丹皮 杜仲 黄柏 山药 山茱萸 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.992396 0.52505 0.63324 0.334043 0.321023 0.358903 0.676703 0.639233 0.586443 0.481737 0.534383 0.526708
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.642857, error: 0.250000
385. 
patient tongue id: 02212007582065_1_2_5
label yaofang:
甘草 枳壳 当归 防风 党参 仙鹤草 茜草 天麻 槐花 鳖甲 火麻仁 蜈蚣 天山雪莲 半枝莲
0.996482 0.527631 0.664343 0.34115 0.349158 0.69102 0.701158 0.646023 0.534823 0.590656 0.587303
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
386. 
patient tongue id: 02171959301394_2
label yaofang:
法半夏 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.378046 0.695302 0.366359 0.826266 0.463339 0.556066 0.35872 0.367842 0.312175 0.395088 0.718246 0.721239 0.679464 0.762474 0.379694 0.798078 0.42678 0.537499 0.404845 0.582297
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.650000, recall: 0.928571, error: 0.350000
387. 
patient tongue id: 02212029417696_7_6
label yaofang:
甘草 枳壳 茯苓 桃仁 党参 酸枣仁 丹参 玄参 柏子仁 黄连 生地黄 栀子 牡丹皮 天花粉 火麻仁 郁李仁
0.986461 0.515257 0.611206 0.351876 0.342975 0.590047 0.574099 0.538611 0.436138 0.464497 0.455859
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.187500, error: 0.727273
388. 
patient tongue id: 02020950137737_6_5
label yaofang:
甘草 柴胡 白芍 黄芩 当归 茯苓 党参 白术 酸枣仁 生地黄 栀子 牡丹皮 合欢花
0.985588 0.519126 0.602778 0.329874 0.313911 0.57863 0.593176 0.513038 0.469031 0.480896 0.464975
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.307692, error: 0.636364
389. 
patient tongue id: 02252110182261_3
label yaofang:
甘草 茯苓 葛根 远志 党参 白术 酸枣仁 栀子 牡丹皮 山药 益智仁 芡实 桑螵蛸 浮小麦
0.997173 0.540568 0.672978 0.332075 0.313364 0.344193 0.689228 0.703764 0.642606 0.552685 0.598362 0.598024
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.500000, recall: 0.428571, error: 0.500000
390. 
patient tongue id: 03272233577184_1_4_7
label yaofang:
桂枝 龙骨 牡蛎 麦冬 党参 五味子 熟地黄 火麻仁 炙甘草 黑枣
0.453146 0.348681 0.358263 0.426209 0.377916
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.100000, error: 0.800000
391. 
patient tongue id: 05261954034707_1_4
label yaofang:
荆芥 薄荷 浙贝母 僵蚕 百部 枇杷叶 苦杏仁 紫苏子 蝉蜕 紫苏叶 紫苑
0.457163 0.33899 0.362886 0.336952 0.433106
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
392. 
patient tongue id: 01091945426733_1_4_7
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 黄连 山药 天麻 鳖甲 浮小麦 首乌藤 蜈蚣 白花蛇舌 半枝莲 红豆杉
0.989809 0.51001 0.623669 0.330578 0.334725 0.613953 0.598918 0.539053 0.454979 0.496699 0.488063
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.909091, recall: 0.666667, error: 0.090909
393. 
patient tongue id: 05042036546633_1_6
label yaofang:
甘草 黄芪 阿胶 白术 海螵蛸 枳实 干姜 砂仁 菟丝子 制白附子
0.349561 0.408544 0.420721 0.393405 0.338299 0.350323 0.4365 0.315923 0.591251 0.721368 0.325879 0.301209
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 干姜 姜半夏 炙甘草 紫苏叶 紫苏梗

------Score: precision: 0.250000, recall: 0.300000, error: 0.750000
394. 
patient tongue id: 01052206203844_1_3_7
label yaofang:
甘草 桔梗 黄芪 白术 熟地黄 浙贝母 山茱萸 桑螵蛸 夏枯草 北沙参 首乌藤 蜈蚣 合欢皮 墨旱莲
0.881564 0.444556 0.44549 0.322854 0.474596 0.319244
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 蜈蚣

------Score: precision: 0.666667, recall: 0.285714, error: 0.333333
395. 
patient tongue id: 05261933056225_1_4_7
label yaofang:
陈皮 半夏 党参 黄芪 枸杞子 白术 杜仲 牛膝 郁金 山药 厚朴 僵蚕 菟丝子 鸡内金 紫苏梗 红豆杉
0.52569 0.371296 0.33539 0.535143 0.511256 0.311103 0.367921 0.376788
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 北沙参

------Score: precision: 0.500000, recall: 0.250000, error: 0.500000
396. 
patient tongue id: 06190248442610_4_6
label yaofang:
甘草 白芍 法半夏 茯苓 龙骨 远志 酸枣仁 知母 山茱萸 地黄 砂仁 辛夷 浮小麦 紫苏梗 炒苍耳子 合欢花
0.969824 0.477583 0.603955 0.388226 0.484861 0.476907 0.440481 0.329065 0.358629 0.345801
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.125000, error: 0.800000
397. 
patient tongue id: 03242130590095_1
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.575557 0.363262 0.451295 0.315377
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
398. 
patient tongue id: 03192302394682_2_7
label yaofang:
甘草 白芍 党参 白术 竹茹 杜仲 砂仁 天麻 桑寄生 麦芽 续断 紫苏梗 广藿香 牛大力
0.994338 0.520051 0.654084 0.34954 0.331253 0.659595 0.674034 0.603193 0.515908 0.565654 0.554175
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
399. 
patient tongue id: 05032222108497_7_6_4
label yaofang:
甘草 法半夏 前胡 龙骨 桃仁 远志 党参 丹参 薤白 桑白皮 水蛭 瓜蒌皮 款冬花 莪术 苦杏仁
0.97598 0.49234 0.607388 0.35373 0.306562 0.56204 0.557877 0.500051 0.419148 0.458469 0.458686
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.181818, recall: 0.133333, error: 0.818182
400. 
patient tongue id: 04052210079869_3_4
label yaofang:
麻黄 甘草 陈皮 黄芪 白术 胆南星 杜仲 郁金 神曲 厚朴 生半夏 僵蚕 桑寄生 莪术 紫苏叶 蜈蚣
0.638407 0.363933 0.44459 0.309877 0.324372
predicted yaofang:
甘草 法半夏 茯苓 桔梗 党参

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
401. 
patient tongue id: 04222053220677_1_4
label yaofang:
白芍 川芎 当归 独活 党参 黄芪 细辛 防己 桑寄生 木瓜 川牛膝 炙甘草 续断 首乌藤 威灵仙 盐菟丝子
0.3654 0.549385 0.403799 0.688174 0.399851 0.457693 0.339655 0.313121 0.585115 0.554105 0.546997 0.639104 0.413683 0.65945 0.365518 0.437269 0.332727 0.482899
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.055556, recall: 0.062500, error: 0.944444
402. 
patient tongue id: 04202316192773_5
label yaofang:
甘草 金银花 连翘 蒲公英 紫花地丁 党参 白术 天麻 白芷 白花蛇舌草 皂角刺 蜈蚣 半枝莲 醋鳖甲
0.974904 0.493599 0.573849 0.355009 0.312022 0.501558 0.484609 0.461248 0.362333 0.375504 0.366928
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
403. 
patient tongue id: 05162059381473_2_7
label yaofang:
甘草 白芍 法半夏 牡蛎 薏苡仁 桃仁 党参 枸杞子 赤芍 郁金 天麻 全蝎 蒺藜 女贞子 土鳖虫 制天南星
0.989735 0.514773 0.634688 0.344183 0.306894 0.34509 0.648337 0.623864 0.554168 0.467843 0.517905 0.500474
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
404. 
patient tongue id: 05312143408050_4
label yaofang:
甘草 羌活 独活 薏苡仁 党参 白术 杜仲 天麻 白花蛇舌草 浮小麦 首乌藤 蜈蚣 半枝莲 醋鳖甲
0.908909 0.461394 0.523102 0.327164 0.369848
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.800000, recall: 0.285714, error: 0.200000
405. 
patient tongue id: 03291618097049_6_4
label yaofang:
甘草 香附 枳壳 法半夏 茯苓 党参 丹参 郁金 薤白 水蛭 瓜蒌皮 莪术 紫苏梗
0.964547 0.48774 0.576126 0.334163 0.309825 0.517231 0.433294 0.390143 0.300665 0.321641 0.301514
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.230769, error: 0.727273
406. 
patient tongue id: 01062354544903_1_2_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.527336 0.335315 0.480369 0.43626 0.327613 0.526403 0.482493 0.442604 0.448099 0.471836 0.452803 0.4896 0.497563 0.475644 0.461203 0.453163
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.750000, recall: 1.000000, error: 0.250000
407. 
patient tongue id: 01211155296740_2
label yaofang:
白芍 丹参 钩藤 桑叶 石斛 秦皮 决明子 蒺藜 化橘红
0.412517 0.352028 0.320097 0.40697 0.400756 0.313276 0.309546 0.469995
predicted yaofang:
甘草 白芍 茯苓 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.125000, recall: 0.111111, error: 0.875000
408. 
patient tongue id: 05111439032509_1_3_7
label yaofang:
甘草 枳壳 木香 党参 黄芪 丹参 海螵蛸 厚朴 莱菔子 鸡内金 草豆蔻 六神曲
0.625936 0.335025 0.42805 0.457235 0.351508 0.476543 0.429079 0.383162 0.320422 0.390656 0.376752 0.398672 0.513763 0.359464 0.354947 0.326629
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.312500, recall: 0.416667, error: 0.687500
409. 
patient tongue id: 03161713206874_2
label yaofang:
前胡 桔梗 麦冬 太子参 荷叶 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子
0.392875 0.619231 0.383247 0.759562 0.449148 0.522665 0.348353 0.35507 0.388424 0.661154 0.657074 0.62442 0.70591 0.383257 0.738267 0.413563 0.301311 0.513756 0.401981 0.548115
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.500000, recall: 0.833333, error: 0.500000
410. 
patient tongue id: 03231132255868_5_7
label yaofang:
甘草 黄芩 防风 金银花 黄芪 白术 五味子 生地黄 浙贝母 牡丹皮 茜草 荆芥穗 紫苏梗 贯众
0.979101 0.483892 0.614311 0.372457 0.527983 0.532499 0.49037 0.379092 0.41252 0.405752
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.200000, recall: 0.142857, error: 0.800000
411. 
patient tongue id: 01182159428007_6_2_1
label yaofang:
甘草 柴胡 川芎 木香 党参 丹参 赤芍 牛膝 郁金 山药 莪术 海金沙 鸡内金 王不留行
0.992887 0.514276 0.634507 0.338618 0.323432 0.625646 0.615341 0.55268 0.451254 0.497041 0.476813
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
412. 
patient tongue id: 02141943569886_1
label yaofang:
甘草 肉桂 干姜 款冬花 附片
0.478832 0.315539 0.454989 0.324413
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.250000, recall: 0.200000, error: 0.750000
413. 
patient tongue id: 03292133154570_1
label yaofang:
甘草 枳壳 茯苓 牡蛎 党参 太子参 酸枣仁 丹参 生地黄 竹茹 浙贝母 郁金 扁豆花 麦芽
0.982684 0.499136 0.595572 0.343904 0.490583 0.478227 0.448246 0.339145 0.355776 0.336148
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
414. 
patient tongue id: 05140956056868_6_4
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 赤芍 山药 天麻 鳖甲 补骨脂 女贞子 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.997202 0.537439 0.665537 0.324716 0.300804 0.340086 0.701944 0.704345 0.633303 0.537418 0.593017 0.573142
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.916667, recall: 0.733333, error: 0.083333
415. 
patient tongue id: 05161929352710_1_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 太子参 细辛 干姜 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香 蜜麻黄
0.404861 0.81298 0.303265 0.941688 0.528444 0.640366 0.330887 0.399208 0.450115 0.867424 0.881589 0.807468 0.897482 0.327851 0.918554 0.48653 0.629985 0.43137 0.689658
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.789474, recall: 0.937500, error: 0.210526
416. 
patient tongue id: 05152046239739_1_2_6
label yaofang:
桂枝 当归 木香 远志 党参 黄芪 鸡血藤 白术 柏子仁 炙甘草 百合 紫苏叶
0.553471 0.329266 0.347006 0.462226 0.390651
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.400000, recall: 0.166667, error: 0.600000
417. 
patient tongue id: 03090759186879_1_4_7
label yaofang:
甘草 川芎 党参 杜仲 牛膝 天麻 桑寄生 麦芽 地龙 女贞子 粉葛 首乌藤 墨旱莲
0.887379 0.459571 0.499628 0.329263 0.329158
predicted yaofang:
甘草 茯苓 党参 白术 天麻

------Score: precision: 0.600000, recall: 0.230769, error: 0.400000
418. 
patient tongue id: 03240607532132_1_2_4
label yaofang:
甘草 柴胡 白芍 茯苓 薏苡仁 党参 山药 车前子 天麻 鳖甲 白扁豆 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.949748 0.301001 0.485865 0.540723 0.325782 0.413502 0.357564 0.334187
predicted yaofang:
甘草 法半夏 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.750000, recall: 0.400000, error: 0.250000
419. 
patient tongue id: 04061958385390_4
label yaofang:
甘草 柴胡 白芍 香附 黄芩 当归 茯苓 薄荷 白术 海螵蛸 白花蛇舌草 麦芽 广藿香
0.300167 0.368349 0.312562 0.377364 0.334501 0.373331 0.311638 0.480883 0.648981
predicted yaofang:
柴胡 白芍 香附 党参 白术 海螵蛸 干姜 姜半夏 炙甘草

------Score: precision: 0.555556, recall: 0.384615, error: 0.444444
420. 
patient tongue id: 01121851476067_4
label yaofang:
陈皮 法半夏 前胡 桔梗 太子参 款冬花 紫菀 白前 百部 北沙参 炙甘草 炒紫苏子 蜜麻黄
0.335093 0.352271 0.39231 0.335872 0.343984 0.325107
predicted yaofang:
甘草 法半夏 茯苓 黄芪 北沙参 炙甘草

------Score: precision: 0.500000, recall: 0.230769, error: 0.500000
421. 
patient tongue id: 05140638543298_6_1_5
label yaofang:
甘草 川芎 党参 酸枣仁 生地黄 天麻 鳖甲 白花蛇舌草 浮小麦 蜈蚣 天山雪莲 半枝莲
0.982418 0.507647 0.611378 0.320787 0.329888 0.580174 0.568133 0.502216 0.44777 0.473549 0.473931
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.583333, error: 0.363636
422. 
patient tongue id: 04282031455762_6
label yaofang:
甘草 香附 枳壳 黄芩 茯苓 桃仁 党参 白术 生地黄 红花 山药 菟丝子 桑寄生 补骨脂
0.960338 0.466529 0.583957 0.410752 0.419267 0.43538 0.418989 0.31774 0.304448
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.444444, recall: 0.285714, error: 0.555556
423. 
patient tongue id: 05162146419364_2_5
label yaofang:
白芍 茯苓 生地黄 牡丹皮 黄柏 知母 山药 山茱萸 白茅根 小蓟 泽泻 车前子 白花蛇舌 鹿衔草
0.887213 0.467585 0.482706 0.385172 0.313829
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.200000, recall: 0.071429, error: 0.800000
424. 
patient tongue id: 05262110593119_5_7
label yaofang:
甘草 白芍 川芎 法半夏 黄连 赤芍 胆南星 牛膝 细辛 天麻 全蝎 白芷
0.891012 0.443617 0.514399 0.449152 0.368498
predicted yaofang:
甘草 茯苓 党参 白术 蜈蚣

------Score: precision: 0.200000, recall: 0.083333, error: 0.800000
425. 
patient tongue id: 03221634094943_1_7_4
label yaofang:
半夏 橘红 薏苡仁 桃仁 黄芪 红花 赤芍 海螵蛸 郁金 厚朴 当归尾 砂仁 全蝎 鸡内金 地龙
0.62724 0.373498 0.349932 0.351518 0.567425 0.629672 0.325702 0.347842 0.456304 0.373969 0.328095 0.403737 0.320285
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 莪术 北沙参 合欢皮

------Score: precision: 0.384615, recall: 0.333333, error: 0.615385
426. 
patient tongue id: 03261611575991_6
label yaofang:
甘草 柴胡 白芍 川芎 香附 远志 枳实 泽泻 升麻 首乌藤 合欢皮
0.618414 0.404087 0.453529 0.30557 0.392755
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
427. 
patient tongue id: 03171415120649_4
label yaofang:
桂枝 甘草 白芍 法半夏 前胡 太子参 黄芪 细辛 干姜 白芷 百部 北沙参 辛夷 蜜麻黄 炒苍耳子 醋五味子
0.373483 0.656889 0.370273 0.769686 0.462436 0.512484 0.33038 0.375167 0.327098 0.414978 0.67905 0.687784 0.609361 0.681182 0.30903 0.798849 0.381549 0.301201 0.515037 0.338926 0.523716
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.476190, recall: 0.625000, error: 0.523810
428. 
patient tongue id: 02161859548478_4
label yaofang:
陈皮 法半夏 前胡 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄
0.400178 0.696082 0.371583 0.84185 0.476907 0.57284 0.356962 0.393766 0.315631 0.332335 0.42557 0.744153 0.751852 0.6923 0.782586 0.371653 0.812304 0.452952 0.31248 0.559328 0.431063 0.604501
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 紫苏梗 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.636364, recall: 1.000000, error: 0.363636
429. 
patient tongue id: 02181628211123_1_6_7
label yaofang:
甘草 前胡 薏苡仁 党参 黄芪 白术 生地黄 延胡索 郁金 天麻 鳖甲 威灵仙 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.990668 0.520084 0.624032 0.324196 0.32875 0.615606 0.608157 0.537605 0.469 0.504191 0.491504
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.727273, recall: 0.500000, error: 0.272727
430. 
patient tongue id: 03090856447016_2
label yaofang:
甘草 茯苓 熟地黄 牡丹皮 杜仲 山药 山茱萸 泽泻 菟丝子 巴戟天 桑寄生 决明子
0.993247 0.522838 0.630812 0.324121 0.322901 0.619836 0.650311 0.580823 0.517782 0.536904 0.531085
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
431. 
patient tongue id: 05251958320141_7_5_2
label yaofang:
薏苡仁 黄芪 白术 浙贝母 牛膝 小蓟 砂仁 莪术 山慈菇 蛇舌草
0.695579 0.414525 0.449325 0.395721 0.322639
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.200000, error: 0.600000
432. 
patient tongue id: 05221859059633_2_1
label yaofang:
甘草 芦根 薏苡仁 麦冬 黄芪 生地黄 枳实 乌梅 山茱萸 虎杖 决明子 地龙 北沙参 百合
0.568043 0.40544 0.379593 0.447368 0.465362 0.300137
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 北沙参

------Score: precision: 0.500000, recall: 0.214286, error: 0.500000
433. 
patient tongue id: 05092249462526_1_2
label yaofang:
枳壳 当归 黄芪 白术 海螵蛸 浙贝母 山药 砂仁 鸡内金 紫苏梗 红豆杉 合欢皮 稻芽
0.614591 0.352926 0.361025 0.527447 0.63895 0.354811 0.370399 0.322898
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 海螵蛸 厚朴 砂仁

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
434. 
patient tongue id: 03111748035222_4_2_7
label yaofang:
甘草 白芍 川芎 法半夏 茯苓 牡蛎 白术 酸枣仁 牡丹皮 天麻 浮小麦 桑枝 威灵仙
0.965751 0.484065 0.560799 0.3566 0.30131 0.44976 0.394679 0.392697
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣

------Score: precision: 0.500000, recall: 0.307692, error: 0.500000
435. 
patient tongue id: 06072250294527_1_2
label yaofang:
甘草 白芍 陈皮 薏苡仁 党参 白术 山药 天麻 鳖甲 白扁豆 建曲 蜈蚣 天山雪莲 半枝莲
0.984749 0.511157 0.627107 0.325401 0.327354 0.600515 0.563977 0.49283 0.420804 0.458948 0.455123
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
436. 
patient tongue id: 02261926197982_1
label yaofang:
甘草 茯苓 生地黄 延胡索 牡丹皮 山药 山茱萸 泽泻 补骨脂 麦芽 续断 威灵仙
0.994354 0.521634 0.638976 0.335314 0.323897 0.61405 0.628012 0.573281 0.471673 0.509413 0.501452
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.250000, error: 0.727273
437. 
patient tongue id: 04200623333925_6
label yaofang:
甘草 柴胡 白芍 香附 黄芩 茯苓 党参 白术 山药 砂仁 菟丝子 益母草 佛手 合欢花
0.980961 0.508694 0.600461 0.348174 0.332449 0.574316 0.555275 0.49662 0.42389 0.448369 0.428583
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
438. 
patient tongue id: 04202153096518_4
label yaofang:
防风 党参 太子参 黄芪 枸杞子 山药 芡实 煅牡蛎 北沙参 炙甘草 浮小麦 麸炒白术 煅龙骨
0.325768 0.461697 0.399923 0.522466 0.350064 0.34769 0.302884 0.427225 0.420731 0.376758 0.455646 0.372191 0.570524 0.340082
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 黄芪 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香

------Score: precision: 0.285714, recall: 0.307692, error: 0.714286
439. 
patient tongue id: 01180543308372_1_3_4
label yaofang:
桂枝 甘草 陈皮 茯苓 半夏 黄芪 白术 浙贝母 橘核 桑枝 黑枣 黑老虎
0.595137 0.386989 0.391743 0.503657 0.477658 0.337138 0.316822
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.571429, recall: 0.333333, error: 0.428571
440. 
patient tongue id: 05091927123896_2_4
label yaofang:
陈皮 法半夏 防风 佩兰 荆芥穗 砂仁 香薷 炙甘草 紫苏梗 广藿香 麸炒白术 麸炒苍术 炒六神曲 炒稻芽 醋香附 炒麦芽
0.395956 0.854758 0.318768 0.960582 0.541582 0.671582 0.323261 0.401951 0.460386 0.899137 0.910451 0.836755 0.921558 0.320445 0.943791 0.476677 0.647684 0.420427 0.713921
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.263158, recall: 0.312500, error: 0.736842
441. 
patient tongue id: 05222107388871_4_1
label yaofang:
陈皮 当归 黄芪 白术 杜仲 苍术 厚朴 生半夏 僵蚕 鸡内金 枇杷叶 红豆杉 山慈菇 稻芽
0.535883 0.336566 0.437418 0.687788 0.684482 0.431561 0.370043 0.555926 0.409477 0.300946 0.339003 0.381008 0.477856 0.431591 0.358978
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 僵蚕 莪术 鸡内金 北沙参 合欢皮 蛇舌草

------Score: precision: 0.400000, recall: 0.428571, error: 0.600000
442. 
patient tongue id: 06051119462038_1_2
label yaofang:
当归 麦冬 玉竹 党参 黄芪 乌药 山药 淫羊藿 仙茅 益智 鹿角霜
0.478562 0.333872 0.356657 0.409113 0.478822 0.391116 0.342549 0.310007
predicted yaofang:
甘草 茯苓 桃仁 党参 黄芪 丹参 牛膝 泽泻

------Score: precision: 0.250000, recall: 0.181818, error: 0.750000
443. 
patient tongue id: 06050915326782_1_3_7
label yaofang:
当归 党参 黄芪 乌药 山药 淫羊藿 桑螵蛸 仙茅 益智 鹿角霜 覆盆子 煨诃子
0.668429 0.383625 0.450578 0.409489 0.350359 0.33482
predicted yaofang:
甘草 茯苓 党参 黄芪 丹参 天麻

------Score: precision: 0.333333, recall: 0.166667, error: 0.666667
444. 
patient tongue id: 01182137036842_6_2
label yaofang:
甘草 茯苓 党参 白术 酸枣仁 生地黄 红花 山药 山茱萸 补骨脂 续断 浮小麦 桑枝 威灵仙
0.992809 0.510664 0.642151 0.335747 0.320778 0.624402 0.63034 0.566736 0.473289 0.518449 0.51516
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.454545, recall: 0.357143, error: 0.545455
445. 
patient tongue id: 05222101141649_5_4
label yaofang:
麦冬 黄芪 五味子 杜仲 厚朴 僵蚕 瓜蒌皮 莪术 诃子 鸡内金 枇杷叶 地龙 北沙参 蝉蜕
0.61923 0.368035 0.325382 0.357579 0.611979 0.630023 0.315232 0.342269 0.459814 0.351181 0.315689 0.304326 0.39879
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 杜仲 厚朴 砂仁 莪术 鸡内金 北沙参

------Score: precision: 0.461538, recall: 0.428571, error: 0.538462
446. 
patient tongue id: 06132101578932_5
label yaofang:
甘草 茯苓 桔梗 薏苡仁 党参 白术 山药 砂仁 白花蛇舌草 白扁豆 鸡骨草
0.313261 0.30158 0.350506 0.438812 0.366932 0.383208 0.396448 0.493396
predicted yaofang:
甘草 柴胡 白芍 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.375000, recall: 0.272727, error: 0.625000
447. 
patient tongue id: 04241922145369_2_3
label yaofang:
陈皮 芦根 黄芪 枸杞子 生地黄 赤芍 海螵蛸 枳实 厚朴 砂仁 芒硝 火麻仁 百合 人参叶 土牛膝
0.394864 0.333541 0.364103 0.364394
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.250000, recall: 0.066667, error: 0.750000
448. 
patient tongue id: 04282218309687_6
label yaofang:
甘草 柴胡 白芍 枳壳 茯苓 党参 酸枣仁 丹参 黄连 郁金 山茱萸 补骨脂 佛手 浮小麦
0.989161 0.506713 0.577588 0.335991 0.303526 0.530435 0.541221 0.491607 0.398262 0.402501 0.369491
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.214286, error: 0.727273
449. 
patient tongue id: 02181956257943_1_4_7
label yaofang:
甘草 法半夏 茯苓 桔梗 党参 丹参 浙贝母 砂仁 天麻 鳖甲 莪术 麦芽 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.976829 0.492232 0.596849 0.321556 0.306726 0.54303 0.475357 0.415331 0.336566 0.363896 0.345097
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.562500, error: 0.181818
450. 
patient tongue id: 03231058246240_1_3
label yaofang:
防风 太子参 黄芪 肉桂 细辛 干姜 白芷 北沙参 辛夷 紫苏梗 广藿香 麸炒白术 麸炒苍术 超苍耳子
0.417893 0.748737 0.351218 0.886226 0.487118 0.592348 0.331712 0.403489 0.318773 0.42468 0.796742 0.810896 0.738612 0.837518 0.345603 0.866509 0.451498 0.569231 0.445068 0.623988
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.400000, recall: 0.571429, error: 0.600000
451. 
patient tongue id: 05272343384152_4_7_5
label yaofang:
枳壳 黄芪 白术 海螵蛸 浙贝母 杜仲 白茅根 砂仁 补骨脂 鸡内金 紫苏梗 稻芽
0.597476 0.356234 0.396498 0.591324 0.400608 0.349284 0.306623
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.285714, recall: 0.166667, error: 0.714286
452. 
patient tongue id: 05290748019004_1_4
label yaofang:
甘草 薏苡仁 党参 黄芪 枸杞子 白术 酸枣仁 天麻 鳖甲 莪术 蜈蚣 白花蛇舌 红豆杉 龙葵果
0.99345 0.52516 0.633576 0.341408 0.324064 0.629496 0.649061 0.582592 0.499667 0.53347 0.517022
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.636364, recall: 0.500000, error: 0.363636
453. 
patient tongue id: 05312342504121_6_2
label yaofang:
甘草 川芎 当归 茯苓 桃仁 红花 乌药 山药 山茱萸 地黄 桑寄生 吴茱萸 仙茅 佛手 合欢花
0.992648 0.518092 0.663882 0.341789 0.332709 0.676176 0.667803 0.594055 0.509281 0.569783 0.566249
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.272727, recall: 0.200000, error: 0.727273
454. 
patient tongue id: 06071852227647_4_3
label yaofang:
川芎 桔梗 半夏 羌活 麦冬 党参 白术 附子 豆蔻 北沙参 紫苏子 炙甘草 骨碎补 姜黄 石榴皮
0.616457 0.381354 0.383777 0.512502 0.538363 0.36418 0.313648
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.200000, error: 0.571429
455. 
patient tongue id: 03091906502111_1_2
label yaofang:
甘草 川芎 党参 黄芪 枸杞子 酸枣仁 石菖蒲 天麻 地龙 蒺藜 女贞子 粉葛 首乌藤
0.991217 0.488132 0.653529 0.362732 0.604423 0.629979 0.581435 0.46737 0.518935 0.531831
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.300000, recall: 0.230769, error: 0.700000
456. 
patient tongue id: 05130637599152_1_2_4
label yaofang:
甘草 柴胡 陈皮 薏苡仁 黄芪 山茱萸 天麻 鳖甲 莪术 地龙 蜈蚣 白花蛇舌 红豆杉 龙葵果 广升麻
0.640236 0.402729 0.398426 0.464399 0.555918 0.357595 0.310858 0.306792
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 砂仁 北沙参

------Score: precision: 0.250000, recall: 0.133333, error: 0.750000
457. 
patient tongue id: 03021232004242_1_3_7
label yaofang:
甘草 白芍 桔梗 金银花 连翘 薄荷 桃仁 蒲公英 麦冬 玄参 生地黄 红花 浙贝母 牡丹皮 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 败酱草 制何首乌
0.408389 0.499593 0.380633 0.404763 0.544015 0.462188 0.469896 0.465102 0.488554 0.461909 0.505396 0.387374 0.496771 0.48898 0.487328
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.800000, recall: 0.500000, error: 0.200000
458. 
patient tongue id: 04132049296799_7_5
label yaofang:
桂枝 甘草 川芎 当归 金银花 蒲公英 紫花地丁 黄芪 生地黄 红花 赤芍 吴茱萸 白鲜皮 地肤子
0.954581 0.475242 0.574466 0.352932 0.472541 0.402923 0.366261
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.142857, recall: 0.071429, error: 0.857143
459. 
patient tongue id: 05022220273856_2_5
label yaofang:
甘草 山茱萸 天麻 菟丝子 益母草 鳖甲 桑螵蛸 益智 续断 蜈蚣 天山雪莲 半枝莲 广金钱草 红豆杉
0.983822 0.502874 0.598208 0.366701 0.312688 0.534364 0.568324 0.516184 0.433979 0.454457 0.43575
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
460. 
patient tongue id: 01190621199806_2_1_6
label yaofang:
甘草 白芍 茯苓 远志 党参 枸杞子 牡丹皮 黄柏 山药 山茱萸 泽泻 菟丝子 金樱子 蛇床子 沙苑子 合欢花
0.998702 0.548801 0.700838 0.323886 0.331097 0.371469 0.772983 0.756473 0.713002 0.575346 0.658998 0.66206
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.333333, recall: 0.250000, error: 0.666667
461. 
patient tongue id: 03142051504437_4
label yaofang:
白芍 香附 法半夏 党参 延胡索 海螵蛸 砂仁 天花粉 北柴胡 麦芽 炙甘草 紫苏梗
0.419111 0.311806 0.37036 0.322985 0.458926 0.36639 0.302931 0.398149 0.455222
predicted yaofang:
甘草 柴胡 白芍 香附 党参 白术 海螵蛸 姜半夏 炙甘草

------Score: precision: 0.555556, recall: 0.416667, error: 0.444444
462. 
patient tongue id: 03012336527370_6_2
label yaofang:
甘草 薏苡仁 桑白皮 天麻 鳖甲 款冬花 莪术 紫菀 枇杷叶 苦杏仁 蜈蚣 白花蛇舌 天山雪莲 红豆杉
0.994992 0.529454 0.639223 0.329256 0.332322 0.636654 0.627689 0.577065 0.463132 0.503554 0.485924
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.545455, recall: 0.428571, error: 0.454545
463. 
patient tongue id: 03301959026757_4
label yaofang:
甘草 茯苓 半夏 牛蒡子 薏苡仁 鱼腥草 黄芪 白术 赤芍 浙贝母 杜仲 泽泻 僵蚕 白芷 蝉蜕 辛夷 紫苏叶 蜈蚣 猫爪草 冬凌草
0.491792 0.4238 0.433161 0.379014 0.361375 0.348234 0.309496 0.412283 0.301666
predicted yaofang:
甘草 法半夏 茯苓 前胡 桔梗 款冬花 紫菀 炙甘草 广藿香

------Score: precision: 0.222222, recall: 0.100000, error: 0.777778
464. 
patient tongue id: 02211850374883_1
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 干姜 豆蔻 姜半夏 炙甘草 紫苏梗
0.544241 0.313346 0.331896 0.450683 0.378434
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
465. 
patient tongue id: 04062019186697_4_1_6
label yaofang:
柴胡 大枣 茯苓 防风 连翘 太子参 昆布 海藻 乌梅 石斛 白花蛇舌草 猫爪草 山慈菇
0.926879 0.423762 0.583546 0.374154 0.457634 0.395993 0.386031
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.142857, recall: 0.076923, error: 0.857143
466. 
patient tongue id: 01140807411080_6_2_5
label yaofang:
甘草 白芍 薏苡仁 党参 白术 熟附子 山药 天麻 赤石脂 鳖甲 莪术 败酱草 蜈蚣 天山雪莲 半枝莲
0.993804 0.52552 0.648319 0.365338 0.334968 0.3627 0.686188 0.696258 0.653972 0.543342 0.603265 0.614417
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.750000, recall: 0.600000, error: 0.250000
467. 
patient tongue id: 06041124157518_1
label yaofang:
白芍 川芎 当归 党参 太子参 黄芪 枸杞子 熟地黄 郁金 北柴胡 炙甘草 续断 盐菟丝子 酒女贞子 墨旱莲 干益母草
0.420669 0.378678 0.445929 0.403713 0.40334
predicted yaofang:
甘草 茯苓 黄芪 白术 北沙参

------Score: precision: 0.200000, recall: 0.062500, error: 0.800000
468. 
patient tongue id: 03211947277137_6
label yaofang:
柴胡 白芍 香附 枳壳 海螵蛸 浙贝母 白芷 豆蔻 姜半夏 炙甘草 紫苏梗
0.503308 0.335039 0.308344 0.466405 0.37249
predicted yaofang:
甘草 白芍 茯苓 党参 白术

------Score: precision: 0.200000, recall: 0.090909, error: 0.800000
469. 
patient tongue id: 06182025467826_1_4_6
label yaofang:
桃仁 蒲公英 龙齿 黄芪 白术 砂仁 菟丝子 桑寄生 鸡内金 莲子 麦芽 首乌藤 土鳖虫 合欢皮
0.529483 0.354227 0.351411 0.30657 0.575947 0.616897 0.356768 0.415793 0.314874 0.401623
predicted yaofang:
甘草 茯苓 半夏 党参 黄芪 白术 海螵蛸 厚朴 砂仁 北沙参

------Score: precision: 0.300000, recall: 0.214286, error: 0.700000
470. 
patient tongue id: 02261101461368_1_6
label yaofang:
甘草 茯苓 党参 酸枣仁 生地黄 山药 天麻 鳖甲 白花蛇舌草 浮小麦 蜈蚣 天山雪莲 合欢花 半枝莲
0.986966 0.499207 0.628431 0.354729 0.320141 0.578425 0.608447 0.550023 0.470319 0.503769 0.500827
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.642857, error: 0.181818
471. 
patient tongue id: 02142126299882_1_2
label yaofang:
法半夏 前胡 防风 太子参 黄芪 白芷 款冬花 紫菀 百部 北沙参 炙甘草 辛夷 广藿香 炒苍耳子 麸炒白术
0.395598 0.827794 0.317053 0.948407 0.518178 0.663306 0.324874 0.395454 0.441233 0.868966 0.881858 0.806803 0.902741 0.332214 0.917515 0.492531 0.632792 0.430392 0.684411
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.631579, recall: 0.800000, error: 0.368421
472. 
patient tongue id: 02122101348965_6_5_1
label yaofang:
柴胡 白芍 黄芩 法半夏 大枣 茯苓 龙骨 牡蛎 党参 竹茹 郁金 石菖蒲 大黄 炙甘草 浮小麦 合欢花
0.792021 0.409298 0.509067 0.376472
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.500000, recall: 0.125000, error: 0.500000
473. 
patient tongue id: 04131805467596_5
label yaofang:
甘草 黄芩 法半夏 茯苓 桔梗 远志 党参 酸枣仁 丹参 胆南星 浙贝母 石菖蒲 白花蛇舌草 蜈蚣 醋鳖甲
0.972136 0.480333 0.607303 0.359678 0.519319 0.520252 0.448629 0.37565 0.399857 0.383694
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.266667, error: 0.600000
474. 
patient tongue id: 02110736270713_1_3_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 决明子 夏枯草 制何首乌
0.349877 0.302056 0.469115 0.408183 0.505932 0.359881 0.363204 0.424324 0.369893 0.375978 0.413497 0.345469 0.504763 0.339711
predicted yaofang:
甘草 陈皮 法半夏 茯苓 前胡 桔梗 防风 款冬花 紫菀 白前 百部 北沙参 炙甘草 广藿香

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
475. 
patient tongue id: 06080204163206_5_6
label yaofang:
甘草 柴胡 白芍 法半夏 茯苓 远志 枸杞子 白术 酸枣仁 泽泻 天麻 麦芽 女贞子 首乌藤 沙苑子
0.990664 0.519483 0.634825 0.347582 0.302877 0.34463 0.631194 0.630999 0.576252 0.485928 0.527086 0.524089
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.416667, recall: 0.333333, error: 0.583333
476. 
patient tongue id: 04181934531716_1_2_6
label yaofang:
甘草 法半夏 茯苓 远志 党参 酸枣仁 知母 天麻 鳖甲 麦芽 首乌藤 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.950895 0.466179 0.571484 0.343032 0.459509 0.374402 0.343345
predicted yaofang:
甘草 茯苓 党参 白术 天麻 鳖甲 蜈蚣

------Score: precision: 0.857143, recall: 0.400000, error: 0.142857
477. 
patient tongue id: 02120939242868_1_6_5
label yaofang:
甘草 茯苓 金银花 党参 红花 牡丹皮 荆芥穗 天麻 鳖甲 麦芽 白鲜皮 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.961604 0.486932 0.577077 0.333794 0.314406 0.51102 0.441675 0.394443 0.319288 0.341638 0.31845
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.818182, recall: 0.600000, error: 0.181818
478. 
patient tongue id: 03261604189277_4
label yaofang:
甘草 桔梗 薄荷 芦根 桑叶 苦杏仁 百合 木蝴蝶 野马追
0.497541 0.361701 0.430013 0.327376 0.374184
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.200000, recall: 0.111111, error: 0.800000
479. 
patient tongue id: 03020715016086_5_7_1
label yaofang:
甘草 白芍 茯苓 白术 酸枣仁 牡丹皮 牛膝 车前子 益母草 鳖甲 淡竹叶 决明子 土鳖虫 谷精子
0.957763 0.464064 0.551006 0.450617 0.329627 0.410632 0.407029 0.504549 0.305311 0.313886
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 天山雪莲 半枝莲

------Score: precision: 0.400000, recall: 0.285714, error: 0.600000
480. 
patient tongue id: 05092136143168_5_6
label yaofang:
甘草 白芍 茯苓 薏苡仁 党参 丹参 苍术 山药 泽泻 厚朴 砂仁 茵陈 扁豆花 虎杖 麦芽
0.990622 0.515605 0.642529 0.353278 0.333433 0.640091 0.664192 0.581665 0.518495 0.56315 0.539922
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.266667, error: 0.636364
481. 
patient tongue id: 01140543127190_1_2_6
label yaofang:
甘草 白芍 陈皮 茯苓 防风 党参 白术 赤芍 山药 天麻 五灵脂 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.987071 0.50123 0.62284 0.379032 0.338035 0.601419 0.612036 0.572157 0.459285 0.505974 0.508277
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 1.000000, recall: 0.687500, error: 0.000000
482. 
patient tongue id: 02161946166870_6
label yaofang:
柴胡 白芍 香附 枳壳 黄芩 海螵蛸 浙贝母 豆蔻 姜半夏 炙甘草 浮小麦 紫苏梗
0.476268 0.360084 0.431828 0.314868 0.334727
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
483. 
patient tongue id: 01041852414357_2
label yaofang:
柴胡 白芍 黄芩 当归 阿胶 枳实 石膏 杏仁 细辛 干姜 大黄 生地 川朴 法夏
0.853894 0.424531 0.458124 0.463139
predicted yaofang:
甘草 茯苓 党参 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
484. 
patient tongue id: 04072006444776_1_4_7
label yaofang:
玄参 生地黄 海螵蛸 浙贝母 牡丹皮 郁金 仙鹤草 砂仁 鸡内金 枇杷叶 北沙参 蛤壳 首乌藤 鲜龙葵果
0.520862 0.340279 0.404197 0.485721 0.350304
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
485. 
patient tongue id: 01180602171656_1_2
label yaofang:
甘草 桔梗 麦冬 太子参 丹参 浙贝母 鳖甲 诃子 北沙参 鹿角霜 百合 白花蛇舌 天山雪莲 蜂房
0.971433 0.485268 0.601708 0.327778 0.323728 0.571138 0.474047 0.410912 0.325864 0.369184 0.347674
predicted yaofang:
甘草 茯苓 党参 白术 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.363636, recall: 0.285714, error: 0.636364
486. 
patient tongue id: 01192152376587_2_5
label yaofang:
甘草 黄芩 桔梗 防风 芦根 麦冬 丹参 玄参 生地黄 浙贝母 白茅根 车前子 鳖甲 鹿角霜 白花蛇舌 四季青
0.996897 0.540833 0.666466 0.322448 0.321031 0.35506 0.699521 0.720332 0.663993 0.570991 0.615734 0.619115
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.250000, recall: 0.187500, error: 0.750000
487. 
patient tongue id: 06082011087953_1
label yaofang:
桂枝 白芍 川芎 当归 茯苓 防风 芦根 麦冬 党参 白术 五味子 延胡索 北沙参 炙甘草 女贞子
0.768436 0.408479 0.443927 0.325585 0.454571
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.600000, recall: 0.200000, error: 0.400000
488. 
patient tongue id: 05032251013285_5_7
label yaofang:
甘草 白芍 当归 茯苓 远志 党参 酸枣仁 生地黄 天麻 鳖甲 浮小麦 蜈蚣 白花蛇舌 天山雪莲 半枝莲
0.994623 0.526418 0.654289 0.336629 0.314225 0.345154 0.68983 0.684078 0.632938 0.521353 0.582411 0.587894
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.666667, error: 0.166667
489. 
patient tongue id: 06132011077602_4_7
label yaofang:
甘草 枳壳 半夏 橘红 薏苡仁 黄芪 胆南星 浙贝母 杜仲 厚朴 僵蚕 莪术 紫苏子 蝉蜕 辛夷 紫苏叶 蜈蚣 守宫
0.517707 0.367073 0.336038 0.566923 0.4766 0.371602 0.399496
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.166667, error: 0.571429
490. 
patient tongue id: 02281249517102_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.447673 0.345953 0.416351 0.308625
predicted yaofang:
甘草 法半夏 茯苓 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
491. 
patient tongue id: 06082028269834_2_5
label yaofang:
甘草 白芍 枳壳 薏苡仁 白术 海螵蛸 郁金 白茅根 泽泻 车前子 厚朴 射干 北沙参 土鳖虫 合欢皮 姜黄 预知子 蛇舌草
0.787605 0.410024 0.413407 0.343945 0.487195
predicted yaofang:
甘草 茯苓 党参 黄芪 白术

------Score: precision: 0.400000, recall: 0.111111, error: 0.600000
492. 
patient tongue id: 04121811008302_4
label yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 白芷 款冬花 紫菀 白前 百部 炙甘草 辛夷 紫苏梗 蜜麻黄
0.397112 0.725593 0.348533 0.887439 0.490711 0.58292 0.342801 0.364997 0.40052 0.791342 0.798603 0.732326 0.834312 0.379044 0.852084 0.442022 0.573149 0.412267 0.62121
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.736842, recall: 0.933333, error: 0.263158
493. 
patient tongue id: 03111159067124_1_4_7
label yaofang:
桃仁 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌
0.522961 0.365632 0.384807 0.490489
predicted yaofang:
甘草 茯苓 党参 黄芪

------Score: precision: 0.000000, recall: 0.000000, error: 1.000000
494. 
patient tongue id: 03022131402691_6
label yaofang:
麻黄 桂枝 白芍 牛蒡子 五味子 浙贝母 细辛 干姜 射干 紫菀 苦杏仁 姜半夏 炙甘草 人参叶 龙脷叶
0.339695 0.39439 0.396477 0.423869 0.350509 0.331841 0.423746 0.539365 0.629704 0.314987
predicted yaofang:
柴胡 白芍 香附 党参 白术 柏子仁 海螵蛸 姜半夏 炙甘草 紫苏叶

------Score: precision: 0.300000, recall: 0.200000, error: 0.700000
495. 
patient tongue id: 03261714162055_1
label yaofang:
当归 薏苡仁 党参 太子参 黄芪 山药 芡实 莲子 百合
0.630231 0.382679 0.395334 0.465015 0.560651 0.332614
predicted yaofang:
甘草 茯苓 党参 黄芪 白术 厚朴

------Score: precision: 0.333333, recall: 0.222222, error: 0.666667
496. 
patient tongue id: 04131836360588_1
label yaofang:
陈皮 茯苓 前胡 桔梗 防风 荆芥穗 白芷 款冬花 紫菀 百部 炙甘草 辛夷 紫苏梗 广藿香
0.400187 0.758001 0.348685 0.893557 0.504303 0.609017 0.336072 0.392416 0.302326 0.308801 0.438222 0.811315 0.812419 0.732079 0.834186 0.33414 0.871784 0.467758 0.58667 0.430528 0.627914
predicted yaofang:
陈皮 法半夏 茯苓 前胡 桔梗 防风 太子参 细辛 干姜 荆芥穗 白芷 款冬花 紫菀 白前 百部 北沙参 炙甘草 辛夷 广藿香 炒紫苏子 蜜麻黄

------Score: precision: 0.619048, recall: 0.928571, error: 0.380952
497. 
patient tongue id: 02161926544417_1_6
label yaofang:
茯苓 党参 黄芪 白术 山药 砂仁 补骨脂
0.48796 0.375605 0.376531 0.552638 0.514971 0.350386 0.443221
predicted yaofang:
甘草 茯苓 半夏 黄芪 白术 厚朴 北沙参

------Score: precision: 0.428571, recall: 0.428571, error: 0.571429
498. 
patient tongue id: 06130757280187_1_2_4
label yaofang:
甘草 茯苓 牡蛎 麦冬 党参 黄芪 酸枣仁 郁金 浮小麦 首乌藤 百合 制远志
0.437968 0.710807 0.391929 0.377557 0.754708 0.740233 0.653138 0.668352 0.72231 0.677956 0.778109 0.682948 0.78111 0.762756 0.768839
predicted yaofang:
甘草 桃仁 党参 黄芪 丹参 红花 牛膝 钩藤 泽泻 车前子 莱菔子 天麻 决明子 夏枯草 制何首乌

------Score: precision: 0.200000, recall: 0.250000, error: 0.800000
499. 
patient tongue id: 04122056190651_1
label yaofang:
甘草 茯苓 薏苡仁 党参 白术 天麻 鳖甲 扁豆花 佛手 蜈蚣 白花蛇舌 天山雪莲 合欢花 半枝莲
0.995474 0.51802 0.673121 0.374316 0.302737 0.322564 0.684993 0.722599 0.683045 0.564036 0.619731 0.638241
predicted yaofang:
甘草 茯苓 党参 白术 酸枣仁 山药 天麻 鳖甲 蜈蚣 白花蛇舌 天山雪莲 半枝莲

------Score: precision: 0.833333, recall: 0.714286, error: 0.166667
------Average Score: average precision: 0.453407, average recall: 0.347054, error: 0.546593